[
  {
    "start": 28.046,
    "end": 52.525,
    "text": " all right hello everyone welcome to actinflab live stream number 39.2 it's march 9th 2022 welcome to the actinflab we're a participatory online lab that is communicating learning and practicing applied active inference you can find us at the links here on the slide this is a recorded and an archived live stream so please provide us with feedback so we can improve on our work",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 53.516,
    "end": 58.964,
    "text": " All backgrounds and perspectives are welcome and will be following video etiquette for live streams.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 60.246,
    "end": 64.993,
    "text": "Check out ActiveInference.org to learn more about anything that the lab is up to.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 67.386,
    "end": 88.411,
    "text": " today in stream number 39.2 we're in our third discussion around this paper morphogenesis as bayesian inference a variational approach to pattern formation control in complex biological systems by franz kuchling who's here with us as well as fristen georgiev and levin so",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 89.514,
    "end": 91.075,
    "text": " We're going to have a fun discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 91.575,
    "end": 97.68,
    "text": "In the dot two, the dot zero was some background and context, hopefully overviewing the paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 97.7,
    "end": 102.323,
    "text": "The dot one, we had a discussion that opened up several threads.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 103.284,
    "end": 113.251,
    "text": "And today we will, in the dot two, say hello on the introductions and then just jump in to a blank slide or to a not blank slide.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 113.911,
    "end": 115.292,
    "text": "So I'm Daniel.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 115.913,
    "end": 119.135,
    "text": "I'm a researcher in California and I'll pass it to Dean.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 121.633,
    "end": 140.75,
    "text": " morning I'm Dean I'm in Calgary and I am going to say that I have one thing I want to look at down the road which is how long is a person a stem cell which I think this paper might help us parse a little bit and I'll pass it down to blue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 143.154,
    "end": 143.875,
    "text": " Hi, I'm blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 143.935,
    "end": 146.477,
    "text": "I'm a researcher in New Mexico.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 146.637,
    "end": 158.488,
    "text": "And I also similar to Dean have questions about when a cell becomes a cancer cell and like, how does it develop its own generative model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 158.608,
    "end": 161.231,
    "text": "And just in general, like when you're looking at complex systems,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 161.752,
    "end": 171.534,
    "text": " how these small perturbations can lead to like a totally different effect downstream, which I think is kind of related to the stem cell question that Dean had.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 172.234,
    "end": 174.155,
    "text": "And I'll pass it over to the first author, Franz.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 178.536,
    "end": 179.656,
    "text": "Hi, I'm Franz.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 180.356,
    "end": 184.177,
    "text": "I am a PhD student in the Levin lab in Tufts, Medford,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 184.949,
    "end": 185.549,
    "text": " near Boston.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 185.889,
    "end": 194.974,
    "text": "And yeah, I study active inference in my theoretical work and I do a lot of experimental work as well, looking at information processing in organisms and cells.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 199.056,
    "end": 199.296,
    "text": "Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 199.656,
    "end": 207.78,
    "text": "So where does stemness or how do stem cells play into this paper and this line of research, Franz?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 208.741,
    "end": 212.582,
    "text": "Definitely something we've touched on, but just to kind of start generally and then we'll zoom in somewhere.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 212.883,
    "end": 213.583,
    "text": "So take it away.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 215.123,
    "end": 216.804,
    "text": " Sure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 216.884,
    "end": 229.571,
    "text": "The idea is that the cells initially, in the simulation when they're being initialized, they're randomly initialized and they have very low beliefs about what cell type they are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 229.611,
    "end": 243.259,
    "text": "They can be one of four different cell types in this particular simulation, and they all share a model, a target morphology they could achieve that they essentially are programmed to achieve at some point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 244.093,
    "end": 250.055,
    "text": " but none of the cells are any of the given cell types initially, at least not with any significant precision.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 251.875,
    "end": 265.059,
    "text": "And as they move along, signaling to each other and sensing each other and secreting signal types in response to each other, they then slowly by slowly infer a cell type, which essentially is differentiation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 270.645,
    "end": 276.608,
    "text": " So cells starting with low precision about what kind of cell they believe themselves to be.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 277.728,
    "end": 280.15,
    "text": "And then there's a process of differentiation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 281.39,
    "end": 288.914,
    "text": "So Diener Blue, any thoughts on that sort of stem to differentiated continuum?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 289.114,
    "end": 294.857,
    "text": "And I'll pull up an image from a non-active perspective that also shows that kind of a continuum.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 298.558,
    "end": 299.479,
    "text": "So I...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 300.555,
    "end": 306.059,
    "text": " have just something to add that ties into the paper where there's aberrant signaling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 306.099,
    "end": 321.61,
    "text": "So a stem cell differentiates, but then during the process of carcinogenesis, like retains some kind of, or, or D differentiates into something that's more similar to a stem cell than it is to a different kind of cell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 322.35,
    "end": 329.075,
    "text": "And so this plasticity is important to retain, like so that we can repair ourselves, but also it can lead to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.744,
    "end": 332.526,
    "text": " kind of an aberrant signaling pattern.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 332.546,
    "end": 354.322,
    "text": "Yep, like this notion of having a terminal cell revert to a state and regain the ability of having stemness is",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 355.615,
    "end": 383.616,
    "text": " one of the characteristics of cancer because it can then sometimes differentiate into other cell types that are like normal and downstream of a precursor or abnormal in some other way how is this i was going to say it's also something that happens and especially in higher organisms right not not every organisms keeps absolute stem cells and all kind of populations",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 384.252,
    "end": 396.554,
    "text": " One example that I used to work on is in zebrafish, where you have an always developing eye, and there are certain parts of the retina, essentially, that can de-differentiate to some extent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 396.594,
    "end": 397.974,
    "text": "They're not entirely stem cells.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 398.014,
    "end": 408.956,
    "text": "They have a stem cell niche as well, but there's also, especially in higher organisms as well, they keep those populations of either stem cells or of already partially differentiated cells that can de-differentiate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 409.496,
    "end": 411.917,
    "text": "So it's an important part in regeneration.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 412.637,
    "end": 413.517,
    "text": "And ironically,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 414.002,
    "end": 416.563,
    "text": " This is something that's not been studied for a while now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 416.583,
    "end": 432.826,
    "text": "There's older research that was done where highly regenerative organisms, when they undergo, they did this in salamanders and they injected them with carcinogens and they basically saw a tumor progressing and then they cut off a limb and these salamanders are highly regenerating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 432.846,
    "end": 437.367,
    "text": "We actually renormalize the tumors potentially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 437.387,
    "end": 441.768,
    "text": "So initiation of regeneration in those organisms seems to actually counteract",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 442.703,
    "end": 471.373,
    "text": " um cancer progression and even kind of remove the tumors um which is very interesting and it kind of um this feeds a little bit into the idea in this paper as well that regeneration right what happens is you suddenly now have a much higher flow of information um things need to rearrange to to re-differentiate and um and that is kind of like what i was thinking as well with the simulation here of the the cancer rescue phenomena where you you",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 472.289,
    "end": 482.693,
    "text": " you rescue this formation of aberrant cells and aberrant signaling by having a stronger contact between cells as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 482.713,
    "end": 486.034,
    "text": "I'm not saying I'm modeling regeneration here, although you can.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 486.234,
    "end": 491.495,
    "text": "I think in the original paper, Carl has done some way to cut, I think, part off and let it grow again.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 491.535,
    "end": 494.256,
    "text": "I think that has been done in the original paper in the annoying once place.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 496.137,
    "end": 497.637,
    "text": "But that's something to kind of keep in mind.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 497.677,
    "end": 498.218,
    "text": "This is something that...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 499.998,
    "end": 521.752,
    "text": " experimentally highly studied um to an extent so one general note and then a question this question this idea that the organisms that have the highly regenerative capacity and there's a continuum from regrowing just the tail to regrowing a whole limb to kind of an extreme or a highly um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 522.955,
    "end": 551.088,
    "text": " regenerative case like the planaria that was studied in this paper so it's all kind of a on a continuum from total ability to regenerate from any adult somatic cell can fully recapitulate the full population all the way to a total opposite of that and then you pointed out that it might be related to cancer progressions and phenotype and that speaks to what blue brought up about the um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 552.528,
    "end": 554.57,
    "text": " like system level effects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 554.87,
    "end": 563.755,
    "text": "There's the individual cell and then there's the system level, because clearly there's something about the system level in the regenerative situation that would lead to this being different.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 564.615,
    "end": 567.877,
    "text": "Or maybe it could be explained by just something internal to the model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 567.917,
    "end": 574.781,
    "text": "Anyways, you mentioned that higher information was associated with rearrangement.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 575.842,
    "end": 580.545,
    "text": "Could you explain a little bit about that or how does it play out in this paper or in general?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 582.742,
    "end": 591.144,
    "text": " Yeah, it's basically the idea that it's not so much the total information content, but the flow of it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 591.164,
    "end": 593.145,
    "text": "And we talked a little bit about this last time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 593.205,
    "end": 598.066,
    "text": "It's hard to really kind of quantify this in a more meaningful biological sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 598.126,
    "end": 601.727,
    "text": "But the idea is that it's information flow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 601.747,
    "end": 605.208,
    "text": "I think Dean asked this question, is more information always good?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 605.248,
    "end": 609.649,
    "text": "And my kind of answer to that was it's within context of what the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 610.805,
    "end": 613.687,
    "text": " participating organisms can receive and can process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 613.747,
    "end": 637.601,
    "text": "So in the sense that if you have, you know, cells that, you know, processing certain information with a certain kind of rates, time constants, then kind of getting information in with that timeframe in mind is what makes it more likely for them to kind of understand better their environment and react to it, as opposed to a cell, you can think of it also cancer cells,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 638.4,
    "end": 667.172,
    "text": " um that you know have that whole sensory part completely perturbed they do not react to the environment anymore then everything else becomes noise and it gets ignored um that's kind of the idea so there is there is a lot of different differences in of how the cancer cells because they have changed ion profile ion channel profiles they have changed uh machinery of what they're actually transcribing so all of that leads to the difference in how signals are being processed",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 667.893,
    "end": 674.929,
    "text": " And understanding that and then reacting to that is, I think, is a key to understanding and treating this disease.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 674.949,
    "end": 677.715,
    "text": "Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 678.056,
    "end": 678.517,
    "text": "Thanks, Dean.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 681.499,
    "end": 690.922,
    "text": " I don't know if I have the answer to my question, which is how long is a person a, in scare quotes, a stem cell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 690.962,
    "end": 700.046,
    "text": "But one of the things you mentioned, Franz, in the point one was I think Steven asked the question about how much volume in the flow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 700.606,
    "end": 705.568,
    "text": "And what I've heard you say back was it's always a state space dependency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 706.568,
    "end": 713.694,
    "text": " Which, which I, when I'm reading the paper, it was, I think you made a really good sound case for that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 714.174,
    "end": 727.445,
    "text": "But then one of the things that when you had to, when you had to sign off, one of the questions that I brought up, hopefully that maybe we can discuss a little bit today is they can figure four and five of the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 728.12,
    "end": 737.062,
    "text": " All that black area around when the sort of cells move into place, that's a crude way of describing what's going on there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 737.102,
    "end": 747.986,
    "text": "But all that black area around that, is it fair to say that that's kind of the state space dependency or is that just assumed?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 748.426,
    "end": 756.508,
    "text": "And how would we, because Daniel did a good job of sort of saying there's some invisibility aspects to this when we do multiple layering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 757.455,
    "end": 765.998,
    "text": " And so how do you give people a sense of what's going on in that blacked out area, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 766.078,
    "end": 772.301,
    "text": "I think black is a good color representation because it's not really a color, I don't think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 772.861,
    "end": 786.626,
    "text": "But it kind of speaks to this idea that we've got these low beliefs, but for how long as a person or as cells, as a cluster of cells, is that beneficial?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 788.066,
    "end": 788.286,
    "text": " Right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 789.487,
    "end": 793.048,
    "text": "We're talking, of course, here under the big umbrella of morphology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 793.468,
    "end": 798.511,
    "text": "So that was kind of where I was wondering today, maybe you could explain it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 799.491,
    "end": 809.376,
    "text": "Because the eye tends to focus on the object within the frame, as opposed to sort of the area around what we would consider to be the object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 809.416,
    "end": 814.638,
    "text": "So maybe you can kind of help me understand this state-space dependency piece.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 816.041,
    "end": 816.301,
    "text": " Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 816.321,
    "end": 826.584,
    "text": "I mean, so, um, if, if you have to look at figure two or so, and, um, what I didn't plot in the, in the, in the figure four and five and two, I did is the back of concentrations, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 826.624,
    "end": 840.829,
    "text": "So there are of course, some, some levels of, of, of signaling, uh, molecules in the background as well, um, which will also of course be the case in the, in the actual simulations, um, down the line of four and five, um, the,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 841.599,
    "end": 869.604,
    "text": " the blackness so the one interesting part about the simulation which was done mainly for simplicity and lack of necessity is to not actually have an external environment per se like there's nothing right there's no external force like outside of basically everything in the simulations is done by the cells where the cells they make the environment right so there is essentially there's an external environment by the signaling molecules that they put out but we don't have any external um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 870.296,
    "end": 872.037,
    "text": " limits around it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 872.097,
    "end": 877.201,
    "text": "We just basically plot the signaling molecules don't go faster than that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 877.901,
    "end": 882.084,
    "text": "And there isn't any external force, which we could do, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 882.124,
    "end": 894.153,
    "text": "Part of the simulations where you do this asymmetry, we essentially get sort of an implicit environment by changing the response to the signals around you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 894.173,
    "end": 900.017,
    "text": "You can imagine that you put something in the medium that flips how a signal is being processed, and then that's it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 901.495,
    "end": 905.217,
    "text": " So back to your question about this blackness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 907.198,
    "end": 910.06,
    "text": "And when is that beneficial, if I answered that question correctly?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 910.96,
    "end": 918.384,
    "text": "There is, of course, like a precision component to it and kind of more less hand wavy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 920.185,
    "end": 924.567,
    "text": "If your environment is very volatile and constantly changes and you keep",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 925.216,
    "end": 928.598,
    "text": " but you have a not this essentially is a closed system, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 928.638,
    "end": 932.76,
    "text": "If you had an open system, constantly you would get signals also from the environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 932.78,
    "end": 936.682,
    "text": "This will also become all a lot messier and especially initially, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 936.742,
    "end": 941.365,
    "text": "In the first frames of that figure four and five where you had the simulations, they all started together.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 941.405,
    "end": 952.851,
    "text": "I mentioned last time there's certain smoothness requirements where like if we had to put this dampening on the sensitivity a long time, so inverse dampening, it will get more sensitive with time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 953.484,
    "end": 956.566,
    "text": " which is because initially they're very unstructured.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 956.606,
    "end": 962.689,
    "text": "They have very low pyroblasts and they will jump crazy if they have high sensitivity to each other because they're in such close proximity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 963.849,
    "end": 967.351,
    "text": "And that is something that we, of course, do see in biology, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 967.391,
    "end": 971.113,
    "text": "We do see most, especially the higher organisms, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 971.133,
    "end": 973.274,
    "text": "They start off usually in close environments.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 973.854,
    "end": 975.615,
    "text": "Now, of course, you can argue this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 975.635,
    "end": 976.996,
    "text": "You don't need to go to any information stuff.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 977.016,
    "end": 979.777,
    "text": "You can just argue, well, it's just, you know, thermally insulated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 979.817,
    "end": 981.038,
    "text": "They have their own food supplies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 981.118,
    "end": 981.558,
    "text": "It makes sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 982.093,
    "end": 985.496,
    "text": " you know, just makes like a more safe zone, like just physically energy speaking.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 985.556,
    "end": 987.477,
    "text": "But I do think there's a big component to it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 987.537,
    "end": 1000.048,
    "text": "It's like shutting this highly volatile, you know, it's self-inferring organism off from influence from the environment at a stage when all these cells are figuring out what to do with each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1000.628,
    "end": 1010.096,
    "text": "So they need, they kind of need to have a kind of a barrier between signals from the environment, which normally, you know, to us adults, to a mature organism or not,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1010.629,
    "end": 1037.67,
    "text": " really dangerous but to end developing organism full of stem cells can be problematic and will basically would um would perturb its natural kind of progression in this state space on this sulfate acquisition um there is a cool paper i can reference to you from chris fields who i am from disclosure i'm working with and very much admire him who wrote a paper about multicellularity as exactly",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1038.868,
    "end": 1060.984,
    "text": " The consequence of what I just said, the multicellularity basically emerging as a way to shut some cells, cells that are an initial evolution of multicellularity, cells that are undergoing some evolution towards complexity, needing some kind of barrier from the environment, basically making themselves, creating a Markov bank around them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1061.67,
    "end": 1065.834,
    "text": " that makes it so they're not constantly, you know, being perturbed by the environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1066.315,
    "end": 1081.37,
    "text": "And that's the idea of how my mode of celebrity arose in the first place is to insulate niches, which will become stem cell niches from the environment so that cells that are undergoing, you know, very dynamic changes in short amount of time",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1082.399,
    "end": 1091.924,
    "text": " that therefore need to be kind of sensitive to the environment, cannot be, need to be isolated from influence in the environment that would perturb this careful inference of cell type.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1094.105,
    "end": 1094.405,
    "text": "Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1094.525,
    "end": 1094.785,
    "text": "Dean?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1097.066,
    "end": 1109.092,
    "text": "Yeah, so in this figure too, you can see that there's, we're talking about ranges because we've got values on the horizontal and the vertical sides of the box.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1111.249,
    "end": 1123.094,
    "text": " So one of the things that I think is really interesting is that once you, so we've all spelled it out if we're dealing with active inference, we want to avoid something surprising, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1123.114,
    "end": 1127.195,
    "text": "The whole variational aspect of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1127.476,
    "end": 1140.561,
    "text": "So again, if we're talking about going from something that has low beliefs to something that gains in, I'll say gains in sensitivity without hopefully killing what I want to say next,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1142.478,
    "end": 1149.216,
    "text": " If it's about signal adaptation to these top-down conditions, which influence the final form taken,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1150.532,
    "end": 1159.679,
    "text": " Is there some way, based on what you researched with this paper, is there some way to know as you're approaching that place of energy exhaustion?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1160.219,
    "end": 1166.324,
    "text": "Is there something that the cell tells you that it's finding this too surprising?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1166.344,
    "end": 1174.87,
    "text": "Because one of the things, again, we talked about was that rate of change being so rapid, say, like the UN report on global warming, where",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1175.39,
    "end": 1184.233,
    "text": " We simply don't have the machinery to be able to adapt Is there something that you found out through this paper that kind of said to you as you were looking at these things?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1184.914,
    "end": 1185.674,
    "text": "Oh, wait a second here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1185.694,
    "end": 1197.959,
    "text": "We're just going to we're going to we're not our intent is not to kill this thing off But we're approaching that place where the environment is just too changing too fast Yeah, um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1200.947,
    "end": 1205.591,
    "text": " I'm trying to give you a more detailed answer than hand waviness, but let's start with the general answer first.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1205.651,
    "end": 1216.981,
    "text": "So yes, one way you can quickly see it is in that something that you get with the prediction error plot that you also get with the free energy plot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1217.001,
    "end": 1223.988,
    "text": "In a perfect world, you'll get a nice, smooth exponential decay of the free energy function.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1224.869,
    "end": 1227.331,
    "text": "If that keeps changing, bouncing up and down,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1228.415,
    "end": 1229.516,
    "text": " that will be very problematic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1229.776,
    "end": 1231.597,
    "text": "I did some simulations afterwards.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1231.617,
    "end": 1250.425,
    "text": "They're not included in this paper, but based on exactly the same stuff, where I was including a time, based on top of this time sensitivity, you know, increase that I use for basically, you know, increasing the sensitivity over the time, but having a low in the beginning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1250.925,
    "end": 1256.868,
    "text": "On top of that, I put in a pulsing, like a sinusoidal or rectangular function",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1257.492,
    "end": 1266.761,
    "text": " which was, we were just trying to simulate what I'm doing in my experiments in a lab where basically, you know, pulse certain signaling inputs to my organisms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1267.381,
    "end": 1275.469,
    "text": "And I wanted to see basically if I randomized that or if I made that in a certain pattern, how well would the simulation still be able to cope with that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1275.609,
    "end": 1280.513,
    "text": "And in the case where I had like a nice regular pattern of that, in the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1281.65,
    "end": 1293.092,
    "text": " free energy land and the free energy decay, you hardly saw that, you know, initially, initially when, when that sensitivity was very high, it was, you know, you can see it there, there was like a big jump in this and fuzziness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1293.592,
    "end": 1308.575,
    "text": "You could see it also in the, in the belief updates, you know, the basically they were they kind of emerged kind of like they diverged initially very strongly and diverged in terms of their beliefs that they had about themselves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1309.104,
    "end": 1324.089,
    "text": " But then kind of afterwards, when the sensitivity overall was kind of acclimating, but was kind of varying around this acclimation point, you didn't see that much anymore in the regular pattern.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1324.129,
    "end": 1327.93,
    "text": "But when the ones were less regular, that was very much perturbed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1327.99,
    "end": 1336.413,
    "text": "And the energy also didn't actually quite, not only did it not come to kind of like to this,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1337.222,
    "end": 1363.589,
    "text": " asymptotic behavior but actually started increasing again basically um just was really perturbed and you didn't see that so to answer a question like um how do you see if if you are not adapting correctly even though you don't actually know yet what what the what your external state is i would answer it's how much are you switching back and forth between your beliefs and uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1364.502,
    "end": 1367.503,
    "text": " I guess more precisely also like how certain are you of that, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1367.523,
    "end": 1377.188,
    "text": "This is something that we talk about in metacognition, which I've recently, for my last paper, I've been getting into and reading about metacognition in rats and primates and other animals.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1377.268,
    "end": 1384.091,
    "text": "And the first step to metacognition is, as far as I understand it, is having a certain confidence about your results.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1384.171,
    "end": 1389.874,
    "text": "They did this with rats where they basically gave rats the option in this kind of cognitive task",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1391.118,
    "end": 1410.708,
    "text": " that they could also just not answer the task, not push the lever, because I think it was levers, I forgot what the task was, but it was basically levers, and they had an option to not push the lever, for which they would get a lower reward than if they, a much lower reward than if they got it correctly, but more than if they got it wrongly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1411.288,
    "end": 1420.013,
    "text": "And so what they saw is that they actually would, in certain cases, when they hadn't learned the task correctly, they would just not push the lever.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1421.115,
    "end": 1430.259,
    "text": " And that is used as like a first instance of the medical condition, a sense of they must have been unsure about what you do and then chose not to do it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1431.039,
    "end": 1439.003,
    "text": "So I think that's kind of like if you, it's one thing if you kind of lean back and forth because you always think, well, you know, I'm this and that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1440.664,
    "end": 1450.048,
    "text": "Being unsure is normal, but kind of constantly going back and forth between certain states of sureness is also problematic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1451.601,
    "end": 1453.503,
    "text": " So that's the generalized answer to this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1455.164,
    "end": 1459.588,
    "text": "I think the interesting thing there is the emphasis on the back and forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1459.868,
    "end": 1471.598,
    "text": "Metaphorically speaking, we tend to give a lot of attention over to the balance piece, but what you're talking about when you're talking about the environment is not the plank as much as a moving fulcrum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1472.259,
    "end": 1475.622,
    "text": "So how do you adjust, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1476.623,
    "end": 1479.245,
    "text": "The balance, I guess, is the outcome, but it's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1479.793,
    "end": 1506.342,
    "text": " the uh the process itself is the back and forth so yeah i wondered about that because some things you do want and from like from an epigenetic standpoint you do want certain cells to die you want their energy to expire absolutely i mean right that's part of the back and forth as opposed to the balance you know there's no balance metaphor you want there you want them to die and they're not dying so that's really interesting thank you yeah",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1508.063,
    "end": 1512.724,
    "text": " I wanted to add one more kind of attempt to answer this more specifically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1513.464,
    "end": 1529.927,
    "text": "There's a paper by, I'm probably pronouncing his name wrong, Droefeli, which was, if you just Google valence and active inference, they basically looked at valence in terms of judging if your actions are certain, are they better or worse, basically?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1530.007,
    "end": 1535.568,
    "text": "Are you assigning a sign, positive or negative, to outcomes?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1536.774,
    "end": 1547.381,
    "text": " and they were doing that in the active inference schemes, and they were defining it, and there's other definitions, not everyone's going to agree about this, but they were looking at it in the active inference scheme about the rate of change.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1547.441,
    "end": 1563.532,
    "text": "They were looking at the first and second order derivatives of how, if I'm saying this correctly, about how the prior beliefs were updated to the precision, how important, like how",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1564.687,
    "end": 1567.009,
    "text": " how sure they were about what cell type they were.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1567.029,
    "end": 1573.435,
    "text": "And so basically in the second order derivative, basically how much would they change at any given time in their beliefs?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1574.075,
    "end": 1579.58,
    "text": "That's what they plugged in valence into different mode that gets more complex than that, but that's the gist of it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1580.381,
    "end": 1591.811,
    "text": "So that I think is within the framework of active inference is a more specific answer to your question is look at the rate of change by which your beliefs are updating",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1592.58,
    "end": 1599.985,
    "text": " And that with respect to uncertainty, of course, there's this whole cause written about this as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1600.265,
    "end": 1610.792,
    "text": "I'm very interested as well from the biologist's point of view is that stress sensing mechanisms, like stress is a universal driver in biology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1610.832,
    "end": 1612.594,
    "text": "It's actually much more important than rewards.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1612.694,
    "end": 1617.317,
    "text": "I kind of find that we always talk about rewards, but biology is much more focused on stress.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1618.553,
    "end": 1646.529,
    "text": " um because it's more informative and it's more important to deal with than than what maximizing but of course you always say it's just negative but um the the point of being is uh stress as in as in terms of for uncertainty like not having not minimizing your energy effectively and stably um that will lead to stress and there's paper that doesn't humans i think mentioned last time as well where they do experiments with humans and mice as well where they",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1647.776,
    "end": 1650.558,
    "text": " very ethical, where they give electric shocks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1650.998,
    "end": 1652.479,
    "text": "I think they did it both for mice and humans.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1653.68,
    "end": 1662.326,
    "text": "And then they showed that the cortisol levels were more stressed out, not just by the electric shocks themselves, but they couldn't predict the electric shocks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1662.366,
    "end": 1664.327,
    "text": "So it's that uncertainty of what's coming next.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1664.427,
    "end": 1675.935,
    "text": "I think that is the most... If I had to say one thing that is most indicative of you going in a bad place, it's if you are stressed because you have no idea what's happening and you cannot even",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1676.348,
    "end": 1682.49,
    "text": " If you know something bad is going to happen and you know when it's happening, that's a lot less bad than if you don't know at all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1684.13,
    "end": 1689.912,
    "text": "One last really dark example to really make it a dark place is there is a, I was born in East Germany.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1691.652,
    "end": 1693.513,
    "text": "I guess I was only one year old when the wall fell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1694.133,
    "end": 1705.576,
    "text": "But my parents were very much, and there was this, now it's a museum, but it was a prison for the basically political detainees in East Germany, in East Berlin.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1706.539,
    "end": 1714.065,
    "text": " And we went there as a class once, and they showed us all the techniques they used to interrogate prisoners, including torture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1714.125,
    "end": 1727.336,
    "text": "And one of the torture devices was, I believe, a Japanese device where you would put your head down on this device, and there's water that's dropping from the top onto your neck.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1729.178,
    "end": 1731.399,
    "text": "So you think at this point, that doesn't sound too bad, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1732.0,
    "end": 1733.581,
    "text": "The problem was is that the drops,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1735.29,
    "end": 1736.511,
    "text": " There's a lot of viscosity in there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1736.551,
    "end": 1740.573,
    "text": "So they'll have kind of fluctuations, so the drops wouldn't always come at the same time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1740.593,
    "end": 1744.835,
    "text": "And it kept repeatedly happening over time and time again.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1745.455,
    "end": 1749.337,
    "text": "And the prisoners actually, people that used to be in prison, they were actually the ones giving the tour.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1749.977,
    "end": 1756.16,
    "text": "So they were telling us, yeah, if you're on the device after a couple of hours or so, these drops will feel like hammers on your neck.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1757.021,
    "end": 1759.162,
    "text": "And apparently, a big component of that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1761.656,
    "end": 1767.981,
    "text": " not the body not being able to adapt to it because, you know, the drops don't come at a perfect five second interval.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1768.001,
    "end": 1772.345,
    "text": "It happens kind of at semi-fast randomized intervals.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1773.145,
    "end": 1783.113,
    "text": "So that I think there's a huge part in not just looking at stress over time, but how you can adapt to that stress.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1783.234,
    "end": 1787.957,
    "text": "And in order to adapt to stress, adaptation to me always involves a component of prediction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1788.518,
    "end": 1791.08,
    "text": "If you can't predict the source of the stress when it happens,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1791.812,
    "end": 1792.953,
    "text": " It makes things a lot worse.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1793.013,
    "end": 1797.916,
    "text": "This has been shown extensively in humans and also in lower organisms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1798.697,
    "end": 1806.121,
    "text": "And I believe very strongly that there's something fundamental to any biological system, to fundamental drive.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1806.221,
    "end": 1814.367,
    "text": "If you're prescribed to the point of view that minimizing uncertainty in your environment is a fundamental drive of life, then",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1815.129,
    "end": 1821.932,
    "text": " With that, you prescribe that minimizing stress and the source of stress over time and being able to predict it is also fundamental.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1822.492,
    "end": 1825.714,
    "text": "And lack thereof makes a very dangerous system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1829.155,
    "end": 1829.395,
    "text": "Blue?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1829.896,
    "end": 1830.156,
    "text": "Thanks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1832.537,
    "end": 1834.398,
    "text": "So all that's super interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.078,
    "end": 1838.879,
    "text": "Just, OK, so let me, I'm going to start at the front and work backwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1839.08,
    "end": 1840.66,
    "text": "So in terms of uncertainty and uncertainty",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1843.103,
    "end": 1845.003,
    "text": " how that's causes stress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.504,
    "end": 1851.304,
    "text": "I'm really kind of, I don't know, reluctant to use the word stress in a biological system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.364,
    "end": 1855.185,
    "text": "Like I think about stressing a biological system is like pushing it out of equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1857.406,
    "end": 1859.946,
    "text": "But, but maybe that's just a stimulus, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1859.986,
    "end": 1870.548,
    "text": "Like I want you to rebalance and go to like a new equilibrium, like, or like turn on heat shock protein, or, you know, there's a variety of different things, like many ways you can view stress as a stimulus to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1871.178,
    "end": 1873.819,
    "text": " do something new or to perturb the system in a new way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1875.139,
    "end": 1885.902,
    "text": "But in terms of uncertainty, I think that there's a lot of truth in how uncomfortable people are with uncertainty at a cognitive level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1885.982,
    "end": 1894.064,
    "text": "And you can even see it in the stock market before the election is in, before the election results, the stock market goes crazy because nobody knows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1894.104,
    "end": 1899.066,
    "text": "I mean, it's not that one candidate is preferable over the other, but it's just the unknowing is very,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1900.796,
    "end": 1928.296,
    "text": " like people freak out so so and that speaks I think to metacognition also and then so I wanted to back up a little bit if I can to your discussion of information flow and how that might be difficult to quantify and Daniel I don't know can you flip to the section for me please on the generalized flow section I think we started to get into that a little bit last week and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1928.942,
    "end": 1933.617,
    "text": " We did discuss it in the doc zero, but I have like, I know that this is very,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1935.243,
    "end": 1959.143,
    "text": " mathematically technical and so I just have a little bit of questions about this and maybe you can help explain it in a way that's perhaps less technical but specifically information flow and Chris Fields is coming to discuss the FEP for generic quantum systems next week and so I can similarly interrogate him about some of this stuff and I'm looking forward to it but yeah",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1960.264,
    "end": 1975.16,
    "text": " you know, we have a discussion, there's a discussion in the paper about the probability flow and information, like a probability current, I think is actually what is used and getting into information currents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.18,
    "end": 1981.987,
    "text": "Like if you look up what is an information current, I think there's like the idea of the von Neumann information current and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1982.592,
    "end": 2006.251,
    "text": " um that like is explicitly related to quantum systems so is there any similar like do we have a way to measure information current because even when mike came to the live stream and talked about um um expanding cognition biological cognition computational boundary of a self there was sorry um but when you expand biological cognition like there's a you know you're",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2006.751,
    "end": 2009.173,
    "text": " basically expanding your informational awareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.213,
    "end": 2016.3,
    "text": "And so is there anything like an information current or how can you best relate that within a biological system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2016.42,
    "end": 2023.006,
    "text": "Is it like an expansion of your computational boundary or does it look like just more information goes in and comes out?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.749,
    "end": 2031.353,
    "text": "I think it depends on what level you're looking at.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2031.433,
    "end": 2032.214,
    "text": "I would say it's both.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2032.234,
    "end": 2032.554,
    "text": "So",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2035.139,
    "end": 2038.54,
    "text": " The second part you mentioned, the information flow comes in and out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2038.56,
    "end": 2042.421,
    "text": "That's something we just have more access to, biologically speaking, experimentally, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2044.321,
    "end": 2058.184,
    "text": "And you can absolutely, you know, you can look at, you know, you have all these sensors for receptors being activated for genetic transcription in response to that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2058.344,
    "end": 2062.545,
    "text": "So that's something that you have the best chance of quantifying experimentally.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2063.564,
    "end": 2070.566,
    "text": " And in terms of computationally, it's something you can monitor and then also couple that with what Chris feels.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2070.666,
    "end": 2072.707,
    "text": "Good thing you mentioned that because then I can relate to him.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2073.167,
    "end": 2074.968,
    "text": "That's basically what he's also very interested in, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2075.268,
    "end": 2081.13,
    "text": "How does physical energy, of course, play all into this metabolism, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2081.17,
    "end": 2082.35,
    "text": "None of this comes for free.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2083.111,
    "end": 2090.153,
    "text": "That's something that biologists often kind of, not biologists actually, no, theoretical biologists,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2090.726,
    "end": 2098.829,
    "text": " often under the table because the idea is that energy is abundant in life, which is to an extent true.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2099.409,
    "end": 2100.509,
    "text": "There's plenty of sunlight.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2100.529,
    "end": 2103.51,
    "text": "There's plenty of things to fool around.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2105.011,
    "end": 2111.213,
    "text": "But at the same time, locally, just with entropy, there is a strong competition there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2111.273,
    "end": 2115.534,
    "text": "So just because you are living in a reservoir that has plenty of food and sunlight,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2116.358,
    "end": 2121.54,
    "text": " That doesn't mean that you locally are going to survive because there's people locally competing with you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2122.0,
    "end": 2122.92,
    "text": "The same is true, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2122.96,
    "end": 2142.007,
    "text": "I mean, this is always like when you talk to people that have problems with the idea of why does entropy, I don't want to say names, but that saying that entropy is always increased, if chaos in the universe increases, how do we see",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2142.751,
    "end": 2144.152,
    "text": " much more structure evolving.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2144.332,
    "end": 2155.398,
    "text": "And then, of course, the answer to that is that, well, just like in a bath of water, if you have certain oil droplets that are going to come together, because overall, that gives more degrees of freedom for all the water molecules.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2155.458,
    "end": 2163.962,
    "text": "So the entire system, entropy did increase, but you managed to find a solution that does increase that by locally creating more water.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2163.982,
    "end": 2168.164,
    "text": "That's the drive of, I think, of life overall.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2168.424,
    "end": 2169.345,
    "text": "The quote that probably",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2169.773,
    "end": 2176.697,
    "text": " The talk that got me into biology was from a biophysicist in Heidelberg, was saying life is not about energy, it's about entropy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2178.638,
    "end": 2181.32,
    "text": "But the two come together, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2181.4,
    "end": 2191.586,
    "text": "Yes, it's about how much information is available, but then by extent of that, once you are subscribed to that, once you have to form these localized structures, then energy becomes important again.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2192.766,
    "end": 2198.93,
    "text": "So, and that's where I think is needed right now when you have these highly spatially organized systems",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2199.659,
    "end": 2203.502,
    "text": " energy suddenly does become something that is valuable again.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2203.522,
    "end": 2209.267,
    "text": "Yeah, I think I kind of lost my train of thought there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2210.588,
    "end": 2212.589,
    "text": "The boundary of self, that's right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2212.949,
    "end": 2215.892,
    "text": "The other information flow that was part of the information flow, we can measure that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2215.912,
    "end": 2226.22,
    "text": "We have good ideas what's lacking is a quantum understanding of how metabolism is really hooked into the information flow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2227.011,
    "end": 2233.455,
    "text": " whether or not it's built into the model or whether it's ad hoc, just down the line, you give it certain resources, and after a while, it just exploits them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2233.996,
    "end": 2239.179,
    "text": "The boundary of the cell is interesting because, of course, in the cell, we think, well, we have a, you know, there's a membrane.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2240.14,
    "end": 2242.141,
    "text": "The boundary of the cell is fairly obvious.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2242.742,
    "end": 2244.603,
    "text": "It's not actually as easy to assess, I think.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2244.663,
    "end": 2250.867,
    "text": "And, of course, if you look at multicellular organisms, it becomes, you know, tissue scale, then that becomes a lot more difficult.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2250.887,
    "end": 2251.788,
    "text": "But even on a cellular level,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2252.7,
    "end": 2266.025,
    "text": " Um, if you have certain receptors, um, you know, you have certain activations of it, then a model, any gender, gender model, not just in the active inference scheme, but especially in active inference scheme, you also have a model of yourself, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2266.165,
    "end": 2277.369,
    "text": "And if at what point your own, your own, what you're, what you're secreting on the owner, your signals that you secrete also feed back into what you're sensing after all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2278.214,
    "end": 2290.743,
    "text": " So it is kind of thought that that whole system is very much perturbed in cancer cells as well, where the, how much, like, is it, are you actually receiving things from the environment?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2290.804,
    "end": 2295.827,
    "text": "Are you basically just secreting and secreting and you don't really react to it anymore?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2296.568,
    "end": 2305.975,
    "text": "So the boundary of self, what Mike, if Mike already talked about this, he will have been much more eloquent than I can be about this, but the idea is the boundary of self is encoded",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2307.259,
    "end": 2336.233,
    "text": " specifically with time and spatial constraints so like how much your body of yourself what your yourself might be more general about this your self model depends very much on your sensual on your sensory memory like how how far do you sense and how and spatially how much around you can you sense and how much back do you have encoded as memory how much are effects in the past um persisting so that you know so even though if you have a cell that's a certain membrane if",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2337.478,
    "end": 2352.149,
    "text": " if that cell does not actually keep any track, if that cell is not somehow sensing beyond a certain boundary, and then it creates its own boundary by these highly peripheral cells that are basically surrounding themselves with each other, then suddenly the environment becomes mute.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2353.07,
    "end": 2356.272,
    "text": "So the boundary of the cell has essentially expanded, I would argue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2358.234,
    "end": 2360.815,
    "text": "I think that's kind of the thought train here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2360.916,
    "end": 2365.079,
    "text": "I just hope that was some way I would answer your question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2366.079,
    "end": 2366.4,
    "text": "Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2366.48,
    "end": 2366.62,
    "text": "Blue?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2367.757,
    "end": 2374.699,
    "text": " So just, I was curious, you mentioned that there was a talk that got you hooked into biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2374.759,
    "end": 2378.639,
    "text": "Was it Eric Smith and his discussion of biology and entropy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2378.659,
    "end": 2380.18,
    "text": "Because that's also fabulous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.88,
    "end": 2381.34,
    "text": "It was not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2381.36,
    "end": 2382.52,
    "text": "I'm real, just saying that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2382.56,
    "end": 2387.121,
    "text": "No, it was, damn, that's really embarrassing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2387.181,
    "end": 2390.142,
    "text": "I don't remember right now the name of the person that got me into biology's.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2392.309,
    "end": 2399.371,
    "text": " as I speak English right now, it's all in German back then, and always kind of my brain then has problems switching between those two in content as well as language.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2399.391,
    "end": 2402.212,
    "text": "It'll come back to me probably within this talk.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2402.992,
    "end": 2407.953,
    "text": "Eric Smith does a wonderful job, though, of, you know, discussing biology in terms of entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.973,
    "end": 2410.954,
    "text": "And so if you are not familiar with this work, I would just highly recommend it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2411.194,
    "end": 2411.394,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2412.815,
    "end": 2413.195,
    "text": "That really...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2414.423,
    "end": 2435.538,
    "text": " reflects on our um discussion what parts of the self model are important to carry forward and then what are the affordances for direct and indirect self modification so that's one piece like you mentioned the auto crin signaling and that's not even a contentious component it just is being",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2437.159,
    "end": 2445.56,
    "text": " modeled in a different way with active inference, rather than just a molecular event that's happening, that like cells secrete molecules that they also possess receptors",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2446.772,
    "end": 2454.655,
    "text": " to measure, it's just putting that into a framework of reflexive self-modeling and stigmergy and niche modification here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2456.875,
    "end": 2463.118,
    "text": "But just one other point that I thought was really maybe useful to highlight was this sensitivity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2463.598,
    "end": 2472.161,
    "text": "And just like many of the terms in Active, we're kind of seeing that there is a narrow or a quantitative sense, and then there's a broader sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2472.741,
    "end": 2476.362,
    "text": "Because in any dynamical systems model, you might hear about",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2477.04,
    "end": 2499.387,
    "text": " sensitivity of the parameter which is how much changing that parameter changes the outcome of the system and so that's a quantitative sense and then also it was brought up that it's important to model these like second order derivatives like how fast are things changing relative to expectations or how fast are they changing how they're changing and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2500.745,
    "end": 2504.968,
    "text": " that is what the generalized flow is, is all those higher derivatives.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2505.789,
    "end": 2514.036,
    "text": "So we can use that quantitative sense of sensitivity to look at how parameter changes in the generalized coordinates of motion matter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2514.836,
    "end": 2528.807,
    "text": "But also we can perhaps with cognitive modeling, take this discussion of sensitivity in the way that people are usually meaning it, like sensitivity of what is seen on someone's emotional state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2529.668,
    "end": 2550.077,
    "text": " and then model that using cognitive parameters like valence and affect even though that's quite a disjoint use from the parameter sensitivity discussion on the generalized coordinates so it's was an awesome discussion with like what is stress",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2552.028,
    "end": 2558.715,
    "text": " And how does that relate to the parametric sort of neutral perspective on what stress or sensitivity might mean?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2559.236,
    "end": 2571.288,
    "text": "Just the model descriptive versus some of these functional or phenomenological even ways that these terms come into play.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2573.731,
    "end": 2573.951,
    "text": "Blue?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2576.169,
    "end": 2583.656,
    "text": " So that's super interesting, thinking about sensitivity and stress just in terms of cognition, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2583.676,
    "end": 2594.906,
    "text": "So I know people that have sensory processing disorders get super aggravated by something like a bright light or a windy day, and just how sensitivity does play into that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2595.266,
    "end": 2604.533,
    "text": " maybe the flow of, of information, like, because, you know, I'm suddenly sensitive to this and I'm also sensitized to every other thing in my environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2604.573,
    "end": 2607.776,
    "text": "Like someone's screaming over here and it's windy and it's hot and it's bright.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.836,
    "end": 2610.758,
    "text": "And then like, I become just so overstimulated, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2610.778,
    "end": 2614.621,
    "text": "Like people have these, these processing things and it's sensory things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2615.101,
    "end": 2617.143,
    "text": " is that something that like has momentum, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2617.183,
    "end": 2622.268,
    "text": "Like, so you have enhanced sensitivity and does that just like, then all of a sudden you're just, you're so sensitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2622.309,
    "end": 2625.792,
    "text": "Like we hear people say stuff like that, like stop being so sensitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2626.172,
    "end": 2628.274,
    "text": "Just in terms of, of cognitive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2628.294,
    "end": 2631.978,
    "text": "I thought that that was just super interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2634.361,
    "end": 2635.382,
    "text": "I think that's an excellent point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2635.422,
    "end": 2636.743,
    "text": "I mean, that's, that's something that, that,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2637.281,
    "end": 2647.764,
    "text": " that shows exactly how important it is for humans, and again, I argue low levels as well in the evolution, to be able to model our sensitivity, to change our sensitivity, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2647.784,
    "end": 2657.287,
    "text": "We would never be able to have conversations in low environments if we couldn't change consciously our, and sometimes subconsciously as well, our sensitivity parameters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2657.367,
    "end": 2658.788,
    "text": "And I think",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2660.226,
    "end": 2663.168,
    "text": " that's something also that then also feeds into metacognition, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2663.189,
    "end": 2665.851,
    "text": "You'll learn like, oh, well, was I not paying attention enough?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2665.871,
    "end": 2667.352,
    "text": "Is that something you need to pay more attention to?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2667.372,
    "end": 2669.293,
    "text": "You're trying to tune this in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2669.333,
    "end": 2682.964,
    "text": "And I think that's the, in the sense of on the cellular level, I think where that feeds in is by learning over time, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2682.984,
    "end": 2685.666,
    "text": "By how much are being, how many receptors are being activated?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2685.686,
    "end": 2687.568,
    "text": "How does that feed in downstream?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2688.168,
    "end": 2693.871,
    "text": " then there is this component where essentially the cell can up its sensitivity by expressing more receptors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2694.191,
    "end": 2701.455,
    "text": "If it's not understanding its inputs, it can increase those proteins that are responsible for sensing these things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2702.656,
    "end": 2711.441,
    "text": "And there's also different, if you talk about ion channels specifically, and in the lab we work with that, there are different versions of ion channels that have different rate constants.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2712.425,
    "end": 2716.807,
    "text": " The same is true for active proteins as well, such as pumps.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2717.347,
    "end": 2730.371,
    "text": "So that becomes a lot more explicitly modulating sensitivity over time in a way to better react and cope with, adapt to its environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2730.411,
    "end": 2734.332,
    "text": "Again, adaptation, keep in mind, involves prediction in most cases.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2735.553,
    "end": 2736.973,
    "text": "If not explicitly, then implicitly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2739.898,
    "end": 2740.239,
    "text": " Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2740.639,
    "end": 2747.568,
    "text": "And by the way, the guy is Michael Hausmann in Heidelberg before I turn around my grave.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2747.588,
    "end": 2750.952,
    "text": "That was the person that got me to physics, to biology, biophysics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2752.711,
    "end": 2753.011,
    "text": " Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2754.991,
    "end": 2758.512,
    "text": "Just to kind of connect that change in sensitivity to some of those mechanisms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2758.652,
    "end": 2774.415,
    "text": "So if it's the sensitivity to a given hormone or a given circulating molecule, then that sometimes gets accomplished biologically by changes in like the membrane receptor density or changes in downstream signaling pathways.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2774.475,
    "end": 2778.756,
    "text": "So even if the amount of receptor in the membrane stays constant, it's like you can",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2779.156,
    "end": 2807.618,
    "text": " release more of the neurotransmitter in the synapse, or you could have more or less receptors, or you could have more or less of all these regulators and phosphorylating proteins, et cetera, in the downstream signaling pathways, because there's a lot of complexity in that space, but there's a lot of knobs, including rates of change and rates of rates of change and lag effects with transcription factors and all this other, basically anything is possible.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2809.045,
    "end": 2819.333,
    "text": " And then at the organism level, just to give one, and then anyone else maybe at some other level, it's kind of like a nestmate ant being sensitive to interactions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2820.314,
    "end": 2834.365,
    "text": "And then a nurse who's a younger ant is initially more susceptible or more sensitive due to multiple reasons, like at the antenna, at the brain, in just spatially where the nurse is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2834.825,
    "end": 2835.586,
    "text": "And then there's this...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2837.453,
    "end": 2844.896,
    "text": " development towards being a forager, being sensitive to forager cues, finding oneself in spaces where there are forager cues that are useful.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2846.297,
    "end": 2856.401,
    "text": "So there's a lot of ways that these changes in the type of sensitivity, again, are already things that we talk about in developmental biology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2857.302,
    "end": 2864.185,
    "text": "And so it's so cool to see how that is connected to the molecular mechanism, the affective angle, and then",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2865.365,
    "end": 2867.306,
    "text": " with the underpinning of the generalized flow.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2873.47,
    "end": 2873.81,
    "text": "Yeah, Dean?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2873.83,
    "end": 2879.854,
    "text": "So you guys can push back on this hard if you want, but it's interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2880.834,
    "end": 2886.658,
    "text": "One of the terms that I coined was that stress programming, or at least programming",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2887.591,
    "end": 2893.132,
    "text": " with stress assumed was basically learning, either formally or informally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2893.852,
    "end": 2899.214,
    "text": "That's what it is, because there's a certain amount of stress involved, be it positive or negative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2899.694,
    "end": 2910.036,
    "text": "But kind of through that viewfinder, I think it's interesting that back to the back and forth thing, stress programming can be safer",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2910.734,
    "end": 2915.282,
    "text": " or it can be riskier, as long as it's not sort of killing the learner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2916.024,
    "end": 2920.432,
    "text": "If it's safer in the sense of as intervention, I think this paper,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2921.867,
    "end": 2944.484,
    "text": " show that you can intervene but riskier is as distribution like sending something out into the unknown it can be safer as teaching or taught it can also be riskier as unteaching or untaught sort of just sort of throwing somebody into a situation and see whether they can paddle or not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2946.308,
    "end": 2963.7,
    "text": " The last thing is it can also be seen as both modeling in the safer sense because we've reduced some of the variation, or it can also be riskier as in terms of coordinating, meaning the person has to kind of figure it out as they're flying the plane.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2964.581,
    "end": 2967.303,
    "text": "So I wonder what you guys think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2967.823,
    "end": 2973.467,
    "text": "Do you think that, can we, is there some agreement that learning in general is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2974.025,
    "end": 2983.711,
    "text": " be it formalized or informalized, has an aspect of stress programming that kind of is assumed or am I way out?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2988.855,
    "end": 2990.596,
    "text": "Awesome question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2991.556,
    "end": 2992.937,
    "text": "Blue or Franz, what do you think?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2996.52,
    "end": 2997.44,
    "text": "I don't think you're off.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2997.88,
    "end": 3003.384,
    "text": "There's definitely, of course, explicit incorporations of stress into learning, but your question, I think, is like,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3003.996,
    "end": 3007.617,
    "text": " is kind of always implicitly there, even if not explicitly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3008.237,
    "end": 3020.741,
    "text": "So one interesting kind of fact, this was Blue mentioned earlier, that stress can be interpreted as like human perceived stress, hormones, but it can also just be like perturbation from equilibrium, from homeostasis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3021.821,
    "end": 3030.204,
    "text": "And they actually do kind of, this has been breached, this has been combined in homeostatic reinforcement learning where they kind of implicitly, explicitly make",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3030.819,
    "end": 3035.942,
    "text": " the reward and reward-based reinforcement learning about the homeostatic off point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3036.763,
    "end": 3043.486,
    "text": "And then stress becomes suddenly a lot more explicit in that sense of perturbation from your homeostatic set point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3045.428,
    "end": 3054.333,
    "text": "In the active inference scheme, stress is basically just your, you could just define it basically as your overall stress.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3055.399,
    "end": 3081.837,
    "text": " difference and again like with those fans i was talking about like how much is your is your is your private belief certainty changing are you minimizing uncertainty um over time or not um it is it is hard i think it's hard it's hard both to completely say stress is not involved and without saying that well you're just calling everything stress but it kind of it's really",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3082.423,
    "end": 3084.505,
    "text": " It depends on how you define stress.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3084.545,
    "end": 3103.061,
    "text": "But if you think if you go with something as in stress as you're not right now in an energy-minimized state, you're not in an active improvement scheme, or you're not in your homosex set point in a more basic scheme, then stress is, I would argue, ubiquitous in learning, yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3104.262,
    "end": 3107.425,
    "text": "Because without that, if you don't have the difference to that, if you don't actually",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3108.038,
    "end": 3115.52,
    "text": " If you don't have any drive to learn because you think everything's perfect, then it's hard to have learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3115.58,
    "end": 3123.062,
    "text": "So specifically, if learning is about, with the environment and context, what are you getting from your environment?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3123.082,
    "end": 3124.202,
    "text": "Are you trying to adapt to it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3124.483,
    "end": 3130.224,
    "text": "Are you trying to learn in the sense of adapt to it and find a certain equilibrium with it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3131.004,
    "end": 3136.826,
    "text": "Then I think stress becomes very much explicit and it's ubiquitous in learning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3139.713,
    "end": 3146.138,
    "text": " I just want to add one thing and that's perfect because I always talk about the minimum of two and I think you're absolutely right, Franz.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3146.619,
    "end": 3150.942,
    "text": "I think you have to then look at stress as being either voluntary or involuntary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3150.962,
    "end": 3156.347,
    "text": "I think that's the minimum of two that you have to look at because I think if you have voluntary stress,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3157.711,
    "end": 3161.833,
    "text": " It's measurably different than the involuntary type.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3162.934,
    "end": 3165.315,
    "text": "So, yeah, you're right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3165.635,
    "end": 3170.017,
    "text": "I don't think we can just throw everything under one umbrella and make it a monolith.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3170.517,
    "end": 3180.462,
    "text": "I think we have to partition it right from the very get-go and say, all programming, be it a curriculum, whatever, whatever the curriculum is that those stem cells have,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3182.426,
    "end": 3205.604,
    "text": " that's some of it's going to be voluntary and some of it's going to be involuntary based on the situation that they're they're placed in so again i wasn't trying to pull it in that direction but i didn't bring up stress but i really like that it was brought up so okay yeah blue blue sorry so just um from uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3206.661,
    "end": 3208.462,
    "text": " neuroscience perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3209.403,
    "end": 3213.667,
    "text": "It's interesting, like the voluntary and involuntary stress thing is so different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3213.687,
    "end": 3227.037,
    "text": "And I feel like maybe Daniel will remember, we discussed that at some point, like when you're exposed to a stress that like you do to yourself on purpose, like your strength training or something like that versus, you know, some, some externally imposed stress that you didn't volunteer for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3227.057,
    "end": 3229.259,
    "text": "I think that that has a difference in affect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3229.319,
    "end": 3230.58,
    "text": "I feel like we looked at a paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3230.6,
    "end": 3232.161,
    "text": "I can't remember off the top of my head though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.621,
    "end": 3240.527,
    "text": " Um, but in terms of sensory processing, it's really interesting in neuroscience, we actually adapt, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3240.667,
    "end": 3245.591,
    "text": "So, so you can listen to like your, you, this is a great example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3245.611,
    "end": 3252.196,
    "text": "Like you turn on the car radio and like you're listening, jamming out in the car for, I don't know, a while, 20 minutes, 30 minutes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3252.316,
    "end": 3254.298,
    "text": "And then suddenly it doesn't seem as loud.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3254.598,
    "end": 3255.359,
    "text": "And so you turn it up and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3256.039,
    "end": 3257.903,
    "text": " And then you're jamming out, jamming out, jamming out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3257.963,
    "end": 3259.226,
    "text": "And still, it doesn't seem as loud.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.266,
    "end": 3265.238,
    "text": "So you turn it up because the same level of stimulus produces a decreasing sensation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3266.094,
    "end": 3271.476,
    "text": " And that's true in terms of, you know, visual, like when you first turn on the light, you're like, oh, it's so bright, but then you adapt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3271.856,
    "end": 3277.418,
    "text": "And so in terms of sensory processing, we have a mechanism for adaptation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3278.358,
    "end": 3287.661,
    "text": "And I wonder about actually cells, like not neurons, because this is like, I'm specifically talking about like a sensory processing way, but I wonder if cells do the same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3287.701,
    "end": 3293.423,
    "text": "I mean, I guess like, you know, the receptor shuts or the receptor is triggered and then it can't get activated again for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3294.003,
    "end": 3295.044,
    "text": " some certain amount of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3295.124,
    "end": 3299.386,
    "text": "So even just receptor binding in and of itself is like an adaptation mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3299.426,
    "end": 3303.849,
    "text": "Like you can't constantly like dump the chemical into the receptor, open the channel or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3303.909,
    "end": 3307.071,
    "text": "Like that's not like biochemically possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3308.011,
    "end": 3309.992,
    "text": "But I wonder if, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3311.213,
    "end": 3325.436,
    "text": " cells have some other adaptation mechanism outside of this, like, channel opening or closing, or just this, is there more than, like, the mechanodynamics of the channel that enables cellular adaptation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3325.456,
    "end": 3340.059,
    "text": "I can think of a couple ones, but we're an expert on this, but there's, well, you can think of first, like, on the epigenetic level, if you basically just, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3340.953,
    "end": 3349.718,
    "text": " you know, recruit more histones, basically have a more tightly packed chromosome, you're going to have less genetic expression, no matter what kind of signaling input you get to the nucleus.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3350.358,
    "end": 3351.639,
    "text": "That's one way I can think of it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3352.479,
    "end": 3355.701,
    "text": "Another one is mechanically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3355.981,
    "end": 3369.308,
    "text": "So the right, most of the, I hope I'm not overgeneralizing, but I think most of the, you know, signaling against that receptors are sensing and then has to be transported to the nucleus somehow to cause transcription.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3369.907,
    "end": 3371.068,
    "text": " That is usually directed, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3371.108,
    "end": 3373.009,
    "text": "That has to correct of a cross-site skeleton.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3373.51,
    "end": 3387.361,
    "text": "So if you change the mechanical properties of the status skeleton itself, and again, yeah, I'm out of my league, but that's something I could very well imagine to ask someone that's smart on that topic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3389.342,
    "end": 3394.966,
    "text": "Lastly, if you're talking in the intercellular context, then, you know,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3397.622,
    "end": 3402.906,
    "text": " Things like, you know, what we, in neuronal context, you have these, you know, the synapses.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3403.127,
    "end": 3409.011,
    "text": "In the non-neuronal context, you still have gap junctions and other complexes that basically allow transport between cells.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3409.692,
    "end": 3412.915,
    "text": "And those can also be modulated by the cell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3412.955,
    "end": 3414.916,
    "text": "So then there you can also get habituation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3414.976,
    "end": 3418.139,
    "text": "And I definitely know of examples where people have shown habituation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3418.923,
    "end": 3427.369,
    "text": " And even other, there's active research on showing that there's more just habituation, but also actually learning of a certain pattern as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3429.371,
    "end": 3429.951,
    "text": "I think that's true.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3430.652,
    "end": 3437.557,
    "text": "So I'm really interested in the cytoskeleton, because a lot of, I mean, the receptors are in the membrane, embedded in the membrane.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3437.637,
    "end": 3444.502,
    "text": "But we don't really, there's not a lot of work that looks at the cytoskeletal dynamics with respect to,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3446.483,
    "end": 3472.966,
    "text": " modulation of receptor dynamics right right so like that's a field that i think or i haven't seen very much work um in terms of how does this the underlying cytoskeleton contribute to the properties of the membrane and how a cell might be behaving and just in terms of like you know things having to get into the nucleus i don't know i'm iffy on that one um i i think and it's just because i did very early work like transfecting cells in a variety of different ways and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3473.246,
    "end": 3496.393,
    "text": " you know to get a gene into the into the cell to get the cell to express the gene you have to get it through the nucleus right how does it get into the nucleus like nobody can answer you so like if it doesn't have a nuclear target on it like how is it going so is it just like osmosing itself through or or like like just how is that exactly happening and so you call the vendor like oh i'm trying to use your product whether you're electroporating or you know using some kind of lipid mediated transduction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3496.693,
    "end": 3497.113,
    "text": " They don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3497.193,
    "end": 3498.293,
    "text": "They have no idea, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3498.634,
    "end": 3501.574,
    "text": "So it's just a super interesting prospect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3501.634,
    "end": 3510.117,
    "text": "And I think that in terms of both that and the cytoskeleton, there's a lot of like dynamic remodeling that occurs during cell cycles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3510.197,
    "end": 3510.357,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3510.397,
    "end": 3518.819,
    "text": "Like during the phases, you know, like when a cell is dividing and growing and becoming two cells, there's and so like the nuclear membrane, that's the point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3519.694,
    "end": 3529.057,
    "text": " But in terms of terminally differentiated cells, like a neuron or something that's not undergoing constant change and remodeling, it's curious to see how that can happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3530.198,
    "end": 3536.3,
    "text": "And I'm interested if anybody has any good, like, hardcore mechanistic papers that you want to point out to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3536.62,
    "end": 3541.782,
    "text": "Or if anybody listening in the live stream wants to drop them in the YouTube chat, I would really love to take a look at them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3545.223,
    "end": 3545.383,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3549.901,
    "end": 3560.211,
    "text": " I really like Dean returning to this idea that there's the, there's a continuum or there's multiple archetype dimensions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3560.251,
    "end": 3572.023,
    "text": "So not that it's all going to map onto just two, but we know it's at least locally going to be at minimum two, that there's the kind of one mode of interacting and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3572.984,
    "end": 3585.148,
    "text": " in an educational or training setting with a teaching and a taught, that could still be in an interactionist or an instructionist way versus the unteaching and the untaught.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3585.768,
    "end": 3596.952,
    "text": "So that's the difference between the athlete having their form like observed in a tight feedback versus when they're on a sojourn away from that sort of a training context.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3597.712,
    "end": 3601.013,
    "text": "And so there's like an environment or there's a setting",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3602.392,
    "end": 3605.694,
    "text": " where there's some kind of stress as fundamental.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3605.714,
    "end": 3611.958,
    "text": "And then there's another type of environment where the different kind of stress is fundamental.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3612.838,
    "end": 3615.5,
    "text": "And then Franz was an awesome point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3616.405,
    "end": 3623.972,
    "text": " moving from that basic homeostatic framing where stress is usually considered at the first derivative or the state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3624.532,
    "end": 3630.397,
    "text": "So it's like for a thermo organism, thermal stress is gonna be when it's hot or cold.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3631.138,
    "end": 3636.783,
    "text": "And then that's gonna be like a bowl or it's a V or it's a bathtub or it's some other thermal stress curve.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3637.243,
    "end": 3638.224,
    "text": "It's about temperature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3640.043,
    "end": 3656.028,
    "text": " moving into the generalized coordinates of motion with temperature and change of temperature and change of temperature, so all the higher derivatives of temperature, that expands the space a lot because maybe it's possible that a temperature that you slowly reach, like over 10 years,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3658.689,
    "end": 3662.25,
    "text": " is a different amount of stress than just jumping there instantly, time matters.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3662.93,
    "end": 3669.792,
    "text": "And so the rates of change captures that time dependence in an instance with a snapshot vector.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3671.232,
    "end": 3677.794,
    "text": "So that's sort of the formal use of how we can look beyond just the stress on temperature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3678.754,
    "end": 3683.775,
    "text": "And then we introduced the whole cognitive stress because you said, well, for the active inference entity,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3685.251,
    "end": 3699.427,
    "text": " this is sort of like the first resonance and this is the one whose violation of integrity results in physical death but then stress moves to higher or different",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3702.401,
    "end": 3729.595,
    "text": " analogous settings and that could be how fast am i learning and as pointed out by dave in the chat and by dean and others like it really matters whether somebody has agency or affordances to change it and so my closing point there with the voluntary involuntary is like grad school and stress because or any research or any educational environment but one that many people experience is like it can be stressful",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3730.649,
    "end": 3734.252,
    "text": " It's also a very often privileged setting to be in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3735.093,
    "end": 3740.238,
    "text": "And one is taken care of sometimes in a way that even neighbors won't be.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3740.699,
    "end": 3745.543,
    "text": "And so that is something that I saw first and second hand.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3746.244,
    "end": 3752.049,
    "text": "And just thinking about the stress, it's like, why is it stressful to just read a few papers some days",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3753.157,
    "end": 3754.018,
    "text": " or something like that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3754.718,
    "end": 3760.922,
    "text": "So just kind of interesting with what is voluntary and involuntary, how we commit ourselves to different kinds of stress of what kind.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3761.322,
    "end": 3770.067,
    "text": "It's like, well, I wanted it to be novel, but not that novel, and how we actually make those action selections in uncertain environments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3773.329,
    "end": 3773.509,
    "text": "Blue?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3775.037,
    "end": 3783.303,
    "text": " So just to add on to the voluntary versus involuntary, like grad school is an entirely voluntary endeavor, obviously, but like high school is not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3783.643,
    "end": 3785.084,
    "text": "And like I dropped out of high school at 16.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3785.564,
    "end": 3787.766,
    "text": "Like as soon as I was old enough to drop out, I was like, I'm out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3788.026,
    "end": 3791.568,
    "text": "Like I'm not doing this compulsory regimented program.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3791.748,
    "end": 3792.489,
    "text": "Like, sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3793.89,
    "end": 3794.63,
    "text": "No regrets, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3794.65,
    "end": 3801.255,
    "text": "Like I started college, obviously have a PhD, like did well, but it's the difference versus involuntary versus voluntary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3801.315,
    "end": 3804.196,
    "text": "Like when it's compulsory, it becomes torture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3806.498,
    "end": 3808.398,
    "text": " I mean, just my two cents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.439,
    "end": 3827.324,
    "text": "We had a discussion in our computational group recently about this whole idea of how do you quantify any kind of agency and Josh Bonger in that context who works with us brought up this idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3827.365,
    "end": 3831.166,
    "text": "Instead of talking about agency, which is hard to quantify, you can talk about empowerment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3832.146,
    "end": 3834.707,
    "text": "In the computational sense, empowerment is about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3835.342,
    "end": 3839.923,
    "text": " how much do your actions, how much can your actions influence your sensations?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3840.704,
    "end": 3845.345,
    "text": "Again, this makes very clear in an active inference scheme, right, where you have this Markov blanket.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3845.365,
    "end": 3862.69,
    "text": "So to build an example, right, if you don't, if there's no actions you can take to change it, that's, you know, we can think about it as natively stressful, but we can also define that fairly clearly in a computational sense using something like empowerment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3863.331,
    "end": 3864.111,
    "text": "So it's a",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3865.098,
    "end": 3885.667,
    "text": " And that, again, I like that you brought this up because this drives home the point that a lot of these fundamental things we understand about stress in human context, anyone that's ever dealt with depression or people that suffer from depression knows that it's never really about the objective total amount of stress, but how it's being perceived by that person.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3886.107,
    "end": 3890.208,
    "text": "And I think this definition of empowerment helps a lot to understand that better.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3890.629,
    "end": 3891.869,
    "text": "How much control do you have over that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3892.249,
    "end": 3894.03,
    "text": "There's other things that, of course, feed into that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3894.684,
    "end": 3913.89,
    "text": " But it also makes then fairly clearly that a lot of the fundamental principles must hold true in lower organisms as well, because these definitions are, of course, as soon as you prescribe actions, of course, you can argue that there's no real actions in cell biology, then that's okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3913.91,
    "end": 3915.85,
    "text": "That's just then, don't want to talk about that level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3916.231,
    "end": 3921.072,
    "text": "But if you do look at active states in a certain context, then you do get",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3921.82,
    "end": 3933.269,
    "text": " then you can fairly simply in an active inference scheme, but other ones as well, define empowerment, measure empowerment over time by looking at how much, how actions actually change the sensory states of the cell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3933.749,
    "end": 3938.393,
    "text": "And then definitions of stress from that point of view also become fairly explicit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3943.208,
    "end": 3944.748,
    "text": " Can I ask you a question, Franz?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3945.468,
    "end": 3946.349,
    "text": "Yeah, can I ask you a question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3946.369,
    "end": 3952.45,
    "text": "Because you mentioned when you were with us in the point one for a bit there, and I don't know if you re-mentioned it today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3952.87,
    "end": 3957.771,
    "text": "You said you went to Mark, I think, and you said, I want to do something cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3958.911,
    "end": 3961.572,
    "text": "We're going to bring this back to the voluntary and involuntary piece.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3962.132,
    "end": 3967.873,
    "text": "And then I think you said, I'd never heard of active inference before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3969.149,
    "end": 3972.095,
    "text": " I was pointed in that direction to Carl's lab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3972.757,
    "end": 3978.569,
    "text": "So in the context of what's voluntary and involuntary, when you...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3980.41,
    "end": 3984.312,
    "text": " When you said, I want to do something cool, that sounds like you wanted to do something voluntarily.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3985.093,
    "end": 3987.594,
    "text": "Then you got this deep dive into activism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3988.395,
    "end": 3995.119,
    "text": "You pushed that up against your biology background, which is something that you've obviously done because you like it, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3995.539,
    "end": 4009.328,
    "text": "And you wanted to finish off your... So going forward now, that voluntary piece that got you into the active inference, what do you see the active inference doing in terms of this empowerment question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4010.128,
    "end": 4012.709,
    "text": " because Daniel's written it out here with a question mark behind it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4012.97,
    "end": 4017.192,
    "text": "So how do you feel more agential?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4018.113,
    "end": 4038.825,
    "text": "Sorry, I always kill words because I'm not very... Anyway, I'm just curious what you think now in terms of what sort of empowerments you've sort of become in the sense that now that you've got this sense of what active inference can do and what some of these math formalisms provide and what the statistical...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4039.801,
    "end": 4039.961,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4040.041,
    "end": 4056.655,
    "text": "What do you, what do you, what do you, like, what are you thinking going forward in terms of the reapplication of what you, what you pulled out of a, out of a, out of a different, different bucket and then it's set down in the bucket that you're most familiar with?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4057.307,
    "end": 4060.868,
    "text": " So you mean like what I put out on a personal level, like for my life decisions?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4060.888,
    "end": 4068.872,
    "text": "Yeah, like when you're going to be going forward and trying to use that active inference sense in terms of some of those decisions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4069.512,
    "end": 4081.797,
    "text": "And what kind of environments do you think you see yourself projecting yourself into that you may not have projected yourself into prior to sort of engaging or encountering or exposing yourself to active inference?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4082.957,
    "end": 4083.918,
    "text": "That's a good question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4084.858,
    "end": 4085.838,
    "text": "I think in the end, it's...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4088.228,
    "end": 4117.821,
    "text": " it's my wife and I, we both love this word, serendipity, which is the concept of happy accidents, which there's all kinds of connotations there, but in an active inference scheme, or any, you know, when you look at, you know, what is the information flow from you, what the idea is that you, if you have tumor, if you have, so it's going really active inference right now, I'm sorry, if you have super high precision, very strong prior beliefs, then whatever you, if you are confining yourself and you don't allow variances,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4118.727,
    "end": 4125.773,
    "text": " to change your mind, then you're almost always going to be upset because you never, you know, your precision is set too high, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4125.813,
    "end": 4133.018,
    "text": "There's a paper going to be coming out soon about this collaborator as well, looks about precision in this context as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4133.659,
    "end": 4139.703,
    "text": "So that's something that, you know, any active inference modeler will know that you have to, you know, keep that in mind when you set your precisions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4140.724,
    "end": 4145.628,
    "text": "For me personally, it really is an idea of like, I think every, there's,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4146.263,
    "end": 4153.588,
    "text": " This is not a novel idea by myself by any stretch, but any human tells stories about their environment, but most about themselves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4154.228,
    "end": 4157.11,
    "text": "And the storytelling is, in my sense, nothing else than doing a model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4157.748,
    "end": 4160.49,
    "text": " an active inference scheme, making a generative model and setting that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4160.57,
    "end": 4176.28,
    "text": "So I think to, for me to, I'm way too young to be giving life advice, but for me to, to, to achieve any kind of happiness, you have to really be careful of what story you tell about yourself and how strictly confined that on things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4176.46,
    "end": 4183.225,
    "text": "And there is definitely advantages of, I think personally, I've always had better luck personally, I think by, by not,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4184.062,
    "end": 4189.243,
    "text": " not letting that not define that too, too strictly and really looking into what, what your environment throws at you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4189.503,
    "end": 4191.044,
    "text": "And I think that helps.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4191.124,
    "end": 4200.926,
    "text": "And I know personally people that have a very hard time with that and that have very strong models of, you know, I'm going to, you know, get married at that age and then do this and that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4201.006,
    "end": 4206.427,
    "text": "And then when things don't happen that way, I think at least it's love and happiness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4207.387,
    "end": 4211.808,
    "text": "So, you know, in that context, active influence, what can I do for you?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4211.868,
    "end": 4212.048,
    "text": "I mean,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4212.981,
    "end": 4241.939,
    "text": " think it's it it makes things explicit that we all kind of hear about some level and and you know i don't know when you come from psychology biology just you know folk psychology things just people giving you advice parents saying i think oh now this is i don't want to say that you need any of those insights i think you can get this lots of ways but what i like about that inference scheme that it you know it's it's putting this dimension it makes makes the it makes the i think also biology the biggest advantage is you get a very explicit",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4242.893,
    "end": 4246.694,
    "text": " a structure about information flow for very simple systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4247.474,
    "end": 4254.796,
    "text": "And because it's been primarily applied in neurosciences, you get, for us, intuitive results from that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4254.876,
    "end": 4256.576,
    "text": "What happens if you have tri-precision?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4256.596,
    "end": 4258.037,
    "text": "What happens if your priorities don't change?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4258.577,
    "end": 4261.078,
    "text": "What happens if your energy isn't being minimized?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4261.098,
    "end": 4261.638,
    "text": "All these things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4262.278,
    "end": 4270.56,
    "text": "I can fairly easily explain that in the context of human behavior because that's been applied and we all have a true understanding.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4271.411,
    "end": 4276.972,
    "text": " Um, but I think there's, um, for the biology point of view, there's, there's a lot of things we can learn from that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4277.132,
    "end": 4284.114,
    "text": "If you look at the fun, the mathematical definitions, then of course you deal with the baggage that you get from the neuroscience, which I had to deal a lot with, uh, which is fair.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4285.134,
    "end": 4295.556,
    "text": "Um, but for your life, I think it just helps you once you see really how, how much study has been put into mis inference, you know, a mal like bad inferences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4296.657,
    "end": 4318.715,
    "text": " And of course, people doing tests in an active inference scheme about, you know, psychology, like behavior, task states, then I think that that's one lesson I can definitely learn from that if I hadn't done already, is that be mindful of your bias, be mindful of the rate of change, like how, what are you really stressed out about right now?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4318.776,
    "end": 4320.817,
    "text": "What's the worst uncertainty coming from?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4320.857,
    "end": 4323.6,
    "text": "How much should that throw you off, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4323.68,
    "end": 4325.281,
    "text": "And this is, in a sense,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4326.192,
    "end": 4337.44,
    "text": " to kind of bring all this home a little bit, the biggest limitation of any algorithm, of any model is that you are defining the general model beforehand, not just an active inference scheme, but any.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4337.86,
    "end": 4347.927,
    "text": "There's papers that come out that criticize the idea of artificial generalized intelligence because you always have a predefined model and life on that sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4347.988,
    "end": 4350.409,
    "text": "But that definition does not do that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4350.449,
    "end": 4354.152,
    "text": "Life always, you know, virtual systems, evolution kind of generates",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4354.807,
    "end": 4381.345,
    "text": " bunch of diversity in its background and from that kind of they pick the best path and constantly evolve the generative model so you know that's kind of like limitation of active inference any other algorithm which can be overcome by you know chain different algorithms together by evolving system by having models make models there's some cool work on that too but that's something you need to take i think both computationally scientifically most personally could take a mind of is like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4381.949,
    "end": 4384.551,
    "text": " at what point do you change your own model and allow for flexibility?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4384.571,
    "end": 4396.939,
    "text": "That's what makes human right now still, that's one of the sort of acts that makes humans superior, I would say, to any kind of algorithm right now is because they all come predefined with a lot of the hard models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4397.279,
    "end": 4401.782,
    "text": "Again, I'm saying this now and I also don't actually agree with that 100%.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4402.062,
    "end": 4406.345,
    "text": "I don't actually believe in fundamental differences between different intelligences, but that's something that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4407.27,
    "end": 4410.013,
    "text": " at least kind of intuitively makes sense to us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4410.033,
    "end": 4413.557,
    "text": "Whether or not that's really true scientifically, I have my points to that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4413.597,
    "end": 4415.279,
    "text": "But that's going off the rails.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4418.762,
    "end": 4419.123,
    "text": "Awesome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4419.263,
    "end": 4419.423,
    "text": "Wow.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4424.062,
    "end": 4447.737,
    "text": " a few things like we often talk about concordances with different systems and it brings the cognitive apparatus that was developed for humans and starts to at least instrumentally if not from a realism perspective also project that and so it allows um as a trans discipline",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4448.985,
    "end": 4469.484,
    "text": " people to talk about systems and map their analogies and models in a way that would help us find the resonances between cellular metabolism and economics, kind of taking a vague feeling like those might have some similarities into using the same notation, terms, forms,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4471.926,
    "end": 4500.198,
    "text": " etc so that's one very interesting piece about active inference and also the limitations in terms of at what order and how much uh time and attention is allocated to this structural aspect and how many different families of structures are provided on what and then to your um well communicated uncertainty about if and how biology is different from other kinds of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4502.076,
    "end": 4521.034,
    "text": " processes um that's an awesome question especially connecting back to your point about the reservoir of energy versus how locally there can be a different energy or entropy balance so it's almost like there might be",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4523.163,
    "end": 4530.735,
    "text": " little pieces that can be mapped to digital signal processing with super high fidelity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4531.416,
    "end": 4533.819,
    "text": "And that'll be taken as like a win for the realists.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4534.761,
    "end": 4537.425,
    "text": "And then there might be other parts where the instrumentalism",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4538.562,
    "end": 4545.407,
    "text": " bridges because we're just making a model of this one smaller thing and this one larger thing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4546.208,
    "end": 4555.694,
    "text": "And then in cases where this is fully computationally defined or fully described, then there's like a case for a real.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4556.175,
    "end": 4566.062,
    "text": "What does empowerment look like at maybe like a low organismal level or even like a cellular level?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4566.422,
    "end": 4567.243,
    "text": "How, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4568.434,
    "end": 4596.01,
    "text": " like is cellular behavior or lower organism behavior like voluntary versus compulsory and like is there a way to measure that like obviously like you can trap an animal in a box and frequently like you know will try to get out but if you don't trap it would it go into the box and hang out there like like does that happen maybe i don't know does anybody know of any examples of like what um empowerment looks like at like that's just it's a super interesting concept to me",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4601.275,
    "end": 4629.189,
    "text": " um in the in the sex it's if you take that definition of um the combination of how much your actions um change your sensory puts your perceptions then and definitely definitely if once you have a definition it's of course built on what your different actions are and that that is fairly easy and because you don't have to go into this route what is voluntary or not you just basically",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4629.736,
    "end": 4656.364,
    "text": " something internal state you know you basically you can even simpler you look at the the flow of states your marker blanket which you can show forms naturally which call is shown and then from that point of view once you have active states then you can measure that fairly fairly easily so as example i would argue if you know if cells actually interact with each other and really change other cell types we have here's a great example morphogenesis is traditionally",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4657.717,
    "end": 4686.689,
    "text": " i'm not sure i think it's pretty fairly established it's really driven by life's organizing and it's always a subset of cells that will drive itself the ones i would argue then that those cells are probably very much in power because their actions uh cause differentiation of cells around them which then will very much and they're going to do certain expression of self as well so then that will they have action very much control that whereas themselves um the receiving end have a lower power because",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4687.372,
    "end": 4710.163,
    "text": " their their own signaling probably isn't really because they're not not they often just don't have that that they don't make a lot of that signaling self that it's being organizing element so they are not going to have a lower let's think of that you're asking me what anyone yeah what as as our guest or anyone else is welcome to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4715.305,
    "end": 4732.717,
    "text": " Whether to go, I personally like to get to a place where there comes more than kind of quality of like making actual, like instead of just like making these abstract models of active inference, you can measure on the other hand, if you can really map those two together, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4732.737,
    "end": 4739.001,
    "text": "Like in the sense of, I mean, a lot of work went into this whole SPM software that they developed in London.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4739.021,
    "end": 4744.285,
    "text": "And at this point, right, you actually can get fMRI data and then you can do a dynamic causal model and you can really",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4745.22,
    "end": 4774.012,
    "text": " can really postulate different causal models and then do a you know a patient belief updating you can do a hypothesis testing right in this in the sense that which hypothesis is more probably to have cost that you see um if we get to that level in a morphogenesis exam you can get the high fidelity images of the developing embryo that you would get with over time get signals that you can measure and feed back into your model and really",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4774.725,
    "end": 4800.739,
    "text": " make really of what cause a model like what structure would have caused these sensations that you or the the data that you're receiving that would be a huge step forward and microscopy is really doing some uh having some great advance on that one example i can give is a friend of mine works on that dimitri crumb and we used to be in heidelberg and he was this light sheet microscopes there's a lot of other groups i mean he's a master student phd student",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4801.537,
    "end": 4826.413,
    "text": " um about that from him but there's groups um you can go that do high fidelity um light sheet from two sides we can really nice like near confocal resolution um but with high high temporal resolution um of their organism doing and recapture the entire process of you know from castellation further on that's you could collect where you can really start to make",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4827.523,
    "end": 4834.648,
    "text": " postulate our causal models in an active inference framework, and then they basically retest where is the actual home there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4835.208,
    "end": 4850.119,
    "text": "And you can retest the idea that we already have, as I mentioned in morphogenesis, and retest out how much that fits into our notions of computational belief updating and actions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4851.36,
    "end": 4852.781,
    "text": "I would love to see that in my lifetime.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4856.735,
    "end": 4856.955,
    "text": " Wow.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4858.036,
    "end": 4858.536,
    "text": "Super awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4858.576,
    "end": 4868.723,
    "text": "So just to kind of restate that, SPM has been developed in the capacity of behavioral neuroimaging.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4869.544,
    "end": 4885.074,
    "text": "And so it allows a combination of observable features, such as what button somebody pressed or what image somebody was shown, and also observable features of the environment, like the measurements coming in off of the EEG or the fMRI or the MEG.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4886.155,
    "end": 4894.721,
    "text": " And it allows integrated modeling of those different kinds of parameters along with the dynamical causal modeling on the underlying dynamic system identification.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4895.301,
    "end": 4897.963,
    "text": "And there's a lot more in the SPM documentation on that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4898.863,
    "end": 4912.913,
    "text": "And so ACK-DIMF here, along with some advances in, for example, the ability to look at the process of embryogenesis and track cellular location for a whole organism developing through time,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4914.127,
    "end": 4934.443,
    "text": " then that can be fit as if those are the fMRI measurements of this embryo SPM and then the underlying mechanics of development like a hypothesized morphogen gradient or a known or hypothesized mechanical relationship",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4935.603,
    "end": 4937.984,
    "text": " that's part of the model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4938.044,
    "end": 4941.386,
    "text": "That's like the underlying neural systems model in SPM.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4942.226,
    "end": 4955.152,
    "text": "And so it's kind of a great dream, but if it can be stated, if it's likely to exist, it sounds like you're taking some actions that will reduce your surprise about it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4955.172,
    "end": 4957.433,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4958.373,
    "end": 4958.853,
    "text": "Pretty cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4959.954,
    "end": 4965.116,
    "text": "So on the microscopy note, I'm like getting ready to, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4966.238,
    "end": 4969.281,
    "text": " receive and set up of IOAFM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4969.341,
    "end": 4978.331,
    "text": "I'm really looking forward to the multi-parametric capability of I can look at structures top to bottom, also do fluorescence imaging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4978.751,
    "end": 4980.073,
    "text": "So I'm really excited to have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4981.546,
    "end": 4983.887,
    "text": " affordances available on this plane.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4984.968,
    "end": 4986.949,
    "text": "Like the micromanages are great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4986.989,
    "end": 4996.333,
    "text": "Like I've used an AFM, you know, it gives you the biomechanics of your sample, but not, not it's, I've never also been able to look at the sample.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4996.413,
    "end": 5000.775,
    "text": "You just, the, you know, mapping without being able to see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5000.815,
    "end": 5006.057,
    "text": "So I'm really excited to be able to see and measure mechanics, what's going on in a cell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5006.317,
    "end": 5009.499,
    "text": "That's cytoskeleton parameters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5010.618,
    "end": 5015.682,
    "text": " discussing earlier about how that, you know, manipulates or enables cells to do different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5021.687,
    "end": 5022.007,
    "text": "Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5028.753,
    "end": 5032.095,
    "text": "Let's look at any other things, or",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5035.757,
    "end": 5041.118,
    "text": " Also, we can sort of give a closing round, whatever people feel like.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5043.319,
    "end": 5049.1,
    "text": "So one thing I'd like to find out is really about the aberrant signaling figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5049.14,
    "end": 5053.381,
    "text": "So I don't think we went into figure five very much last time in the dot one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5053.401,
    "end": 5059.603,
    "text": "And maybe you could talk about the aberrant signaling rescue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5059.703,
    "end": 5061.583,
    "text": "Kind of unpack that for us in your own words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5061.703,
    "end": 5063.444,
    "text": "We're not seeing the slides anymore also, Daniel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5063.464,
    "end": 5064.124,
    "text": "I don't know if you know that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5065.231,
    "end": 5091.031,
    "text": " well i'm not yeah it's also kind of lagged on youtube so i'm recording it i'll re-upload like the high quality one it's kind of like weird it's a normal video chat but the youtube stream link is like disrupted but c'est la vie um yeah so actually if you don't see the i'm showing figure five even though you can't see it so just",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5092.441,
    "end": 5093.181,
    "text": " Oh, yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5093.281,
    "end": 5093.501,
    "text": "I see.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5093.701,
    "end": 5094.622,
    "text": "OK.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5094.642,
    "end": 5095.562,
    "text": "We can do that too.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5095.582,
    "end": 5096.623,
    "text": "Yes, that's good.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5098.223,
    "end": 5098.423,
    "text": "Great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5098.463,
    "end": 5098.903,
    "text": "And thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5099.784,
    "end": 5100.064,
    "text": "Awesome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5100.304,
    "end": 5100.544,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5100.564,
    "end": 5104.005,
    "text": "So this is the top row here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5104.025,
    "end": 5106.206,
    "text": "It's just the normal simulation, this reference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5106.546,
    "end": 5115.949,
    "text": "You start off with these eight cells in the beginning, and then kind of have this vague, very specified, very low prior belief of what type they are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5115.969,
    "end": 5117.53,
    "text": "And as they come out, that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5118.183,
    "end": 5127.085,
    "text": " density changes, so the hue tone here makes them, means that they're now more, the more redder they are, the more sure they are of being this head type, head type cell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5127.925,
    "end": 5131.106,
    "text": "Or in this case, the green, the tape.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5131.726,
    "end": 5147.309,
    "text": "And B, where basically one, one cell, which you can see kind of heating off, the arrow points towards, that had a reduced sensitivity to measurement, to six, basically,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5148.516,
    "end": 5150.918,
    "text": " had a really hard time, basically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5151.259,
    "end": 5156.463,
    "text": "First of all, it was much longer, kind of, unspecified than its neighbor cells were.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5157.344,
    "end": 5161.027,
    "text": "And in the end, it achieves, actually, it gets wrong cell type.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5161.688,
    "end": 5166.372,
    "text": "Not only is it at a wrong position, like there's no cell in the original one at that place.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5166.953,
    "end": 5172.878,
    "text": "And even where you expect it to be, either yellow, red, or somewhere in between, but not blue as it is down here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5175.814,
    "end": 5189.984,
    "text": " In the sense that the initiation of a cancer is, I term this that way because I think that's basically the first step in cancer initiation is a misidentification of your environment and your place in it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5190.784,
    "end": 5193.766,
    "text": "The original paper from Carl was called Knowing One's Place.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5193.806,
    "end": 5195.548,
    "text": "The cell definitely does not know its place.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5196.368,
    "end": 5197.929,
    "text": "So this is where it goes in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5198.51,
    "end": 5203.253,
    "text": "And then here is where you have basically the same as above, but",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5203.979,
    "end": 5228.068,
    "text": " the overall not just the absolute flow of actually signaling like two one cells is to get to that has been upregulated so that each cell basically now drives more concentrations of cells to that cell and basically kind of tries the ideas to compensate for that that quality sensitivity and what happens which i don't expect at all is that you have",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5229.906,
    "end": 5245.177,
    "text": " If the cell contracting was more here, so you don't see that so much yet, you see the cell that kind of initially would have normally gone down, more cell, you push out in the end.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5245.197,
    "end": 5259.086,
    "text": "What happened, the words is that those were put into more of signaling concentration and allowed",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5259.602,
    "end": 5270.73,
    "text": " arrangement allowed this cell to retake a place that is conforming to what you see in the target morphology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5270.75,
    "end": 5283.118,
    "text": "And what I'd also like to always reiterate when I talk about this figure and both figures, really, is you do not, in the simulation, at any point in time, change target morphology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5283.258,
    "end": 5285.26,
    "text": "All the actual encoding was exactly the same.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5285.88,
    "end": 5288.782,
    "text": "So what they were expecting and where they were expecting was exactly the same.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5289.54,
    "end": 5300.451,
    "text": " And that, I think, is where I see the fundamental promise of this work, that you don't always want to change the code, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5300.471,
    "end": 5305.536,
    "text": "We know that we have higher , we haven't ever had.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5306.216,
    "end": 5310.841,
    "text": "And yet, I don't think anyone really thinks that this is the way",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5312.031,
    "end": 5338.887,
    "text": " forward in all cases and in all you know if if you can do it and you have really complete understanding that's great and you have no other options in an extreme case that is absolutely warranted i'm not trying to dissuade anyone anyone from advances in gene therapy but i think it's you know there's the genome is so complex so many things that can go wrong we don't know all of the details that if you did not have to start messing up people holding i think that would be preferred and i think this is all and also",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5339.761,
    "end": 5346.145,
    "text": " from a, even just from a capability setting, you know, that you don't always have the capability, not with high fidelity that we think often do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5346.726,
    "end": 5365.238,
    "text": "So our lab as well, I kind of take at the core of my experimental approach to things is that I want to understand how, how cells interact with their environment and always start and work on that manipulation, basically control information and sensing and drive them towards different states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5365.318,
    "end": 5366.899,
    "text": "Again, with that Arlington,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5367.571,
    "end": 5371.173,
    "text": " landscape that we talked last time where you want to direct the flow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5371.193,
    "end": 5372.114,
    "text": "I do actually this time have.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5373.035,
    "end": 5373.615,
    "text": "I took my shirt off.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5373.655,
    "end": 5374.816,
    "text": "I didn't see that right now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5375.076,
    "end": 5377.738,
    "text": "I do have the white landscape there on my shirt.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5379.839,
    "end": 5380.98,
    "text": "This time I did that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5381.661,
    "end": 5392.388,
    "text": "So that's kind of like what is that you're trying to redirect the flow of self-made decision-making, not try to manipulate the actual peasants themselves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5396.788,
    "end": 5400.329,
    "text": " So what was the signal response?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5400.509,
    "end": 5400.969,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5403.569,
    "end": 5403.789,
    "text": "There.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5404.029,
    "end": 5404.249,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5404.369,
    "end": 5406.55,
    "text": "The perturbed signal response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5406.99,
    "end": 5407.17,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5407.19,
    "end": 5411.111,
    "text": "What was, how did you perturb the, like, did you cut it off?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5411.631,
    "end": 5417.172,
    "text": "Did it get less information or did it like, was it supposed to like infer an incorrect place?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5417.212,
    "end": 5423.233,
    "text": "Like how exactly in that one cell, did you manipulate the parameters of that one cell so that it went to a different place?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5423.873,
    "end": 5425.093,
    "text": "Yeah, basically, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5426.457,
    "end": 5427.718,
    "text": " Let me see.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5427.838,
    "end": 5441.985,
    "text": "I think I .. It was basically done in the .. It was a decrease in sensitivity?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5442.025,
    "end": 5442.585,
    "text": "Is that what it was?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5442.605,
    "end": 5449.429,
    "text": "I'm trying to make this specific ..",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5453.715,
    "end": 5456.117,
    "text": " So it's basically in the gradient that we also formally induced.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5456.137,
    "end": 5465.583,
    "text": "So that's basically how much actions are being updated based on sensory inputs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5467.864,
    "end": 5471.867,
    "text": "And we can put a gradient on there and a sign on there of how much they act on that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5472.387,
    "end": 5474.749,
    "text": "That is the part that I manipulate here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5474.789,
    "end": 5477.431,
    "text": "But that basically means is that by",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5478.473,
    "end": 5504.388,
    "text": " altering the response capability of the cell how much how much sensory update up how many how much to what extent sessions are being updated based on external information flow and with what kind of uh you know how on top of that that by that you're basically upping or reducing the sensitivity to the environment you basically you're misarranged you're misregulating the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5505.742,
    "end": 5508.244,
    "text": " Again, it's empowerment, essentially, but that's downstream.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5508.604,
    "end": 5513.287,
    "text": "But you may have the potential of the cell to act with environments and do anything about it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5515.128,
    "end": 5518.17,
    "text": "And also, even upstream, how much sensing of that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5518.53,
    "end": 5524.514,
    "text": "So in this case specifically, it just wasn't really sensing as much of its environment as it was supposed to be sensing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5527.456,
    "end": 5531.159,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5532.279,
    "end": 5532.76,
    "text": "It almost...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5534.511,
    "end": 5550.611,
    "text": " is equivalent to the argument or the dissolution of sort of nature and nurture partitioning by just taking a complexity stance, kind of like Evelyn Fox Keller in her book, The Mirage of a Space Between Nature and Nurture.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5552.267,
    "end": 5556.851,
    "text": " You were talking about a target morphology, but then about how changes in the signal.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5556.871,
    "end": 5566.98,
    "text": "We're about to do number 40 on the quantum FEP paper and Blue and our friend Jason and I have been preparing a lot for it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5567.161,
    "end": 5571.765,
    "text": "And I think separating quantum from",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5572.472,
    "end": 5584.177,
    "text": " the electrons and their behavior and just asking, well, what is quantum strategy or what does this quantum statistics or quantum information projected onto biology mean?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5585.138,
    "end": 5589.68,
    "text": "Not how it's been approached from the mechanistic question, which is quantum biology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5589.72,
    "end": 5599.424,
    "text": "Well, that's about the synapses and their quantum mechanical properties or about photon tunneling or proton tunneling and like quantum effects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5600.512,
    "end": 5614.48,
    "text": " But what about just using the statistics instrumentally of quantum and talking about situations with complex patterns of uncertainty and observation bias and memory and modeling and all of that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5615.481,
    "end": 5618.403,
    "text": "And this was like a dot too that kind of like,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5620.06,
    "end": 5632.547,
    "text": " opened up a whole new area for us in our discussions with morphology and like the spatial and the embedded and then cracked a window into just another area we'll go into.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5632.567,
    "end": 5635.929,
    "text": "And you brought so many awesome insights.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5635.989,
    "end": 5637.03,
    "text": "So we really appreciate it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5640.762,
    "end": 5642.604,
    "text": " Yeah, that talk should be a real pleasure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5642.764,
    "end": 5644.966,
    "text": "I highly recommend tuning in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5645.646,
    "end": 5648.268,
    "text": "Chris Fields was great to listen to, and it's some exciting work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5648.328,
    "end": 5656.575,
    "text": "And if you also, if you have seen, I'm sure you have seen the particular paper from Carl Frist, and he has a section there on quantum mechanics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5657.196,
    "end": 5669.206,
    "text": "And it's a very cool section because he actually derives, I think, the Schrodinger equation from essentially from a true inference point of view, from just a definition of what your log probability density is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5670.5,
    "end": 5671.561,
    "text": " Very cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5672.962,
    "end": 5683.87,
    "text": "I don't know how much that will feed into other and future work, but it's always very exciting to me when you see different fields at least formally being able to be related to each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5684.53,
    "end": 5688.253,
    "text": "That usually means there's something going on, something fundamental.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5691.363,
    "end": 5692.344,
    "text": " We'll have more to say in .40.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5693.084,
    "end": 5695.786,
    "text": "And join us, Franz.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5696.147,
    "end": 5697.308,
    "text": "Yeah, and you're welcome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5697.408,
    "end": 5698.809,
    "text": "Anytime to participate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5699.649,
    "end": 5703.172,
    "text": "Yeah, it'll be Chris and Carl and I think Mike.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5703.232,
    "end": 5704.273,
    "text": "I think everybody's coming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5704.293,
    "end": 5705.314,
    "text": "So if you want to come.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5705.414,
    "end": 5705.614,
    "text": "Sure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5706.334,
    "end": 5706.934,
    "text": " Join the panel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5706.955,
    "end": 5707.675,
    "text": "You're more than welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5708.656,
    "end": 5711.538,
    "text": "All the events and pop in if it works.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5711.618,
    "end": 5713.519,
    "text": "So thanks again, everybody.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5714.3,
    "end": 5719.463,
    "text": "Hope that the viewers can bear with the lag if it was there, but c'est la vie.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5719.624,
    "end": 5720.945,
    "text": "So peace out, everyone.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5720.985,
    "end": 5722.245,
    "text": "Thanks a lot for this great discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5723.326,
    "end": 5724.087,
    "text": "Thanks for having me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5724.607,
    "end": 5724.787,
    "text": "Bye.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5724.807,
    "end": 5725.768,
    "text": "Bye-bye.",
    "speaker": "SPEAKER_05"
  }
]