[
  {
    "start": 28.848,
    "end": 29.128,
    "text": " All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 29.908,
    "end": 30.989,
    "text": "Hello and welcome everyone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 31.729,
    "end": 33.729,
    "text": "This is Act-Inf Lab live stream number 35.1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 34.19,
    "end": 37.51,
    "text": "It's January 5th, 2022.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 39.031,
    "end": 40.891,
    "text": "Welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 41.552,
    "end": 47.093,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 47.633,
    "end": 49.374,
    "text": "You can find us at the links here on this slide.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 50.594,
    "end": 56.396,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 57.403,
    "end": 59.805,
    "text": " All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 60.626,
    "end": 68.233,
    "text": "And we'll be following good video etiquette for live streams, plus playing with our new affordance, thanks to our Jitsi repair person.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 69.014,
    "end": 70.215,
    "text": "And that'll be fun.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 72.54,
    "end": 77.544,
    "text": " Go to ActiveInference.org if you want to learn more about how to participate or get involved.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 77.664,
    "end": 88.813,
    "text": "If you're listening to this live stream, live or in replay, allocating your regime of attention this way, then maybe you'd like to get involved a little bit more actively with projects, including planning the live stream.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 90.529,
    "end": 92.571,
    "text": " So today we are in ActiveStream 35.1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 94.133,
    "end": 100.779,
    "text": "We are discussing the paper that Dean and Blue and I did 35.0 on yesterday.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 101.42,
    "end": 108.727,
    "text": "And that paper is A Tale of Two Architectures, Free Energy, Its Models, and Modularity by Majid Beni in December 2021.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 108.767,
    "end": 109.307,
    "text": "And we're going to be...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 112.56,
    "end": 124.927,
    "text": " talking, modifying the slides, asking questions, going into some things that we brought up in the dot zero, connecting a few dots, and also preparing for hopefully Majeed to join in the dot two video.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 125.968,
    "end": 129.289,
    "text": "We're going to be discussing this again next week at the same time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 131.857,
    "end": 134.338,
    "text": " Let's begin with some introduction and warm-up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 134.878,
    "end": 152.442,
    "text": "We will each go around and just say hello and introduce ourselves, as well as maybe just add something that we're curious about, what got us really excited to discuss this paper, and what are we looking forward to reducing our uncertainty about in the coming",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 153.851,
    "end": 154.772,
    "text": " days, and weeks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 155.452,
    "end": 155.973,
    "text": "So I'll start.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 156.113,
    "end": 156.633,
    "text": "I'm Daniel.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 156.934,
    "end": 179.632,
    "text": "I'm a researcher in California, and I think I'm excited to talk about the information encapsulation and what that means, as well as to go into that parable of Alice and Bob and see who here wants to relay that story to us and shine some light on narrative-based understandings of free energy principle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 180.233,
    "end": 181.794,
    "text": "And I'll pass it to Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 184.619,
    "end": 185.08,
    "text": " Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 185.1,
    "end": 186.561,
    "text": "Yeah, I'm Stephen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 186.581,
    "end": 187.482,
    "text": "I'm here in Toronto.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 188.223,
    "end": 201.897,
    "text": "I'm really interested in this ability to step back and look at some of the underlying processes of actually modeling that this talks about and the philosophies of that in quite a practical way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 202.198,
    "end": 202.498,
    "text": "So I...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 203.539,
    "end": 206.882,
    "text": " I'm excited by that potential from this paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 207.442,
    "end": 216.089,
    "text": "And also what the group here is making of that, because I think it's challenging us to start to think about some foundational stuff in our work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 216.149,
    "end": 219.732,
    "text": "So I'm going to pass this over to Dave.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 220.293,
    "end": 222.615,
    "text": "We're going to just skip Dave for some audio.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 223.375,
    "end": 224.276,
    "text": "Oh, Dean?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 224.336,
    "end": 224.997,
    "text": "Is Dean around?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 225.457,
    "end": 225.677,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 227.779,
    "end": 229.36,
    "text": "I'm Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 229.38,
    "end": 230.181,
    "text": "I'm in Calgary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 231.847,
    "end": 235.229,
    "text": " For me, it's always trying to be able to hold up two things at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 235.709,
    "end": 248.375,
    "text": "And so for those two things in this paper, the moment of instantiation or the sort of the model slice aspect of what we're looking at, and then also to instantiate or to modulate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 248.575,
    "end": 253.197,
    "text": "And so those two things together, what does that imply?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 253.718,
    "end": 257.099,
    "text": "And that's what I want to talk about a little bit today with Bob and Allison.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 257.159,
    "end": 258.5,
    "text": "I'll pass it to Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 261.055,
    "end": 261.755,
    "text": " Hi, I'm Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.955,
    "end": 264.536,
    "text": "I'm a research consultant in New Mexico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 265.257,
    "end": 282.684,
    "text": "And something I'm excited to talk about today is, or maybe next week, is the idea of modularity in the free energy principle and how that might work in the absence of a brain where the FEP still applies to brainless systems and how that might be also modular or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 285.208,
    "end": 312.406,
    "text": " okay so there's so many places to jump in but thankfully we have some questions in the live chat which we'll begin with and then as per usual we will modify our slides and just keep on adding more slides adding more questions so if you're watching live thanks again for all these great questions and i'll uh first bring them into this slide so joseph clark asks",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 313.126,
    "end": 317.571,
    "text": " This is a little bit of a general question, and then we'll move to a question that's a bit more specific to the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 317.991,
    "end": 329.704,
    "text": "So the general question, is there a space on either the Discord or live streams to discuss active inference in reference to more traditional, philosophical, psychological, linguistic, or social science questions?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 330.765,
    "end": 332.067,
    "text": "What would anyone say on that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 336.644,
    "end": 344.075,
    "text": " Well, I suppose that we do have some of those conversations as part of the Active Influence Lab.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 346.198,
    "end": 356.606,
    "text": " Some of the social science questions, it can get in the weeds with too many different assumptions in the background, which they themselves could be contentious.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 356.706,
    "end": 364.932,
    "text": "So I think it's helpful to do some of the type of work that we're doing now to sort of think about, well, what does it actually mean to model something?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 365.013,
    "end": 366.554,
    "text": "What are the sort of assumptions",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 367.557,
    "end": 383.214,
    "text": " that are even going on before we start to dive into broad sort of popular theoretical frameworks because are we going to come at this from the position of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 385.123,
    "end": 409.141,
    "text": " a very low dimensional modeling approach, which has shed light onto things like autism, things like schizophrenia, things like types of behavior, or are we gonna come at this more from a structured principled approach where we have an ecological niche relating to an agent and a generative model?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 409.861,
    "end": 412.523,
    "text": "Some of those things I think are more helpful to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 413.869,
    "end": 443.051,
    "text": " start to pass um so that we know how we're locating the discussion but i'm not sure if others agree with that because it's very easy to get caught up in a discussion which is essentially located in say the social sciences and trying to work from there with all the implicit assumptions and get back to active inference and it can get quite heady and kind of confusing",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 444.008,
    "end": 455.115,
    "text": " It's maybe better working the other way, addressing something from, okay, how do we take a type of modeling approach used around FEP active inference in relation to something?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 455.656,
    "end": 456.896,
    "text": "What's useful from that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 457.117,
    "end": 458.037,
    "text": "But that's my...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 459.673,
    "end": 477.649,
    "text": " That's my feeling, and I also believe it's nice to do stuff where you're doing interactive dialogue and working with documents in real time as much as it is through text chat, because I think that also can start to get, it can't quite handle the level of complexity at play.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 477.669,
    "end": 480.072,
    "text": "Thanks, Stephen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 480.232,
    "end": 480.412,
    "text": "Luke?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 484.511,
    "end": 491.556,
    "text": " So I would push back on Joseph for a specific example of a question that might fall into this category.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 491.836,
    "end": 499.522,
    "text": "And also, is there a particular paper that might be related to active inference in this field?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.303,
    "end": 504.285,
    "text": "Because I do feel like we do discuss a lot of philosophical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 505.186,
    "end": 506.807,
    "text": " and social science questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 506.887,
    "end": 509.468,
    "text": "I'm not sure, I guess there's some linguistics also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.508,
    "end": 510.849,
    "text": "I can't remember like a stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 510.909,
    "end": 512.99,
    "text": "It's just not like linking in my brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.49,
    "end": 518.713,
    "text": "But I mean, we just did thinking like a state, which is very social science based, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.793,
    "end": 523.816,
    "text": "And so, yeah, I would just love to see what particular questions you would like to see addressed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.036,
    "end": 530.339,
    "text": "And if you can find a paper and recommend it that we discuss on the live stream, more than happy to accommodate that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 531.04,
    "end": 531.14,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 532.0,
    "end": 555.306,
    "text": " yep the linguistics guest stream was elliott murphy so i'll respond in terms of affordances i think there are probably more so create your own affordance modify the acting flab as your niche as you see fit but there's always the informal discord affordance just post in general and say hey everyone i'm gonna be curious about these ideas i don't even know",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 556.394,
    "end": 565.877,
    "text": " what to know, but I'm gonna be curious about these different things, these topics, these three questions and in two hours, I'll be doing it or in two weeks at this time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 566.117,
    "end": 575.761,
    "text": "So you can always just say when you're gonna be in the voice chat on Discord and maybe some people will drop in or you can invite some friends specifically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 576.521,
    "end": 581.803,
    "text": " And then a little bit more formal of an affordance is we can host a guest stream or a panel.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 582.263,
    "end": 585.125,
    "text": "So that would be done through the dot coms organizational unit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 585.845,
    "end": 591.067,
    "text": "And we would work to plan the timing and then also set up the discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 591.127,
    "end": 594.448,
    "text": "So it's not just like we show up and it's like, okay, well, who is going to prepare?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 594.528,
    "end": 597.41,
    "text": "Like we can just to whatever extent is required.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 598.61,
    "end": 603.255,
    "text": " get a jam board ready, get some slides ready, some questions that will spark the conversation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 604.036,
    "end": 607.46,
    "text": "And that can also invite people outside of the Act-Inf community.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 607.56,
    "end": 609.823,
    "text": "So it can be whatever you like.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 610.123,
    "end": 614.608,
    "text": "So by asking the question, you've signaled that you understand that such an affordance could be important.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 614.788,
    "end": 615.108,
    "text": "And so...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 616.67,
    "end": 618.29,
    "text": " Looking forward to seeing how you follow through.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 619.011,
    "end": 627.115,
    "text": "So let's go to Joseph's second question, which brings us, I think a little bit closer towards the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 627.135,
    "end": 628.036,
    "text": "It will",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 629.099,
    "end": 630.3,
    "text": " Zoom in towards it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 630.841,
    "end": 642.171,
    "text": "So how do you stop overfitting on one layer of the model, for example, leg movements, to avoid compromising the larger goal that an agent or person wants to do, like kicking a football?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 643.512,
    "end": 651.199,
    "text": "I feel this question may also help put some of the debates around modularity versus hierarchical information segregation in an analogous context.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 652.34,
    "end": 655.403,
    "text": " So it's a great question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 655.763,
    "end": 671.677,
    "text": "We talked a lot about hierarchical modeling and about that lateral modularity, kind of the collective behavior element, and then the nested modularity, which is the multi-scale systems perspective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 672.558,
    "end": 678.403,
    "text": "And in active inference, as we explored with the mental action paper and deep active inference,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 679.364,
    "end": 705.247,
    "text": " we sometimes have these nested models that are expanding over multiple timescales so that the action at one time step isn't just greedily pursuing the overall preference, but rather the preference can be realized or uncertainty about realizing the preference can be achieved through policy selection over a given time horizon, even when the micro movements might not be, um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 707.099,
    "end": 735.293,
    "text": " intuitive so sort of taking one step back so that you can go a better path what would anybody add to that or we can start to diagram some pieces out here i would just say don't don't drop one or the other don't drop the idea of the moment of instantiation of that model slice and don't drop the ins to instantiator to modulate",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 736.021,
    "end": 739.884,
    "text": " Make sure that, like I've used the expression, when in doubt, zoom in, zoom out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 740.445,
    "end": 746.37,
    "text": "When you're zooming out, you're actually trying to incorporate longer timeframes versus a moment in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.011,
    "end": 751.535,
    "text": "And that's how I would mitigate some.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 751.595,
    "end": 753.737,
    "text": "I don't know that you can wipe out the overfitting problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 753.757,
    "end": 754.998,
    "text": "There's always a potential for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 755.848,
    "end": 781.195,
    "text": " you can mitigate it somewhat by making sure that you keep the two ideas up at the same time without one blending into the other or total focus on one or the other right i threw up a image from uh paper 25 which was the mental action paper of sanved smith",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 782.384,
    "end": 787.066,
    "text": " And this is kind of one way to address it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 787.926,
    "end": 792.888,
    "text": "So let's just say that the overall goal were to kick the football.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 793.268,
    "end": 793.928,
    "text": "It's a good example.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 793.968,
    "end": 798.229,
    "text": "You know, it works for whichever side of the pond you're on with kicking the football.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 799.69,
    "end": 808.833,
    "text": "The overall preference would be for, for example, the sensory observation of seeing the football far away or of observing the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 810.017,
    "end": 817.951,
    "text": " foot making contact with the football at high velocity and the foot is starting in a neutral position",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 819.167,
    "end": 829.237,
    "text": " So just sort of like standing and the greedy gradient descender would just go from the neutral position to just kick forward.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 829.978,
    "end": 832.501,
    "text": "But maybe it's possible there's like a three-step movement.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 832.881,
    "end": 837.746,
    "text": "For example, in the first time step, you pull the leg back and then you move it forward two times.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 838.126,
    "end": 841.75,
    "text": "So over three clicks of time in the model,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 842.691,
    "end": 868.12,
    "text": " that is going to be the outcome that ultimately best realizes your preferences of making contact with your foot on the ball at the maximum possible velocity and so the policy selection is happening at the motor level so the policy here is a parameter that's describing like the angle of the hip that is the um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 869.497,
    "end": 896.202,
    "text": " state that's being inferred so we won't go too deep into the skilled performance angle or the interactionism angle but 23 check it out um and two policies can be compared or a whole family of policies can be compared with one another one policy is just move the leg forward the other policy is move leg backwards then forward twice another policy would be like move it backwards then forwards and backwards and forwards never kick the ball",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 897.813,
    "end": 909.561,
    "text": " Then over a given time horizon, like the time that the organism has to make this kick, different expectations can be calculated for different policy sequences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 910.682,
    "end": 926.493,
    "text": "And again, if it turns out that moving the leg back one step and then forward two steps makes contact with the ball at higher velocity, then at the level of deep policy selection, that three-step sequence will be selected over",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 927.813,
    "end": 933.454,
    "text": " the just move the leg forward sequence or the back and forth, not kicking sequence.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 934.195,
    "end": 936.975,
    "text": "So that's a mechanical version.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 938.015,
    "end": 945.497,
    "text": "And it's also the kind of model structure that applies to not just motor actions, but mental action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 946.297,
    "end": 952.539,
    "text": "So I hope that gets a little bit towards it and also starts us towards this discussion of modularity because",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 953.686,
    "end": 956.187,
    "text": " where is the modularity in what we just described?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 956.468,
    "end": 960.59,
    "text": "So Stephen, and then anyone else who raises their hand or throws out a string of emojis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 963.311,
    "end": 965.853,
    "text": "Yeah, this is a very useful example.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 967.033,
    "end": 971.796,
    "text": "A, because you see how it's about phenomenology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 973.357,
    "end": 978.8,
    "text": "And it's interesting because traditionally philosophical, psychological, perspectival type phenomena",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 979.845,
    "end": 987.306,
    "text": " approaches averaging out over social approaches aren't phenomenological.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 988.387,
    "end": 995.208,
    "text": "And phenomenological ties in more with our best guess approach of how an agent is experiencing things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 995.588,
    "end": 1002.569,
    "text": "So in what you just mentioned here, I think this is quite good for the kick in the football is I'm trying to work out how to kick the football.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1003.109,
    "end": 1004.169,
    "text": "What am I trying to do?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1004.389,
    "end": 1007.55,
    "text": "As it said in policy selection, I'm trying to work out the best way to do it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1008.76,
    "end": 1013.728,
    "text": " And I may be unaware of what I'm paying attention to in trying to help do that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1013.928,
    "end": 1017.533,
    "text": "There might be some subconscious processes which are helping to calibrate it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1017.954,
    "end": 1022.821,
    "text": "However, once I've actually mastered that performance,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1024.016,
    "end": 1026.617,
    "text": " what I'm paying attention to may not be how to do it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1026.637,
    "end": 1027.818,
    "text": "I might be in the flow.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1027.838,
    "end": 1034.421,
    "text": "And now what am I paying attention to is how do I look up and just kick the ball towards another player?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1034.821,
    "end": 1041.004,
    "text": "So I think that I'm wondering what people's thoughts are there in terms of how that changes things to now be in an agent-based mode.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1043.585,
    "end": 1044.986,
    "text": "Good question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1045.286,
    "end": 1051.629,
    "text": "I think it also relates to the event-based cognition, for example, Martin Boots and what he talked about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1053.692,
    "end": 1063.163,
    "text": " The micro level is indeed the policy of each muscle and joint being selected to write something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1063.984,
    "end": 1073.776,
    "text": "However, there's a modularity that arises from cognitive chunking of complex motor actions, for example, into writing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1075.023,
    "end": 1095.255,
    "text": " broader more handleable units so like writing a letter is like a unit of motor actions it's actually a really complex sequence of motor actions and then writing a word is a given event that subsumes or entails or requires or",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1096.829,
    "end": 1104.013,
    "text": " is supervening upon lower level policy selections, like which way to move a muscle of a thumb.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1105.014,
    "end": 1119.362,
    "text": "However, it's the increasingly chunked and modular, perhaps even semantic levels that appear to arise more to our phenomenology, which is why we",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1120.353,
    "end": 1130.305,
    "text": " for example, reach for something and a whole host of processes play out without us needing to micromanage the motor actions?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1131.306,
    "end": 1132.608,
    "text": "Yes, Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1135.251,
    "end": 1135.331,
    "text": "Oh.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1138.211,
    "end": 1148.478,
    "text": " I was just kind of, I think what, to Stephen's point, I think what we are asking here is, does the mind or can the mind go in two directions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1148.719,
    "end": 1153.462,
    "text": "Namely, do we start with a frame or an architectural scaffold or a model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1154.983,
    "end": 1160.687,
    "text": "Or does the process of what we're watching, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1160.747,
    "end": 1164.81,
    "text": "kicking a ball, spectralize the relativity, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1164.85,
    "end": 1167.012,
    "text": "does it confirm what the edges are?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1168.21,
    "end": 1174.776,
    "text": " So those are different, completely opposite views of things over a time scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.376,
    "end": 1182.302,
    "text": "So then I guess what we have to ask ourself is, does the representation act as the takeoff point?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1182.523,
    "end": 1184.084,
    "text": "Meaning, do we start with the model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.705,
    "end": 1189.188,
    "text": "Do we start with that scientific view and or does the representation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1190.029,
    "end": 1193.57,
    "text": " evolve as the results, sort of more the creative view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.63,
    "end": 1195.67,
    "text": "I think we're capable of doing both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1195.69,
    "end": 1198.911,
    "text": "In fact, there's lots of evidence that we do do both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1198.971,
    "end": 1202.851,
    "text": "So I would come back to do we modulate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1202.911,
    "end": 1203.212,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1203.572,
    "end": 1204.432,
    "text": "Is that a process?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1204.492,
    "end": 1204.792,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1206.532,
    "end": 1215.334,
    "text": "Can we take slices of a modulation exercise and see them as representational and modeling?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1215.674,
    "end": 1215.894,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.884,
    "end": 1219.809,
    "text": " So that's all I would point to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.849,
    "end": 1222.615,
    "text": "I don't know when the transition is, Stephen, when it's kicking a ball.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1225.381,
    "end": 1227.146,
    "text": "Thanks, Dean, Stephen, and then anyone else.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1228.556,
    "end": 1232.48,
    "text": " Yeah, well, this transition, this may be part of what changes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1232.72,
    "end": 1237.646,
    "text": "And I suppose this is one of the interesting things is it depends on the nature of the situation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1238.967,
    "end": 1244.533,
    "text": "But everything at some level, which is interesting, is hidden in active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1244.713,
    "end": 1250.739,
    "text": "And we're trying to get some purchase on that, which is interesting, as opposed to it being out there as knowledge.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1251.755,
    "end": 1256.458,
    "text": " and we somehow know it, it's like, okay, what am I perceiving?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1256.478,
    "end": 1260.08,
    "text": "There will always be more hidden states than I can ever really know.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1260.701,
    "end": 1261.601,
    "text": "What am I trying to do?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1261.622,
    "end": 1263.363,
    "text": "There were more hidden states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1263.423,
    "end": 1264.643,
    "text": "What am I paying attention to?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1264.664,
    "end": 1271.028,
    "text": "And I think what's quite interesting is what is at the realm of,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1273.129,
    "end": 1275.311,
    "text": " being available to us in our consciousness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1275.831,
    "end": 1286.758,
    "text": "Okay, so the sort of thing that Daniel was talking about, the sort of process, the sense-making process, which is present when it's not immediately obvious how to kick a ball, because Messi doesn't do that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1286.978,
    "end": 1289.84,
    "text": "Messi knows, he just, he feels it, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1290.561,
    "end": 1298.626,
    "text": "But there's something really interesting about the scale, and I think my feeling is we have a meso-middle scale.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1298.986,
    "end": 1299.606,
    "text": "There's things which...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1300.629,
    "end": 1307.013,
    "text": " come out of our awareness or are harder to purchase or get a grip on as they become faster and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1309.545,
    "end": 1332.042,
    "text": " as they become slow slower so you know what am i paying attention to there may be something that's my unconscious is sort of aware of that phenomenological feeling about how the events is going and how my stomach is feeling waiting for the next meal which is sort of too slow for me to really notice and there's other things like we're saying we should just",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1332.95,
    "end": 1353.2,
    "text": " biologically at speeds faster than the rates at which conscious awareness operates and we've sort of got both of these and that moves a little bit depending on how i take my attention in the world thanks steven yes so we have a few different",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1354.682,
    "end": 1376.921,
    "text": " axes or continuum here there's the phenomenological or what is experienced and then there's sort of the third person impersonal where it's more just about what's happening in the model and we don't even associate it with a conscious experience in this mental action paper",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1378.303,
    "end": 1382.225,
    "text": " it threads the line because it is talking about computational phenomenology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1382.646,
    "end": 1391.41,
    "text": "However, this is the structure of deep active inference policy selection models, which don't need to require any kind of phenomenological experience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1392.631,
    "end": 1395.733,
    "text": "So blue, and then we will continue to the next slide.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1397.731,
    "end": 1411.447,
    "text": " So just in thinking about agent systems and information encapsulation, it seems like to be part of the same system, there must be partial information encapsulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.588,
    "end": 1417.835,
    "text": "Like you can't play a basketball game with a bunch of other people without sharing information",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.035,
    "end": 1420.797,
    "text": " information such as the position of the ball, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1420.837,
    "end": 1423.338,
    "text": "Like, so there's, you know, and the rules of the game, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.858,
    "end": 1438.306,
    "text": "So the partial information encapsulation, I mean, how, to what degree, like what percentage is information encapsulated between individuals, between modules of an individual, tissues of an individual and so forth?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1438.407,
    "end": 1439.487,
    "text": "I really wonder about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.807,
    "end": 1444.65,
    "text": "I mean, even like you think about the butterfly effects, like we're all sharing, I mean, globally, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1444.75,
    "end": 1448.092,
    "text": " information such as climate change or this type of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1448.412,
    "end": 1454.955,
    "text": "So there's information at a global level that affects every single one of us because we're all part of the same global system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1455.395,
    "end": 1464.159,
    "text": "And so there's got to be some kind of partial encapsulation, I think, just to be connected in a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1466.24,
    "end": 1466.54,
    "text": "Great.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1466.781,
    "end": 1467.081,
    "text": "Stephen?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1467.101,
    "end": 1471.483,
    "text": "I think that's a good point Blue makes there because",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1473.049,
    "end": 1478.355,
    "text": " There's only certain things available at certain temporal scales to make some of these.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1478.375,
    "end": 1484.782,
    "text": "The temporal depth of being aware of the ball",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1485.911,
    "end": 1507.022,
    "text": " in a in a practical sense is a certain there's a certain at some point it just becomes noise it's too fast to sequence it there's no point getting outside of actually processing sensory information itself at these faster levels and as happens with all the uncertainty and error prediction that goes up the chain there's a certain",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1507.802,
    "end": 1536.758,
    "text": " Goldilocks zone right for knowing how the ball is going in the game and if I'm standing I'm watching the game there's a sort of a Goldilocks speed which is probably relatively slow just like in a soccer game if I'm sort of running down the wing and not getting the ball a lot and but when the ball is actually kicked to me I've got a player coming in to tackle me I've got another player running and we've got to do something with it now bang I've got a window that's got to happen in a shorter period of time you know the the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1537.698,
    "end": 1556.288,
    "text": " the regime of attention and the action policy selection is in the terms of like half a second, maybe milliseconds, of which some then are not even available in our conscious awareness, unlike maybe the tracking of the game, which might be of a window of 5, 10, 15 seconds, maybe longer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1556.789,
    "end": 1561.091,
    "text": "I think that in itself, would that not itself create some sort of modularity?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1564.943,
    "end": 1566.444,
    "text": " Great question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1566.604,
    "end": 1574.346,
    "text": "So we explored several different senses of modularity in the dot zero.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1574.867,
    "end": 1581.989,
    "text": "So there is the physical connectedness, like the anatomical connectivity, anatomical modularity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1582.529,
    "end": 1587.831,
    "text": "And then we talked about the effective and functional, which are two statistically different.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1588.072,
    "end": 1591.353,
    "text": "They're not interchangeable, but they're two different ways to talk about modularity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1593.414,
    "end": 1605.179,
    "text": " So now we're exploring how these notions of modularity line up with potentially the nesting of multi-scale systems through space and time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1605.879,
    "end": 1611.862,
    "text": "So I'm pulling up one of the figures from Ramsted et al, 2018, answering Schrodinger's question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1612.682,
    "end": 1614.502,
    "text": " if I can just resize it properly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1615.143,
    "end": 1621.764,
    "text": "And so here on the x-axis is time and on the y-axis is spatial scale.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1622.724,
    "end": 1640.168,
    "text": "And what this graph is laying out loosely, and it's been described in other papers and discussions since, is that things are kind of existing on the line where we're seeing that smaller things are happening faster",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1641.269,
    "end": 1643.689,
    "text": " and larger things are happening slower.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1644.53,
    "end": 1651.711,
    "text": "Things that happen over continents are happening over longer timescales than things that can happen at a sub cellular scale.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1652.531,
    "end": 1658.412,
    "text": "So there is kind of this natural relationship between spatial and the temporal scale of processes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1659.292,
    "end": 1664.653,
    "text": "And how does that relate to the modularity that Blue was describing?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1665.473,
    "end": 1668.594,
    "text": "If there's complete encapsulation of a given module,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1670.538,
    "end": 1674.659,
    "text": " If such a thing could even exist in reality is one question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1675.339,
    "end": 1679.94,
    "text": "Now, if something could exist in our model, of course it's true.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1680.12,
    "end": 1684.061,
    "text": "We can develop a model that has that connectivity amongst variables.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1684.681,
    "end": 1691.782,
    "text": "Doesn't mean it's the best model or it's the one that is the perfect territory description itself, but it's not, it's a map.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1692.723,
    "end": 1698.924,
    "text": "And then if we had no integration, that's kind of like saying that it's just encapsulated at the next scale up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1700.353,
    "end": 1706.761,
    "text": " I'm sorry, no encapsulation within a level is kind of like saying it's just perfectly encapsulated at the next level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1707.562,
    "end": 1715.391,
    "text": "So in a way, the partial information encapsulation is the gray zone that everything is going to be existing within.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1717.773,
    "end": 1718.975,
    "text": "Stephen, and then anyone else?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1720.856,
    "end": 1721.156,
    "text": " Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1721.976,
    "end": 1729.418,
    "text": "And actually, because they have they've sort of gone back on this on this particular diagram to some extent after feedback from Casper Hess.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1729.959,
    "end": 1741.542,
    "text": "I think this is really where there is a because this continuum, this idea of a continuum going out is what I think active inference sort of.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1742.958,
    "end": 1762.12,
    "text": " changes how we see that and it's hard because when we try and map things like what maxwell was doing here he was taking stuff from the social sciences and the different approaches that are mainstream and this is how it pans out but if this is often because this is what we",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1763.322,
    "end": 1765.063,
    "text": " think of something from the outside.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1765.403,
    "end": 1768.004,
    "text": "We see from the outside group behavioral patterns.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1768.385,
    "end": 1769.445,
    "text": "We see an organism.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1769.485,
    "end": 1770.486,
    "text": "We categorize it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1770.966,
    "end": 1771.866,
    "text": "We make models of it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1772.246,
    "end": 1779.29,
    "text": "And they sort of stack up in this way over time and temporal and physical scales.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1779.81,
    "end": 1788.755,
    "text": "However, from the perspective of the dynamics, are we having a different Goldilocks zone",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1789.81,
    "end": 1796.112,
    "text": " within smaller and faster temporal dynamics in terms of what's actually happening.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1796.652,
    "end": 1817.098,
    "text": "And when that means something's out in the niche, we may see stuff dropping out from that, but there's no reason, for instance, where niche construction is not being under-girdled by rapid decision-making at real time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1818.547,
    "end": 1822.93,
    "text": " just like the soccer players are all making choices on the pitch around where they run.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1822.95,
    "end": 1825.671,
    "text": "It changes the way the grass is going to get worn down.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1825.691,
    "end": 1826.512,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1827.072,
    "end": 1833.336,
    "text": "So this is interesting actually now looking at, well, so what is the replacement to this diagram?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1834.036,
    "end": 1847.324,
    "text": "Has there been one that doesn't have this kind of micro macro and actually is able to have an action orientated meso that can meet the requirements of, um,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1848.988,
    "end": 1852.471,
    "text": " talking about pluralistic ontologies and ontological pluralism.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1852.872,
    "end": 1853.793,
    "text": "Well, where is that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1854.394,
    "end": 1855.995,
    "text": "Where is that being described?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1856.156,
    "end": 1858.238,
    "text": "And I think that's a missing link at the moment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1860.661,
    "end": 1860.841,
    "text": "Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1862.208,
    "end": 1874.072,
    "text": " I think that this takes us to a good return on the Markov blanket, scale-free or scale-friendly debate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1875.073,
    "end": 1880.335,
    "text": "Because just like you said, Stephen, somebody talking about a cellular scale",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1881.315,
    "end": 1907.242,
    "text": " and the kinds of perception, cognition, action happening at a cellular or an organismal scale, they're not saying that niche construction doesn't exist, ecological scale niche construction, because we could also think about tissue level niche construction, rather that the regime of attention of the scientific modeler is being directed towards a given kind of modeling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1908.163,
    "end": 1909.483,
    "text": "And so that's sort of,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1910.973,
    "end": 1935.181,
    "text": " how we take something that is a unifying theory, like free energy principle, or a scale-free or a scale a priori model, whether it's Markov blankets or linear regression, but in any application to a given system, there are going to be timescales of analysis that just do and don't make sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1936.282,
    "end": 1936.362,
    "text": "And...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1939.11,
    "end": 1958.847,
    "text": " That's where we operationalize the Markov blanket, or as Benny wrote, although Markov blankets are in principle scale-free, meaning there are no inherent constraints on their size and scope, their application or imputation to various target systems will impose a definite scale on Markov blankets.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1959.308,
    "end": 1959.468,
    "text": "Dean?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1961.55,
    "end": 1970.134,
    "text": " Yeah, and I think, again, that's why I want to talk a little bit about the instantiation moment, sort of piggybacking on yours and Stephen's comment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1970.654,
    "end": 1980.398,
    "text": "When we apply a Markov blanket, we can ask the question from an encapsulation perspective, did you see what I saw?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1980.938,
    "end": 1981.638,
    "text": "It's a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1982.298,
    "end": 1983.699,
    "text": "We're both behind a blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.739,
    "end": 1990.442,
    "text": "We're both wondering if there's some agreement that we've gained some sort of a contextual alignment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1991.189,
    "end": 1994.33,
    "text": " I could also say to you, did you see that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.33,
    "end": 2000.171,
    "text": "Which may sound like almost the same question, but it's not the same question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2000.271,
    "end": 2007.293,
    "text": "They're radically different questions because one says, are we in agreement on what's being encapsulated?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2008.653,
    "end": 2013.495,
    "text": "Meaning, are we forming a co-contextualization?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2014.075,
    "end": 2018.236,
    "text": "Or the other one says, I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.677,
    "end": 2020.917,
    "text": " Right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.497,
    "end": 2023.078,
    "text": "I'm not sure what you're seeing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2023.699,
    "end": 2035.586,
    "text": "So to this question of scale, free energy is moving us, I think, to that place of coexisting contexts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2036.166,
    "end": 2044.551,
    "text": "But I think the critical thing is, we've talked about this so many times, don't confuse the something or other, the map with the field or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2045.131,
    "end": 2046.952,
    "text": "I get lost in it all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2047.132,
    "end": 2048.073,
    "text": "But the bottom line is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2049.284,
    "end": 2051.126,
    "text": " Can we do two things at once?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2051.206,
    "end": 2051.926,
    "text": "I know we can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2052.006,
    "end": 2065.597,
    "text": "Our brains can realize that applying a partition versus or with, in conjunction with, what is that slice of time as a relativity question?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2066.038,
    "end": 2069.02,
    "text": "And then when does that relativity question appear?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2069.381,
    "end": 2073.384,
    "text": "At the beginning, is that our takeoff point or is that our conclusion?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2074.841,
    "end": 2080.503,
    "text": " That's all that this paper to me does is it says, at what moment do we employ categorization?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.303,
    "end": 2084.024,
    "text": "Interesting, Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2084.144,
    "end": 2084.524,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2084.784,
    "end": 2086.184,
    "text": "Dave, then anyone else?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2092.386,
    "end": 2099.048,
    "text": "Yeah, you know, to Dean's comment, when I asked, did you see what I saw?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2099.068,
    "end": 2103.849,
    "text": "The proximal poll",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2105.237,
    "end": 2110.14,
    "text": " of your attention is being invited to be projected into me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2110.16,
    "end": 2114.463,
    "text": "So you're seeing it through me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2114.483,
    "end": 2121.448,
    "text": "You might compare that to what some crazy Russians were doing 100 years ago.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2122.608,
    "end": 2131.174,
    "text": "They were trying to get the notion across that very few people are conscious more than a few times a year.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2132.329,
    "end": 2137.271,
    "text": " And they said, well, look, I can explain away your impression that you're conscious a whole lot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2139.652,
    "end": 2140.933,
    "text": "Here's what I can say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2140.953,
    "end": 2143.054,
    "text": "I can say, hey, are you conscious?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2144.414,
    "end": 2148.636,
    "text": "The very fact that I asked you, are you conscious, causes you to be conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2148.656,
    "end": 2150.757,
    "text": "It shocks you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2151.498,
    "end": 2152.998,
    "text": "It shocks you into consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2153.278,
    "end": 2155.619,
    "text": "And you wake up and you say, well, yes, I am.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2155.759,
    "end": 2158.881,
    "text": "Of course you are, because I forced that on you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2159.021,
    "end": 2159.121,
    "text": "Right."
  },
  {
    "start": 2163.092,
    "end": 2187.994,
    "text": " even and this takes in the idea of what is the adjacent possible what is available in that ecosystem for awareness that we're talking about so just like you said there if someone says did you see that um that can take someone into a sense of like i'm trying to work out",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2190.023,
    "end": 2217.606,
    "text": " often particularly if there's a power difference between people um what that other person's now wanting me to see and i've seen this a lot actually when we're doing work in south africa with communities one of the first things is to let people and you ask them a question to get them to a point where they're actually telling you what they think not what they think you are thinking about what they should be saying",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2218.795,
    "end": 2220.937,
    "text": " So where is that attention?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2220.957,
    "end": 2224.88,
    "text": "Just like I say, where is it in terms of being conscious as an awareness?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2226.081,
    "end": 2234.387,
    "text": "And how much of this scale is, well, what's available and what's going to be an impact in terms of the adjacency?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2234.487,
    "end": 2240.912,
    "text": "So a cell has some awareness potentially and maybe even some adaptive inference at the kind of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2242.478,
    "end": 2252.692,
    "text": " at the actual organ level potentially, and maybe further, it will have an impact maybe in terms of the way cells divide on the nature of speciation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2254.074,
    "end": 2257.96,
    "text": "Yes, but it hasn't necessarily got",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2259.798,
    "end": 2287.332,
    "text": " any trajectory to adaptively um couple it it's not in its adjacent possibles and i think that is quite useful in terms of it starts to open up in terms of the information either temporally how much is something separated by time spatially how much is it by space but i suppose also by statistical contingencies and the ability to adapt and interact those types of things well what is",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2288.439,
    "end": 2293.183,
    "text": " either within or adjacent and what becomes outside of that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2293.983,
    "end": 2303.67,
    "text": "I think that starts to give some of these scaling modularity questions just maybe an applied direction to come out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2305.472,
    "end": 2306.052,
    "text": "Thank you, Stephen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2306.312,
    "end": 2306.573,
    "text": "Blue?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2308.794,
    "end": 2314.819,
    "text": "There is a huge fundamental difference between asking someone, what do you see?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.068,
    "end": 2317.729,
    "text": " And do you see that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2318.149,
    "end": 2324.45,
    "text": "Even if you don't give them a that, you're still looking in a direction of that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2324.571,
    "end": 2326.491,
    "text": "So the, what do you see?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2326.591,
    "end": 2336.994,
    "text": "Like, let's someone look at their surroundings, take stock in what they see and give their independent observations versus just even like, do you see that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2337.094,
    "end": 2343.036,
    "text": "And like, you look over in a direction, at least like you're directing someone's attention with your question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.556,
    "end": 2349.64,
    "text": " So asking an open question versus a directed question can give very different answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2350.36,
    "end": 2359.145,
    "text": "And I wonder what the impact of that would be on modularity, or even just an information sharing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2360.066,
    "end": 2363.208,
    "text": "There's more shared information in, do you see that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2363.468,
    "end": 2365.249,
    "text": "Or do you see what I see?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2365.829,
    "end": 2375.217,
    "text": " That's like an intention to share your generative model at that point versus what do you see is actually trying to take stock in someone else's model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2375.237,
    "end": 2376.638,
    "text": "It's just an interesting thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2378.479,
    "end": 2389.301,
    "text": " These all point using the example of communication and visual perception to where we have partial information encapsulation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2390.061,
    "end": 2393.622,
    "text": "If the two entities were totally encapsulated, they couldn't communicate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2394.382,
    "end": 2399.343,
    "text": "If there was no encapsulation, such a question wouldn't be required to be asked.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2399.883,
    "end": 2402.364,
    "text": "But there's a specific type of edge",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2403.704,
    "end": 2405.125,
    "text": " in this network.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2405.165,
    "end": 2411.327,
    "text": "We could almost think of these like two modules as like maybe the two generative models of the individuals.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2411.427,
    "end": 2417.429,
    "text": "And there's this connection when some of the modules are connected.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2418.169,
    "end": 2422.671,
    "text": "And it is a nice, how we're kind of exploring these subtly different questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2422.811,
    "end": 2424.992,
    "text": "I think, did you see that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2425.932,
    "end": 2430.854,
    "text": "Is that is corresponding to an external state, like an observation?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2431.234,
    "end": 2432.195,
    "text": "Did you see that, that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2433.155,
    "end": 2457.821,
    "text": " red blur in the sky i don't know what it was could have been a comment but did you see that versus what i saw um well we know that you see with your mind generative model of vision and whatnot and so especially when we're outside of the signal processing paradigm of vision did you see what i saw is like quite literally asking is your internal hidden state",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2460.117,
    "end": 2460.737,
    "text": " related to mine?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2461.357,
    "end": 2462.658,
    "text": "Are we seeing the same thing?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2463.398,
    "end": 2466.439,
    "text": "That doesn't mean are the photons hitting both of our retina.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2466.459,
    "end": 2471.421,
    "text": "It means do we have a shared generative model of visual objects?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2472.681,
    "end": 2475.382,
    "text": "So Dean and then Dave.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2477.223,
    "end": 2477.883,
    "text": "Just one last thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2477.923,
    "end": 2479.924,
    "text": "That's a great summary, first of all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2480.564,
    "end": 2483.125,
    "text": "Secondly, when we're talking about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2484.144,
    "end": 2496.066,
    "text": " what is the nature of the partition where I think as a group, we're still trying to define what we hope is not completely definable yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2497.186,
    "end": 2499.947,
    "text": "Do you want to understand with that partial encapsulation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2500.587,
    "end": 2509.929,
    "text": "Not saying it's undefined, I'm not saying it's zero, although down the road, I might say we're passing through zero because that's what I'm kind of moving towards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2510.109,
    "end": 2510.849,
    "text": "But I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2512.159,
    "end": 2518.942,
    "text": " When we partition, that partition is not static.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.982,
    "end": 2524.965,
    "text": "And the definition of it is to leave it somewhat undefined.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2526.566,
    "end": 2534.03,
    "text": "I like your explanation better, Daniel, but that's what I think we're trying to move towards here eventually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2536.482,
    "end": 2536.722,
    "text": " Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2536.942,
    "end": 2538.963,
    "text": "Dave, do you want to add something there?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2539.983,
    "end": 2540.283,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2541.024,
    "end": 2547.186,
    "text": "So blue, or if not blue, then Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2550.347,
    "end": 2550.947,
    "text": "I went already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2551.027,
    "end": 2551.327,
    "text": "I'm good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2554.128,
    "end": 2565.652,
    "text": "I suppose just pushing a question back, we talk about this encapsulation modularity and where we put that by putting the blanket somewhere.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2566.966,
    "end": 2569.468,
    "text": " seems to be kind of implied by that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2570.409,
    "end": 2591.164,
    "text": "So that kind of is done through a way of speculating on where the observations are generating some sensory states and where we are in terms of the action dynamics at play.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2592.145,
    "end": 2594.287,
    "text": "How much is this dropping out of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2596.206,
    "end": 2610.47,
    "text": " the literal availability at a certain scale, and then we make the blanket around it, and how much of it comes from structuring the blanket in terms of how we implement this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2610.59,
    "end": 2622.653,
    "text": "I think that changes what modularity may or may not mean, because I think that how those separations of modularity are done",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2623.581,
    "end": 2641.346,
    "text": " you know, is it, is it a case of how sort of parallel processes are happening and are being integrated and they're modularly almost independent, maybe certain senses are independent and how much is it that they're independent?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2642.146,
    "end": 2649.268,
    "text": "Um, because they're separated at an integrated level by temporal physical space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2652.318,
    "end": 2677.037,
    "text": " great questions are these partitionings are a priori model or do we merely specify what we're going to measure and then the blankets if we're using the technical definition of a markov blanket like the set of variables upon which two other sets of variables called internal and external states become conditionally independent",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2678.297,
    "end": 2683.121,
    "text": " In that case, you don't need to specify which nodes are blanket states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2683.801,
    "end": 2696.831,
    "text": "You just make the measurements and then relative to a target set of states, some other set become a blanket with respect to a third external type of states.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2697.612,
    "end": 2699.794,
    "text": "So Dean and then Blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2701.315,
    "end": 2702.576,
    "text": "Okay, I'll be super quick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2704.862,
    "end": 2707.503,
    "text": " This idea that our minds are able to categorize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2708.204,
    "end": 2715.069,
    "text": "It's a world of segregation, like in backslashes, when we're looking at it symbolically, or integrations, i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2715.169,
    "end": 2715.669,
    "text": "hyphens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2717.691,
    "end": 2726.977,
    "text": "These are symbolic knots to the Markov blanketing, so the instantiating, or partitioning and applying, I'm sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2731.098,
    "end": 2736.001,
    "text": " So my example here might be a little strange, but be generous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2736.861,
    "end": 2747.948,
    "text": "When yellow becomes orange in an fMRI or a rainbow, which begs the question, is a rainbow a piece of encapsulated information?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2747.968,
    "end": 2750.389,
    "text": "Okay?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2752.57,
    "end": 2755.412,
    "text": "Is that representation transitive or intransitive?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2757.176,
    "end": 2758.736,
    "text": " Okay, so i.e.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2758.776,
    "end": 2776.74,
    "text": "the claim that the most important color in the rainbow is yellow on one end, on the other is at the end of all rainbows must exist prisms made up of unicorns, sea serpents, and flying monkeys, or maybe free and energy and dynamic or principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2779.021,
    "end": 2780.161,
    "text": "See where I'm going with this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.541,
    "end": 2784.822,
    "text": "Our minds are able to do both ends of that continuum at once.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2786.8,
    "end": 2793.005,
    "text": " And that's what I think where the architecture and the process both come into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2794.045,
    "end": 2799.189,
    "text": "If we can look at this from a more of a, did you see what I saw perspective?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2799.309,
    "end": 2807.976,
    "text": "And most people won't say they're comparing flying monkeys to free energy dynamics, but people can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.949,
    "end": 2814.832,
    "text": " And I think maybe that's what Fortin's, our minds are trying to set up here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.132,
    "end": 2824.117,
    "text": "It certainly is with how we encapsulate the information, how we as the observer choose to do that and then try to gain some consensus around that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2825.098,
    "end": 2826.138,
    "text": "Thank you for your patience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.18,
    "end": 2831.001,
    "text": "Late nights in the Dean household.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2834.623,
    "end": 2835.784,
    "text": "Blue and then Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2838.226,
    "end": 2839.567,
    "text": " Tickles me, just tickles me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2842.389,
    "end": 2846.972,
    "text": "So I have to just comment on Dean's comment really quickly, and then I want to go back to what Stephen said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2847.052,
    "end": 2851.896,
    "text": "So when yellow becomes orange in an fMRI, now I don't really...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2852.981,
    "end": 2858.743,
    "text": " know a lot about how fMRI works, but I don't think that there's actually any color spectra applied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.864,
    "end": 2864.406,
    "text": "Like yellow is 570 to 590 nanometers in the electromagnetic spectrum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2864.426,
    "end": 2866.747,
    "text": "But I don't think that fMRI actually turns out yellow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2867.147,
    "end": 2870.288,
    "text": "I think it actually turns out something between zero and 256.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2872.049,
    "end": 2878.031,
    "text": " So in terms of light intensity, and we just fakely apply yellow to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2878.871,
    "end": 2879.531,
    "text": "That's correct, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.172,
    "end": 2884.213,
    "text": "So it's an arbitrary distinction when yellow becomes orange or rainbow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2885.133,
    "end": 2894.396,
    "text": "This is just something we made up just to share our generative model, to share information about the picture that we're seeing on the screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2895.396,
    "end": 2899.598,
    "text": "But going back to what Stephen said, and then this is going to hit on a point that Dean is going to love also,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.518,
    "end": 2916.402,
    "text": " You know, because we apply the Markov blanket to the system that we're interested in studying, like to the organism, the individual, the heart, the liver, the cell, to define what makes the internal and external states conditionally independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.762,
    "end": 2918.003,
    "text": "We apply the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2918.723,
    "end": 2920.603,
    "text": "Therefore, we create the module.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.963,
    "end": 2923.304,
    "text": "Is that the same or is that not the same?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.737,
    "end": 2929.317,
    "text": " I vote same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2929.597,
    "end": 2941.02,
    "text": "Are we engaged in module projection or module discovery and, not even or, or what other ways do modules apply?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2942.36,
    "end": 2944.94,
    "text": "So, Stephen, with a raised hand, and then anyone else.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2947.261,
    "end": 2952.082,
    "text": "So, there are two interesting points just been made there by Blue and...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2953.843,
    "end": 2975.814,
    "text": " that moment and Dean what when we say doing both at once I think there's also times I would argue though that we're able to do both and some of these processes can be possibly be running parallel however the regimes of attention at certain scales we can't do",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2977.478,
    "end": 3000.138,
    "text": " together in the same way we almost have to go from one to the other unless there's an adjacency between the two types of regimes i would say to enable that to happen so if i'm thinking about um something for instance that's quite somatic and then i'm thinking about something which is quite um abstract",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3002.563,
    "end": 3011.11,
    "text": " Over time, I might be able to train myself for that abstract to have a marker in the somatic that I can then integrate with.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3011.43,
    "end": 3014.973,
    "text": "But I'm still integrating two somatics together in the somatic regime.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3015.494,
    "end": 3023.44,
    "text": "Or I might have a model of the somatic in the kind of ocular visual modeling mode, and I can imagine the two.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3024.747,
    "end": 3030.351,
    "text": " In the same moment, I can't hold both with the same type of embodiment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3031.132,
    "end": 3036.396,
    "text": "So that's one of the things that I think is quite important to wonder.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3036.456,
    "end": 3043.542,
    "text": "And then also, once we then get into these, is that ability to configure, is that...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3044.602,
    "end": 3055.592,
    "text": " the Markov blanket, and this sort of takes us into sense finding, sense making type of work, is the sense finding that, okay, how am I even sensing what to do in this moment?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3055.752,
    "end": 3056.813,
    "text": "And we have that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3057.834,
    "end": 3063.779,
    "text": "And then I start to sense, and then I'm sense making how to do it, and then I'm into skillful practice, and maybe I can just do it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3064.48,
    "end": 3068.385,
    "text": " So some things are more or less in and out of.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3068.745,
    "end": 3071.889,
    "text": "Is that sense finding sort of aligning a blanket?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3072.069,
    "end": 3077.575,
    "text": "I basically align in what the sensory inaction kind of states that are relevant are going to be done.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3078.056,
    "end": 3081.3,
    "text": "And then are we maybe have that set?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3081.36,
    "end": 3082.781,
    "text": "And now we're in a kind of more",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3083.702,
    "end": 3111.307,
    "text": " um generative sense making maybe even just skillful flow okay okay i've got my general blanket in place i'm in a skillful flow now right um and that sometimes takes time you know um and it's also maybe you know we can only switch attention to something that's in a different regime with a certain speed you know um so anyway both those points really struck me",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3112.469,
    "end": 3115.714,
    "text": " The speed of attention, it's really interesting and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3117.947,
    "end": 3130.096,
    "text": " Kristen and others have related that to the rapid oscillations, like the gamma cycles in the brain, which they don't happen 100,000 times per second, but they do happen more than once a second.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3130.697,
    "end": 3137.342,
    "text": "There's a certain number of times, and it's interesting how that lines up with our perceptual capacity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3137.782,
    "end": 3143.286,
    "text": "Like when something is like alternating and rotating, and then it goes from sort of black and white to gray,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3144.167,
    "end": 3162.218,
    "text": " there's a moment where the perceptual speed is just not able to um see that anymore as two contrasting states but it's one blurred state and it doesn't have to do with the photons hitting the retina being blurred it has to do with the generative model of vision dean",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3164.269,
    "end": 3165.789,
    "text": " Stephen, I completely agree with you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3165.889,
    "end": 3171.251,
    "text": "And I reference back to sort of Wittgenstein's illusion of the duck-rabbit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3172.051,
    "end": 3175.772,
    "text": "And how do we put a Markov blanket between those two representations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3175.812,
    "end": 3179.833,
    "text": "You can't see the rabbit when you see the duck, and vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3181.493,
    "end": 3184.294,
    "text": "And then that leads me to the parable of Bob and Alice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.494,
    "end": 3186.014,
    "text": "So I just wanted to put that in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3186.414,
    "end": 3187.915,
    "text": "I think that's a great time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3187.995,
    "end": 3188.195,
    "text": "Let's...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3189.833,
    "end": 3191.153,
    "text": " move Bob and Alice up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3191.373,
    "end": 3194.674,
    "text": "Let's put Bob and Alice on their own page with a duck.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3195.594,
    "end": 3199.955,
    "text": "I don't want to even bias which one it is with this representation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3200.415,
    "end": 3207.197,
    "text": "So would you like to maybe set up the Bob and Alice or we can look up the full text?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3208.237,
    "end": 3210.217,
    "text": "Go with the text because it's really clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3210.597,
    "end": 3210.818,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3210.998,
    "end": 3211.278,
    "text": "Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3211.658,
    "end": 3211.958,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3212.078,
    "end": 3212.938,
    "text": "So here we go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3212.958,
    "end": 3217.219,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3220.567,
    "end": 3239.479,
    "text": " okay all right we're going to assume there are two neighbors bob and alice so a and b kind of a classic quantum parable every night when bob is beginning to brush his teeth alice begins to read a section of a tale of two cities at the adjunct flat",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3240.618,
    "end": 3247.403,
    "text": " State B contains Bob beginning to brush his teeth in his flat, and state A contains Alice beginning to read the book at hers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3248.284,
    "end": 3253.528,
    "text": "Let us assume there's no causal relationship between the states A and B, given the two states are segregated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3254.488,
    "end": 3265.577,
    "text": "There may or may not be a common cause that pre-establishes a harmony between A and B, say, when what happens in A and B are both bedtime activities coordinated because of various cultural and geographic habits.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3266.317,
    "end": 3278.585,
    "text": " However, the assumption of common cause does not need to affect the present discussion because what is important for us is that information processing in A is inaccessible to information processing in B and vice versa.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3279.286,
    "end": 3285.97,
    "text": "This is in harmony with satisfying the assumption of encapsulation and the assumption of modularity to some interesting extent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3286.851,
    "end": 3294.436,
    "text": "So Dean, maybe unpack or explain what you think is interesting and I'll start to get some nodes and edges on this slide.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3295.021,
    "end": 3313.811,
    "text": " So I don't know which is the duck or the rabbit, which is Bob or which is Alice, but to the observer, there's information encapsulated in that which can be broken down into A or B. Then the question becomes one of, so how do we modulate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3314.412,
    "end": 3323.757,
    "text": "How does the switch between those two different representations held in one block of pixels work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3324.693,
    "end": 3332.24,
    "text": " How do we partition when that potential for one or the other exists?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3332.56,
    "end": 3334.402,
    "text": "Did you see what I saw?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.422,
    "end": 3336.644,
    "text": "I guess we're coming back to that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3342.529,
    "end": 3342.789,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3343.85,
    "end": 3347.413,
    "text": "Stephen, then I'll be developing these nodes a little bit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3349.235,
    "end": 3350.416,
    "text": "Yeah, and what we see...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3353.464,
    "end": 3354.685,
    "text": " Well, I'm going to add one thing here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3354.705,
    "end": 3367.453,
    "text": "It's sort of related, I think, is if you look at that rabbit and that duck, OK, well, the rabbit is forward looking and decisive and the back is backward looking at the past.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3368.424,
    "end": 3382.315,
    "text": " Because the visual grammar that we use in the West is mostly that the left of a vertical flat image or flat piece of paper is the left is the past, the right is the future.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3383.096,
    "end": 3393.284,
    "text": "So even that flipping, the nature of that rabbit is caught within a cultural frame.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3394.594,
    "end": 3414.303,
    "text": " okay which would be different if the duck was facing the other way and the rabbit was looking backwards so um i suppose there's something interesting there yeah yeah now now the the rabbit's like looking back in the past right um so there's there's something interesting there about um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3417.919,
    "end": 3440.946,
    "text": " some other kind of uh the contextuality i suppose of how things are so i just thought i'd add that in but yes as the symposium with friston discussed a lot illusions reveal our priors so if you're trained in ballerina dance and it's only a clockwise rotation when you see the rotating ballerina you're going to see that that's going to be",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3442.19,
    "end": 3466.025,
    "text": " having overwhelming posterior likelihood given the ambiguous visual stimuli or if cubes are always facing down into the left you're going to perceive that when you see an ambiguous cubic stimulus and so it does matter um these deep priors on how we perceive even visual stimuli blue so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3467.435,
    "end": 3473.262,
    "text": " There's an important component, I think, that's missing from the Bob and Alice paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3473.642,
    "end": 3478.888,
    "text": "And the author alludes to it in describing shared cultural norms, bedtime, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3479.489,
    "end": 3483.293,
    "text": "But there's Bob and there's Alice and then there's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3483.954,
    "end": 3489.677,
    "text": " the niche, the environment, essentially, that they both reside in the environment, and in the environment, it's nine o'clock.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3490.458,
    "end": 3500.364,
    "text": "And so something interesting that it reminds me of is that I was reading that intransitivity paper, I was just looking for it, Daniel, maybe you have it in a slide and can reference it here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3500.824,
    "end": 3503.886,
    "text": "But they talked about intransitivity in various contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3503.946,
    "end": 3506.307,
    "text": "And we gave the example of rock, paper, scissors, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3507.688,
    "end": 3515.214,
    "text": " They also mentioned intransitivity in the Lacta Volterra population model with the fox and the rabbit, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3515.234,
    "end": 3520.299,
    "text": "So normally like you don't think about that as being an intransitive relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.359,
    "end": 3527.285,
    "text": "It's like the foxes go up and the rabbits go down and the rabbits go up and the fox, you know, it's like this cyclical thing between the fox and the rabbit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3527.325,
    "end": 3534.671,
    "text": "But they mentioned the importance of the environment and how like it's just normally considered that environmental resources are constant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3535.171,
    "end": 3537.333,
    "text": " But that's not normally the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3537.634,
    "end": 3546.203,
    "text": "And so eventually, like if the rabbits eat all the grass, the population of rabbits will go down unrelated to the population of foxes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3546.663,
    "end": 3555.512,
    "text": "And so it's, I think, important to consider in Bob and Alice in this relationship, like what is the role of the niche environment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.953,
    "end": 3557.254,
    "text": "And then does does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.308,
    "end": 3563.713,
    "text": " Like this third hidden state, like, okay, we see Bob and we see Alice and they don't know anything about each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.114,
    "end": 3565.796,
    "text": "So information is encapsulated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3565.836,
    "end": 3567.177,
    "text": "Like Bob doesn't know anything about Alice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.277,
    "end": 3570.66,
    "text": "Alice doesn't know anything about Bob, but they both live in the same place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.74,
    "end": 3573.663,
    "text": "And that's what I was saying earlier about the butterfly effect and climate change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3573.944,
    "end": 3579.089,
    "text": "Like the environment plays a role in the distribution of information between Bob and Alice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3584.827,
    "end": 3605.348,
    "text": " great um so we can look at two different stories and i think this totally gets to the um difference between realism and instrumentalism as well so what are the difference between these two sto these two uh well first off it's funny that the book being read is um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3606.208,
    "end": 3625.119,
    "text": " tale of two cities because that's like the tale of two den cities like we read and uh it's also invoked in the title of this paper so there's going to be two stories of red lines these are two narratives that can be told scientifically by modelers",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3626.229,
    "end": 3628.97,
    "text": " Okay, so no one's disagreeing about the niche.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3629.05,
    "end": 3633.191,
    "text": "No one's saying, well, they're actually, they're in a, you know, one's on the moon and one's on earth.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3633.551,
    "end": 3635.171,
    "text": "So we're talking about the same niche.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3636.051,
    "end": 3647.214,
    "text": "Now let's imagine that Bob and Alice were two brain regions, B and A. So we observe brushing and reading to be co-activated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3647.614,
    "end": 3649.294,
    "text": "They're co-expressed behaviors.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3650.075,
    "end": 3653.155,
    "text": "And so what does this edge reflect?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3654.276,
    "end": 3655.636,
    "text": "We have an answer there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3656.869,
    "end": 3658.63,
    "text": " It's the functional connectivity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3659.291,
    "end": 3661.392,
    "text": "Functional connectivity, Frist in 94.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3662.213,
    "end": 3666.416,
    "text": "Functional connectivity is a temporal correlation between spatially remote events.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3667.236,
    "end": 3669.638,
    "text": "So that is functional connectivity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3670.138,
    "end": 3676.443,
    "text": "The alternative is to refer to effective connectivity, which is the influence of one neuronal system over another.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3677.623,
    "end": 3678.684,
    "text": "Let's go back to Bob and Alice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3679.365,
    "end": 3682.587,
    "text": "So this is a functional connectivity edge.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3683.979,
    "end": 3695.846,
    "text": " If there was an effective connectivity edge, it would have none because although they happen at a temporally correlated time, let's just say they each did it 90% of the time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3696.446,
    "end": 3699.728,
    "text": "So overall, like 81% of the time, they're both doing it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3700.428,
    "end": 3702.469,
    "text": "And so there's a really high temporal correlation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3702.91,
    "end": 3708.273,
    "text": "However, the 10% of the time when one is not doing it, it doesn't have an effect on the other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3709.013,
    "end": 3710.254,
    "text": " So they're conditionally independent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3710.594,
    "end": 3715.339,
    "text": "So actually the effective connectivity wouldn't have an edge if it were calculated appropriately.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3715.979,
    "end": 3718.281,
    "text": "So functional connectivity, we see an edge.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3718.621,
    "end": 3720.283,
    "text": "Effective connectivity, we don't see an edge.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3720.743,
    "end": 3730.231,
    "text": "And then there's the third story, then Dean, which is a causal mechanistic story, which is the niche...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3731.223,
    "end": 3742.967,
    "text": " broadly being the time zone and the human circadian rhythms and all these other features, the niche is influencing Bob and Alice independently.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3742.987,
    "end": 3744.328,
    "text": "It's like a confounding variable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3745.108,
    "end": 3749.87,
    "text": "And then that is what causes Bob to brush and Alice to read.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3750.89,
    "end": 3758.693,
    "text": "And so, yes, we do get this temporal correlation arising from a latent causing variable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3759.514,
    "end": 3759.794,
    "text": "And so,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3760.839,
    "end": 3774.087,
    "text": " How does that relate to neuroimaging studies when people find that there's functional or even effective connectivity amongst brain regions and then cast that as a mechanistic story about what is actually happening?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3774.947,
    "end": 3775.928,
    "text": "Dean, and then Steven.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3776.868,
    "end": 3788.175,
    "text": "Isn't the effective, I'm asking, because I don't know, is the effective connectivity here on a Z plane, meaning from the observer's standpoint, the effect is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3789.85,
    "end": 3791.651,
    "text": " this XY relationship?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3795.612,
    "end": 3800.474,
    "text": "Because that's time, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3800.734,
    "end": 3811.639,
    "text": "The change is through that, from my eyeballs, through that screen, into that slide, and then beyond on the other side of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3811.719,
    "end": 3813.3,
    "text": "Is that not the effect of connectivity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3814.98,
    "end": 3821.425,
    "text": " I know we can't show it here because we have to work on 2D rectangles, but isn't that it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3823.146,
    "end": 3823.466,
    "text": "Correct.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3823.506,
    "end": 3832.573,
    "text": "You could think about for any given edge, like between brushing and reading, there's going to be some FC score between 0 and 1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3833.194,
    "end": 3835.896,
    "text": "And then there's some effective connectivity score between 0 and 1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3837.076,
    "end": 3840.059,
    "text": "And so you could have cases where that edge is like a 0, 0.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3842.426,
    "end": 3846.768,
    "text": " It doesn't have effective nor functional connectivity in a given experimental measurement.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3848.209,
    "end": 3849.93,
    "text": "And then you could have high for both.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3850.37,
    "end": 3863.257,
    "text": "And it always has to be described in terms of the measurement that's being taken because the temporal correlation doesn't exist outside of the time series that the correlation is being done on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3864.298,
    "end": 3868.301,
    "text": " And so that is where Benny introduces the model-based science.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3868.381,
    "end": 3876.527,
    "text": "It's like, if you're talking at all about the connectivity statistically defined, you're talking about a statistical model on a specific experiment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3877.108,
    "end": 3887.175,
    "text": "So even if you're using a tool like a Markov blanket or a linear regression that is not posing an a priori scale in that time series, there is an a priori scale.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3887.776,
    "end": 3889.457,
    "text": "It's the specific time scale that you measured.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3890.278,
    "end": 3890.378,
    "text": "Um,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3891.587,
    "end": 3894.467,
    "text": " So yes, the edges can be of different kinds.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3895.048,
    "end": 3900.168,
    "text": "And in neuroimaging, again, as we talked about dot zero, there's the anatomical, the functional, and the effective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3901.169,
    "end": 3904.409,
    "text": "And so wouldn't that be simple if they were all the same?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3904.629,
    "end": 3906.49,
    "text": "But it's just literally not the case.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3906.51,
    "end": 3911.29,
    "text": "There's brain regions that don't have direct connections to each other that have temporal correlations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3911.89,
    "end": 3915.451,
    "text": "And there's ones that are directly connected, but they don't have temporal correlations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3915.531,
    "end": 3919.472,
    "text": "And every other combination, that's why we have to do empirical measurement.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3920.152,
    "end": 3920.892,
    "text": "So Steven?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3924.606,
    "end": 3929.632,
    "text": " The difference as well is now we see niche being brought in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3930.774,
    "end": 3937.562,
    "text": "When we have functional connectivity in the brain, it's kind of assuming that it's all brain activity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3938.223,
    "end": 3962.411,
    "text": " processes so you okay you've got the brain and what's going on and the connection between different areas now if we start coming out and we start looking at well there's active influence with markovian approaches okay there's brushing but brushing is an action right reason is an action coupled to a niche and the body and the generative model",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3963.573,
    "end": 3976.661,
    "text": " And so you've now come, and the niche, it's not just that there's a niche out there that's also interacting with a kind of a brain-based process, you've got a niche.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3977.041,
    "end": 3990.849,
    "text": "But there's also then another recursion where, okay, we're now looking at the idea, which is maybe being reformulated conceptually more, of this whole thing happening,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3992.324,
    "end": 3997.908,
    "text": " And this whole thing, this whole process, this model, is in a niche itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3999.369,
    "end": 4011.278,
    "text": "And I'm creating in this model of this story a functional connectivity, which may be substantiated through data if science is used, between brushing and reading.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4011.819,
    "end": 4016.022,
    "text": "Because the story has put that system of information to me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4016.042,
    "end": 4019.444,
    "text": "Because I've never met Bob or Alice, and they're most likely fictional.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4020.285,
    "end": 4047.051,
    "text": " so there's an interesting move from what started out as brain regions being looked at as functional connectivity trying to then think what that's doing because this something out there this hidden states to an active influence agent where you now have action to give you a grounding to jumping back out again to another sort of conceptual",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4048.064,
    "end": 4052.668,
    "text": " system of information which we may be working with to look at ourselves.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4053.108,
    "end": 4057.852,
    "text": "So I think that changes where does that word niche fit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4062.256,
    "end": 4062.916,
    "text": "Great, thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4063.417,
    "end": 4063.677,
    "text": "Dean?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4066.059,
    "end": 4071.283,
    "text": "I just think that if I'm going to incorporate effective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4073.498,
    "end": 4074.28,
    "text": " connectivity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4074.821,
    "end": 4078.19,
    "text": "I'm actually looking at the observer observing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4079.273,
    "end": 4081.66,
    "text": "So somebody",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4083.157,
    "end": 4100.603,
    "text": " somebody throws me into a CAT scan machine, starts taking slices on my brain, I'm sure they're going to be able to point out some sort of a functional connection between what image pops out when my brain is focusing on the rabbit or my brain is focusing on the duck.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4101.424,
    "end": 4104.865,
    "text": "That functional connection will definitely be able to show up in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4106.167,
    "end": 4113.132,
    "text": " some sort of differentiation between those two ways that I'm perceiving that image.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4114.113,
    "end": 4126.902,
    "text": "I think it's harder, and maybe there's, because I don't know, but maybe there is some way of being able to show how the brain is swapping, building the Markov blanket in situ.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4126.922,
    "end": 4128.163,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4129.264,
    "end": 4131.646,
    "text": "But if there is a paper about that, I'd like to read it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4136.004,
    "end": 4146.727,
    "text": " Because I know the observer in Betty's example here is swapping at some point between, am I looking at Bob?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4147.268,
    "end": 4148.268,
    "text": "Am I looking at Alice?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4148.328,
    "end": 4149.708,
    "text": "Or am I looking at nine o'clock?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4150.108,
    "end": 4151.529,
    "text": "Or am I looking at the swap?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4153.59,
    "end": 4158.071,
    "text": "And I'm not sure if it's easy to be able to show the swap part, but it's definitely there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4160.373,
    "end": 4160.573,
    "text": " Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4160.673,
    "end": 4167.637,
    "text": "Blue, did you want to add something about the intransitivity of the Volterra ecological modeling?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4168.918,
    "end": 4170.359,
    "text": "So I had already mentioned it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4170.459,
    "end": 4171.82,
    "text": "Okay, just putting the image up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4172.24,
    "end": 4172.44,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.54,
    "end": 4172.96,
    "text": "Okay, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4173.04,
    "end": 4173.3,
    "text": "Stephen?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4175.302,
    "end": 4179.104,
    "text": "Sort of, it's going to be a little bit of a question, but it's rhetorical if you want it to be.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4179.284,
    "end": 4181.445,
    "text": "But if we've got here...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4183.956,
    "end": 4198.11,
    "text": " the relationship between the brain processing or the body processing of the organism, there could be effective connectivity because there's some common relational processes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4199.632,
    "end": 4205.058,
    "text": "If we're talking about how they're in their niche and maybe some",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4206.588,
    "end": 4231.86,
    "text": " loose way that feedback loops can reverberate through the buildings that they're in and the social uh malheur you can see the niche coming in and then if we then go to well what in this system of information that we're engaging so if alice and bob are coupled in our system of information here that could be functional",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4233.496,
    "end": 4244.646,
    "text": " because it's within the variables that I assign to Alice and Bob in whatever way that I'm embodying this meaning making.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4244.867,
    "end": 4247.069,
    "text": "So I was wondering if those three",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4249.255,
    "end": 4274.388,
    "text": " it sort of ties in a bit to what you've got here, but I kind of feel it's useful to, it starts to think about where was Friston coming from when it was a kind of a trying to get at what the brain's doing in response to, and really get at what's going on in there to when it's something which is actually happening to something again, which becomes a kind of an abstracted level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4274.688,
    "end": 4274.788,
    "text": "And",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4276.696,
    "end": 4280.457,
    "text": " I don't know which of those is closest to what is normally being taught.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4281.738,
    "end": 4287.44,
    "text": "Does that change between the actual nature of the system?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4287.5,
    "end": 4291.381,
    "text": "Do we have a way to think about that?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4291.921,
    "end": 4293.642,
    "text": "Or is that speaking to this...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4295.558,
    "end": 4304.006,
    "text": " process that when you just have DCM models and you just have these kind of informational models, that has to be kind of set.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4304.586,
    "end": 4307.189,
    "text": "You have to kind of tell it and believe that what you're talking about.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4308.049,
    "end": 4315.937,
    "text": "The beauty of active inference is I have a deeper anchor to help me tether all of those three.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4317.073,
    "end": 4320.815,
    "text": " You know, I have an embodied way of knowing how it is to imagine.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4321.015,
    "end": 4323.257,
    "text": "I have an embodied way of knowing how to brush and read.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4323.877,
    "end": 4335.905,
    "text": "I have an embodied way of enacting motor skills in real time to make the brushing and reading even possible.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4336.925,
    "end": 4344.43,
    "text": "And that's something that the previous models hadn't really got a plausible mechanism to explain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4345.646,
    "end": 4346.927,
    "text": " until we got active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4348.287,
    "end": 4350.248,
    "text": "DCM doesn't seem to have that ability.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4350.268,
    "end": 4354.51,
    "text": "It's all still kind of untethered information-based approaches.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4357.511,
    "end": 4358.832,
    "text": "Okay, interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4359.412,
    "end": 4372.697,
    "text": "So I think these three, Tale of Three cities now, we have a functional... So these are predicated upon observations of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4373.298,
    "end": 4373.398,
    "text": "So...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4374.378,
    "end": 4389.103,
    "text": " First, to Stephen's point, yes, we could think about brushing and reading as affordances and embodiment, and that is something that active inference brings to the table, which is like the ability to zoom in on one of these observations",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4390.086,
    "end": 4393.971,
    "text": " And it's like, well, we're not just studying the observation of brushing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4394.011,
    "end": 4399.498,
    "text": "There's an entity that's engaged in this skillful action that's encultured and that just takes you a million other places.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4399.578,
    "end": 4404.043,
    "text": "So yes, active inference is a development on what Friston and others have been doing for 30 years.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4406.53,
    "end": 4413.713,
    "text": " We really have to be careful whether we're using terms in their technical, statistical sense or not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4413.833,
    "end": 4419.916,
    "text": "Like just to show how easy it is to get mixed up, you can say, well, I mean, brushing and reading are correlated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4420.496,
    "end": 4425.019,
    "text": "So it's like they're effectively connected, but they're not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4425.099,
    "end": 4426.799,
    "text": "That's called functional connectivity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4427.099,
    "end": 4429.341,
    "text": "Functional connectivity is the temporal correlation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4429.441,
    "end": 4432.142,
    "text": "And then here's how easy it is to get confused on the other side.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4433.373,
    "end": 4438.374,
    "text": " Here's a story about the world where Bob does call Alice, but we are not wiretapping.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4439.075,
    "end": 4440.895,
    "text": "And Bob says, hey, I'm brushing, you should read.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4442.015,
    "end": 4458.18,
    "text": "And so it turns out that in this world, not just are brushing and reading functionally correlated, like they have a time series correlation, but actually brushing does induce reading through a mechanism that we didn't observe.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4459.96,
    "end": 4461.741,
    "text": "That sounds like a functional correlation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4462.699,
    "end": 4463.74,
    "text": " or a functional connection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4463.86,
    "end": 4471.226,
    "text": "It's not, it's an effective connection, how it's technically defined the influence of one system on another.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4472.407,
    "end": 4474.708,
    "text": "And so yes, function is happening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4475.329,
    "end": 4477.911,
    "text": "Action is happening, but it is very,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4480.211,
    "end": 4495.045,
    "text": " importance that when thinking about these edges, people are accurate because these stories are all happening at the same time and different experimental designs or statistical analyses might not be contradictory to each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4495.305,
    "end": 4497.467,
    "text": "They might be totally complimentary to each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4498.167,
    "end": 4499.368,
    "text": "Somebody might be describing",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4500.089,
    "end": 4503.732,
    "text": " the enculturation of how brushing and reading come to be.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4504.413,
    "end": 4509.417,
    "text": "And somebody else might be talking about the functional or the effect of connectivity or all these other kinds of pieces.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4509.517,
    "end": 4510.518,
    "text": "And so I agree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4511.038,
    "end": 4518.184,
    "text": "Active helps us understand the non-rivalrous dynamics of all these different descriptions",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4520.031,
    "end": 4532.898,
    "text": " However, we're going to be on the ground floor forever if we can't be clear about what those different descriptions are and adjust our regime to these different important parts of the system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4534.479,
    "end": 4535.56,
    "text": "Dave and then Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4539.983,
    "end": 4542.465,
    "text": " Okay, Dean, and then Dave, if you unmute later.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4542.485,
    "end": 4544.526,
    "text": "So Dean and then Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4544.686,
    "end": 4552.892,
    "text": "Yeah, so could you put a second thought bubble under EC and could it be, hey, I'm nine o'clocking, are you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4556.174,
    "end": 4558.676,
    "text": "Because that to me is the effect of connectivity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4559.397,
    "end": 4563.64,
    "text": "I keep the, hey, I'm brushing, you should read, but also there should be a second one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4564.0,
    "end": 4565.221,
    "text": "Hey, I'm nine o'clocking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4566.618,
    "end": 4567.639,
    "text": " Are you nine o'clocking?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4568.2,
    "end": 4573.825,
    "text": "Because that to me speaks as much to the effect as opposed to the function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4576.828,
    "end": 4578.609,
    "text": "Yes, good point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4578.669,
    "end": 4586.677,
    "text": "And depending on how literal you want to take this metaphor or how you're imagining the story Bob and Alice or how close you want to tie it to neural systems,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4588.237,
    "end": 4589.638,
    "text": " One could imagine various pieces.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4589.718,
    "end": 4601.143,
    "text": "This is just to highlight like that red is this causal chain, the difference that makes a difference, the actual phone call that induces reading that's unobserved in this experiment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4601.483,
    "end": 4606.606,
    "text": "So fMRI is measuring blood oxygen level dynamics, bold signal.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4607.446,
    "end": 4609.568,
    "text": " And so that's not even neural activity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4609.948,
    "end": 4618.054,
    "text": "Now, read the SPM textbook because that's how you infer neuronal activity from the BOLD signal, but it's not what's being directly measured.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4619.375,
    "end": 4620.896,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4620.976,
    "end": 4625.36,
    "text": "But I just want to add, so even the observer is 9 o'clocking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4627.801,
    "end": 4633.666,
    "text": "So now Bob is 9 o'clocking, Alice is 9 o'clocking, and the observer of Bob and Alice is 9 o'clocking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4635.063,
    "end": 4638.485,
    "text": " That's what I kind of want to bring into the conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4639.946,
    "end": 4641.066,
    "text": "Yes, totally agree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4641.126,
    "end": 4643.688,
    "text": "Like here's our happy scientist.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4644.428,
    "end": 4650.151,
    "text": "Don't know if there's a better icon to represent the scientist, but right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4650.411,
    "end": 4651.812,
    "text": "They're going to be observing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4652.792,
    "end": 4655.614,
    "text": "They're the ones who are making all of these observations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4656.534,
    "end": 4656.914,
    "text": "And it's...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4658.911,
    "end": 4664.279,
    "text": " It's somewhere between misguided to dangerous when it's like, well, this is simply how it is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4664.299,
    "end": 4669.427,
    "text": "It's like, well, no, there's the smiley guy who's projecting that, who's modeling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4669.767,
    "end": 4670.588,
    "text": "Model-based science.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4671.189,
    "end": 4672.511,
    "text": "Science as a social praxis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4673.172,
    "end": 4674.234,
    "text": "Humans doing science.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4676.223,
    "end": 4677.865,
    "text": " This is really important to keep in mind.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4678.926,
    "end": 4684.09,
    "text": "Otherwise you might have a smiley and a frowny, and then they're debating two different stories.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4685.051,
    "end": 4689.676,
    "text": "And one is actually talking about the FC and one is the EC and one's debating the niche.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4689.756,
    "end": 4697.663,
    "text": "And you could have all these different perspectives and they don't have a common Rosetta Stone to actually come together.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4698.544,
    "end": 4702.525,
    "text": " And some people are just talking about what happens in principle, no reference to a data set.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4702.585,
    "end": 4707.287,
    "text": "Someone else is talking about an empirical correlation coefficient from a specific data set.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4708.287,
    "end": 4710.708,
    "text": "So yes, Steven, then Blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4712.968,
    "end": 4715.569,
    "text": "Yeah, this is very helpful to map it out like this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4715.789,
    "end": 4724.812,
    "text": "And it sort of gives a sense of this journey of functional connectivity, functional to effective.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4725.572,
    "end": 4725.832,
    "text": "And I'm",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4726.576,
    "end": 4749.323,
    "text": " wondering whether we the the process has evolved even further to affective connectivity um in the sense of like alice could ring up bob and say hey bob hey i'm feeling good tonight it's been a great day okay bob's like okay i'm feeling good hey i'm gonna brush my teeth",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4750.886,
    "end": 4773.897,
    "text": " Um, so, um, the, the, there's a, the, and, uh, I'm, I'm a bit more motivated to be into that big book that I really am not, wasn't so interested in before, but I know Alice likes, you know, so there's a, is that, is that kind of that extension, something that's almost could be charted here from functional to effective to affective.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4776.659,
    "end": 4776.799,
    "text": "So.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4779.753,
    "end": 4780.694,
    "text": " It's a good question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4780.734,
    "end": 4787.878,
    "text": "We can imagine this little variable because again, we're not in the territory, we're on the map.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4788.639,
    "end": 4808.532,
    "text": "If this variable is Bob's affect and Bob's affect has an edge that is influencing how likely Bob is to undertake the policy selection of calling Alice, then yes, there is an effective edge or a connectivity between the variable corresponding to Bob's affect",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4809.577,
    "end": 4815.958,
    "text": " and then the policy of what to say, and then continue onwards.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4816.038,
    "end": 4820.799,
    "text": "But not every single piece is explored here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4820.819,
    "end": 4822.74,
    "text": "But yes, affects can enter the picture.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4823.32,
    "end": 4830.942,
    "text": "And that's what's so fun and exciting about these incredibly composable and flexible models like Active Inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4831.462,
    "end": 4832.562,
    "text": "So Steven at the EnBlue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4834.875,
    "end": 4852.306,
    "text": " This also, you know, sort of harking back to that earlier question about social sciences and other sciences, this actually does provide a useful way to have a construct to look even at arts and the sort of relationship people be having.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4852.466,
    "end": 4864.353,
    "text": "So as you may be thinking about, as people think about narratives and stories, as well as, okay, what is explicitly happening and measurable through modelling, what kinds of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4865.14,
    "end": 4892.033,
    "text": " relational dynamics might be at play and that itself could be a useful boundary object in constructing co-creation work because you're starting to get some sort of framework again provided you get some of the minimal constructs clear so that it doesn't just become noise thanks blue",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4894.423,
    "end": 4900.769,
    "text": " So I'm also wondering about the relationship between functional connectivity and effective connectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4901.85,
    "end": 4907.374,
    "text": "And just really, I think about this always in relation to like gene expression, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4907.835,
    "end": 4911.998,
    "text": "So we observe a functional connectivity because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4912.819,
    "end": 4916.801,
    "text": " two genes are expressed in the same tissue at the same time they're both upregulated, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.062,
    "end": 4929.729,
    "text": "So this is something that Daniel and I have studied and maybe foreign to the rest of you guys, but effective connectivity also in terms of gene expression is like there's a downstream effector molecule, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4929.829,
    "end": 4934.812,
    "text": "So there's a molecule that has an effect downstream of the gene expression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4934.852,
    "end": 4942.037,
    "text": "So there's one transcription factor that diffuses through a tissue and then activates the transcription of something else, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4944.298,
    "end": 4964.432,
    "text": " And I wonder, so it's not that I think functional connectivity and effective connectivity can occupy the same space at the same time, but what is it then when there's effective connectivity, like I am the transcription factor, so I'm effectively connected to downstream genes, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4964.452,
    "end": 4964.833,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4965.453,
    "end": 4972.602,
    "text": " And so when I activate two genes at the same time, are those effectively connected to the transcription factor, but functionally connected to each other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4973.042,
    "end": 4978.669,
    "text": "Like, I wonder just if there's any degree of overlap between functional connectivity and effective connectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4979.77,
    "end": 4980.25,
    "text": "Thanks, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4981.308,
    "end": 4982.769,
    "text": " Can I ask you a question, Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4984.29,
    "end": 4989.413,
    "text": "Because I know nothing about genes, other than I wear them occasionally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4990.334,
    "end": 5000.341,
    "text": "Do genes automatically go to the place of affording us certain things as an effect, or can genes...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5001.181,
    "end": 5003.522,
    "text": " be an affordance as a cause?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5003.542,
    "end": 5014.205,
    "text": "Because it sounds to me knowing nothing about genes that you're describing, that you're saying that genes can also be a cause, which I think would be really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5015.165,
    "end": 5019.986,
    "text": "But I'm not sure if that's I don't know, like, is it is gene only an effector?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5020.426,
    "end": 5023.107,
    "text": "Or is gene also an affordance around cause?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5024.585,
    "end": 5033.649,
    "text": " So genes can be causes, especially like genes, like transcription factors, what I was mentioning earlier, a transcription factor just like activates the transcription of other genes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5033.709,
    "end": 5035.29,
    "text": "That's like what it, that's what its job is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5035.75,
    "end": 5042.773,
    "text": "So, and it's something that happens like very normally during the processes of development and the transcription factors diffuse along axes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5042.813,
    "end": 5050.337,
    "text": "And then it, you know, causes like a cascade of, you know, developmental gene expression timing that happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5051.877,
    "end": 5066.422,
    "text": " So if it can be both a cause and effect, are you saying that it has, whether we measure it traditionally with a timestamp, that it in effect has a built-in affordance for time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5066.522,
    "end": 5080.446,
    "text": "Is that, because it sounds fascinating if it's true, because I said, I don't know anything about this, but if that's the case, maybe some of the traditional ways that we measure change have to be reviewed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5082.654,
    "end": 5084.016,
    "text": " So, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5084.116,
    "end": 5088.421,
    "text": "Let me see if I can understand your question fully.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5088.481,
    "end": 5096.69,
    "text": "So in the process of development, there are specific genes that are expressed in specific tissues at specific times that aren't expressed any other time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5097.211,
    "end": 5100.815,
    "text": "So in that way, it could, I guess, mark time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5100.875,
    "end": 5102.036,
    "text": "Is that kind of what you're asking?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5102.136,
    "end": 5102.357,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5104.235,
    "end": 5108.762,
    "text": " Yes, genes as kairos is a very interesting idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5108.802,
    "end": 5113.649,
    "text": "Like there are certain critical periods where developmental factors are expressed in sequence.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5114.23,
    "end": 5117.856,
    "text": "But let me also respond to the comment about what Blue said about genetics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5119.514,
    "end": 5122.498,
    "text": " Unsurprisingly, genetics uses a different ontology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5123.059,
    "end": 5128.446,
    "text": "They use a different ONFT actually, ontology, narrative, formal documents and tools than neuroscience.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5129.187,
    "end": 5135.596,
    "text": "So when people in genetics are describing functional connectivity or functional interactions,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5136.437,
    "end": 5137.237,
    "text": " call those connectivity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5138.057,
    "end": 5142.458,
    "text": "Usually for cellular biologists, function is equivalent to mechanism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5143.098,
    "end": 5148.059,
    "text": "And so a functional connection would be like a mechanistic physical linkage.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5148.679,
    "end": 5157.461,
    "text": "So two proteins that bind, that's called a protein-protein interaction, or like DNA protein binding, like the transcription factor example that Blue mentioned.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5157.921,
    "end": 5161.942,
    "text": "So that is often what is meant by functional connectivity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5162.902,
    "end": 5175.218,
    "text": " Effective connectivity I don't think is used that much, but if it were, it would be used informally to describe the effect of one on another mechanistically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5175.979,
    "end": 5178.062,
    "text": "Probably not in this time series at all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5178.883,
    "end": 5193.116,
    "text": " perturbation framework and this is one of the most fascinating areas like people talk about gene networks or gene regulatory networks but there are multiple kinds of networks that you can make you can make networks of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5195.047,
    "end": 5196.348,
    "text": " proteins that bind to each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5197.188,
    "end": 5201.872,
    "text": "You can make networks of proteins that are co-expressed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5202.252,
    "end": 5209.858,
    "text": "So they have correlated expression patterns, which is functional connectivity, but that doesn't mean that they're functionally related.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5210.359,
    "end": 5216.223,
    "text": "There could be one factor or a cellular scenario that causes two genes to be upregulated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5216.583,
    "end": 5219.306,
    "text": "So they're going to appear in the same co-expression group.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5220.486,
    "end": 5223.469,
    "text": "And therefore a neuroscientist would say that they're functionally connected.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5224.847,
    "end": 5232.969,
    "text": " a biologist might jump to say there's a functional relationship or, oh, there's a gene ontology enrichment of this co-expression module.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5233.269,
    "end": 5237.491,
    "text": "So there's some sort of functional relationship, but it's being used in a slightly different way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5238.431,
    "end": 5247.453,
    "text": "And wouldn't that be fun to have shared ontology for systems that ultimately are related like gene expression and neurophysiology?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5248.274,
    "end": 5249.334,
    "text": "So blue and then Steven.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5250.566,
    "end": 5252.128,
    "text": " Okay, let me just respond to that really quickly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5252.208,
    "end": 5257.555,
    "text": "Okay, so take my gene expression comment aside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5258.316,
    "end": 5259.238,
    "text": "Let's go back to the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5259.638,
    "end": 5263.624,
    "text": "So say there are two neurons that light up at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5263.904,
    "end": 5265.126,
    "text": "They're not connected, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5265.766,
    "end": 5272.572,
    "text": " So that is a functional connection between those two neurons or brain regions, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5272.933,
    "end": 5275.855,
    "text": "But let's just use neurons for the sake of simplicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5276.316,
    "end": 5280.119,
    "text": "So two neurons that light up at the same time, they're functionally connected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5280.539,
    "end": 5286.985,
    "text": "Now, one neuron that lights up and then touches another neuron and tells it to light up, that's an effective connection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5287.205,
    "end": 5287.766,
    "text": "Is that correct?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5289.102,
    "end": 5304.752,
    "text": " Yes, or if you had a hidden third neuron with a time delay and it influenced one in one time step and it took two time steps to get to the second one, you would see an effective connection between the two that you measured because the second one would always get activated after the first one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5305.192,
    "end": 5318.281,
    "text": "And so that's the challenge with interpreting effective connectivity as a mechanistic story when actually a whole diversity of mechanisms can give rise to the observed empirical effective connectivity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5319.008,
    "end": 5320.629,
    "text": " Okay, but wait, so here's my question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5320.669,
    "end": 5324.971,
    "text": "Like I'm trying to see if there's any overlap between this functional and effective connectivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5324.991,
    "end": 5332.455,
    "text": "So say I have one neuron that touches two neurons and tells those two neurons to light up at exactly the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5333.115,
    "end": 5345.342,
    "text": "Is that effective connectivity between the original neuron and the two neurons that light up subsequently and then functional connectivity only between those two neurons that light up at the same time but are not touching?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5345.402,
    "end": 5347.083,
    "text": "Is that correct to think of it that way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5347.483,
    "end": 5353.689,
    "text": " Yes, the two children would have functional connectivity because they have a temporal correlation between remote events.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5354.149,
    "end": 5361.175,
    "text": "However, they would not have an effective connectivity because activity in one would be conditionally independent upon activity in the other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5361.776,
    "end": 5367.3,
    "text": "And then from the point of view of that parent neuron, it would not have functional connectivity",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5368.061,
    "end": 5374.245,
    "text": " because let's just assume that it spikes and then the next time step, it's not spiking and the children are.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5374.745,
    "end": 5379.148,
    "text": "So it wouldn't have a temporal correlation in its activity at a lag of one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5379.388,
    "end": 5390.475,
    "text": "It gets a little bit more complex when we're talking about time lag models, but it would have effective connectivity through time because it is like a directed edge influencing them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5390.495,
    "end": 5390.555,
    "text": "And",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5392.356,
    "end": 5399.686,
    "text": " functional and effective are independent of the anatomical connectivity, which is what you'd find out with a microscope without taking any measurements.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5400.668,
    "end": 5402.931,
    "text": "So there's no overlap between these two categories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5403.612,
    "end": 5408.579,
    "text": "There are situations where they can be high for both or they can be low for both.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5410.126,
    "end": 5416.688,
    "text": " And there can be anatomical connectivity and functional or effective or any combination.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5417.148,
    "end": 5426.27,
    "text": "It's like for two nodes, there's like a tuple of how strong that edge is functionally, effectively, and anatomically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5426.81,
    "end": 5427.87,
    "text": "And it could be one, one, one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5428.23,
    "end": 5430.111,
    "text": "It could be negative one, one, negative one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5430.151,
    "end": 5431.051,
    "text": "It could be anything.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5431.911,
    "end": 5437.433,
    "text": "So I'm trying to think of a circumstance where something can be functionally and effectively connected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5437.733,
    "end": 5438.673,
    "text": "How is that possible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5439.798,
    "end": 5448.506,
    "text": " So there would be like two cryptocurrencies who over the year time scale have both gone up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5448.806,
    "end": 5452.089,
    "text": "So at the course graining, they have a positive correlation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5452.39,
    "end": 5453.671,
    "text": "That's the functional connectivity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5454.512,
    "end": 5463.039,
    "text": "And they have a day-to-day correlation in their movements such that one moving leads the other that day.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5464.085,
    "end": 5470.668,
    "text": " So then they'd have an effective connectivity on the short timescale because through time changes in one caused the same direction of changes in the other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5471.388,
    "end": 5473.929,
    "text": "And when you zoom out, they have a broad scale correlation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5478.331,
    "end": 5478.631,
    "text": "Got it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5478.731,
    "end": 5483.133,
    "text": "So depending on the timescale, they can be functional or effective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5484.904,
    "end": 5485.204,
    "text": " Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5485.384,
    "end": 5498.736,
    "text": "And this is like where it does matter exactly how there's not just one way to do a time series correlation because a time series correlation can be just like an ARIMA model can have different time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5500.441,
    "end": 5528.923,
    "text": " horizons so one can look at the temporal correlation like let's just say you had two um out of phase oscillators if you had a time horizon of one they would have very strong negative correlation but if you had very very long time windows they would have about the same average so you'd think that they were uncorrelated for example so time series correlations extremely depend on the specifics of how it's calculated which brings us back to model-based science",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5530.021,
    "end": 5534.043,
    "text": " and a W for the instrumentalists over the realists.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5534.743,
    "end": 5556.271,
    "text": "And that's why Benny is saying like, yeah, don't get too concerned about whether we're finding cyclic or directed acyclic models, because those are just modeling conveniences that are downstream of the experimental setup and the measurements and the quantification techniques.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5556.631,
    "end": 5558.152,
    "text": "So let's focus on that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5559.147,
    "end": 5568.291,
    "text": " And we'll see that we're engaged in different flavors of the scientific endeavor and ones that include humans and all the ways that they work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5569.132,
    "end": 5574.674,
    "text": "And that just trying to look at that distilled kernel of like, well, the coefficient is 0.7.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5575.094,
    "end": 5587.32,
    "text": "So it's a module that is a metaphysical conclusion or an ontological conclusion being drawn from a methodological process that might be unwarranted.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5597.378,
    "end": 5598.739,
    "text": " So in our, oh yeah, Stephen, go for it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5599.219,
    "end": 5608.306,
    "text": "Yeah, so if we were to take between these two, and I think this has really helped clarify, because yeah, I think you're right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5608.666,
    "end": 5614.81,
    "text": "These words are possibly open to some confusion at first.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5615.51,
    "end": 5624.737,
    "text": "If we were to take brain scanning, which is essentially you've got the, you know, you can have electrical signals, which aren't very easy to identify, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5625.796,
    "end": 5630.577,
    "text": " where they're coming from, that you can get a good sense of temporal fidelity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5631.398,
    "end": 5636.719,
    "text": "And then you've got fMRI, which tends to be a bit more over time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5636.739,
    "end": 5646.062,
    "text": "Kristen has been bringing that to the table, the idea that, well, what's the more general function at play?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5646.542,
    "end": 5654.525,
    "text": "And what's the type of spatially understood changes happening?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5655.575,
    "end": 5676.927,
    "text": " over that temporal depth, whereas the effective connectivity might be more like, what can we effectively say changes between this and this for a more specific, definitive timescale?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5676.947,
    "end": 5682.631,
    "text": "Would that be one way that you're talking about the methods influencing which types of models are relevant",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5683.607,
    "end": 5710.687,
    "text": " um that would tie into that yes awesome point about um sensor fusion as well as the differences between fmri and m and eeg so eeg is on the surface of the scalp although you can also take electrical measurements within the scalp it's on the surface and it has extremely fast temporal resolution like many many times per second",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5712.014,
    "end": 5715.059,
    "text": " and it's localized and it's measuring electromagnetic activity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5716.374,
    "end": 5734.241,
    "text": " fMRI has a very different spatial and temporal resolution, and it's measuring something different, which is the blood oxygenation dependent signal inside of the brain, which is related to the hemodynamics and the metabolic activity of brain regions and the vasculature.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5734.701,
    "end": 5735.981,
    "text": "So they're measuring different things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5736.982,
    "end": 5741.884,
    "text": "That's why it's so important that in act-inf style models,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5742.964,
    "end": 5750.272,
    "text": " that we clarify what our observations are and what the hidden states are that we're doing inference on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5751.093,
    "end": 5755.098,
    "text": "And so one of the ways that sensor fusion happens in SPM",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5757.129,
    "end": 5768.837,
    "text": " So what's being described here as multimodal integration of the EEG and the fMRI is there's a latent unobserved variable, which is the neuronal activity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5769.437,
    "end": 5781.666,
    "text": "And then that neuronal activity at a given voxel is going to have an edge that outputs fMRI measurements, and then another edge that measures EEG outcomes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5782.642,
    "end": 5794.927,
    "text": " And then what's happening with that unobserved variable is being fit based upon the jointly measured fMRI and EEG.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5795.627,
    "end": 5808.992,
    "text": "So it's not just like you take a big time series and do descriptive statistics, but rather you use this hidden state, and that's what allows the generative modeling of brain activity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5810.049,
    "end": 5815.293,
    "text": " because you're fitting the hidden state, which gives rise to observations, which can be of totally different types.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5816.875,
    "end": 5820.558,
    "text": "So it is an awesome thing to explore.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5820.578,
    "end": 5827.804,
    "text": "I hope we can continue to delve into this type of like sensor fusion and what these Bayesian graphical models actually enable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5828.244,
    "end": 5829.485,
    "text": "Dean and then Steven.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5830.803,
    "end": 5840.15,
    "text": " I'm trying to see if I can come up with ways of being able to sort of keep the effective connectivity and functional connectivity segregated before they're reintegrated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5841.091,
    "end": 5842.772,
    "text": "I don't know whether if we were to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5844.775,
    "end": 5853.32,
    "text": " We were to find ourselves out in the middle of the wilderness and come upon an anthill and suddenly out of that anthill poured a bunch of elephants the size of ants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5854.061,
    "end": 5866.108,
    "text": "Whether we would need to look at the mechanics of that or we would just be drawn into the idea that now there's these really, what was surprise and essentially,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5867.503,
    "end": 5877.89,
    "text": " ant-sized elephants, or if we saw elephants suddenly walking or ambling as though they're still the normal sized elephants, but petting as though they were ants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5878.25,
    "end": 5883.193,
    "text": "So taking the tiniest of footsteps relative to their overall scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5883.613,
    "end": 5887.476,
    "text": "I think that's where the effective connectivity and the influence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5888.885,
    "end": 5894.75,
    "text": " based on something, some of it based on priors, but essentially I want to keep the functional and the effective apart.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5894.81,
    "end": 5913.446,
    "text": "Not that they can't overlap or that our minds aren't able to make those connections, but I think each serves a purpose so that when we come up against surprisal, we know kind of what went into that, that moment or that event.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5916.121,
    "end": 5925.027,
    "text": " I'm kind of seeing the size of the animal as the year performance of the crypto, and then the day-to-day is the effective connectivity with the footsteps.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5925.627,
    "end": 5928.569,
    "text": "Yeah, the scale piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5928.609,
    "end": 5930.971,
    "text": "The scale and relativity as opposed to the sequence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5932.612,
    "end": 5933.533,
    "text": "Interesting, Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5933.553,
    "end": 5935.114,
    "text": "And then there's a question in the live chat.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5936.875,
    "end": 5939.036,
    "text": "I'm going to ask a little question with this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5939.377,
    "end": 5940.838,
    "text": "Again, maybe rhetorical.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5942.659,
    "end": 5945.0,
    "text": "Over the timescale of...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5947.11,
    "end": 5954.735,
    "text": " this effective connectivity, it can effectively be brain bound to some extent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5957.197,
    "end": 5973.769,
    "text": "When we have functional connectivity, it's the measure or the unit of analysis is implying something outside as being connected to that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5974.904,
    "end": 5993.157,
    "text": " or something that's a slightly more macro idea, the idea of the function that's being used to as a unit of analysis to then give a way to get purchase on temporal correlations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5993.277,
    "end": 5995.899,
    "text": "Would that seem to be fair enough?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5995.939,
    "end": 6001.663,
    "text": "And would that also possibly also then reflect the sort of journey that's happened in cognitive neuroscience?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6002.423,
    "end": 6015.446,
    "text": " and computational neuroscience, because of Kristen's work, it started to, that even in itself brought in this process of, well, what does it mean to have function?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6018.226,
    "end": 6022.047,
    "text": "Again, we want to be precise about what function means here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6022.487,
    "end": 6026.908,
    "text": "If the measurements are all brain related, then that's the nodes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6027.861,
    "end": 6031.105,
    "text": " corresponding to the variables that edges are going to be calculated within.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6031.806,
    "end": 6038.594,
    "text": "If there are measurements that are outside of the brain, then you can have functional or effective connectivity amongst those variables.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6039.255,
    "end": 6043.4,
    "text": "But we're not actually talking about function like mechanistic impact",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6044.531,
    "end": 6063.587,
    "text": " nor teleological impact in the niche which is like the function of the hammer is to nail things that's not what functional is meaning here and just to give an example of this is the awesome recent work by guillaume dumas and collaborators and so this is a toolkit that expands on this",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6064.696,
    "end": 6070.601,
    "text": " neuroimaging framework and just says, well, we're just going to concatenate those matrices.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6071.162,
    "end": 6074.805,
    "text": "Kind of reminds us of the stochastic chaos, paper 32, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6075.225,
    "end": 6079.629,
    "text": "Like when we went from having one coupled system to having the two coupled systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6080.21,
    "end": 6087.956,
    "text": "And then remember in the off diagonals, we had the effect of the two different systems on each other, the causal impact of the systems on each other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6088.803,
    "end": 6091.044,
    "text": " the effective connectivity of those systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6091.524,
    "end": 6103.849,
    "text": "And so this is hyperscanning where you have two people, or it could be a human and a computer, whatever it is, whatever the measurements you're making are the rows and columns on this matrix.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6104.729,
    "end": 6109.231,
    "text": "And then you have that matrix, the measurements at each time slice going through time, it's a tensor.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6109.911,
    "end": 6112.352,
    "text": "And then you do time series statistics on that tensor.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6113.132,
    "end": 6117.954,
    "text": "And so these connections between the two brains are not anatomical.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6118.928,
    "end": 6121.31,
    "text": " People's brains are not actually wired up that way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6122.07,
    "end": 6128.235,
    "text": "However, you could calculate the functional connectivity, which is not the function of one on the other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6128.535,
    "end": 6130.837,
    "text": "It's the temporal correlation between the events.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6131.277,
    "end": 6139.243,
    "text": "And you could also calculate the effective connectivity, which is what is the statistical impact of one variable on another through time?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6140.051,
    "end": 6144.233,
    "text": " Whether or not that's the mechanistic link is a separate question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6144.833,
    "end": 6158.98,
    "text": "And that is what was revealed with this example, was even if you hyperscan those people's brains and you say, I mean, come on, this brain region always leads this other brain region and the other person, but that doesn't mean that's the mechanistic connector.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6159.4,
    "end": 6162.121,
    "text": "It just means that it's an effective connective edge.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6162.762,
    "end": 6167.164,
    "text": "And so this toolkit and this hyperscanning approach like really demonstrate",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6167.924,
    "end": 6190.604,
    "text": " that you can have functional and effective connectivity amongst any variables that are being measured in your experiment but that's not the same thing as a mechanistic story about what's happening stephen okay actually just one thing to clarify so is that bottom diagram saying that there's both fmri and eec",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6192.764,
    "end": 6198.769,
    "text": " there's electrical and blood flow measurements happening and they've been integrated.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6199.01,
    "end": 6204.414,
    "text": "This one, so in this paper, that was the sensor fusion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6204.715,
    "end": 6210.52,
    "text": "That was the integration of multiple neuroimaging modalities, fMRI and EEG.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6210.74,
    "end": 6210.98,
    "text": "Here,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6211.661,
    "end": 6220.966,
    "text": " you could do sensor fusion hyperscanning, or you could just have EEG on each person, or you could have EEG on one person and fMRI on the other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6221.546,
    "end": 6231.911,
    "text": "You'd have to qualify what it is that you were actually measuring, but this is a general framework for multi-agent neuroimaging statistics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6232.452,
    "end": 6233.352,
    "text": "Okay, perfect.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6233.792,
    "end": 6236.434,
    "text": "So then the point I was thinking that sort of relates is",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6237.805,
    "end": 6244.751,
    "text": " I think this is a really useful point that you say about how it's not functional in some sort of teleological sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6245.112,
    "end": 6261.227,
    "text": "However, sort of hidden in the linguistic couching that's going on here, for it to be viable, not necessarily for it to be experimentally how it's done, is implicitly",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6262.333,
    "end": 6284.002,
    "text": " the effective connectivity seems to be couched on for there to be something meaningful happening or some some sort of process happening effectively a one neuron has to exert something or potentially have some",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6285.287,
    "end": 6309.068,
    "text": " direct effect okay so there's it's like a contingency that's um is present functionally it's like okay within whatever functions going on but we don't necessarily know what that is but within some sort of process there is something happening that we can infer",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6311.6,
    "end": 6334.246,
    "text": " useful is coming into play we're not saying because we know they're spatially separated we can't say for sure then or they're that's temporally hard too fuzzy we can't necessarily say they have to be connecting but functionally we're getting a feel for",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6336.553,
    "end": 6347.16,
    "text": " that this dynamic is present rather than this almost more signal based approach if there was more effective.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6347.72,
    "end": 6353.884,
    "text": "And I think that that is philosophically couched in those two words.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6357.486,
    "end": 6359.387,
    "text": "Yes, I totally hear you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6363.519,
    "end": 6367.762,
    "text": " the mathematical and the statistical definitions are the ones that are being calculated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6368.302,
    "end": 6378.189,
    "text": "So trying to read a lot into the English word and then apply that reading in to the calculation is where we get a little lost.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6378.949,
    "end": 6383.332,
    "text": "Because again, the effective connectivity, it doesn't mean that there's a mechanistic relationship.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6384.012,
    "end": 6387.495,
    "text": "You could have spatially remote neurons that have an effective connectivity edge,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6388.41,
    "end": 6395.493,
    "text": " like the example we discussed earlier, where there's a causal neuron and then it takes one time step to get to this one and two to get to the other.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6396.294,
    "end": 6401.196,
    "text": "So then those two recipient neurons are going to have an effective connectivity edge",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6402.597,
    "end": 6414.703,
    "text": " It's a hypothesis whether there's a mechanistic edge, but that's something that you can explore with science, is you can actually look at whether, then you test, well, what happens if I silence this one?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6415.103,
    "end": 6416.724,
    "text": "You go, wow, the firing pattern didn't change.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6417.324,
    "end": 6425.468,
    "text": "So I falsified or reduced the posterior likelihood of a mechanistic story that involved a mechanistic edge.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6425.848,
    "end": 6429.13,
    "text": "It doesn't invalidate the measurement of an effective connectivity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6429.95,
    "end": 6432.932,
    "text": " It just means that you have to look elsewhere for your mechanistic story.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6433.132,
    "end": 6439.596,
    "text": "You know, you shut down Bob's phone and there still is this effective connection between the brushing the teeth and the reading.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6440.137,
    "end": 6444.159,
    "text": "Well, now you look back in the system, iterated scientific modeling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6445.0,
    "end": 6446.701,
    "text": "So I just want to ask this question from the chat.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6446.841,
    "end": 6451.864,
    "text": "This will be our last question and we'll have final thoughts, but very fun and interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6451.964,
    "end": 6455.987,
    "text": "And I hope next week Majeed will join and that will be great to hear his perspective as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6456.387,
    "end": 6458.809,
    "text": "So Joseph Clark in the chat asked,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6460.066,
    "end": 6471.341,
    "text": " How do you utilize functional and effective connectivity in active inference analysis to better inform an answer to a question such as why I scored the goal, i.e.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6471.441,
    "end": 6473.144,
    "text": "how does it enrich an analysis?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6491.883,
    "end": 6492.383,
    "text": " So Dean?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6494.145,
    "end": 6498.108,
    "text": "I would need time to think about that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6498.208,
    "end": 6501.83,
    "text": "So maybe that's something I can think about and point to because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6502.941,
    "end": 6521.789,
    "text": " right now i'm trying to figure out if a gene is both a cause and an effect how is that then going to be encapsulated and partitioned because basically blue blew up my day and i'm going to need to go away and rest for a little while and think about this because if it's if it's both",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6522.709,
    "end": 6537.572,
    "text": " is their information just encapsulated is that information partially encapsulated because now it's a whole bunch of genes that are dealing with their betweenness and all of that good stuff but again again my final thought on this paper is is that i think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6538.646,
    "end": 6551.19,
    "text": " whether we keep it on the abstract level of something or partial, or whether we pull it down as he does in the paper to the actual moment of we're looking at something now in particular.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6553.05,
    "end": 6561.593,
    "text": "Now I've got to sort of go and take that off to the level of genes and see whether or not that changes exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6562.273,
    "end": 6565.194,
    "text": "It flipped my duck rabbit on a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6566.597,
    "end": 6567.698,
    "text": " I'm rolling downhill here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6567.738,
    "end": 6570.98,
    "text": "I need to take a break.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6571.22,
    "end": 6571.641,
    "text": "I agree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6571.681,
    "end": 6589.733,
    "text": "I think this is an excellent question because effective and functional connectivity, you'll find like tens of thousands of citations in the neurosciences and you'll find people talking about the applications and translational value of neuroimaging towards real life settings.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6589.753,
    "end": 6592.415,
    "text": "I'm sure there's even neuroscience of neuroimaging.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6592.537,
    "end": 6593.618,
    "text": " football or of soccer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6594.378,
    "end": 6610.149,
    "text": "So how do we actually connect all those dots and describe how specifically within an active inference framework, how do we think about these different kinds of modularity, functional, the effective, the anatomical, the informational,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6611.243,
    "end": 6612.744,
    "text": " How is that related to Markov blankets?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6613.324,
    "end": 6620.928,
    "text": "What's unique about the framing in Active Inference compared to the neuroimaging that has existed for 40 years?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6621.348,
    "end": 6626.211,
    "text": "Now, much of it was also developed by Friston, but still there's more to it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6626.571,
    "end": 6627.851,
    "text": "So I think these are great things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6627.891,
    "end": 6630.973,
    "text": "So one thing that we know we'll discuss is that question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6631.373,
    "end": 6636.696,
    "text": "How do we deploy functional and effective connectivity so that we can get better answers?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6638.203,
    "end": 6643.106,
    "text": " We also want to talk about modularity, intransitivity, and preferences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6644.287,
    "end": 6647.809,
    "text": "And let's... Stephen, and then any other last thoughts?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6647.849,
    "end": 6650.611,
    "text": "What are you excited to discuss next week?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6652.512,
    "end": 6656.255,
    "text": "Yeah, I think this is a good question to end and also start the next one.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6657.696,
    "end": 6662.139,
    "text": "I suppose one thing, this idea that this is useful is how...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6663.729,
    "end": 6688.526,
    "text": " ideas of how certain types of effective connectivity was important for scoring a goal like what was tethered to what in terms of the connectivity and where are we talking about something where what's the dynamical system the generative type of system",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6690.18,
    "end": 6692.584,
    "text": " where that involves making it happen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6693.305,
    "end": 6704.263,
    "text": "I get a sense that the functional approach is more connected to dynamical systems thinking.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6705.513,
    "end": 6717.899,
    "text": " And in comparison to the effective approach, which might be more related to how things are potentially wired up and what's first order, second order, third order effects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6718.64,
    "end": 6723.302,
    "text": "So I don't know if other people see the same, but it's helping me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6723.342,
    "end": 6725.984,
    "text": "This is really useful for me starting to think, OK, I see where...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6726.784,
    "end": 6737.97,
    "text": " bristan was sort of coming in with this question of how to address um these hidden states these hidden dynamics um these hidden causes and how",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6739.346,
    "end": 6752.402,
    "text": " By coming at it through this functional dynamic or inference approach, you could say it changes everything in some ways.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6752.482,
    "end": 6756.227,
    "text": "So it certainly means that you have to have more than one",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6757.268,
    "end": 6785.74,
    "text": " um way to understand the hidden states which is also like how the football has also got more than one way of trying to understand what it even means to score the appropriate sections being mixed with visual being mixed with auditory being mixed with tactile all these things are some things do need to effectively happen certain muscles need to happen in a certain order a certain coordinated action has to effectively happen",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6786.26,
    "end": 6787.501,
    "text": " for it to even be possible.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6787.981,
    "end": 6799.848,
    "text": "But there might be multiple dynamical, functional ways that I could also bring, purchase, and have different ways to get to the same result.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6801.489,
    "end": 6811.335,
    "text": "And again, it becomes relevant when you're trying to do the type of measurements that have been designed for a particular reason, so that you can get better.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6811.355,
    "end": 6815.278,
    "text": "You're not going to try and get at the short temporal",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 6816.929,
    "end": 6845.012,
    "text": " inferences through using fmri and and vice versa so i think that that's uh something that's quite useful great my closing thought will be studying the footballer is our football as researchers of football yeah thanks dave dean stephen blue and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6846.343,
    "end": 6847.785,
    "text": " fun to participate today.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6848.005,
    "end": 6856.934,
    "text": "And thanks a lot, Majeed, for writing this provocative paper and getting our 22 off on a good foot in acting flop.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6857.215,
    "end": 6859.277,
    "text": "So thanks everybody for listening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6859.757,
    "end": 6861.479,
    "text": "Please get involved.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6861.639,
    "end": 6863.902,
    "text": "Come join us next week or a future week if you'd like.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6864.703,
    "end": 6865.904,
    "text": "And till next time.",
    "speaker": "SPEAKER_04"
  }
]