[
  {
    "start": 22.927,
    "end": 39.295,
    "text": " hello and welcome everyone it is january 12 2022 we are here in actin flab live stream number 35.2 discussing the paper a tale of two architectures free energy its models and modularity",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 40.68,
    "end": 41.961,
    "text": " Welcome to the ACT-INF Lab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 42.481,
    "end": 48.063,
    "text": "We are an online participatory lab that is communicating, learning and practicing applied active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 48.463,
    "end": 50.644,
    "text": "You can find more information on this slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 51.545,
    "end": 57.848,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 58.068,
    "end": 61.469,
    "text": "If you're watching live, feel free to write questions in the live chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 61.969,
    "end": 64.651,
    "text": "If you're watching in replay, you can also add comments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 65.851,
    "end": 71.798,
    "text": " All backgrounds and perspectives are welcome here and we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 73.66,
    "end": 82.73,
    "text": "All of our activities in the lab are participatory, so if you would like to contribute or get involved, go to ActiveInference.org and see what is there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 84.929,
    "end": 103.556,
    "text": " Today in live stream 35.2, we're going to be having our third discussion continuing on the paper, A Tale of Two Architectures, Free Energy, Its Models and Modularity, written by Majeed Benny, who we're really appreciative is joining us today to talk and see where it goes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 104.036,
    "end": 108.398,
    "text": "So we'll get to the introduction in a second, but basically we're going to just...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 109.358,
    "end": 131.078,
    "text": " pick up on some of the threads that we opened in earlier discussions we have a few specific things written down and i'm sure we'll go many different ways with people joining and ideas coming up and questions in the live chat and all of that so we can kind of go any which way but we'll just start with the introduction and warm-up",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 131.658,
    "end": 133.319,
    "text": " So we can each say hello.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 133.539,
    "end": 137.121,
    "text": "Maybe Blue and I can just say what we're excited about for the DOT 2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 137.741,
    "end": 141.243,
    "text": "And then Majeed, it'd be awesome to hear any context for the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 142.243,
    "end": 142.943,
    "text": "So I'm Daniel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 143.244,
    "end": 144.804,
    "text": "I'm a researcher in California.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 145.605,
    "end": 151.708,
    "text": "And I didn't expect the rabbit duck to appear in DOT 1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 152.81,
    "end": 158.972,
    "text": " But I'm looking forward to continuing that and seeing how is this drawing like a scientific model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 159.672,
    "end": 167.975,
    "text": "And then what does that philosophical or conceptual paradox or ambiguity say about scientific modeling?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 168.615,
    "end": 169.035,
    "text": "So blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 170.945,
    "end": 171.385,
    "text": " I'm Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 171.405,
    "end": 173.427,
    "text": "I'm a researcher in New Mexico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.767,
    "end": 188.079,
    "text": "And I am excited to probe deeper into the relationship between agents and their environment, and also the intransitivity argument and modularity and how those kind of all fit together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.641,
    "end": 191.001,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 191.442,
    "end": 191.782,
    "text": "Majeed?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 195.025,
    "end": 195.665,
    "text": "You are muted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 195.765,
    "end": 196.606,
    "text": "And then please continue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 199.568,
    "end": 200.108,
    "text": " So, hello.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.449,
    "end": 203.09,
    "text": "You can hear me now, Arthur.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 203.171,
    "end": 204.071,
    "text": "So, I'm Majid.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 204.431,
    "end": 208.934,
    "text": "I'm an assistant professor of philosophy at Metu Middle East Technical University.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 209.135,
    "end": 215.359,
    "text": "And I'm obsessed with models and structures across science and perception and mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.699,
    "end": 226.406,
    "text": "And it's for a while that I'm engaged with this issue of applying model-based approach to science, to free energy principle and predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 226.506,
    "end": 227.527,
    "text": "And I'm very happy to be here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 227.587,
    "end": 228.888,
    "text": "Thank you very much for inviting me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 230.885,
    "end": 252.311,
    "text": " great well maybe just for like background and context what brought you to write this specific paper like recognizing modularity as an important topic and where does this fit into some of your other threads related to fep and model-based science",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 255.423,
    "end": 257.565,
    "text": " Well, that's a very good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 257.625,
    "end": 259.766,
    "text": "I'm not quite sure why.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 259.786,
    "end": 278.44,
    "text": "So one reason for focusing on modularity in this paper is that most probably it has some sort of psychological explanation because I started to learn about philosophy of mind and philosophy of cognitive science by reading this language of thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 278.7,
    "end": 281.022,
    "text": "And I think that even...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 281.562,
    "end": 298.069,
    "text": " in the earlier stages when i was when people were studying there no one was thinking that the brain is actually a syntactical engine no one was thinking that if you open up a brain or a cognitive system you actually find things that are inside the brain in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 299.61,
    "end": 305.637,
    "text": " propositional-like entities, language-like entities or syntactical engines or anything of that sort.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 305.717,
    "end": 312.686,
    "text": "But at the same time, people were believing that that perspective on how the brain works",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 313.995,
    "end": 316.317,
    "text": " have some sort of explanatory gain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 316.377,
    "end": 322.801,
    "text": "There is something that we can learn by taking that perspective on the brain and cognitive system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 323.902,
    "end": 342.734,
    "text": "Well, I think that the general idea behind applying this model-based approach to sciences is that it is the explanatory interest, explanatory as well as practical interest of the modeler, of the people who are engaged with scientific enterprise,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 344.275,
    "end": 351.037,
    "text": " provide a handle on the target system, the things that we try to explore and understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 351.237,
    "end": 365.92,
    "text": "And well, I think that when I was reading the target paper by Kirchhoff and Hippolyto, well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 369.386,
    "end": 381.259,
    "text": " What struck me as odd was that they were taking it very much for granted, of course, through very well articulated scientific and philosophical arguments that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 384.386,
    "end": 389.71,
    "text": " there is no such modularity inside the brain or cognitive system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 390.43,
    "end": 402.7,
    "text": "And I just wanted to bring the point to attention that it would be a matter of, as I said earlier, practical and explanatory goals and interests of the modeler, whether there is modularity there or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 402.8,
    "end": 404.421,
    "text": "So one thing that I",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.88,
    "end": 421.583,
    "text": " I'm going to emphasize, underline in this session is that it doesn't need to lead... I mean, this model relativity doesn't need to lead to a downright anti-realism about theories of brain and cognitive system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 421.883,
    "end": 428.345,
    "text": "I mean, model relativity is not all about taking an anti-realist attitude toward",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 429.145,
    "end": 452.42,
    "text": " brain science but at the same time so the the old goal the old project is to end up with some sort of subtler perspective on scientific realism about cognitive science and and the brain science thank you for the context welcome",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.444,
    "end": 460.286,
    "text": " Dean, if you'd like to say hello and if you have any opening shots to fire.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 462.246,
    "end": 464.247,
    "text": "I don't have any opening shots to fire.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 464.267,
    "end": 464.927,
    "text": "My name is Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 465.627,
    "end": 466.227,
    "text": "I'm in Calgary.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 466.287,
    "end": 474.99,
    "text": "I'm sorry for coming in late, but my link was sending me off into another corner of the universe, so glad I'm here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 475.31,
    "end": 477.851,
    "text": "Thanks for being here, Majito.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 477.911,
    "end": 480.951,
    "text": "Really glad that you're here to talk about this paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 481.011,
    "end": 482.812,
    "text": "I found the paper fantastic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 484.926,
    "end": 486.327,
    "text": " Pleasure is all mine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.829,
    "end": 495.632,
    "text": "So, modularity, I mean, it's in the title.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 496.773,
    "end": 511.541,
    "text": "Modularity, models, and then the free energy, and then the tale of two architectures, which was a little bit of a reference towards the tale of two densities, another active paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 512.241,
    "end": 513.862,
    "text": "So, just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 515.399,
    "end": 523.424,
    "text": " How would you reframe the argument of Hippolyta and Kirchhoff-Majid?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 523.464,
    "end": 528.127,
    "text": "And where do you think, like in 22, what can we say now that we couldn't have said in 2019?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 528.167,
    "end": 528.928,
    "text": "Well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 537.726,
    "end": 545.174,
    "text": " Well, I do not think that we could say anything more than we were saying in 2019 because all of the actual stuff was there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 545.234,
    "end": 551.522,
    "text": "I think that this is something that comes with philosophy because no information has been added.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 552.463,
    "end": 554.505,
    "text": "As a matter of fact, I just elaborated on the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 555.646,
    "end": 572.696,
    "text": " information that was there in terms of the argument from intransitivity and all of that discussion of uh causal modeling and dynamical modeling and all that so uh i don't think that any actual information has been added the only thing that has been",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 573.676,
    "end": 598.933,
    "text": " elaborated on was the emphasis on the rule of the modeler the uh which if if we insist on uh so uh as i was watching this in the previous discussion of uh of uh the same paper in active inference lab uh and uh i was so dean's discussion of the in terms of the bob alice",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 600.153,
    "end": 610.083,
    "text": " metaphor, the discussion of the perspective of the observer, the observer that is watching both Bob and Alice, interested me very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 610.143,
    "end": 619.071,
    "text": "So if I want to rephrase the discussion of the modeler in terms of information theory, we can as well start to restate that in terms of the observer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 620.332,
    "end": 622.694,
    "text": " I don't think that the point is that technical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 622.734,
    "end": 627.236,
    "text": "The point is rather philosophical than scientific or formal in terms of information theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 627.276,
    "end": 631.459,
    "text": "So no actual information has been added during these two years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 631.679,
    "end": 635.301,
    "text": "And I think that this approach is gaining momentum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 635.341,
    "end": 649.069,
    "text": "This emphasize on the rule of modeler or interpreter is leading to even more discussions in the free energy principle literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 652.048,
    "end": 653.43,
    "text": " I totally agree with that point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 653.45,
    "end": 666.266,
    "text": "And then, Lord Dean, it made me think of quantum and how the double slit experiment, kind of kicking and screaming, has taken a hundred years",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 667.446,
    "end": 678.492,
    "text": " in that one limited setting to consider the role of the observer, even though it's a really complex thing, we won't go into it, but we'll talk about quantum and FEP in a few weeks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 679.072,
    "end": 689.038,
    "text": "But that was like the anomaly that signaled, yeah, you need to take the observer into account as part of the measuring apparatus.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 689.838,
    "end": 708.906,
    "text": " very quantitative empirical observation that there was a non-negotiable or um irreducible role of the observer and then on the qualitative side the relational insight that scientists are human and science is a human activity and um that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 710.086,
    "end": 725.317,
    "text": " was not driven on empirical observations of wave and particle on a screen like the twin slit was, but it was just a sort of low-level philosophical argument that there isn't a...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 726.883,
    "end": 748.389,
    "text": " a fungible role for the observer or the modeler and so it is very interesting to see how that has started to catch on and then how does that change the way we do science when that is taken as like a starting point that there's an observer modeling the system",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 750.315,
    "end": 759.961,
    "text": " So like that was in this diagram when we started with just talking about like the functional and the effective connectivity and then the mechanism, which is kind of not either of those.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 760.802,
    "end": 769.888,
    "text": "And then it wasn't until the very end when we're like, oh, but it's the scientist projecting in to this whole model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 770.008,
    "end": 774.39,
    "text": "That's another level of how we think about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 774.43,
    "end": 778.253,
    "text": "We can't just like all be sitting around just talking about Bob and Alice, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 778.578,
    "end": 784.801,
    "text": " But then now there's going to be us with multiple perspectives looking at the scientists taking multiple perspectives on Bob and Alice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 785.361,
    "end": 790.923,
    "text": "So are we stuck in this sort of subjective infinite regress?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 791.623,
    "end": 796.145,
    "text": "How are we going to salvage cognitive realism?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 803.068,
    "end": 803.889,
    "text": "Are you asking me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 805.489,
    "end": 805.749,
    "text": "Anyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 809.151,
    "end": 832.291,
    "text": " if you have any thoughts definitely go for it i have some ideas but i i mean i prefer other how about yeah dean and then majid and then blue if you want to well one of the things that i",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 834.206,
    "end": 838.607,
    "text": " that I took away from reading your paper was",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 841.192,
    "end": 847.953,
    "text": " This is funny because typically when I pick something up, it's pretty foreign to me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 848.133,
    "end": 851.274,
    "text": "It starts out being way on the other side of a Markov blanket.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 851.934,
    "end": 858.695,
    "text": "And then I guess I somehow, I'm able to sort of get inside of it and relate it back to the things that I know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 858.815,
    "end": 861.896,
    "text": "And eventually I get a bit of a grip on it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 861.976,
    "end": 868.457,
    "text": "And then next thing you know, there's four duck rabbits spinning madly out of control on a gradient.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 870.737,
    "end": 880.163,
    "text": " But one of the things that I took away from this was, and I think I mentioned it in the point one is, are you nine o'clocking?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 880.664,
    "end": 888.229,
    "text": "When we're taking these slices in time and we're building these models, my question was, what are the specifics of that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 888.309,
    "end": 891.371,
    "text": "I mean, if we take an fMRI image,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 892.562,
    "end": 904.172,
    "text": " I know that the machine itself that's taking those slices of time isn't necessarily conscious, but it is carrying out some sort of an instantiation exercise.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 904.653,
    "end": 916.483,
    "text": "And so one of the things I wanted to kind of talk to you a little bit about, not necessarily on a quantum level, but one of the sections of your paper, which was really, really influential to me, was a section on a golden thread.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 918.314,
    "end": 944.44,
    "text": " I was hoping that perhaps within that idea of partitioning, whether it's through quantum methodology or quantum series or whatever, if you could maybe talk a little bit about that idea of what you meant by a golden thread, not just metaphorically, but maybe materially and maybe influentially, if there is such a word.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 945.1,
    "end": 947.442,
    "text": " Because that part of it really mattered to me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 947.482,
    "end": 952.805,
    "text": "And it actually got me writing a whole set of sub notes based on that section.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 952.885,
    "end": 957.248,
    "text": "So maybe you could expand on that a little bit because I think there's a lot there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 958.989,
    "end": 960.45,
    "text": "Thanks, Dean, for the great question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 960.811,
    "end": 964.193,
    "text": "So yes, we'd love to learn more about the golden thread.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 970.637,
    "end": 971.238,
    "text": "Unmute and then...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 972.396,
    "end": 974.877,
    "text": " I thought that... Very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 976.117,
    "end": 979.398,
    "text": "So if I may do a bit of advertisement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 979.879,
    "end": 988.501,
    "text": "I have been discussing this specific issue, this dog-rabbit thing, in another paper, which is published in a philosophy journal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 988.561,
    "end": 992.963,
    "text": "It is named Cognitive Penetration and Cognitive Realism, and it is published in...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 994.464,
    "end": 995.726,
    "text": " in Episteme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 995.806,
    "end": 1004.859,
    "text": "It relates this issue to the issue of theory-ladenness in philosophy of science, works of Thomas Kuhn and all that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1005.16,
    "end": 1007.283,
    "text": "So I can't... Well...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1009.867,
    "end": 1024.095,
    "text": " What I say here, so I'm also interested in the relation between FIPP and quantum theory, and I'm working on a project that relates FIPP to cubism as one of the significant interpretations of quantum mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1025.636,
    "end": 1035.484,
    "text": " In this context, I cannot... So the paper is not directly related or even indirectly to quantum mechanics and the rule of observer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1035.624,
    "end": 1050.336,
    "text": "I'd rather take some sort of... So if I wanted to state it in more technical terms, I would use Shannon's theory of information to articulate the rule of the observer a bit clearer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1050.496,
    "end": 1050.637,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1052.518,
    "end": 1063.426,
    "text": " About the question, if I understand it correctly, what happens when the picture rotates and there's a scanning or some sort of scanning is taking place?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1066.627,
    "end": 1089.358,
    "text": " whether uh so uh am i correct to understand that your question is about what happens when there is a rotation but there is no observer to uh want to work out whether it is a duck or a rabbit right yeah and the whole business of so so when we're trying to encapsulate something and you you spoke",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.758,
    "end": 1098.526,
    "text": " clearly in the paper about, we don't necessarily have to see this as a hard and fast edges kind of thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1098.566,
    "end": 1105.213,
    "text": "We can kind of appreciate that there's a certain amount of fuzziness that's actually enabling our conversation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1105.994,
    "end": 1108.317,
    "text": "And so that because the lines aren't abrupt,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1109.329,
    "end": 1118.698,
    "text": " And when we do decide to put a Markov blanket around something, it's us choosing to do that at a certain scale with a certain amount of specificity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1118.758,
    "end": 1124.824,
    "text": "And Stephen Sillett in the point one talked about, so what is available at a mesoscale?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1125.485,
    "end": 1129.729,
    "text": "So that golden thread business that what do we lasso?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1130.45,
    "end": 1132.371,
    "text": "What is that fMRI actually doing?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1133.172,
    "end": 1134.273,
    "text": " trying to entail.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1134.813,
    "end": 1138.336,
    "text": "That's what I was hoping that you could maybe tease out for us a little bit.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1138.576,
    "end": 1138.936,
    "text": "Very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1139.417,
    "end": 1147.082,
    "text": "So I can't be all clear about that, because being a philosopher, I'm a bit naive about neuroimaging and that sort of stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1147.102,
    "end": 1160.112,
    "text": "But as some sort of general insight and trivial insight from philosophy of science, I would say that it would depend on what we are trying to trace by using fMRI or any other observational device or measurement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1162.994,
    "end": 1175.38,
    "text": " The fact that we could use these measurement devices in a number of different ways, and by devices I do not only refer to actual devices but also tortical devices such as Markov blankets and that sort of stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.801,
    "end": 1185.226,
    "text": "And applying that to different scales and different levels doesn't need to mean that there is no objective fact of matter to be represented by these devices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.907,
    "end": 1196.294,
    "text": " I might be able to use different theoretical and mathematical devices to measure the space of my room.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1196.975,
    "end": 1206.243,
    "text": "I may be able to use, for example, kilometers, or I may be able to use wet noodles or something of that sort.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1208.264,
    "end": 1212.645,
    "text": " This doesn't mean that there is no fact of matter to be measured.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1212.786,
    "end": 1221.528,
    "text": "After all, we can see this picture in terms of either rabbit or a duck, but not as a dog or a cow, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1222.168,
    "end": 1225.73,
    "text": "And whether we see it as a duck or a rabbit, again, is influenced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1225.97,
    "end": 1236.553,
    "text": "So I would say that to some extent, it will depend on the original vagueness of the picture, to what extent the subjectivity, to what extent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1237.153,
    "end": 1245.516,
    "text": " can affect the perception, what we see, is a matter of the target system itself, the properties of the target system itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1245.576,
    "end": 1253.478,
    "text": "So, I mean, no matter how hard we try, we could hardly be able to see this dog or rabbit as a cow or a dog or something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.879,
    "end": 1259.901,
    "text": "But at the same time, to some extent, especially when the target system allows for some vagueness,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1261.161,
    "end": 1269.967,
    "text": " to some extent, or presuppositions or goals and intentions be around the actual situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1270.327,
    "end": 1283.916,
    "text": "And so there is some sort of constraint or moderate amount of theory-relatedness, to use a jargon by philosophers of science, that is taking place here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1284.956,
    "end": 1295.662,
    "text": " But it doesn't mean that there is no... I mean, it doesn't need to strip the target of all of its objective features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1299.284,
    "end": 1312.09,
    "text": "I'm still not sure whether I could address your worry correctly or not, because I couldn't see the point about the fMRI and neuroimaging techniques.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.75,
    "end": 1313.611,
    "text": "I guess I'm kind of...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1315.387,
    "end": 1325.87,
    "text": " I'm agreeing with the argument that you were putting forward, which is that any time we make an observation and then we drop some kind of a representation, we call that a model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1326.43,
    "end": 1333.392,
    "text": "Even in those efforts to try to be precise, we have to leave open a little bit of latitude, a little bit of wiggle room,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1334.298,
    "end": 1346.041,
    "text": " Because as you pointed out, you can have a dynamic causal model and to get into an argument of whether or not that's the appropriate model that should be an acyclic one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1347.042,
    "end": 1348.942,
    "text": "For example, that was what you were saying.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1349.382,
    "end": 1358.125,
    "text": "And that kind of gets you going down a path of arguing about which is the right tool as opposed to saying, do tools work?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1359.508,
    "end": 1360.81,
    "text": " leverage, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1360.91,
    "end": 1365.735,
    "text": "I think that's what, maybe that's what I was reading into what you were trying to say.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1366.556,
    "end": 1367.117,
    "text": "That's all.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1369.76,
    "end": 1370.441,
    "text": "Thanks, Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1371.001,
    "end": 1372.163,
    "text": "Blue, and then Majeed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1373.655,
    "end": 1380.66,
    "text": " So I think this kind of goes into what Dean was saying about scale friendly versus scale free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1381.22,
    "end": 1402.995,
    "text": "And so like with a Markov blanket and with like this, you know, denotation of a module, whether it's vertical or horizontal, a horizontal or vertical module, you know, we impute the Markov blanket on whatever scale we're trying to separate conditionally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1403.895,
    "end": 1416.038,
    "text": " So I just wanted to bring that point back in and also this idea of maybe like incomplete partitioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.878,
    "end": 1427.221,
    "text": "So, I mean, if there was a complete partition around each module, there would be like no ability to transfer information from module to module.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1428.021,
    "end": 1430.961,
    "text": "And in the brain, I mean, we do know that definitely some,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1433.835,
    "end": 1438.978,
    "text": " the pieces have to communicate to make the entire brain or it wouldn't be considered an organ.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.438,
    "end": 1443.201,
    "text": "You know, we wouldn't be able to Markov blanket, you know, these, this idea of nested Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.241,
    "end": 1448.964,
    "text": "So I don't know about this information encapsulation or, or information leakiness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1449.344,
    "end": 1455.028,
    "text": "Uh, Majida would be nice if you, um, maybe kind of, uh, unpacked that a little bit more for us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1457.169,
    "end": 1457.449,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1457.529,
    "end": 1462.052,
    "text": "The information encapsulation, uh, topic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1471.061,
    "end": 1484.843,
    "text": " So the thing is that I can't see, for some reason, I can't see you in this picture, and I have to shift to the YouTube page in order to see you, and it causes some... You can maybe go to, on the bottom bar, toggle tile view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1485.443,
    "end": 1489.104,
    "text": "There's like... I'll use that, but it's... All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1489.744,
    "end": 1491.184,
    "text": "It's for some reason.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.644,
    "end": 1496.285,
    "text": "I can see that there are pages of people, but I cannot just see your faces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1497.525,
    "end": 1500.186,
    "text": "It shows the initial D and D and B.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1501.463,
    "end": 1504.905,
    "text": " It may have to do with what countries we're all in, which is totally fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1505.305,
    "end": 1506.205,
    "text": "At least we have audio.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1507.326,
    "end": 1509.206,
    "text": "Let me try it once more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1509.867,
    "end": 1511.187,
    "text": "Oh, yes, at least we have audio.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.207,
    "end": 1513.188,
    "text": "So very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1513.308,
    "end": 1519.511,
    "text": "So, well, multi-information encapsulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1519.551,
    "end": 1524.653,
    "text": "Shall I try to explain that in terms of Bob Ali's metaphor?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1526.134,
    "end": 1526.294,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1529.468,
    "end": 1534.509,
    "text": " Yeah, information encapsulation as applied to the Bob Alice parable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1535.049,
    "end": 1535.61,
    "text": "All right, very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1535.71,
    "end": 1550.933,
    "text": "So for one thing, this information encapsulation is one of the features of Jerry Fodor's original statement of the thesis of modularity, which is quite interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.394,
    "end": 1555.795,
    "text": " flexible, a flexible thesis and model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.935,
    "end": 1576.963,
    "text": "So, for me, in the way that I see that, model relativity entails this kind of modularity, information encapsulation, because in order to have model, and again, it can be stated in terms of Markov blanket, and whether the Markov blankets are embodied or nested or not is itself another issue, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1577.543,
    "end": 1592.441,
    "text": " The very fact that we can use Markov blanket or Markovian models, it indicates that we are able to set some sort of barriers, conditional independence between internal and external spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1592.521,
    "end": 1595.564,
    "text": "So in order to state this free energy principle, there's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1597.967,
    "end": 1623.501,
    "text": " interpret these spaces in terms of active spaces and sensory spaces but at the same time it indicates that there is some sort of barrier even though if the barrier is conditional and probabilistic i do not think that for information encapsulation we need anything stronger that this kind of flexible conditional barrier between inside and outside or between different spaces",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1624.361,
    "end": 1645.217,
    "text": " And this is the point that, so when I was watching your discussion in the previous session, 035.1, I saw that this metaphor of Bob and Alice came out and there was the question of whether there is any sort of causal relation between them and whether the relation between them is any way correlated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1645.277,
    "end": 1650.521,
    "text": "So as I argued in the paper, they may be some sort of causal relation or correlation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1652.022,
    "end": 1664.915,
    "text": " which can be stated in terms of interventionist approaches, which are of course liable to other sources of criticism that we don't need to discuss right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1666.977,
    "end": 1676.583,
    "text": " I think that information encapsulation doesn't need anything stronger than the general model relativity that I tried to advertise, advocate in this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1677.164,
    "end": 1690.052,
    "text": "So the main point is that regardless of whether or not there is any kind of causal relation, actual relationship between the actions of Bob and the actions of Alice, or perhaps I have to call them",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1691.692,
    "end": 1699.235,
    "text": " Charles and Lucy in order to be more loyal to the soul of the Tale of Two Cities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1700.075,
    "end": 1707.337,
    "text": "The thing is that to the extent that the information in each unit is not available, accessible to the other unit,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1707.857,
    "end": 1710.279,
    "text": " we can speak of information encapsulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1710.939,
    "end": 1730.03,
    "text": "And when we are making models, if we can't set any kind of distinction between internal and external spaces, and if we can't, in the same way that we may not be able to set a distinction between models and their target, there wouldn't be any modeling practice, there wouldn't be any scientific activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1730.05,
    "end": 1734.133,
    "text": "On the other hand, if we are able to set a distinction between internal and external,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1734.873,
    "end": 1747.597,
    "text": " or any kind of distinction between models and their target, we would be able to state some sort of conditional barrier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1748.417,
    "end": 1751.658,
    "text": "It still doesn't indicate that there is no kind of information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1755.099,
    "end": 1761.682,
    "text": " Setting the barrier by itself doesn't show that the information in one block is not available to the other block.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1763.623,
    "end": 1771.566,
    "text": "I was fascinated by this picture when I was watching your discussion in the previous session.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1772.046,
    "end": 1783.515,
    "text": " So, in terms of the relationship between Bob and Alice, the action of Bob brushing the teeth is correlated with what Alice does in the other unit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1783.555,
    "end": 1788.099,
    "text": "But it has been assumed that the information in the unit is not available.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1788.579,
    "end": 1794.184,
    "text": "The information in Bob's unit is not available to Alice and vice versa, even though the information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.804,
    "end": 1797.225,
    "text": " may be available to us as observers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.525,
    "end": 1804.849,
    "text": "Or if we control another observer, a third person, the information might be available to her, to the observer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1804.889,
    "end": 1814.553,
    "text": "But to the extent that the information in each unit is not available to the person in the other units, I think that we can speak of some sort of partial information encapsulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1818.815,
    "end": 1819.515,
    "text": "Thanks, Feri.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1822.734,
    "end": 1848.9,
    "text": " interesting if we couldn't i just really like caught on that part about how if we couldn't make a distinction between the target system and the model between the territory and the map then it's not modeling so it's kind of like well when you kick a football does it model a parabola well it doesn't have the modeling the self model the integrated world model what everyone wants to call it such that it is just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1850.211,
    "end": 1862.926,
    "text": " the actual causal relationships that it's engaging in the world and no more whereas cognitive entities like scientists are engaging in modeling",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1864.184,
    "end": 1870.566,
    "text": " And then that means that they are able to engage in counterfactuals, in thinking through other minds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1871.626,
    "end": 1880.949,
    "text": "They are reducing their uncertainty from a partial information encapsulation view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1881.689,
    "end": 1889.531,
    "text": "And sometimes you get more information than the system has available, but other times it's radically less.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1894.827,
    "end": 1923.734,
    "text": " And so it's kind of like an application of a Markov blanket partitioning with some non-Markov concepts from philosophy of science to the scientist investigating target systems, getting partial measurements, that's their observations coming in, and then they're updating their hidden state inference about what they think is happening, the likelihood of different hypotheses, just like any active entity would.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1927.369,
    "end": 1944.288,
    "text": " Well, if I may elaborate a bit more on this, and it returns to the question of cognitive realism, I think that despite speaking of all of this model relativity, it doesn't need to lead to some sort of global or general form of anti-realism, because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1944.728,
    "end": 1958.984,
    "text": " Well, part of my activity in the past years was dedicated to developing some sort of cognitive realism that is based on FET, assuming that the practice of scientific model making is underpinned by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.665,
    "end": 1982.953,
    "text": " the dynamical interaction between scientists or groups of scientists and their environment so this kind of model relativity i mean the relation between free energy principle and model-based science is very complicated and it is not something that is directly related to this aspect of them of this paper but this paper is a piece of a larger project that has been",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1985.134,
    "end": 1999.312,
    "text": " finding its own shape in the past few years and it is about the as I say the general idea here is that in the same even though the free energy principle the theoretical framework experimental activity that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2001.254,
    "end": 2010.061,
    "text": " is embodied in the research stream that leads to the development of free energy principle is basically some sort of model-based scientific activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2010.461,
    "end": 2017.546,
    "text": "On the other hand, if we are interested in explaining scientific activity and scientific model-making, and if we are naturalists, we are interested in finding good natural...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2018.747,
    "end": 2025.433,
    "text": " explanations for that, you have to look into the underpinning natural mechanism that makes scientific model making possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.594,
    "end": 2035.262,
    "text": "And a good place to look for that is the scientific accounts of the interaction between the agent, the organism, and the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2035.942,
    "end": 2044.23,
    "text": "Because free energy principle provides a viable account of the relation between agents, or as I discussed in my more recent work, a group of agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2044.67,
    "end": 2049.919,
    "text": " which is the community of scientists and their environment, both social environment and biological environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2050.399,
    "end": 2055.047,
    "text": "We can add well-grown scientific model making in the mechanisms of free energy principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2055.087,
    "end": 2059.314,
    "text": "So the situation is quite complicated and runs in both directions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2063.291,
    "end": 2065.692,
    "text": " We like running in both directions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2068.074,
    "end": 2069.474,
    "text": "So I guess that's okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2071.596,
    "end": 2073.997,
    "text": "So we have a few different ways we could go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2074.077,
    "end": 2076.278,
    "text": "Dean or Blue, do you want to ask a question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2076.798,
    "end": 2079.28,
    "text": "Or we can go to one that we've previously written down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2081.061,
    "end": 2082.722,
    "text": "Can I ask a quick question, Daniel?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2083.162,
    "end": 2083.342,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2084.042,
    "end": 2084.263,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2084.543,
    "end": 2090.026,
    "text": "So in the point one, Blue brought up something that I'm still sort of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2091.058,
    "end": 2102.27,
    "text": " trying to untangle when she talked, she was asking about genes in particular and how it might relate to what this paper was potentially pointing to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2102.29,
    "end": 2106.995,
    "text": "At least it raised the specter around the idea of so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2108.502,
    "end": 2109.982,
    "text": " information encapsulation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2110.723,
    "end": 2125.346,
    "text": "Do we need time in order for us to be able to take a measure or put a boundary around or encapsulate or somehow mark in a Markovian way, decide where the partition is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2126.306,
    "end": 2132.888,
    "text": "And so I'm still trying to figure out whether or not we are talking about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2134.525,
    "end": 2142.608,
    "text": " a world where, because I think a world exists where there are two things going into not necessarily the same direction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2142.669,
    "end": 2147.771,
    "text": "We got one thing where we look at the world and we ask ourselves whether something was completed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2147.831,
    "end": 2149.311,
    "text": "We do a completion analysis.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2149.351,
    "end": 2154.053,
    "text": "We take an account and I think models fit nicely into that world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2154.594,
    "end": 2159.696,
    "text": "What I thought this paper raised some ideas around was",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2161.115,
    "end": 2164.257,
    "text": " is that half of the whole picture?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2164.638,
    "end": 2182.43,
    "text": "Is the other half, do models and being modular allow us to include or make sure that we have included everything that we need in order to be able to get the best sense of what's on the other side of that divide?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2182.75,
    "end": 2190.356,
    "text": "So when we're making these inferences, we can use models as a way to account for things, but are we also able to project off of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2191.198,
    "end": 2194.645,
    "text": " and sort of make better guesses, better inferences.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2195.587,
    "end": 2199.095,
    "text": "I've used the expression prediction matter expert.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2199.155,
    "end": 2201.6,
    "text": "And so I was wondering again,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2202.785,
    "end": 2209.929,
    "text": " Those words weren't exactly used in this paper, but was that part of what we were trying to sort of dig down to?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2210.069,
    "end": 2232.2,
    "text": "Is it just a matter of people use models, people's models account for things in certain ways, but they also, if we don't get too hung up on the precision of that account, they can also be sort of fuzzy and left semi-open and give us an opportunity to also be creative and decide,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2233.001,
    "end": 2237.445,
    "text": " essentially, whether or not we have enough information to make that next best guess.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2237.886,
    "end": 2239.287,
    "text": "So I was just kind of wondering about that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2242.93,
    "end": 2243.571,
    "text": "May I?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.231,
    "end": 2244.632,
    "text": "Yes, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2245.132,
    "end": 2245.773,
    "text": "All right, very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2246.193,
    "end": 2248.916,
    "text": "That's a very brilliant point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2249.356,
    "end": 2256.983,
    "text": "So it comes back to the issue of completeness of models, their accuracy, certainty, and that sort of stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2257.043,
    "end": 2258.024,
    "text": "And I completely agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2259.325,
    "end": 2274.674,
    "text": " uh it uh it has been taken for granted and i think that part of it part of this interest has been raised by richard levin's uh paper the strategy of model-based science in population biology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2275.274,
    "end": 2279.735,
    "text": " that we are making models, but the accuracy of models is very important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2279.795,
    "end": 2286.257,
    "text": "So the models have to be accurate enough to represent, to do their representational task well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2286.498,
    "end": 2290.799,
    "text": "And they have to be complete in the sense that they have to be detailed enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.279,
    "end": 2293.06,
    "text": "I think that this is a very good point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2293.12,
    "end": 2293.82,
    "text": "But look,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2294.78,
    "end": 2321.573,
    "text": " uh how much accuracy is enough i mean we can speak of completeness of models but uh absolutely complete models i think that uh i've been reading a shorter story from a northern american uh writer the on the exactitude of science or something like that which is the story of people in an empire who are trying model map makers cartographers who are trying to make maps of the empire",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2322.173,
    "end": 2323.154,
    "text": " And they are very obsessive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.194,
    "end": 2329.799,
    "text": "They want to have complete maps, but they end up with having maps that are... Oh, all right, perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2330.22,
    "end": 2330.62,
    "text": "Borges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2330.7,
    "end": 2332.181,
    "text": "Yes, yes, precisely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2332.221,
    "end": 2336.645,
    "text": "So they end up with having maps that are as big as the empire itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2336.785,
    "end": 2347.073,
    "text": "So... And it's completely true that Levin's too speak of accuracy and detailedness of models, but then again...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.624,
    "end": 2366.814,
    "text": " More details are not necessarily leading to better models because accuracy works only in combination with some other virtues such as generality and precision of prediction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.874,
    "end": 2375.301,
    "text": "So the other question is that how to find, how to strike the right balance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2376.963,
    "end": 2381.745,
    "text": " between generality on one hand and accuracy and precision of models on the other hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2382.346,
    "end": 2390.409,
    "text": "And I'm tempted to say that I understand that I'm just trying to point to the same direction to speaking of the rule of models, scientific models and model making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2390.469,
    "end": 2392.851,
    "text": "But then again, how much precision and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2394.031,
    "end": 2410.988,
    "text": " accuracy have to be taken into account and have to be related to uh have to put in harmony with generality again i would i'm tempted to say that it is again a matter of interest and explanatory and predictive goals of the model maker",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.155,
    "end": 2422.637,
    "text": " So I will ask a question from the live chat from Steven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2423.497,
    "end": 2438.723,
    "text": "So Steven Majeed was curious about your understanding of the relationship in which practitioners seek to apply low dimensional computational modeling with other scales of knowing in uncertain and dynamic environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2439.423,
    "end": 2443.765,
    "text": "So for example, there's the awareness and the perception of the duck rabbit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2445.003,
    "end": 2452.771,
    "text": " And then there are the affordances in our niche that go beyond just sort of a visual toy example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2453.892,
    "end": 2464.402,
    "text": "So open-ended question about what you might think about that kind of application of modeling, perhaps in a social setting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2472.179,
    "end": 2476.602,
    "text": " Do the models in the social setting need to be dimensional?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2476.622,
    "end": 2484.946,
    "text": "What if I see that in terms of the relation between dynamical causal models and DAGs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2485.086,
    "end": 2497.214,
    "text": "So, for example, I assume that DAGs could provide some sort of low-dimensional model that is capable of representing the network aspects or something like that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2500.295,
    "end": 2501.136,
    "text": "Yeah, I think that's a...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2502.622,
    "end": 2503.884,
    "text": " Good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2503.904,
    "end": 2506.568,
    "text": "I'm going to continue with that and I'll write some things down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2507.43,
    "end": 2515.062,
    "text": "All right, very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2515.303,
    "end": 2516.985,
    "text": "I'm tempted to repeat this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.079,
    "end": 2520.56,
    "text": " Well, I think that it provides a good example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2520.62,
    "end": 2527.403,
    "text": "So take the web of social relation or social events that we may want to model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2527.864,
    "end": 2536.728,
    "text": "So this provides actually a good, nice example of multi-scale or multi-scale nature of target phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2536.768,
    "end": 2545.912,
    "text": "So the social events is constituted by the relationship between people and event and environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2548.034,
    "end": 2549.838,
    "text": " Well, people are actual human beings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2550.078,
    "end": 2557.292,
    "text": "They are biological entities, constituted of people who are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2559.226,
    "end": 2570.569,
    "text": " self-organizing system, and we are able to explain people and their behavior at some level on the basis of biological facts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2570.65,
    "end": 2578.492,
    "text": "So we may be able to use some sort of modeling system that are applicable in biology or that sort of stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.512,
    "end": 2588.055,
    "text": "But at a larger scale, when we try to model the relation between different people as nodes in networks and that sort of stuff, we may need to change or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2588.715,
    "end": 2610.053,
    "text": " modeling device to i don't know devices that are good at representing a small world networks or that sort of stuff if that does make any sense i think that i just get confused by the point about low dimensionality of models in social systems but um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2612.153,
    "end": 2622.015,
    "text": " It could be a Stevenism or one way at least that I would read that would be like the maps that we make are lower dimensional than the territories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2622.615,
    "end": 2629.796,
    "text": "They have a different resolution, but also they don't consider, they're not trying to be a full inventory of every variable in the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2629.836,
    "end": 2640.838,
    "text": "Like there might be a thousand chemicals circulating in our blood, but then somebody might make a lower dimensional model with just blood sugar or two dimensional model with just cortisol and blood sugar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2642.018,
    "end": 2668.107,
    "text": " and um i think it's uh an active inference open question when we make lower dimensional models of complex multi-scale target phenomena like you addressed um it uh i mean i don't want to jump to and answer but it seems clear like that the philosophical",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2669.822,
    "end": 2690.936,
    "text": " implications of a lower dimensional map shouldn't be confused with a systems accounting of the territory because it's not the same thing and um yeah steven just followed up in the chat he just said generally how does majid see the informational or physical sense of systems",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2692.386,
    "end": 2697.629,
    "text": " Like some people talk about systems in the more ontological sense about the parts and how they're connected.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2698.37,
    "end": 2703.933,
    "text": "Other times we're talking about systems informationally, like our analysis of the measurement data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2703.973,
    "end": 2712.219,
    "text": "And so the system, like the default mode network is a connectivity pattern that isn't necessarily the anatomical connection.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2712.279,
    "end": 2718.523,
    "text": "So how do we think about these different kinds of systems and maybe where does the FEP come into play with that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2719.761,
    "end": 2720.561,
    "text": " All right, very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2722.082,
    "end": 2723.502,
    "text": "That's a very good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2723.542,
    "end": 2726.363,
    "text": "So I'm a tag-bearer structural realist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2726.523,
    "end": 2730.244,
    "text": "So I'm committed to some sort of information-theoretic ontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2730.304,
    "end": 2738.767,
    "text": "And I think that, well, and I say that I'm defending some sort of embodied informational structural realism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.847,
    "end": 2748.05,
    "text": "So when I say that I was advocating cognitive realism, it would have been more precise to say that I'm advocating cognitive structural realism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2748.51,
    "end": 2752.232,
    "text": " which is actually the title of the book that I wrote about this topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.933,
    "end": 2759.256,
    "text": "And what rule free energy principle plays in this context is a very complex rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2759.336,
    "end": 2764.439,
    "text": "So let's assume that we have the structure of scientific theories or scientific models on the one hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2764.579,
    "end": 2767.281,
    "text": "So let's assume that we have a class of models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2769.021,
    "end": 2796.85,
    "text": " or scientific models on the one hand and on the other hand we have our causal structure of the world which is our target system something that we are trying to represent by our scientific model so when I speak about a structural realism I think that it has been the official wisdom of philosophy of science for the past 15 years or so and people were trying to use different kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2797.65,
    "end": 2808.815,
    "text": " a formal vehicle such as set theory, model theory, category theory to speak of this representational relation between the class of models and the causal structure of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2811.536,
    "end": 2814.077,
    "text": "So my beef with that was that the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.097,
    "end": 2837.542,
    "text": " formal relations such as isomorphism do not contribute to strengthening realism because this formal model such as isomorphism are not informed to i mean you can use isomorphism to relate any two sets together provided that there are enough number of set members so it doesn't contribute to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2838.542,
    "end": 2867.782,
    "text": " uh realism much so what i was trying to do was to use feb free energy principle to account for the class of models and their target system in the world assuming that scientists are self-organizing system that aim at minimizing the discrepancy between their models and their targeted system in the real world so uh but it is my take i mean it is something that i'm trying to develop i won't i don't say that this is the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2869.803,
    "end": 2890.977,
    "text": " This is not the orthodox view, either in the philosophy of science community or in the FEPP community, but I think that when we speak of representation in terms of the representational capacity of models, in terms of the relation between class of models and causal structure in the war,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2892.401,
    "end": 2899.443,
    "text": " Free energy principle can play a very subtle and specific role there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2905.145,
    "end": 2917.248,
    "text": "Maybe we're in a little strange neck of the woods, but I think having scientists as real entities doing something seems at home here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2917.528,
    "end": 2917.829,
    "text": "Luke?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2922.208,
    "end": 2931.954,
    "text": " So I think you presented us with a lot of things that don't contribute to realism, but is there anything that you think does contribute to realism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2931.974,
    "end": 2942.381,
    "text": "Well, could you elaborate to this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2943.121,
    "end": 2949.265,
    "text": "I mean, because of the model relativity or because of free energy principle,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2951.017,
    "end": 2961.004,
    "text": " In terms of cognitive structural realism, what does provide evidence for the cognitive structural realist argument?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.484,
    "end": 2969.309,
    "text": "You've deconstructed that, but can you take the opposite side and provide evidence for cognitive structural realism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2969.409,
    "end": 2970.53,
    "text": "Fair enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.743,
    "end": 2998.429,
    "text": " I think that the general arguments for scientific realism in general have been always stated in some sort of no-miracle arguments, assuming that if science was not representing the structure of reality, it would be a matter of cosmic co... The empirical adequacy of science has been a matter of cosmic co...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2998.709,
    "end": 3023.641,
    "text": " coincidence so there are some sorts of uh arguments usual arguments in the philosophy of science that try to relate empirical adequacy of scientific theories to approximate truths of scientific theories right and uh structural realism just tries to model this representational relation the veracity of rep or variety veridical representational relations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3024.261,
    "end": 3026.042,
    "text": " in terms of set theory and model theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3026.422,
    "end": 3040.846,
    "text": "So in my view, it would be more realistic to consider scientists as actual human beings, constituted by flesh and blood, who aim at minimizing the discrepancy between their models and the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.246,
    "end": 3045.528,
    "text": "I would say that the evidence that I could provide for this take on realism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3049.112,
    "end": 3064.686,
    "text": " has its roots in evolutionary biology, because if we had not been successful in minimizing the discrepancy between our model and reality, we would also fail to maximize our survival.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3064.766,
    "end": 3071.753,
    "text": "So I think that I can, as a way of evidence or argument, I can try to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3072.533,
    "end": 3098.262,
    "text": " Grown the argument the usual scientific realist argument that aim to relate the empirical adequacy of science to truth of theory I can try to relate the or sectors to maximizing or survival as an evidence of or success in Minimizing the discrepancy between our scientific models and their target system the causal structure of reality",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3102.113,
    "end": 3102.353,
    "text": " Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3102.633,
    "end": 3119.902,
    "text": "That also plays into some other discussions we've been having about like the objective function of science and this sort of multi-scale nature that scientific fields, research labs and organizations and individuals are engaged in pragmatic and epistemic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3121.082,
    "end": 3132.766,
    "text": " And so in active inference, we have this scale-friendly approach, which a priori doesn't require a specific scale of analysis, which is what you brought up with Markov blankets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3133.966,
    "end": 3140.728,
    "text": "And any specific application will entail a specific scale of analysis because it's empirical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3141.308,
    "end": 3145.73,
    "text": "And so it's this one foot in both world, just like linear models are,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3146.59,
    "end": 3168.285,
    "text": " the model doesn't have a priori scale but then when we specify it we do make it specific and what's interesting about actinv is that we could think about this action and perception loop of different kinds of nested entities now definitely it's going to get complex for any nested entity and then it brings a whole other level with a strange loop",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3169.145,
    "end": 3190.152,
    "text": " and the meta modeling and the cognizer and the thinking about oneself that's like a whole another level but just a way to talk about vertically and horizontally interacting systems is an awesome start so blue and then uh either majid you could respond to what blue says or dave feel free to say hello",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3191.283,
    "end": 3198.828,
    "text": " I just wanted to compliment you on that awesome prelude to next week's discussion about modeling ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3199.369,
    "end": 3206.053,
    "text": "So it's a very interesting perspective when the modeler is the model is the modeler is the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.113,
    "end": 3206.534,
    "text": "It's a loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3209.776,
    "end": 3209.996,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3210.857,
    "end": 3213.739,
    "text": "Dave, would you like to say hello or ask anything?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3215.191,
    "end": 3218.495,
    "text": " Hi, nothing particular to ask.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3218.535,
    "end": 3219.376,
    "text": "Sorry to be late.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3219.416,
    "end": 3225.925,
    "text": "I've been marinating myself in neuropsychoanalysis for the last week and a half.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3225.945,
    "end": 3227.226,
    "text": "So that's my post.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3227.347,
    "end": 3229.029,
    "text": "I've got to an excuse for being late.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3230.799,
    "end": 3231.319,
    "text": " Fair enough.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3233.201,
    "end": 3237.344,
    "text": "So let's go to a few of the other topics that we had written down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3237.964,
    "end": 3247.491,
    "text": "So I think before we get to this more, the lift off on the post dot two, let's talk a little bit about intransitivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3248.211,
    "end": 3270.974,
    "text": " because in our discussions we had looked at intransitivity in a preference framework where intransitivity of preferences has been transformational in microeconomics for example and then there's intransitivity from a game theoretic perspective like the rock paper scissors and just strategic intransitivity which also brings us back to the population biology modeling",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3271.514,
    "end": 3283.918,
    "text": " But you were discussing intransitivity in a specific context, which is about the predictive processing architectures and models of cognitive architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3283.958,
    "end": 3289.6,
    "text": "So could you maybe unpack a little bit what is intransitivity mean in that context?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3289.68,
    "end": 3290.52,
    "text": "Who disagrees?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3291.18,
    "end": 3292.601,
    "text": "What would be different if it weren't that way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3295.575,
    "end": 3296.195,
    "text": " Yeah, sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3296.275,
    "end": 3300.319,
    "text": "So I think that the thing is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3306.562,
    "end": 3325.227,
    "text": " if we assume that there is transitivity, information could be transferred from one unit to another, we would have a serious problem in defending... I was thinking of saying something more about active inference and objective inferences, but I will put that in the background for the time being.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3325.247,
    "end": 3326.548,
    "text": "But the thing is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3327.528,
    "end": 3347.624,
    "text": " The point that I was trying to make in the paper was that all of this talk about the distinction between transitivity and intransitivity only works with regard to invoking a specific kind of model, which is no wonder because the paper is about the significance of scientific models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3347.644,
    "end": 3349.085,
    "text": "So we can defend",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3350.026,
    "end": 3355.71,
    "text": " transitivity or intransitivity of the cognitive structure, depending on the kind of modeling that we summon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3355.75,
    "end": 3366.837,
    "text": "So if we assume that the only kind of models that are allowable in the context of pre-energy principle are dynamical causal models,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3367.335,
    "end": 3373.199,
    "text": " we will end up by a straightforward rejection of modularity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3373.219,
    "end": 3383.786,
    "text": "But this doesn't need to be the case because free energy principle is not all about representing the actual causal mechanisms, neurophysiological mechanisms of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3384.226,
    "end": 3389.63,
    "text": "So this is as much about representing these neurophysiological structures as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3390.31,
    "end": 3406.665,
    "text": " the general properties of the... It is as much about representing the local significant neurophysiological mechanism as it is about explaining the relation between different units and different component counterparts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3407.205,
    "end": 3429.256,
    "text": " that are implemented in the brain so it is supposed to be a unifying theory of the brain and in some sense it may indicate that we do not need modularity enough because if we want to defend some sort of unity between different components between different parts of the structure we do not need to be able to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3429.936,
    "end": 3457.357,
    "text": " modulate the brain and the paper tries to argue the reverse that speaking of the connection between different parts in terms of mainly in terms of and again it comes back to the distinction between effective functionality and functional connectivity that you discussed very well most probably better than I would be able to in the previous session would be a matter of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3458.362,
    "end": 3481.553,
    "text": " kind of properties of the cognitive system that we aim to model by invoking free energy principle whether there are local properties of the brain or the global unifying properties of the brain and if we want to model the brain in its unity we also need to be able to speak about the connection between different parts and from the very fact that we assume that there are different parts",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3482.573,
    "end": 3505.295,
    "text": " uh it follows that we have to assume that there is some sort of encapsulation or a weak point a moderate form of modularity very interesting thank you any other thoughts on that well then i'm going to go to a hard question which is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3506.795,
    "end": 3533.998,
    "text": " what makes a model active inference is that a uh in the in the circle or out of the circles at a binary classifier is it a zero to one scale what will happen when people disagree does simply any model involving action and inference qualify as active inference um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3535.683,
    "end": 3549.012,
    "text": " We have asked it on a few previous discussions and I think we've gotten a range of answers, but it's definitely an important one to revisit from this model-based science perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3555.455,
    "end": 3561.78,
    "text": " Well, I mean, I have been defending some sort of panpsychism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3561.88,
    "end": 3566.263,
    "text": "I have been marshalling free energy principle in defense of versions of panpsychism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3566.323,
    "end": 3580.293,
    "text": "So I'm tempted to say that any kind of self-organizing system that can minimize the discrepancy between its internal models and the environment is capable of forming active inferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3582.435,
    "end": 3594.562,
    "text": " it is not directly to, I mean, it is not specifically related to this issue of model relativity, unless we assume that model relativity is quite ubiquitous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3594.622,
    "end": 3596.783,
    "text": "It is everywhere in scientific activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3596.923,
    "end": 3610.011,
    "text": "I cannot find any specific relation between that kind of panpsychist account of active inference and a specific discussion of model relativity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3615.253,
    "end": 3616.374,
    "text": " Daniel, can I ask a question?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3617.115,
    "end": 3618.295,
    "text": "Yep, Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3619.717,
    "end": 3621.378,
    "text": "Sorry, Blue, maybe you want to go first.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3621.418,
    "end": 3623.239,
    "text": "You put your hand up and I just blurted out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3623.88,
    "end": 3624.32,
    "text": "Go ahead, Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3625.041,
    "end": 3626.202,
    "text": "Okay, sorry about that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3626.242,
    "end": 3626.502,
    "text": "Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3627.303,
    "end": 3639.312,
    "text": "So at the end of the last of the last live stream, there was a question posted in the live chat about so does active and maybe this ties in with what you're just asking Daniel, does active inference?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3639.332,
    "end": 3642.855,
    "text": "What does active inference tell us about the model of the person trying to kick the ball?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3644.315,
    "end": 3658.82,
    "text": " And I'm curious about this, Majee, because you wrote another paper with a, you co-authored a paper on active inference and abduction with somebody by, if I pronounce their last name incorrectly, I apologize, Piataranin.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3659.721,
    "end": 3669.384,
    "text": "And I'm kind of curious because I think what active inference, enacting an active inference within model building and modularity is, it,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3672.219,
    "end": 3680.022,
    "text": " It gets us asking a question much like Charles Saunders Pierce would ask, if you walked in late on Bob and Alice, okay?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3681.03,
    "end": 3685.031,
    "text": " It's nine o'clock, but you're not really paying attention to the clock right now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3685.051,
    "end": 3695.255,
    "text": "You just walked into a room and there's on the other side of the one-way mirror is a subdivided two cubes, one with Bob in it and one with Alice in it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3695.295,
    "end": 3701.677,
    "text": "But you've walked in and you don't have a model yet other than the fact that you're on the other side of the curtain.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3701.717,
    "end": 3704.478,
    "text": "You don't have a smiley face or a frowny face.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3704.559,
    "end": 3705.399,
    "text": "What you have is...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3706.773,
    "end": 3729.518,
    "text": " moment where you have to ask if you're actively inferring and you're enacting this is what should I be surprised if and what should I not be surprised if as the as the as the stuff that's carrying out in Bob's room somehow is appears to not being carried out in Alice's room so",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3731.826,
    "end": 3741.132,
    "text": " I don't know that modeling can sort of segregate itself out scale free from the idea of the specifics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3741.192,
    "end": 3757.801,
    "text": "Like Pierce would say, if you walked in and into a room and somebody opposite of you had a bunch of white beans in their left hand and a bag of beans in their right hand and asked you as the person walking to the room, did these beans in this one hand come from this bag?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3758.402,
    "end": 3760.143,
    "text": "You wouldn't have enough information",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3761.499,
    "end": 3766.503,
    "text": " to be able to give a specific and clear answer to that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3766.683,
    "end": 3769.405,
    "text": "But you could start a process of modeling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3769.965,
    "end": 3780.994,
    "text": "You could start a modularity exercise to try and gather from an abductive sense what led up to this moment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3781.394,
    "end": 3786.518,
    "text": "And so I'm just kind of wondering, Majid, how you take this paper",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3788.343,
    "end": 3801.875,
    "text": " and that example and sort of tie it in with some of the other work that you've been, because I'm hoping maybe I'll talk to you after this, but maybe I would like to be able to review your active inference and abduction paper as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3802.441,
    "end": 3803.081,
    "text": " if you have time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3804.502,
    "end": 3815.25,
    "text": "Anyway, I'm just wondering what, because I think if we're looking at this from active inference and enacting, sometimes we walk in and we walk in and we have to infer based on a limited amount of information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3815.71,
    "end": 3818.472,
    "text": "And so I think that's what we're trying to do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3818.952,
    "end": 3828.699,
    "text": "We're basically saying when we walk in, do or don't be surprised if, and then whatever plays out approximately on those timescales next.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3829.912,
    "end": 3830.793,
    "text": " Do you agree?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3832.054,
    "end": 3834.956,
    "text": "Yes, I do agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3835.316,
    "end": 3843.283,
    "text": "And well, I'm very happy that you mentioned that paper because I wanted to speak about that too earlier.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3843.423,
    "end": 3848.006,
    "text": "So the thing is that, as I say, there are two phases of the same project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3848.067,
    "end": 3858.195,
    "text": "So in this project, in the project that has been stated in this tale of two architectures and in another paper, a critical artist of Markovian monism,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3858.915,
    "end": 3865.883,
    "text": " I was emphasizing the model-based, model-relative nature of active influences and activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3866.183,
    "end": 3874.052,
    "text": "But the main reason why I was getting interested in that is because of the Markov blankets, because I think that Markov blankets are also very...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3876.314,
    "end": 3894.687,
    "text": " strong and reliable modeling tools also for the general scientific modeling purposes so it is the other side of my project when i'm trying to ground scientific realism and scientific model making in active inference and free energy principles so this is the other side and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3896.248,
    "end": 3917.245,
    "text": " going back to the general arguments for scientific realism, again, a strong version of defense of scientific realism is reliant on invoking explanatory inferences by developing something that is called inference to the best explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3917.685,
    "end": 3923.27,
    "text": "And this project that you mentioned, the paper that has been written by me and Ati, and there is another paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3924.6,
    "end": 3940.733,
    "text": " we were collaborating on another paper on the same subject, aims to show that how the general explanatory inferences, how the general abduction is grounded in the process of active inferences, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3940.793,
    "end": 3949.04,
    "text": "So I think that there are two sides of the same coin and they are two intertwined, two interrelated projects, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3951.583,
    "end": 3962.054,
    "text": " Do you want to also explore the implications of that for the metaphor of Bob and Alice?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3962.734,
    "end": 3968.821,
    "text": "Do you think that it has any specific ramifications for this Bob and Alice metaphor?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3969.505,
    "end": 3973.206,
    "text": " Yeah, that's exactly what I think it does.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3973.506,
    "end": 3981.229,
    "text": "And again, it's a separate paper and another excellent insight if you get a chance to read it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3981.749,
    "end": 3992.173,
    "text": "But I think when we're trying to figure out what's effective and functional, we come into a situation looking at Bob and Alice",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3993.115,
    "end": 3996.764,
    "text": " And over time, our model grows as well, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3996.804,
    "end": 4000.874,
    "text": "And I think that's part of where my question about what is...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4001.721,
    "end": 4002.781,
    "text": " What is scale free?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4003.581,
    "end": 4008.383,
    "text": "Yes, Bob and Alice are in their cubicles and those cubes are of the same dimensions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4008.823,
    "end": 4013.524,
    "text": "And then there's a scale friendly part that kind of grows over those slices of time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4013.544,
    "end": 4023.266,
    "text": "So yes, I actually do think that it would be interesting to sort of say, when did we walk in on this Bob and Alice observation?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4024.416,
    "end": 4024.816,
    "text": " Very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4025.136,
    "end": 4045.164,
    "text": "So I would say that for the moderate, weak sense of encapsulation that is at issue in this specific paper, The Tale of Two Cities, the necessary condition is that the information in each unit is not available to the person in the other unit or in the other black.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4045.244,
    "end": 4052.507,
    "text": "So to the extent that the information about, for example, Bob brushing his teeth is not available to Alice,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4053.007,
    "end": 4062.497,
    "text": " there is some sort of weak encapsulation, and I think that it is enough for establishing some sort of moderate modulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4062.537,
    "end": 4065.82,
    "text": "But the other part, the more fundamental question about the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4068.923,
    "end": 4089.673,
    "text": " uh scale relativity and to what extent so it is some sort of scientific fact that we can choose the scale that we need on the basis of our explanatory interest so at this specific setting my explanatory interest my scientific interest was to call to to set the limits of the scale at the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4091.194,
    "end": 4095.879,
    "text": " level of the rooms of Bob and Alice, because I wanted to explain encapsulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4096.239,
    "end": 4105.088,
    "text": "So in another situation, so assume that you are an information theorist and you want to develop a general theory of communication between these two units.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4105.148,
    "end": 4111.074,
    "text": "So it is natural for you to take the point of view of the third person, of another observer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4111.174,
    "end": 4115.018,
    "text": "And then there might be another person who wants to speak about the relation between these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4115.538,
    "end": 4117.619,
    "text": " third person and the target system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4118.719,
    "end": 4126.303,
    "text": "So it might go observer all the way up and observer all the way down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4126.583,
    "end": 4131.685,
    "text": "And it would be a matter of what you are trying to do with changing the scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4131.725,
    "end": 4134.346,
    "text": "What goal do you aim to achieve?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4134.386,
    "end": 4141.009,
    "text": "So again, at some papers, I was trying to stay limited to the level of individual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4141.089,
    "end": 4142.57,
    "text": "So for example, when I wanted to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4144.432,
    "end": 4148.922,
    "text": " model, the activity of a scientist, an individual scientist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4149.002,
    "end": 4152.971,
    "text": "I was focusing on the processes of minimization of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4155.65,
    "end": 4158.553,
    "text": " predictions at the level of individuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4158.613,
    "end": 4168.123,
    "text": "But at points I wanted to model the behavior or speak about the behavior of all scientific community, assuming that scientific practice is a social act.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4168.183,
    "end": 4177.533,
    "text": "And I was, for that reason, I was trying to expand the limits of the scale and apply that to the whole community of scientists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4177.993,
    "end": 4194.669,
    "text": " or a specific group of scientists rather than individual scientists what was important for me and what i think is important is to have good and satisfactory justifications for changing the level to be able to explain clearly what was the purpose of changing the level taking it to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4195.65,
    "end": 4197.711,
    "text": " an upper level or a lower level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4197.791,
    "end": 4210.596,
    "text": "And I think that to the extent that we are speaking about encapsulation and modulation, it is justifiable to limit the module to the specific cells in which Bob and Alice are dwelling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4214.696,
    "end": 4244.134,
    "text": " So just wrote a few things down and maybe this captures it, but the free energy principle, especially as you're applying it in this embodied informational and cognitive structural realism perspective, the FEP as a theory of things is providing the conceptual continuity for modeling different complex systems, including scientists in the world and other processes as they engage in their niche.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4244.874,
    "end": 4272.926,
    "text": " And then the active inference framework, we can say, is operationalizing this imperative for persistence of different systems, and then connecting that a priori process ontology to a whole host of other patterns, motifs that we must explain in the world, like abduction in the social and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4274.161,
    "end": 4294.995,
    "text": " communication case and narrative information inference on one end of us but then on the other end we also want to have act dymph really dial in and get at exact inference in certain cases where it's like we made the fmri measurements and we kind of want to like leave philosophy",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4296.136,
    "end": 4299.898,
    "text": " in the lab and just plug and chug this pipeline.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4300.619,
    "end": 4309.684,
    "text": "And we don't want that to be a pipeline to nowhere, or we don't want the output of the pipeline to be interpreted in a fallacious philosophical milieu.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4310.605,
    "end": 4319.81,
    "text": "But at the same time, if we try to take that philosophical baggage through every step of the processor and the RAM and the GPU,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4320.771,
    "end": 4341.063,
    "text": " We get into these little nano debates, which you highlighted, which is like people arguing whether cyclic or directed acyclic graphical models have philosophical impact when they're both just models that scientists chose for different reasons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4344.99,
    "end": 4349.653,
    "text": " I have to say that you have the knack of explaining my ideas far more clearly than I can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4352.354,
    "end": 4363.86,
    "text": "Here's my next question for you, because there's multiple FEP frontiers here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4364.04,
    "end": 4370.844,
    "text": "You have the book, then there's the Markovian monism that we had earlier discussed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4371.786,
    "end": 4376.288,
    "text": " the abduction one, which we haven't gotten a chance to discuss this paper, obviously.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4377.388,
    "end": 4396.617,
    "text": "So how do you keep the information organized or assess how new papers coming in play into how you want to develop these different threads of research or determine where you can be making an impact by",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4398.038,
    "end": 4405.241,
    "text": " targeting this paper or assessing this phenomena or stepping into this, you know, 5,000 year old philosophical debate?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4409.542,
    "end": 4409.842,
    "text": "Well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4412.941,
    "end": 4417.645,
    "text": " It is very hard to explain where these ideas are coming from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4420.507,
    "end": 4431.576,
    "text": "I mean, if I could state the process in this fashion, most probably I would be able to hire someone to write a program that does this instead of doing that myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4431.677,
    "end": 4441.405,
    "text": "So I think that it is mainly a matter of intuition, although it is very ironical because philosophically I'm not...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4442.285,
    "end": 4447.65,
    "text": " someone who scores too much credit by the intuition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4448.691,
    "end": 4466.448,
    "text": "But I think that I have a general program, and as I said, I'm trying to defend some sort of moderate version of cognitive realism that tries to account for scientific representation, to ground scientific representation in the relationship between",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4468.209,
    "end": 4489.466,
    "text": " set a commodity of self-organizing agents and their environment so i think that i'm starting from the uh from the uh simpler bits so for example starting by just stating the point that scientific representation could be grounded in free energy principle and then i'm just flashing out the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4490.527,
    "end": 4518.792,
    "text": " uh other complex issues so for example one thing so as they say one thing leads to another as soon as you try to account for scientific representation in terms of free energy principle uh people point out and there have been excellent papers by excellent criticism for example by uh max jones who were pointing out this criticism that science is not an individual activity it is a social activity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4519.352,
    "end": 4544.037,
    "text": " and then i am going back to threshold the social aspects of my view so uh i think that it is again some sort of dynamical social uh process that leads to development of these ideas and then when i'm trying to deal with this social aspect uh i stumble on reading thomas coon and i see that i have to also take care of theory ladenness for example and i engage with that issue",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4544.537,
    "end": 4566.757,
    "text": " but i think that i started to work on these applying this uh model uh relativity the uh model-based nature of scientific activity to philosophy of mind since 2016 and then uh as i say one thing led to another and i'm where i am now and i'm",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4567.177,
    "end": 4581.049,
    "text": " I have no idea what impact would this project lead to, what group of people, because most probably the project is a bit too scientific for philosophers and a bit too philosophical for scientists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4581.169,
    "end": 4589.476,
    "text": "But, well, it is the only way that I know for developing my philosophical ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4593.107,
    "end": 4593.427,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4593.607,
    "end": 4595.53,
    "text": "Blue, if you wanted to raise your hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4595.63,
    "end": 4597.632,
    "text": "Otherwise, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4597.752,
    "end": 4601.557,
    "text": "Okay, Blue, then Dave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4602.278,
    "end": 4606.102,
    "text": "So I think my comment is kind of old at this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4606.543,
    "end": 4609.006,
    "text": "But really, I was just curious about...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4610.899,
    "end": 4625.749,
    "text": " linking this or under what circumstances or how can we apply this, the active inference framework to partially encapsulated systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4626.539,
    "end": 4630.563,
    "text": " And so, I mean, I think that this is, it gets into like, I guess that's the big question, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4630.663,
    "end": 4647.62,
    "text": "So always just, I would love to hear your thoughts on how information is passed from module to module, or what is this idea of mutual information, you know, in the collective panpsychism sense, like how do you think, or to what degree is it shared?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4647.8,
    "end": 4648.541,
    "text": "And can you,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4649.562,
    "end": 4659.669,
    "text": " perhaps maybe shed some light on mathematically ways that you think it would make sense to talk about partial encapsulation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4663.712,
    "end": 4671.878,
    "text": "Well, so starting from the last part, I think that mathematical representation is rather the easier part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4671.938,
    "end": 4673.799,
    "text": "So we can easily",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4675.296,
    "end": 4682.141,
    "text": " model this partial encapsulation by invoking some sort of partial isomorphism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4682.181,
    "end": 4693.528,
    "text": "So it is enough to have two sets of models and try to show that to what extent or through what relation, what subparts of these sets are related to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4695.169,
    "end": 4720.991,
    "text": " uh what subsets of the other system uh to the extent that there are significant chunks that are not related together through some sort of isomorphic relation we can retain some sort of partial isomorphism the other way i think that the more other more intuitive way of doing that is by invoking mark of blankets i think that as a matter of fact i think that uh partial encapsulation is a direct uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4721.731,
    "end": 4733.254,
    "text": " results, ramifications of invoking Markovian blankets because they are setting some sort of conditional independence between different chunks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4735.915,
    "end": 4742.737,
    "text": "Well, from the very fact that there is some sort of partial encapsulation, it doesn't follow that there is no",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4744.1,
    "end": 4761.568,
    "text": " amount of transfer of information between the chunks at all the only thing that is necessary for retaining this partial encapsulation is that at a given moment there is no actual so the only thing I think that the necessary condition and it is very minimal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4762.168,
    "end": 4772.417,
    "text": " for retaining some sort of partial encapsulation is that at any given time, information at one unit is not accessible to the observer in the other unit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4772.777,
    "end": 4775.88,
    "text": "And I think that this condition could be satisfied quite easily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4775.9,
    "end": 4786.169,
    "text": "This is why I think that some sort of partial encapsulation endures, despite the validity of Kirchhoff and Hippolyta arguments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4787.73,
    "end": 4788.751,
    "text": "Thanks, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4789.051,
    "end": 4789.712,
    "text": "And then go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4790.369,
    "end": 4797.315,
    "text": " So, so I guess this is how, how, so, so my, my question was probably backwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4797.775,
    "end": 4800.298,
    "text": "So what about how is information shared?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4800.778,
    "end": 4806.343,
    "text": "Not as how do you demonstrate information sharing as opposed to information encapsulation, encapsulation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4806.363,
    "end": 4811.067,
    "text": "Like if there's a Markov blanket, we establish conditional independence, but like what,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4811.827,
    "end": 4817.489,
    "text": " Where can we establish conditional dependence or how can we establish conditional dependence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4817.949,
    "end": 4821.51,
    "text": "That's the part that's really I'm curious about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4821.55,
    "end": 4821.81,
    "text": "Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4821.97,
    "end": 4822.19,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4822.21,
    "end": 4822.57,
    "text": "Very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4822.63,
    "end": 4830.212,
    "text": "So look, the internal and external states or the sensory and active states are related together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4830.252,
    "end": 4836.874,
    "text": "But the thing is that the observer or if you are encapsulated inside the Markov blanket, you can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4837.914,
    "end": 4862.194,
    "text": " uh infer the properties of outside only indirectly so what i was trying to do to some extent is to instead of assuming that the collective system is con is composed of mark of blankets i try to put myself inside the mark of blanket and see uh how could i get access to information that is outside the mark of blanket or inside another mark of blanket and to the extent that there is no",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4863.456,
    "end": 4868.602,
    "text": " direct relation or the information is not directly accessible at a given time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4869.703,
    "end": 4872.566,
    "text": "I think that some sort of encapsulation in use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4875.85,
    "end": 4881.938,
    "text": "It's like a cup half full, cup half empty, channel half open, channel half closed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4883.49,
    "end": 4893.833,
    "text": " It's the two extremes, complete integration, which maybe doesn't even make any sense, like a solid state drive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4893.853,
    "end": 4902.656,
    "text": "I mean, what would it even mean if all the information were connected to all the other information at the same time and just not compatible with the architectures of physical systems?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4903.777,
    "end": 4908.259,
    "text": " So interesting thought experiments though for total integration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4909.24,
    "end": 4922.106,
    "text": "And then any realized system is either going to be fully conditionally independent, entirely Markov blanketed, or there'll be some partial relation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4922.766,
    "end": 4932.431,
    "text": "And then part of the realism and instrumentalism, okay, that partial relation can be an edge like an effective or a functional connectivity edge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4933.291,
    "end": 4935.872,
    "text": " which doesn't imply a causal role.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4937.092,
    "end": 4946.616,
    "text": "It's a scientific projection, situationally defined edge that's being inferred in a specific statistics framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4947.516,
    "end": 4954.059,
    "text": "And then there are hidden states of the world of observers who are supposing causes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4955.29,
    "end": 4957.532,
    "text": " like hypotheses about how things happen in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4958.132,
    "end": 4964.197,
    "text": "And then they engage in all kinds of studies like loss of function, gain of function, blinded research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4965.158,
    "end": 4973.445,
    "text": "Those are protocols or affordances that scientists engage in to reduce their uncertainty about this hypothesis space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4975.246,
    "end": 4978.329,
    "text": "So it's a very interesting area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4979.149,
    "end": 4980.671,
    "text": "Dave, and then Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4982.152,
    "end": 4982.432,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4984.764,
    "end": 4987.506,
    "text": " It's a perfect lead-in to what I was going to ask about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4988.667,
    "end": 4994.611,
    "text": "Where you draw the boundaries, where you draw the blankets is really important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4996.192,
    "end": 5013.624,
    "text": "I like to say nasty things about Donald Hoffman, or more specifically, the way he allows himself to be portrayed as thinking that there's absolute freedom in throwing blankets wherever you want, that the boundaries are totally arbitrary, and so we are all one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5015.37,
    "end": 5020.193,
    "text": " Really, though, blanketing is a matter of what's actually happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5021.794,
    "end": 5031.641,
    "text": "Are you, Majid, familiar with Mara Beller's work on the level of actual scientific interaction?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5035.003,
    "end": 5036.404,
    "text": "Can you describe that work a little bit?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5036.484,
    "end": 5038.686,
    "text": "Mara Beller, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5038.806,
    "end": 5044.65,
    "text": "For a number of years, she was perhaps the leading historian of the early days of quantum mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5045.641,
    "end": 5057.872,
    "text": " And as she got more and more in depth into what actually was happening, there are certain papers by Bohr that are widely regarded as being totally incomprehensible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5058.743,
    "end": 5065.288,
    "text": " You go from one thing that he's saying in the paper to a few sentences later, and there doesn't seem to be any connection at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5065.388,
    "end": 5067.449,
    "text": "And people were thinking, well, what was he?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5067.65,
    "end": 5068.51,
    "text": "Had he lost it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5068.95,
    "end": 5070.912,
    "text": "Was he too tired when he gave this talk?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5071.252,
    "end": 5079.998,
    "text": "Well, she went down and tried to take sentence by sentence and phrase by phrase, asking the same question that a good drama coach asks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5081.159,
    "end": 5085.723,
    "text": "For each statement that you have to deliver, what question",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5086.906,
    "end": 5089.447,
    "text": " is that speech an answer to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5090.948,
    "end": 5106.736,
    "text": "And she found if you went through the people that Bohr was in intimate dialogue with, whether he was on their side or being driven crazy by them like Einstein, if you kept that in mind and asked, who was he talking to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5107.016,
    "end": 5108.276,
    "text": "Who was Bohr talking to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5108.937,
    "end": 5113.299,
    "text": "At each moment, everything became very straightforward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5113.379,
    "end": 5115.32,
    "text": "He was having a series of dialogues.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5116.502,
    "end": 5122.105,
    "text": " with a dozen people and just stringing one fragment of the dialogue after another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5122.146,
    "end": 5145.3,
    "text": "And I haven't read it yet, but that totally ties in with the concept of conversation theory, which was something put together in the 1960s and 70s by my teacher of cybernetic learning theory, Gordon Pask, who defines the minimum unit of consciousness as the conversation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5146.857,
    "end": 5155.638,
    "text": " and also represents each conversation, or at least each enduring conversation, as a psychological individual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5157.599,
    "end": 5174.422,
    "text": "So you have very much nested Markov blankets, you have very much the Leibnizian hierarchy and the indefinitely large or infinitely large and deep hierarchy of minds composed of minds composed of minds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5178.497,
    "end": 5184.038,
    "text": " And the way Beller presents that, that's what science is about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5185.079,
    "end": 5190.58,
    "text": "Having lots of dialogues, figuring out how they fit together, the dialogues begetting new dialogues.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5191.64,
    "end": 5205.204,
    "text": "And in Pask's sense, those conversations themselves, in the best case, become the enduring individuals, maybe the immortal individuals that make up a successful living science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5207.881,
    "end": 5212.343,
    "text": " Well, thank you very much for the input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5212.483,
    "end": 5217.826,
    "text": "I agree that the issue of choosing the scale is not arbitrary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5217.986,
    "end": 5232.533,
    "text": "So I think that earlier in the paper, I referred to the works of Rodolf Carnap and Thomas Kuhn to point out that I think that there should be some general considerations that rule over the choice of a specific scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5233.113,
    "end": 5233.794,
    "text": "This is partly",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5234.654,
    "end": 5251.094,
    "text": " uh determined by the property of the target system itself and partly by the interest of the modeler depending on what the modeler is trying to work out about the target system so i completely agree with that uh and about the collaborative and uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5252.435,
    "end": 5279.876,
    "text": " distributed so uh i don't know whether it is i'm reading too much onto what you said right now but into what you said right now but uh i'm completely on board with uh some sort of collective uh distributed take on scientific activity and this is something that i have been defending in recent papers in the previous year so uh i completely agree with that and uh well my",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5281.337,
    "end": 5299.43,
    "text": " So the point about individuals and how to define an individual or the borders of consciousness, the limits of consciousness is still very much at the center of my intellectual enterprises.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5299.47,
    "end": 5302.832,
    "text": "So this is something that I'm trying to explore more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5305.834,
    "end": 5320.542,
    "text": " And this is something that I'm thinking about these days, whether the unit of scientific activity is a region in the population of neurons in the brain of scientists or an individual scientist or a group of scientists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5321.022,
    "end": 5323.383,
    "text": "So these are all very interesting topics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5323.404,
    "end": 5324.104,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5326.065,
    "end": 5328.226,
    "text": "Thanks for the response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5329.267,
    "end": 5332.028,
    "text": "So Dean and then Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5334.051,
    "end": 5347.422,
    "text": " So, Majeed, I think what you've done is you've hit on a really important point, and that is that whenever we do isomorphism, we can sort of take an isovist stance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5347.662,
    "end": 5359.231,
    "text": "I've read a book a long time ago by the editor-author was James Brockwell, and it was called The Visual World in Memory, and what he said was is that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5360.407,
    "end": 5364.77,
    "text": " the way that we capture can be one of two types.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5365.09,
    "end": 5389.386,
    "text": "The isobist stance, that sort of isomorphism that we're outside and we're creating a representation with frames around them, or we can be spatially enveloped, which kind of ties in really conveniently with the idea of being either in the cubby hole that Bob is in or Alice is in or anybody that's within spatially enveloped within that sort of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5390.248,
    "end": 5398.274,
    "text": " entailed world, where we're sort of now the subject of whatever the walls are limiting us from being able to see.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5398.934,
    "end": 5404.818,
    "text": "And so I don't think we walk away from the idea that we can make models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5405.279,
    "end": 5413.945,
    "text": "We just have to be able to ask on a moment, especially to Blue's point, how do we make something available as opposed to keeping it",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5414.685,
    "end": 5431.477,
    "text": " sort of cleaved off or or sectioned off we have to kind of take the perspective or the view of the person who is enveloped who doesn't necessarily have that eyes of this slash model ability to nest thing and look at the world from their eyes which is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5432.418,
    "end": 5456.053,
    "text": " okay it's not what you're seeing necessarily in terms of what's on the page it's how you're entering the room with maybe not as much background and not as much as ability to step outside of all of this information and start juggling and so i think that is one of the really key points to try to remember here when we model that just because i have a model",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5456.954,
    "end": 5458.495,
    "text": " but I can take that eyes of his stance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5459.095,
    "end": 5471.062,
    "text": "Doesn't mean I am able to also remember what it was like to be the one sort of captured or enveloped by less information, but still trying to catch up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5471.483,
    "end": 5476.646,
    "text": "I think if we can hold both up at once, it's back to that minimum two things at once.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5477.166,
    "end": 5481.709,
    "text": "Don't be surprised if, do be surprised if, or active and inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5481.749,
    "end": 5485.191,
    "text": "Like I think what we're really basically saying here is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5486.169,
    "end": 5497.253,
    "text": " Bumping it up by including two things, that sort of depth perception piece, yes, it does make it more complicated or complex, but that doesn't mean it's overwhelming.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5497.373,
    "end": 5503.815,
    "text": "It gets overwhelming if you try to do, I guess, maybe seven or 10 dimensions at once, but we can bump up to two.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5505.415,
    "end": 5511.077,
    "text": "We can take the eyes of a stance, we can do the model, and we can also remember what it was like to be spatially enveloped.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5513.584,
    "end": 5532.218,
    "text": " going to get overwhelmed and surprised by the real world when the train comes at you if you don't have depth perception so it's a very interesting take dean like yes two and two is truer than one but also there's other benefits too blue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5534.375,
    "end": 5544.598,
    "text": " So just to clarify what I was talking about earlier and then add on to what Dave was saying, I want to know how to draw a partial Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5544.778,
    "end": 5552.96,
    "text": "To me, a Markov blanket represents a distinct boundary between self and other, internal and external.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5553.04,
    "end": 5556.281,
    "text": "And so how do you make this partial Markov blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5556.561,
    "end": 5561.442,
    "text": "And I like what Dave was saying or about what his teacher put forward about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5562.302,
    "end": 5565.483,
    "text": " the conversation being a unit of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5565.543,
    "end": 5569.704,
    "text": "And I am very much a scriber to panpsychism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5569.824,
    "end": 5574.766,
    "text": "I don't think that it necessarily needs to be a conversation between two humans.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5576.727,
    "end": 5586.73,
    "text": "But really, maybe fundamentally, each relationship between two objects, perhaps each relationship has then its own Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5587.17,
    "end": 5595.424,
    "text": " Like, you know, my heart and my liver have a relationship with each other that that in itself is encapsulated with a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5596.005,
    "end": 5601.353,
    "text": "And this can be attributed to any two cells or two organisms or so on and so forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5607.959,
    "end": 5608.479,
    "text": " Very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5608.7,
    "end": 5612.686,
    "text": "So by the way of an example, I completely agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5612.746,
    "end": 5621.5,
    "text": "So especially about the part that this... Well, I do not want to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5625.699,
    "end": 5647.309,
    "text": " use the term conversation because I do not know the theoretical implications very well but I think that so I used this when I started this project for example on modeling scientific activity as some sort of active inference I was thinking of individual scientists as the units of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5649.25,
    "end": 5650.272,
    "text": " scientific activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5650.312,
    "end": 5663.588,
    "text": "So an individual scientist has been enveloped by a Markov blanket and she was trying to get an access to the causal structure of the world by forming inferences from beyond the blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5663.628,
    "end": 5666.011,
    "text": "But as I worked more on this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5667.533,
    "end": 5672.577,
    "text": " I understood that the situation is becoming complex very quickly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5673.398,
    "end": 5692.075,
    "text": "Then I thought that we could put all of the scientific group or scientific community inside the Markov blanket and then try to explain their relation with the environment as the parts of a general Markov blanket by just expanding the scale that includes them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5692.695,
    "end": 5703.13,
    "text": " And then at the stage, I also told that we could also model in the same way that we could envelope the relation between two scientists inside the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5703.15,
    "end": 5707.856,
    "text": "We could just expand that and also include the artifact, the scientific object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5709.658,
    "end": 5713.139,
    "text": " experimental tools inside the community of the scientists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5713.159,
    "end": 5722.341,
    "text": "So, scientific activity is basically about the relation between scientist-scientist, human-human activity, and human-artifact relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5722.541,
    "end": 5730.762,
    "text": "And scientific activity is distributed to all of this group, which includes both human beings and artifacts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5731.362,
    "end": 5734.403,
    "text": "And then, depending on your take on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5735.724,
    "end": 5753.58,
    "text": " free energy principle, whether you are defending a representationalist stance or an inactivist stance, you can speak about the relation of this group to their environment in terms of classical representation or coupling or a hybrid view which includes both representations and coupling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5760.077,
    "end": 5760.417,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5760.937,
    "end": 5762.038,
    "text": "Very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5762.078,
    "end": 5771.521,
    "text": "Makes me think about science and technology and how the word science relates to like a lot of inference and sci and scry and all of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5771.581,
    "end": 5788.588,
    "text": "And then technology, technique, and that has a little bit more of the implications of tool deployment and finesse and measurement and the blurry line between science and technology and the who and the what and the how.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5790.615,
    "end": 5792.396,
    "text": " So it's very cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5793.096,
    "end": 5799.7,
    "text": "In our last little bit here, first, if anybody watching live has questions, we totally can address them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5800.481,
    "end": 5806.664,
    "text": "But this was the question that we left off on at the end of the 0.1 video, which was,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5810.509,
    "end": 5820.557,
    "text": " How do you utilize functional and effective connectivity in active inference analysis to better inform an answer to a question such as in football, why I scored the goal?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5821.097,
    "end": 5823.479,
    "text": "So how does that enrich in analysis?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5823.619,
    "end": 5831.065,
    "text": "Because we've talked a lot about how the chosen models deployed by scientists are goal driven.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5831.946,
    "end": 5838.311,
    "text": "And so what exactly is active inference helping us",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5839.431,
    "end": 5860.32,
    "text": " do or how is it enriching our account of a situation like scoring a goal in a sports ball game well as a philosopher i feel that i have to stay silent about this question to avoid revealing my deep ignorance of the technical aspects of how this works so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5862.539,
    "end": 5871.606,
    "text": " I mean, I have some general ideas and I can try, but I think that it would be better to stay silent and not reveal my ignorance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5873.588,
    "end": 5878.452,
    "text": "How about start it off with something ignorant and then we'll see if any other researchers have thoughts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5879.5,
    "end": 5894.441,
    "text": " Well, I do not know about this specific example, but for me, the distinction between functional connectivity and effective connectivity was about the causal, physical aspects of the target system and the general...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5896.829,
    "end": 5899.532,
    "text": " global and structural features of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5899.613,
    "end": 5915.633,
    "text": "So I wasn't thinking of this in terms of... So the point that I was trying to make, whether to try to focus on modeling the causal physical aspects or focus on the structural global aspects would be a matter of the interest of the scientist or the modeler.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5916.093,
    "end": 5921.216,
    "text": " whether at the moment or whether in order to do the task at hand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5921.756,
    "end": 5936.825,
    "text": "She prefers to stay focused on the general aspect, speaking about the relation between different parts in unifying structure terms or going into the details and trying to model local specific features.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5937.826,
    "end": 5944.53,
    "text": "I'm not quite sure how I can apply that to the example of scoring a goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5948.76,
    "end": 5950.924,
    "text": " Dean or anyone else?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5952.227,
    "end": 5954.711,
    "text": "I just think it's in the scoring the goal again.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5954.731,
    "end": 5959.28,
    "text": "Pre pre kicking the ball, you could be asking yourself two questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5960.259,
    "end": 5966.445,
    "text": " why am I surprised about the result or should I be surprised about the result?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5966.685,
    "end": 5970.068,
    "text": "Because I think that's what active inference affords.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5970.688,
    "end": 5975.232,
    "text": "It gives you that possibility of two outcomes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5975.573,
    "end": 5986.622,
    "text": "I scored a goal or I kicked it up into the stands, but before you actually kick the ball, perhaps if you're not really, really skilled at kicking a ball,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5987.577,
    "end": 5999.849,
    "text": " you can ask yourself whether or not there's enough, enough in this particular case, mechanical familiarity and background to actually finish off what you intended to do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6001.19,
    "end": 6004.373,
    "text": "That's what I think active inference allows for.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6004.413,
    "end": 6006.976,
    "text": "But again, my ignorance shines through too, so.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6009.915,
    "end": 6022.637,
    "text": " okay i'll uh give a thought so i think there's active inference and then there's functional and effective connectivity because functional effective connectivity have gone back further so first",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6024.301,
    "end": 6048.478,
    "text": " um applying the techniques of functional effective connectivity help us separate out hypotheses about physical causal mechanisms from a whole variety of different kinds of edges that might be uh applied like there's time correlation there's mutual information there's um change with respect to like you know condition on this one going up in that split second this one goes up as well so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6049.278,
    "end": 6073.298,
    "text": " all kinds of different uh edges that can be drawn essentially in a graphical framework so not just like visual but on a nodes and edges active inference gives us a i mean among other things so this of course would not be a um complete or authoritative answer but it does provide us with a a framework and a nexus and a community",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6074.389,
    "end": 6100.9,
    "text": " that can scaffold and nurture accounts of the target phenomena so kicking a goal we want to have the biomechanics researcher and the force on the knee and um physical rehab and then also there's an easy way to go into like the social intersubjectivity of the game rules and regimes of attention and thinking through other teammates and um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6102.378,
    "end": 6110.786,
    "text": " cyber physical systems of the soccer stadium and then like reviewer two just addressing the inner or outer critic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6112.02,
    "end": 6118.365,
    "text": " and knowing that we don't need to have a theory of everything to talk about the ball being kicked.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6119.145,
    "end": 6136.057,
    "text": "So I'd say that ACT-IMP specifically provides value for the researcher, the goal scoring researcher, because it will help them reduce their uncertainty about what contribution to make to the research literature by just saying like, giving really good connection points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6136.177,
    "end": 6137.578,
    "text": "If they're doing the biomechanics paper,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6138.459,
    "end": 6159.453,
    "text": " it can have awesome connection points to the cultural and the social and all of that and if they're doing the social paper it could have nice articulation with the biomechanics and that would even be before we get into the um some of the details of the active modeling per se um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6164.801,
    "end": 6178.776,
    "text": " So if anyone in the live chat would like any final questions, otherwise we will sort of cruise out, you know, in the dot zero, we do the background and it's the time that we all need to take to like work through these very",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6180.697,
    "end": 6183.998,
    "text": " provocative and interesting and far reaching papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6184.038,
    "end": 6197.743,
    "text": "And then dot one is a lot of times like a mess because we're exploring a lot of different avenues and we never finished them all in the dot two, but this is sort of where we take off into our next set of discussions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6197.863,
    "end": 6203.044,
    "text": "It happens to be that in the coming weeks, we're going to be talking about the nature of self-representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6203.464,
    "end": 6207.406,
    "text": "So that might have some themes, but Majeed, I'm just curious, like what,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6208.166,
    "end": 6221.336,
    "text": " are you excited about for 2022 what um directions or policies are like exciting to you now that you've very recently completed this work",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6222.193,
    "end": 6227.598,
    "text": " Well, I'm excited about a new book that is under review.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6227.858,
    "end": 6236.786,
    "text": "So, structural realism, as I said, was the official reason of philosophy of science for quite a while.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6237.126,
    "end": 6242.471,
    "text": "And I tried to develop a cognitive version of structural realism before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6242.571,
    "end": 6245.073,
    "text": "Now, in a new book that is going to be...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6246.154,
    "end": 6250.997,
    "text": " In a new book that is going to be published, I mean, it is a sequel to the book that you are seeing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6251.417,
    "end": 6257.081,
    "text": "In a new book that is under review right now, I'm going to flesh out the social aspects of scientific activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6257.141,
    "end": 6265.066,
    "text": "So a structuralist, despite all of their virtues, they were not too much attending, speaking about the social aspects of science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6265.146,
    "end": 6268.728,
    "text": "And I think that that aspect has been to some extent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6269.428,
    "end": 6272.512,
    "text": " neglected in the contemporary philosophy of science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6272.712,
    "end": 6280.239,
    "text": "So it had its high day in works of Thomas Kuhn and Feyerabend, and then it has been pushed into the background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6280.7,
    "end": 6287.467,
    "text": "And now I'm building upon free energy principle, so the theories of social communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6287.967,
    "end": 6298.25,
    "text": " that are grounded in free energy principle to bring back this discourse on social aspects of scientific activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6298.31,
    "end": 6306.753,
    "text": "So the book that is under review, the title is aptly called Bringing Social Awareness to Structural Realism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6306.853,
    "end": 6308.754,
    "text": "So I'm very excited about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6308.854,
    "end": 6316.516,
    "text": "I still do not know whether it will pass the review and whether it will go to the press or not, but I'm very much excited about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6320.856,
    "end": 6321.136,
    "text": " Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6323.638,
    "end": 6330.824,
    "text": "Reminds me of Bruno Latour reassembling the social, of course, different aim, but that almost feels invoked in the title.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6331.232,
    "end": 6353.571,
    "text": " Well, it is a different aim, but as I say, it has, so it is mainly about works of Thomas Kuhn and Paraben, but it also has references to the works of social constructivist Latour and others, and specifically, sorry, I have to change the place to put my laptop into the charge again, but the thing is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6356.478,
    "end": 6366.0,
    "text": " Latour was one of the main people who was complaining about this kind of dismissiveness of social aspects of scientific activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6366.54,
    "end": 6383.104,
    "text": "And I think that people who were working in distributed cognition were trying to, were actually explicitly mentioning works of Latour and some other social cognitivists to find a foothold for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6385.714,
    "end": 6389.536,
    "text": " dating cognition or knowledge as some sort of distributed social activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6390.457,
    "end": 6399.321,
    "text": "So what I try to do is to develop some sort of collective distributed account of scientific cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6399.401,
    "end": 6407.166,
    "text": "It has been something that people such as Ronald Geary have been doing before and Nancy Narcissian and some other people are doing these days.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6407.226,
    "end": 6409.527,
    "text": "But what I was trying to do is to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6410.131,
    "end": 6420.178,
    "text": " try to reinforce and reconstruct these very interesting insights by drawing on recent development in free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6420.678,
    "end": 6424.301,
    "text": "So some sort of free energy principle account of social communication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6424.881,
    "end": 6436.048,
    "text": "I'm building up on that to reconstruct classical accounts of distributed scientific cognition, which as well has its roots in works of Latour and some other social constructivists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6438.45,
    "end": 6441.394,
    "text": " So you were very sharp to spot the relation again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6442.355,
    "end": 6442.695,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6443.476,
    "end": 6446.36,
    "text": "Nice connection there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6446.44,
    "end": 6447.321,
    "text": "Looking forward to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6447.421,
    "end": 6453.228,
    "text": "Like actor network theory and distributed systems kind of makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6456.803,
    "end": 6468.151,
    "text": " Well, I think if anyone else wants to give a final thought or comment, anyone other than the author, then we'll provide the last word to the author.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6468.171,
    "end": 6470.053,
    "text": "So blue and then either Dave or Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6472.196,
    "end": 6475.118,
    "text": " This was a lot of fun thought experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6475.719,
    "end": 6477.94,
    "text": "And just thanks for your time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6478.08,
    "end": 6483.524,
    "text": "And as any good paper, it opens more questions than provides answers, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6483.664,
    "end": 6489.989,
    "text": "So I'm curious to see what your next work is and how it all unfolds in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6492.511,
    "end": 6496.814,
    "text": "Thank you very much for your contribution as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6500.957,
    "end": 6502.578,
    "text": " Dean, and then Dave, if you would like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6504.459,
    "end": 6516.308,
    "text": "Majeed, as I mentioned earlier, I hope that if in a couple months time and there's a slot where you have some availability, I would like to also look at that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6518.973,
    "end": 6544.64,
    "text": " this work that you've done around abduction and the idea of active inference as well, because I think in terms of trying to be able to cast a wider net and get a better sense of how we model and look at things through timeframes, both before, during, and after, I think that would be something that I'd like to take up because going through this paper certainly brought a lot of things to the forum.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6544.66,
    "end": 6545.66,
    "text": "It was really, really helpful.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6545.76,
    "end": 6546.6,
    "text": "So thank you very much.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6546.66,
    "end": 6547.601,
    "text": "Thank you for showing up today.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6547.621,
    "end": 6548.441,
    "text": "It was really appreciated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6549.495,
    "end": 6550.137,
    "text": " No, not at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6550.177,
    "end": 6551.88,
    "text": "Thank you very much for your interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6552.842,
    "end": 6559.837,
    "text": "I learned quite a lot too, both from participating today and from watching the previous video of the discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6562.369,
    "end": 6583.744,
    "text": " great well yep as always super fun to read and to interact with you to take it from a epistemic stigmergy interaction with your asynchronous artifact into something that is spatially remote but still interactive hashtag effective connectivity um so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6585.051,
    "end": 6586.252,
    "text": " just keep in contact with us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6586.292,
    "end": 6591.994,
    "text": "And anytime you would like to discuss more or do anything else with the lab, just be in touch and anyone else as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6592.414,
    "end": 6594.335,
    "text": "So great times.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6594.835,
    "end": 6595.436,
    "text": "Thank you, everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6595.976,
    "end": 6596.816,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6597.617,
    "end": 6603.779,
    "text": "And sorry for being a bit dizzy after teaching and this end of the semester hassle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6603.799,
    "end": 6604.94,
    "text": "So thank you very much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6604.98,
    "end": 6605.36,
    "text": "Take care.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6605.96,
    "end": 6606.281,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6606.561,
    "end": 6607.181,
    "text": "See you all later.",
    "speaker": "SPEAKER_02"
  }
]