[
  {
    "start": 3.24,
    "end": 3.72,
    "text": " Welcome, Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3.941,
    "end": 4.982,
    "text": "I'm about to play the theme song.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 33.029,
    "end": 39.614,
    "text": " hello everyone welcome to actinflab live stream number 35.0 it is january 4th 2022 so also happy new year to everyone welcome to the actinflab",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 48.735,
    "end": 54.279,
    "text": " We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 54.86,
    "end": 56.601,
    "text": "You can find us at the links here on this slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 57.702,
    "end": 63.507,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 64.547,
    "end": 70.372,
    "text": "All backgrounds and perspectives are welcome on these live streams, and we'll be following good video etiquette.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 72.938,
    "end": 90.015,
    "text": " If you go to ActiveInference.org, you can find out more about how to contribute or get involved because anyone who is curious and wants to learn more will have a niche for you and you will surely learn and create all kinds of awesome affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 90.095,
    "end": 95.52,
    "text": "So if you're curious or you want to learn by doing, please come get involved with ActInflab.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 98.271,
    "end": 118.283,
    "text": " Today in Act-Inf live stream number 35.0, we are going to be learning and discussing this paper, A Tale of Two Architectures, Free Energy, Its Models, and Modularity by Majid Beni in December 2021, but kind of published in 22.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 119.204,
    "end": 125.347,
    "text": "And just like all the other .0s, the video we're about to do is just an introduction and a discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 125.808,
    "end": 127.709,
    "text": "It's not a review or a final word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 128.329,
    "end": 141.956,
    "text": " And in fact, we're very much looking forward to the two upcoming weeks when Majeed may join us, and hopefully many of you will join us, and we're just going to have a good time, talk about the paper, what have we learned from it, and what are the implications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 142.796,
    "end": 157.044,
    "text": "Today, we're going to be more focused on the aims and claims, the abstract, the roadmap, the background, the keywords, and there aren't any figures or formalisms, but we'll go through some of the key arguments, which are very provocative and very salient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 157.965,
    "end": 162.984,
    "text": " So if you want to get involved, just get in touch and we will let you know how to participate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 163.871,
    "end": 167.173,
    "text": " Let's begin with a little bit of an introduction and a warmup.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 167.654,
    "end": 172.937,
    "text": "So feel free to say hello and maybe just one thing that made you excited to discuss this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 173.418,
    "end": 192.15,
    "text": "So I'm Daniel, I'm a researcher in California, and I was excited to read philosophical work by Benny, who always writes very interesting things and just understand how architectures of physical systems and their functional descriptions are related to the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 193.011,
    "end": 193.151,
    "text": "Dean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 195.475,
    "end": 195.875,
    "text": " Thanks, Danny.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 195.915,
    "end": 196.255,
    "text": "I'm Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.295,
    "end": 197.215,
    "text": "I'm here in Calgary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 197.275,
    "end": 201.596,
    "text": "It's really, really cold and snowy, but that's not why we're here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.377,
    "end": 210.399,
    "text": "My real question was, so what do we do about this seeming failure or attraction to the ability to categorize?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 210.499,
    "end": 212.679,
    "text": "And so the question is, do we model up?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 213.899,
    "end": 219.221,
    "text": "And yeah, so reading the paper, I kind of tried to figure out the answer to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 219.821,
    "end": 220.621,
    "text": "I'll pass it down to Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 222.927,
    "end": 238.075,
    "text": " So I like this paper from the perspective of multi-scale dimensionality and also modularity, like modules at different dimensions, the scale-free aspect of the Markov blanket or the not scale-free aspect of the Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 238.195,
    "end": 243.378,
    "text": "And anyway, I thought it was just really neat and a cool way to fit the pieces together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 245.643,
    "end": 245.963,
    "text": " Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 246.423,
    "end": 254.827,
    "text": "So we have some slide with things that we want to discuss in the dot one and the dot two and beyond.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 255.107,
    "end": 260.049,
    "text": "So at any point, feel free to add information there and we'll be writing things there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 260.269,
    "end": 261.609,
    "text": "So we're not going to get to it all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 261.71,
    "end": 263.67,
    "text": "We're not going to make this a 11 hour video.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 264.191,
    "end": 267.612,
    "text": "We'll get things down to discuss in 35.1 and two, but we can lead in with",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 271.055,
    "end": 293.796,
    "text": " the big question a big question which is how do we think about modularity of different kinds like functional effective and anatomical which we'll be discussing later in active inference and free energy principle and why does that matter why does it matter how we think about modularity of different kinds what does it mean",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 296.047,
    "end": 303.858,
    "text": " Here on this slide are some images related to just different uses of modularity, just modules like Lego bricks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 304.639,
    "end": 310.587,
    "text": "Other times modularity can refer to like part of a network that's more densely connected, like a click.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 311.428,
    "end": 322.434,
    "text": " Other times modularity doesn't refer to hot swap ability, but rather to a larger structure that's composed of smaller modules, whether they're the same or different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 323.174,
    "end": 326.516,
    "text": "It's often applied to mathematical systems or biological systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 326.556,
    "end": 329.638,
    "text": "So there's so many aspects of modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 329.998,
    "end": 336.101,
    "text": "And today we're going to be exploring what are those aspects of modularity and why does it matter for the free energy principle?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 336.822,
    "end": 340.924,
    "text": "Blue or Dean, like any thoughts on the general modularity question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 344.341,
    "end": 345.682,
    "text": " I got a quick question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 345.802,
    "end": 365.815,
    "text": "So for me, when we see these sort of images that we externalize in artifacts and that sort of thing, when I started getting into the paper, the real problem for the modularity argument is what does localized mean when we're talking about fMRI representations as the tool?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 366.436,
    "end": 370.118,
    "text": "Does a bump in electrochemical impulse mean a clearly defined border?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 371.819,
    "end": 372.48,
    "text": "I don't think so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 373.2,
    "end": 373.741,
    "text": "Of course not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 374.721,
    "end": 381.427,
    "text": " Where one bump ends and another begins all inside the same energy field might be captured through fMRI imaging.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 381.707,
    "end": 389.554,
    "text": "And is that misleading because there's no moment of stasis because the magnets inside our heads keep warring constantly?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 390.035,
    "end": 397.421,
    "text": "So that was, again, another question that I sort of tried to carry on through as I was reading what the author wrote out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 398.322,
    "end": 398.542,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 399.243,
    "end": 400.804,
    "text": "Where are we talking about modules?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 402.045,
    "end": 403.545,
    "text": " Where are we modularizing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 404.406,
    "end": 407.947,
    "text": "And does that map onto potentially realism and instrumentalism?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 409.067,
    "end": 412.888,
    "text": "Any big setting ideas, Blue, or we can continue to Ames?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 413.468,
    "end": 413.648,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 414.689,
    "end": 421.13,
    "text": "So the paper that we're discussing is by Majeed Beni, A Tale of Two Architectures, Free Energy, Its Models and Modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 422.351,
    "end": 425.372,
    "text": "And it's in the paper Consciousness and Cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 427.785,
    "end": 432.79,
    "text": " Just to go through some of the key aims and claims and then feel free to add a comment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 433.35,
    "end": 443.059,
    "text": "So the paper presents a model-based defense of the partial functional informational segregation of cognition in the context of predictive architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 444.093,
    "end": 455.919,
    "text": " More specifically, to defend the modularity thesis, the paper confutes two counterarguments that lie at the center of Hippolyto and Kirchhoff's 2019 recent confutation of the modularity thesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 456.319,
    "end": 458.0,
    "text": "To confute is like to refute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 459.501,
    "end": 472.448,
    "text": "The main insight of the paper is that Hippolyto and Kirchhoff's counterarguments miss the mark because they dismiss a few rudimentary facts about the model-based nature of dynamical causal models and Markov blankets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 476.943,
    "end": 480.045,
    "text": " So that's why we kind of led in with a big question about modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 480.165,
    "end": 480.925,
    "text": "Why does it matter?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 481.385,
    "end": 485.727,
    "text": "Because we're kind of down the road a little bit, like, okay, modularity matters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 485.807,
    "end": 489.209,
    "text": "It matters how we think about and analyze and design modular systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 490.25,
    "end": 492.991,
    "text": "And then how does it apply to FEP?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 493.751,
    "end": 499.694,
    "text": "And Hippolyta and Kirchhoff make a computation of the modularity thesis, which we can look at soon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 500.355,
    "end": 502.676,
    "text": "And then Benny is firing back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 503.715,
    "end": 505.176,
    "text": " with this current paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 505.196,
    "end": 514.704,
    "text": "So that situates us like in the biggest scope of thinking about modularity, H&K 2019, and here we are with MDB 2021.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 517.046,
    "end": 518.648,
    "text": "So can I add to that, Daniel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 519.388,
    "end": 525.954,
    "text": "Yeah, so we didn't put encapsulation in here, but I know we're going to talk about that a bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.025,
    "end": 538.032,
    "text": " But in order to be able to make sure that we don't mix things up, we have to understand that encapsulation is a separation of what matters or what we consider to be a signal from the noise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 538.072,
    "end": 542.575,
    "text": "And I always think back to Nate Silver when I try to compare those two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 544.476,
    "end": 547.478,
    "text": "So it's a momentary on-off or it's a momentary in-out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 547.898,
    "end": 555.343,
    "text": "Not that there's a walled-off section per se in the brain, like we can diagram out or represent as an artifact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 556.957,
    "end": 565.251,
    "text": " FMRI images, however, might coerce us into thinking that that's what's happening, that there's actually a walled-off section, when that isn't actually the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 565.471,
    "end": 567.114,
    "text": "To avoid the cognitive overload...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 568.032,
    "end": 570.693,
    "text": " There are break-stop mechanisms in our mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.194,
    "end": 580.018,
    "text": "We don't have to tell our pancreas or basal ganglia what to do, which then assists us in our ability to take the external states like these slides in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 580.038,
    "end": 590.043,
    "text": "And I think that's what Benny was trying to point to, although he didn't probably go into that explanation the way that I just did, but I'm kind of in defense of this author.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 590.083,
    "end": 591.924,
    "text": "So I'm starting off right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 591.964,
    "end": 592.665,
    "text": "I'm in his corner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 593.225,
    "end": 595.406,
    "text": "I'm ready to tag up and climb in the ring.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.93,
    "end": 606.497,
    "text": " So just to kind of piggyback onto that, like when you're talking about encapsulating, it's really talking about drawing a boundary around something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.818,
    "end": 612.442,
    "text": "And like, isn't the Markov blanket, like, isn't that the ability to draw a boundary around something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.502,
    "end": 612.703,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.743,
    "end": 619.648,
    "text": "So, so I don't know, like this encapsulating Markov blanketing boundary drawing, like all of those are conflated in my mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.688,
    "end": 625.113,
    "text": "And I don't know if there's like a separate way to tease them all apart or, or if I have correct correctly grouped them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 627.11,
    "end": 627.31,
    "text": " Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 628.231,
    "end": 628.571,
    "text": "Onwards.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 629.312,
    "end": 634.718,
    "text": "So, I'll read the first two and then Blue for the second two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 635.699,
    "end": 643.086,
    "text": "The paper presents a model-based defense of the partial functional informational segregation of cognition in the context of the predictive architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 643.947,
    "end": 649.792,
    "text": "The paper argues that the model relativeness of modularity does not need to undermine its tenability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 650.493,
    "end": 663.107,
    "text": " In fact, it holds that using models is indispensable to scientific practice and it builds its argument about the indispensability of modularity to predictive architecture on the indispensability of scientific models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 664.625,
    "end": 676.715,
    "text": " More specifically, to defend the modularity thesis, the paper confutes two counterarguments that lie at the center of Hippolito and Kirchhoff's 2019 recent confutation of the modularity thesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.335,
    "end": 688.805,
    "text": "The main insight of the paper is that Hippolito and Kirchhoff's counterarguments miss the mark because they dismiss a few rudimentary facts about the model-based nature of dynamical causal models and Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 690.586,
    "end": 690.746,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 690.766,
    "end": 691.467,
    "text": "What's up?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 693.467,
    "end": 695.89,
    "text": " Nice philosophy abstract.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 697.912,
    "end": 701.016,
    "text": "Here is the roadmap where we are going.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 701.116,
    "end": 703.339,
    "text": "And so this has a fun roadmap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 703.359,
    "end": 706.062,
    "text": "There are nine sections.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 707.435,
    "end": 708.295,
    "text": " There's the introduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 708.795,
    "end": 719.078,
    "text": "And then there are eight sections with, or dare I say eight modules that have kind of interesting names that we'll be looking into.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 720.139,
    "end": 723.7,
    "text": "And there are not any figures or formalisms",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 724.58,
    "end": 726.581,
    "text": " but the sections are here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 727.182,
    "end": 728.643,
    "text": "Maybe Dean will rejoin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 729.863,
    "end": 732.405,
    "text": "And welcome back, Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 734.686,
    "end": 735.147,
    "text": "C'est la vie.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 735.887,
    "end": 738.649,
    "text": "I need an internet cable from my heart to yours.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 741.331,
    "end": 752.118,
    "text": "The keywords are free energy principle, model-based science, modularity, and then there's DAG, directed acyclic graphs, and then DCM,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 752.958,
    "end": 761.0,
    "text": " which is going to have two different unpackings as directed cyclic models and as dynamical causal models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 761.92,
    "end": 766.521,
    "text": "And we're going to go through these keywords kind of as they appear in the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 767.121,
    "end": 769.342,
    "text": "We're not going to have a separate section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 770.102,
    "end": 778.804,
    "text": "So let's go right into the introduction section of the paper where we find somewhat of an epistemic preamble.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 779.884,
    "end": 794.635,
    "text": " So not to read the whole thing, but Benny belongs to the clan of philosophers with Carnap and Kuhn, who concede that the choice of theoretical frameworks is not completely arbitrary because some pragmatics affect the choice of theories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 794.795,
    "end": 800.419,
    "text": "So, okay, we have dispensed with the naive postmodernist perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 801.48,
    "end": 807.725,
    "text": "And more generally, Benny identifies as a naturalized metaphysician in the sense of Ladyman and Ross,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 809.252,
    "end": 814.475,
    "text": " in that metaphysics is worthwhile when it is informed by our best scientific theories of the field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 815.195,
    "end": 822.439,
    "text": "So it's kind of just like a classy co-informing process between science and metaphysics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 823.579,
    "end": 832.684,
    "text": "And it is drawing on this work by Ladyman and Ross, Everything Must Go, Metaphysics Naturalized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 833.444,
    "end": 838.827,
    "text": "And then just to like look at the chapter titles, because it's not a book that I was very familiar with,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 840.526,
    "end": 841.987,
    "text": " They're defending science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 842.928,
    "end": 846.47,
    "text": "They're defending a scientific realism and a structuralism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 847.07,
    "end": 854.215,
    "text": "So maybe we're not gonna be in touch with the ultimate reality, but at least we can be in touch with something that's constructively empirical and scientifically real.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 855.407,
    "end": 858.868,
    "text": " They talk about the unity of science, consilience, like E.O.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 858.888,
    "end": 864.429,
    "text": "Wilson, and about causation in a world that's structural, but also complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 865.369,
    "end": 880.592,
    "text": "And so that's sort of the preamble where Benny characterizes his own stance and kind of gives this background that is quite personal in some ways, but then will lead into our understanding about the paper and the contributions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 880.632,
    "end": 882.332,
    "text": "So anything to add on that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 884.753,
    "end": 890.757,
    "text": " All I would try to quantify here is that he's not starting from a position of, did you see that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 890.937,
    "end": 894.059,
    "text": "He's basically starting from a position of, did you see what I see?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 894.959,
    "end": 896.68,
    "text": "He holds that as being valuable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 898.541,
    "end": 898.762,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 901.403,
    "end": 904.025,
    "text": "That takes us to model-based science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 904.585,
    "end": 912.05,
    "text": "So as we saw in the chapters of Ladyman and Ross, scientists use models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 912.978,
    "end": 919.964,
    "text": " It's kind of like saying we use maps on territories and there's so many kinds of models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 921.345,
    "end": 928.61,
    "text": "A few that we've seen are, for example, a graphical visualization of a Bayesian statistical model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 929.131,
    "end": 935.135,
    "text": "And one example of that is like this partially observable Markov decision process that we often look at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 936.318,
    "end": 954.242,
    "text": " and what do models do well that's quite a big topic but they represent hypotheses as well as useful models of conceptual or empirical systems and so there's many many kinds of models and some of them can be reflected graphically and in that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 955.6,
    "end": 963.448,
    "text": " sentence, graphical, is referring to visual, like a computer graphic, but also graphical, like a graphical network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 964.168,
    "end": 971.515,
    "text": "And so we're going to be talking about the visual aspects of graphs, but this isn't a study in aesthetics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 971.876,
    "end": 975.499,
    "text": "This is going to be talking about the topology of graphs in their network sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 975.96,
    "end": 978.082,
    "text": "But model-based science is just the kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 979.309,
    "end": 1001.885,
    "text": " pragmatic perspective that scientists use models implicitly and explicitly and there are certain things that we can say about those models anything that either of you would add on model-based science I'd want to know who who disagrees who doesn't think that scientists are using models like is this just a total uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1003.695,
    "end": 1025.901,
    "text": " meaningless claim or are are there controversies related to this okay so let's look at a few different types of models specifically these graphical models that can be represented by networks so one kind of special graphical model is called a directed acyclic graph or a dag",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1026.863,
    "end": 1032.865,
    "text": " And so DAGs, as their name would have it, do not have cycles amongst variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1033.205,
    "end": 1040.847,
    "text": "So nodes are variables and edges are directed influences, and there are no cycles in DAGs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1041.547,
    "end": 1048.969,
    "text": "And so it turns out that computing DAGs, it's relatively efficient and it has known algorithms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1049.709,
    "end": 1050.55,
    "text": "So here is a...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1053.539,
    "end": 1058.003,
    "text": " image of a DAG that I got from a 2012 paper in ecology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1058.463,
    "end": 1065.99,
    "text": "And so the parameters are defined here and you can look for more details, but just visually, these are different modules of the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1066.551,
    "end": 1073.096,
    "text": "There's like this underlying process model, there's the individual covariate model, there's an observation model, whatever those things are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1073.697,
    "end": 1078.801,
    "text": "But one can imagine that you can like start at the parts that don't have any parents",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1079.702,
    "end": 1097.7,
    "text": " and then kind of drip coffee your way to n and y which are like the ultimate grandchildren nodes and then n and y don't feed back to change the other upstream parameters so dags are not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1099.222,
    "end": 1109.41,
    "text": " all of this exact shape or type, but what makes them in a category is that they don't have cycles in the way that the variables are influencing each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1110.071,
    "end": 1112.673,
    "text": "That makes them easy to compute and relatively straightforward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1115.196,
    "end": 1120.18,
    "text": "We can contrast that with directed cyclic models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1120.82,
    "end": 1123.263,
    "text": "So we're still talking about graphical models here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1124.383,
    "end": 1129.505,
    "text": " Directed cyclic models or DCM have causal loops in the graphical models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1130.405,
    "end": 1134.486,
    "text": "And so this can make certain kinds of computation more difficult.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1134.867,
    "end": 1138.228,
    "text": "I'm sure people can think about different ways that that might happen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1140.588,
    "end": 1144.61,
    "text": "The direction of the edges determines the influence of one random variable on another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1145.59,
    "end": 1147.951,
    "text": "So if it doesn't have cycles, it's a DAG.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1149.062,
    "end": 1156.928,
    "text": " And inference on those DAGs may be performed exactly using algorithms such as belief propagation or variable elimination.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1158.029,
    "end": 1164.454,
    "text": "Like you can kind of collapse a subtree into a simpler system, but with cycles, it's a little bit more complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1165.274,
    "end": 1172.9,
    "text": "So that's the difference between the DAG and the DCM directed cyclic model, but then there's going to be another DCM coming up later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1174.201,
    "end": 1175.162,
    "text": "Any comments there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1178.476,
    "end": 1193.812,
    "text": " Do you think that the looping can can be gets kind of a spiraling kind of a, an accumulation effect that the DAG model, which with its narrowing and narrowing and sort of elimination focus?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1195.714,
    "end": 1201.8,
    "text": "Well, he, Benny talks about the fact that they're actually complementary, but do you actually think they're complementary as well?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1203.649,
    "end": 1222.154,
    "text": " I think that they exhaustively described the landscape of graphical models because either it has a cycle or it doesn't, but it's quite literally the difference between like dropping a coin in a little machine that just dribbles down and then playing pinball where you could have all kinds of feedback.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1222.614,
    "end": 1230.556,
    "text": "So I think they're mutually exhaustive, but that may be sort of a deflationary stance because they're defined as contrary to each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1232.859,
    "end": 1245.275,
    "text": " We're not going to go too into detail here, but sometimes you want to use a model that is acyclic, even for a cyclic system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1245.715,
    "end": 1251.182,
    "text": "For example, within one time step, it might be a heuristic approximation to make it a cyclic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1252.403,
    "end": 1255.724,
    "text": " DAG model, directed acyclic model, rather than a cyclic model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1256.304,
    "end": 1261.386,
    "text": "So we're talking about our statistical models here, not the topology of how things are connected in the real world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1261.946,
    "end": 1270.449,
    "text": "But I just thought it was very interesting to talk about Bayesian networks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1270.469,
    "end": 1274.391,
    "text": "And often Bayesian networks are framed as only DAGs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1274.671,
    "end": 1281.173,
    "text": "So the standard definition, according to these authors, the standard definition of Bayesian networks is usually one directional acyclic directed graphs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1282.526,
    "end": 1290.888,
    "text": " In higher dimension systems, further probabilistic relations can be recovered from network cyclic properties and the joint probability of all variables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1291.569,
    "end": 1301.992,
    "text": "And this paper shows like for a two system where there's just a kind of back and forth between these two X and Y variables, here's X, Y, and Z in a three-way loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1302.632,
    "end": 1303.872,
    "text": "And then here's a four-way loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1304.452,
    "end": 1307.373,
    "text": "And then they also look at N order loops.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1308.033,
    "end": 1309.694,
    "text": "So it can generalize.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1311.803,
    "end": 1313.664,
    "text": " What was once only imagined is now proved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1314.344,
    "end": 1329.073,
    "text": "In other words, let's not get too confident about like what can or can't be done with one type of model family or the other, because it's just one clever paper away for there to be an approximation or to be an exact solution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1331.534,
    "end": 1332.295,
    "text": "Now we turn to...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1333.339,
    "end": 1339.701,
    "text": " the other sense of DCM, and this is dynamical causal models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1340.321,
    "end": 1351.545,
    "text": "And so these DCM can have graphical structure that also is directed acyclic graph, but it's a different usage of the term.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1352.346,
    "end": 1362.069,
    "text": "And so DCM, here we could point to many resources like Friston et al, the 2007 Statistical Parametric Mapping textbook",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1363.67,
    "end": 1368.832,
    "text": " or a later paper of Fristen et al on network discovery with DCM.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1369.532,
    "end": 1381.316,
    "text": "And so I thought that 2011 paper was a little bit more relevant because it's about specifically inferring or discovering the functional architecture of distributed systems using dynamic causal modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1382.594,
    "end": 1383.955,
    "text": " What does this technique do?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1384.636,
    "end": 1402.755,
    "text": "It uses Bayesian model selection, so comparison of the relative adequacy and complexity of different Bayesian models, to identify the sparsity structure, which is where there are edges or not, or where there aren't, which is the same thing as where they are, in a graph that is best explaining an observed time series.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1404.224,
    "end": 1409.946,
    "text": " The implicit adjacency matrix, that's that sparsity structure, specifies the form of the network, e.g.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1410.307,
    "end": 1412.227,
    "text": "cyclic or acyclic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1413.088,
    "end": 1420.271,
    "text": "And then later on, we see unlike conventional approaches to network discovery, DCM permits the analysis of directed and cyclic graphs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1421.607,
    "end": 1425.549,
    "text": " So DCM is an approach for looking at a time series.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1425.729,
    "end": 1427.53,
    "text": "That's the dynamic part through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1428.37,
    "end": 1433.072,
    "text": "And then looking at how variables statistically cause each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1433.873,
    "end": 1441.256,
    "text": "And so a statistical cause is like when one thing happens and then at some later time point, there's another thing happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1441.716,
    "end": 1445.378,
    "text": "That's a statistical causal model like Granger causality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1446.889,
    "end": 1448.149,
    "text": " we're talking about our model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1448.57,
    "end": 1456.492,
    "text": "So if Bitcoin price goes up and then later oil price goes up across the whole time series, so there would be a directed causal edge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1457.312,
    "end": 1460.153,
    "text": "There might be a bidirectional causal edge or a one directional causal edge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1460.693,
    "end": 1465.095,
    "text": "It doesn't mean that in the real world, one going up caused the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1465.555,
    "end": 1467.776,
    "text": "It's just talking about our time series data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1468.276,
    "end": 1469.836,
    "text": "So that's dynamic causal modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1470.276,
    "end": 1471.917,
    "text": "And it can be applied to neuroimaging data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1472.097,
    "end": 1472.297,
    "text": "Blue?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1472.898,
    "end": 1473.859,
    "text": " I have a quick question here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.959,
    "end": 1484.247,
    "text": "So I get the time series that that makes it dynamic, but I also thought like you could have functional studies that also fall into the category of dynamic causal modeling, like gene knockouts, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1484.287,
    "end": 1490.632,
    "text": "So like you'd knock out a gene and not necessarily a time variation, but like a variation in the graph itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.832,
    "end": 1495.056,
    "text": "And so you knock out a gene and then isn't that also dynamical causal modeling or that's something different?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1498.044,
    "end": 1515.585,
    "text": " One could have the nodes be gene expression through time and then test how perturbations or counterfactual network architectures would result in different expressions through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1516.64,
    "end": 1520.224,
    "text": " But can you take the time out of it and have it still be a dynamic model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1520.264,
    "end": 1521.885,
    "text": "I guess it's just snapshots, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.905,
    "end": 1525.109,
    "text": "So it's not time series, but like gene series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.309,
    "end": 1528.552,
    "text": "I don't know, like knocking out the genes in the series to make it a dynamic model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.514,
    "end": 1539.202,
    "text": "If it were just a single time slice, then it's a little bit unclear what the edges would reflect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1540.188,
    "end": 1544.892,
    "text": " because cause is like effect through time in the statistical sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1545.353,
    "end": 1553.32,
    "text": "So if it were just like, I have like, you know, there's 50 people here and 20 people here and 10 people here, it's hard to say where's there a causal edge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1553.62,
    "end": 1557.503,
    "text": "Whereas if all three were changing, then one could draw these causal edges.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1559.926,
    "end": 1560.146,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1561.547,
    "end": 1562.048,
    "text": "Now we turn...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1563.109,
    "end": 1570.812,
    "text": " under the scope of the big question about modularity to specifically modularity and the free energy principle, FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1571.572,
    "end": 1579.995,
    "text": "Okay, so this is the big topic and kind of the entree that Benny is bringing to us to discuss.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.916,
    "end": 1587.958,
    "text": "And it's highlighting a really important issue, which is the conceptual compatibility of modularity with the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1588.919,
    "end": 1589.019,
    "text": "And",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1590.086,
    "end": 1598.171,
    "text": " It's a speculation that this conceptual point may well become significant in the course of scientific development of the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1598.672,
    "end": 1608.118,
    "text": "So this is like a philosopher engaging in a scientific discussion because there actually is a lot on the table if we get modularity right or wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1608.918,
    "end": 1612.441,
    "text": "So what is the relationship between FEP and modularity?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1613.281,
    "end": 1614.062,
    "text": "Is it compatible?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1615.137,
    "end": 1618.279,
    "text": " Is it necessary, sufficient, incompatible?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1618.879,
    "end": 1623.422,
    "text": "Like if we have modularity, do we get FEP, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1623.482,
    "end": 1624.162,
    "text": "That's sufficient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1624.662,
    "end": 1627.764,
    "text": "Do we need modularity for the FEP necessity?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1628.605,
    "end": 1632.147,
    "text": "If we have it, can we not get the FEP incompatibility?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1633.207,
    "end": 1635.369,
    "text": "Are we talking about the modularity of our world?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1636.291,
    "end": 1644.538,
    "text": " carving up nature at the joints or of our scientific statistical models, instrumentalism, carving up our models at the joints that we designed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1645.359,
    "end": 1659.531,
    "text": "And then how does our stance or our perspective on this topic of modularity and the FEP influence our generative model, how we think and act, whether we're the ones collaborating and writing scientific papers or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1660.432,
    "end": 1662.534,
    "text": "And then just to add one more note,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1663.646,
    "end": 1670.052,
    "text": " Despite the great unifying scope, FEP has been criticized on account of not discussing the functional mechanisms of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1670.973,
    "end": 1674.216,
    "text": "So the unifying scope is kind of like top-down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1675.036,
    "end": 1677.619,
    "text": "That's the Ramstad et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1677.639,
    "end": 1680.681,
    "text": "2018, all of space and time under the FEP envelope.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1681.302,
    "end": 1682.723,
    "text": "That's the top-down description.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1683.544,
    "end": 1687.027,
    "text": "And then the functional mechanisms are like those minute particulars.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1687.427,
    "end": 1689.589,
    "text": "That's the bottom-up components",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1690.478,
    "end": 1692.359,
    "text": " that builds the system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1693.38,
    "end": 1700.224,
    "text": "And that sort of meets in the middle with the real world systems that people are always discussing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1700.684,
    "end": 1705.507,
    "text": "So we're talking about how modularity works with the FEP or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1706.187,
    "end": 1707.148,
    "text": "Any thoughts, Blue or Dean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1712.01,
    "end": 1717.614,
    "text": "Well, only thing I would add is that you can be strictly top-down or you can actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1718.88,
    "end": 1725.246,
    "text": " as Benny would point out, keep an open mind, which means that you've got some movement for both top-down and bottom-up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1726.147,
    "end": 1729.53,
    "text": "So we'll probably get into that more in the point one than point two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1730.37,
    "end": 1731.972,
    "text": "Yes, exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1734.714,
    "end": 1738.778,
    "text": "We're now going to go to some classic citations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1741.289,
    "end": 1751.178,
    "text": " So Benny writes, to address this problem of modularity in FEP, FEP theorists may want to provide finer details about the functional mechanisms that enable FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1751.559,
    "end": 1755.082,
    "text": "So that's how we're going to make a comeback to Colombo et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1755.102,
    "end": 1759.206,
    "text": "2021, Colombo and Wright 2016, is by providing finer detail.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1760.066,
    "end": 1765.231,
    "text": "In addition to reinvigorating its unificatory scope.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1766.192,
    "end": 1775.4,
    "text": " unifying scope maybe, that would be in line with Friston's preceding remarks that despite its roughness, FEP may be developed to provide a guide to brain functions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1776.001,
    "end": 1777.662,
    "text": "So we're going to do both.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1778.103,
    "end": 1780.645,
    "text": "We're going to keep the big scope and we're going to provide details.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1780.725,
    "end": 1782.387,
    "text": "So let's look at some of those details.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1783.493,
    "end": 1789.958,
    "text": " This is also going to provide a really good introduction to the difference between the functional and effective connectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1790.518,
    "end": 1801.347,
    "text": "And connectivity here is referring to statistical measurements coming from brain regions because anatomical connectivity is just, are the pieces physically connected?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1801.747,
    "end": 1807.391,
    "text": "You know, the knee bones connected to the leg bone, that kind of descriptive anatomical connectedness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1809.113,
    "end": 1809.453,
    "text": "First in 1994,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1811.206,
    "end": 1814.427,
    "text": " functional and effective connectivity in neuroimaging, a synthesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1815.228,
    "end": 1817.729,
    "text": "So back when we were younger, weren't we?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1818.589,
    "end": 1824.151,
    "text": "The paper reviews the basic distinction between functional and effective connectivity in neuroimaging.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1826.152,
    "end": 1828.153,
    "text": "Going over to the origins and definitions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1829.127,
    "end": 1835.511,
    "text": " Functional connectivity is defined as the temporal correlations between spatially remote neurophysiological events.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1836.291,
    "end": 1848.518,
    "text": "So that's not the only way to say it in English or any other language, but we're not talking about a philosophical sense of function, like what does it mean or what is its teleology?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1849.079,
    "end": 1853.181,
    "text": "We're talking about statistical variation in measurements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1854.742,
    "end": 1856.343,
    "text": "This definition is operational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1857.704,
    "end": 1858.124,
    "text": "Very cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1859.002,
    "end": 1861.724,
    "text": " and provides a simple characterization of functional interactions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1862.785,
    "end": 1867.409,
    "text": "The alternative is to explicitly refer to effective connectivity, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1867.649,
    "end": 1871.132,
    "text": "the influence that one neuronal system exerts over another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1871.952,
    "end": 1881.259,
    "text": "So temporal correlation is things that could be uncorrelated in the micro, but then they're both going up together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1881.94,
    "end": 1883.801,
    "text": "That would have functional connectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1884.741,
    "end": 1892.486,
    "text": " Whereas effective connectivity would be looking at how changes in one at the next time step influence changes in the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1893.026,
    "end": 1904.374,
    "text": "And so those could be like going in different directions at the macro, but they could have effective connectivity because they influence each other statistically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1906.516,
    "end": 1910.558,
    "text": " Let's stay with this Friston 94 theme, but we're not going to go through the whole thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1910.658,
    "end": 1918.222,
    "text": "This is just to show what was being discussed and explored and characterized about 30 years ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1918.963,
    "end": 1920.403,
    "text": "So keep that in mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1920.623,
    "end": 1924.425,
    "text": "We have a long pheromone trail to catch up with Carl on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1925.506,
    "end": 1927.807,
    "text": "They had models way back in 1994?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1928.167,
    "end": 1928.428,
    "text": "This is 94.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1928.548,
    "end": 1930.769,
    "text": "Yeah, they had models back then?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1932.022,
    "end": 1933.323,
    "text": " Well, they were made of wood, but yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1936.664,
    "end": 1943.128,
    "text": "This is a statistical parametric map, hashtag SPM, projected onto a brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1944.348,
    "end": 1952.733,
    "text": "And on this map of the images taken through time of a brain that were fMRI in this case,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1953.971,
    "end": 1958.232,
    "text": " one can take that data object and find the eigenvalues.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1958.973,
    "end": 1963.714,
    "text": "And there are mathematical relationships between functional and effective connectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1964.534,
    "end": 1973.177,
    "text": "Not going to go into it, but it's an awesome topic explored here and in several earlier papers and in the 2007 SPM textbook and in later papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1975.778,
    "end": 1979.099,
    "text": "What was able to be said even way back then?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1980.059,
    "end": 1982.46,
    "text": "Well, this is one of the figures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1984.867,
    "end": 1991.569,
    "text": " These are looking at the loadings on different vectors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1992.709,
    "end": 1995.97,
    "text": "So it's a spatial mode that reflects an eigenvector.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1996.611,
    "end": 2005.753,
    "text": "So it's kind of like a vector through space and time activity that explains a large proportion of variance in the data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2007.737,
    "end": 2016.862,
    "text": " The first vector, that's this top one, is clearly related to the difference between word generation, even-numbered conditions, and word shadowing, odd number scans.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2017.622,
    "end": 2028.188,
    "text": "So this was an experimental paradigm where the person was being asked to do two different things alternating, generate a word and then shadow a word, like I guess repeat a word that was already said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2029.108,
    "end": 2035.932,
    "text": "And then this vector, which had this activation pattern on the right in the brain,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2036.946,
    "end": 2044.054,
    "text": " was negatively correlated with the odds and positively correlated with the even.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2044.535,
    "end": 2053.886,
    "text": "So it's a plausible mechanistic statement about the differences in the activated neuroanatomy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2055.107,
    "end": 2057.109,
    "text": "Doesn't mean it's simple to interpret,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2057.967,
    "end": 2063.851,
    "text": " but it's a vector whose expression is correlated with something in the experimental design.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2064.531,
    "end": 2075.958,
    "text": "Like if you did a double-blind study and these people got the drug and these people got a different drug, the correlation between them would be ascribed to the difference that you as the experimenter imposed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2077.118,
    "end": 2082.722,
    "text": "Whereas here's an example of another vector that declines throughout the entire experiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2084.008,
    "end": 2088.871,
    "text": " And so that might reflect, for example, attention dropping off through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2089.292,
    "end": 2101.881,
    "text": "And so that's a lot of neuroimaging then and now looking into these summarized statistical representations of activity patterns through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2103.84,
    "end": 2113.003,
    "text": " And also for later, just it's cool to look at some of these citations like the Edelman citations, Tonini and Sporns, 92.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2113.904,
    "end": 2116.184,
    "text": "These are really classic citations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2117.285,
    "end": 2117.865,
    "text": "So there we were in 94.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2119.346,
    "end": 2123.567,
    "text": "And then this is a dream of the future from 94.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2124.347,
    "end": 2128.429,
    "text": "So here's Zaragami and Friston in 2020.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2130.965,
    "end": 2156.272,
    "text": " again talking about effective connectivity biologically grounded models like dynamic causal modeling and dynamical systems theory so improving and iterating on those basic ideas and then also what does it look like to apply it and what kinds of conclusions and statements do scientists make when just applying these uh methods so for example",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2157.205,
    "end": 2170.67,
    "text": " This paper was in 2019 and it is called Dynamic Causal Modeling of Effective Connectivity, should sound familiar, During Anger Experience in Healthy Young Men, 7 Tesla MRI Imaging Study.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2171.49,
    "end": 2171.951,
    "text": "And so it's,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2173.618,
    "end": 2182.199,
    "text": " You can read the abstract, but they find that viewing certain kinds of films leads to activation of certain brain regions, dot, dot, dot, dot, dot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2182.74,
    "end": 2188.661,
    "text": "We propose a model of effective connectivity associated with the anger experience based upon dynamic causal modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2189.441,
    "end": 2192.261,
    "text": "The findings have implications for psychiatric disorders.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2193.081,
    "end": 2194.522,
    "text": "So that's what people do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2194.882,
    "end": 2201.883,
    "text": "They put people into scanners, they take measurements of the hemodynamics of the brain, and then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2202.813,
    "end": 2216.678,
    "text": " make a statistical model of it, and the edges that exist across all subjects, or only in the ones who have this diagnosis, or only in these experimental conditions, those edges are interpreted in a certain way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2218.039,
    "end": 2222.4,
    "text": "That's what's on the table when we're discussing all these techniques.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2223.921,
    "end": 2225.261,
    "text": "Any comments on Fristin94?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2225.361,
    "end": 2226.902,
    "text": "Or we'll go to the other classic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2228.325,
    "end": 2233.49,
    "text": " Just that effective connectivity is what I was thinking of, like in the gene network, like how are they effectively connected?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2233.59,
    "end": 2235.531,
    "text": "So it's like makes sense now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2237.693,
    "end": 2237.893,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.014,
    "end": 2242.598,
    "text": "Another classic, but a more recent one is 2009.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2243.178,
    "end": 2250.585,
    "text": "First in this paper, again, single author paper, the free energy principle, a rough guide to the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2251.425,
    "end": 2254.828,
    "text": "So now that's how long ago, 13 years ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2257.642,
    "end": 2267.591,
    "text": " The free energy principle might provide a comprehensive account of how we represent the world and come to sample it adaptively, through action, by moving our little eyes around.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2267.611,
    "end": 2273.057,
    "text": "The FEP provides a mathematical specification of what the brain is doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2273.977,
    "end": 2276.92,
    "text": "Now that starts to sound like realism, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2277.26,
    "end": 2282.826,
    "text": "What the brain is doing, not a functional description of the models we make about the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2285.106,
    "end": 2287.848,
    "text": " it is suppressing free energy if it uses gradient descent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2288.908,
    "end": 2298.333,
    "text": "And so the box with the questions for future research are really still key.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2298.714,
    "end": 2300.975,
    "text": "What optimization schemes does the brain use?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2301.035,
    "end": 2302.976,
    "text": "These are like still important questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2303.736,
    "end": 2304.317,
    "text": "And then also,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2306.027,
    "end": 2308.691,
    "text": " the domains of application.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2309.512,
    "end": 2316.481,
    "text": "It's just always good to see like what was the FEP's description and scope 13 years ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2318.368,
    "end": 2330.132,
    "text": " some of the images we've even seen again and again with sometimes some variants, but these are like images that we see commonly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2330.772,
    "end": 2336.214,
    "text": "We talk about action to minimize surprise and perception to optimize the bound.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2336.574,
    "end": 2341.135,
    "text": "So this is like the predictive processing element, and this is like the control theory element.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2342.936,
    "end": 2346.617,
    "text": "We talk about the topology of perception, cognition, and action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2348.348,
    "end": 2358.278,
    "text": " So suffice to say that there are equations, figures, and it's another great paper on the long road towards the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2359.559,
    "end": 2361.421,
    "text": "Any comments on 2009 paper?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2364.023,
    "end": 2364.264,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2365.545,
    "end": 2367.707,
    "text": "Blue, would you like to describe modularity?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2369.426,
    "end": 2369.666,
    "text": " Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.326,
    "end": 2377.149,
    "text": "So I just wanted to explicitly define it because we talked about it a little bit in the abstract, and we're going to talk about it a lot more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.249,
    "end": 2386.352,
    "text": "But in the paper, the author defined modularity as information encapsulation, which Dean mentioned earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2387.292,
    "end": 2405.242,
    "text": " And he says, informational encapsulation holds that when engaged in information processing, the subsystems do not have access to information processing in other compartments and information processing within each subsystem is constrained within the computational mechanisms of that subsystems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.022,
    "end": 2406.742,
    "text": " of that subsystem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.802,
    "end": 2411.104,
    "text": "And so the modules are then defined by information segregation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2411.124,
    "end": 2432.392,
    "text": "And it's interesting to compare modularity, like as encapsulating information in a module, versus defining individuality, which both Mike Levin in the Competitional Boundary of a Self paper that we did last summer, and then David Krakauer in his 2020 theory about the information theory of individuality, both of those authors",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2433.932,
    "end": 2449.077,
    "text": " talk about information sharing, like information sharing with cells to form a tissue, for example, in Mike Levin's work, and then in the information theory of individuality paper, like up and down across different levels so that you can define individuality at any given level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2449.457,
    "end": 2454.818,
    "text": "But it talked about how information is shared with this bidirectional causation in that paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.859,
    "end": 2462.481,
    "text": "And so I think it's interesting to compare this idea of informational encapsulation in a module with these definitions of biological individuals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2464.445,
    "end": 2468.727,
    "text": " very cool, like is modularity the same thing as individuality?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2469.968,
    "end": 2473.83,
    "text": "How about continue describing maybe in this discussion on intransitivity?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2474.485,
    "end": 2476.646,
    "text": " Well, so I had to like look this up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.726,
    "end": 2482.97,
    "text": "So I just like I went into the paper like I just wanted somebody to just define what does this intransitivity mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2483.49,
    "end": 2497.039,
    "text": "And so the author says the general insight is based on the intransitivity of the passage of prediction errors between levels whose information can affect one another only in cases of uncertainty and noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2497.839,
    "end": 2503.686,
    "text": " So I feel like that this is like intransitivity of information between the modules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.746,
    "end": 2506.049,
    "text": "Like, but I, it was just not clear enough for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2506.069,
    "end": 2508.311,
    "text": "So then I tried to look up like, what is intransitivity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.632,
    "end": 2510.033,
    "text": "What is this intransitivity theory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.093,
    "end": 2517.101,
    "text": "And I came across this really cool paper, which is 2015 and entropy intransitivity in theory and the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2517.201,
    "end": 2517.402,
    "text": "And it's,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.162,
    "end": 2520.905,
    "text": " I think it's really different than what we're talking about here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2521.525,
    "end": 2524.948,
    "text": "But it talks about intransitivity in terms of preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.389,
    "end": 2535.478,
    "text": "And it said the choice between transitive, which are absolute, and intransitive, which are relativistic models, depends on the nature of the processes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.058,
    "end": 2538.019,
    "text": " that these models are expected to reproduce.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.199,
    "end": 2549.747,
    "text": "Many people, however, have a psychological difficulties in accepting a relativistic approach, expecting an absolute scale of judgment from bad to good, which can be suitable in some cases, but excessively simplistic in others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2550.247,
    "end": 2553.329,
    "text": "And they gave the idea of intransitivity in game theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2553.369,
    "end": 2556.832,
    "text": "And so like an intransitive game is just rock, paper, scissors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.552,
    "end": 2568.299,
    "text": " which obviously like your choice, there's no, it's not rock is always good, paper's always good, tails never fails, it's always relative to what the other people are choosing, right, in this game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2569.34,
    "end": 2572.783,
    "text": "And then they really go into like multidimensionality and intransitivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.323,
    "end": 2580.148,
    "text": "So he says in the paper, coarsening, which is like coarse graining, in multidimensional cases becomes strictly intransitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.248,
    "end": 2583.811,
    "text": " And the cases without strict intransitivity are degenerate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.911,
    "end": 2593.679,
    "text": "Either dimensions are redundant or coarsening is performed after merging the fractional variables into the overall utility instead of independent coarsening for all or some of the criteria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.52,
    "end": 2599.925,
    "text": "From a philosophical perspective, this statement can be presented as a continuum argument for intransitivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2600.605,
    "end": 2606.551,
    "text": "Small alterations are commonly overlooked for secondary parameters that can be accumulated into critical differences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.071,
    "end": 2616.54,
    "text": " And so I just thought that this was cool, because it talks about like philosophy and some things that we're talking about and relative or like, you know, realist versus instrumentalist, but it's completely unrelated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.58,
    "end": 2618.782,
    "text": "And I just wonder, like, is it completely unrelated?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.863,
    "end": 2624.108,
    "text": "Or can we go back and then like link in transitivity, full circle into what we're discussing here today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.208,
    "end": 2626.69,
    "text": "So it was just I put this in here, because I thought it was a cool paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2626.79,
    "end": 2630.534,
    "text": "And in my search for in transitivity, that's what I ran into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2633.055,
    "end": 2633.315,
    "text": " Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2633.715,
    "end": 2639.679,
    "text": "Putting a number on something often makes it seem like whatever you're putting the number on, they are transitive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2640.06,
    "end": 2643.842,
    "text": "You know, if everybody gets a score out of 100, then there's a natural order.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.282,
    "end": 2652.528,
    "text": "Or if we're ranking policies according to their expected free energy, then there might be some ordering of policies according to which ones are best minimizing free energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2653.048,
    "end": 2659.593,
    "text": "And I think this idea of intransitivity within the graphical model, what kinds of information are being passed,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2660.468,
    "end": 2661.231,
    "text": " And what does it mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2661.352,
    "end": 2664.91,
    "text": "And then just more broadly, like you brought up with the game theory, it's very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2667.469,
    "end": 2692.002,
    "text": " right let us continue almost finishing the first section and get to modularity fep and the target of the paper which is the hippolyto and kirchhoff paper so without intending to map the course of the evolution of the fep like we will blue i will just remark that the assumption of modularity has been fruitful in the study of brain functions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2693.097,
    "end": 2697.42,
    "text": " And so keeping an open mind about that assumption could be fruitful for the FEP too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2697.96,
    "end": 2702.142,
    "text": "Some significant critiques, such as Hippolito and Kirchhoff 2019, notwithstanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2703.543,
    "end": 2709.527,
    "text": "If you want to read more, definitely check out this paper from late 2019 by Ines and Michael.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2710.267,
    "end": 2714.25,
    "text": "And they are also, as well as any of you, welcome to come on and discuss this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2714.31,
    "end": 2718.813,
    "text": "That could be really cool to like kind of embody and enact the paper and...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2719.827,
    "end": 2723.528,
    "text": " Are we on the same page or what are our perspectives even if we are on the same page?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2724.388,
    "end": 2730.25,
    "text": "And this paper is engaging in the discussion of the relationship between modules and modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2731.31,
    "end": 2735.371,
    "text": "The main goal of the paper is not to defy Hippolyto and Kirchhoff's attack completely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2736.531,
    "end": 2741.133,
    "text": "The notion of modularity that Benny will defend is weaker than the notion that they attack.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2742.033,
    "end": 2745.814,
    "text": "So what senses or types of modularity are we dealing with?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2746.633,
    "end": 2748.655,
    "text": " what are the stronger and weaker claims?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2749.696,
    "end": 2752.499,
    "text": "And we'll look at their definition on the next slide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2753.36,
    "end": 2764.39,
    "text": "The main point of the discussion is that following Hippolyta and Kirchhoff, the modest definition of modularity is neither insignificant nor indispensable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2765.091,
    "end": 2768.354,
    "text": "So that made me ask, are we seeing a trend towards",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2769.435,
    "end": 2784.83,
    "text": " instrumentalism, bottom-up weak claims like the entailment exploration of 34 and deflationary models and moves away from naive or realist strong claims.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2785.63,
    "end": 2791.976,
    "text": "And so that just totally points to the role of philosophy in an ongoing scientific domain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2793.393,
    "end": 2804.865,
    "text": " because things like strong and weak emergence or entailment relationships and these discussions on modularity, they really matter for how science is done and how it's interpreted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2805.366,
    "end": 2809.19,
    "text": "So it's just really cool to be seeing that happen in a new way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2811.693,
    "end": 2832.072,
    "text": " Again, we're not going to go into the whole argument of Hippolyta and Kirchhoff, check out the paper, but they are going to consider the three most well articulated, which is funny because that means well said, but also well jointed, arguments for the view that modularity and predictive processing work well together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2833.513,
    "end": 2837.157,
    "text": "So predictive processing here is also referring to kind of that component of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2838.703,
    "end": 2843.544,
    "text": " And they're going to argue that all three of these arguments for modularity come up short, albeit for different reasons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2844.145,
    "end": 2851.467,
    "text": "So they kind of do like a steel person where they give the strongest argument for that tack, and then they refute it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2852.107,
    "end": 2867.371,
    "text": "And the three arguments they discuss are the epistemic Bayesian courtroom argument, which is just the idea that courtrooms are modular and cognition's kind of like a courtroom, like the eye is like a witness, and then there's like another witness thereof, and...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2868.877,
    "end": 2873.079,
    "text": " So if that's modular, then shouldn't predictive cognitive architectures be modular?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2874.259,
    "end": 2884.743,
    "text": "B, the intransitivity argument, which is that the causal influences across hierarchical levels are instantiating mechanisms that implement causal Bayesian networks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2885.963,
    "end": 2894.927,
    "text": "And they basically say that is pitching predictive processing in terms of the DAG, as opposed to cyclic models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2897.509,
    "end": 2899.19,
    "text": " and see the Markov blanket argument.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2900.37,
    "end": 2905.853,
    "text": "The notion that a Markov blanket grounds the idea that predictive processing exhibits modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2906.674,
    "end": 2912.517,
    "text": "And so they are going to explore those and compute them as they say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2913.637,
    "end": 2920.0,
    "text": "And one of the key points is when cognitive neuroscience works with an acyclic Markov decision scheme.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2920.521,
    "end": 2925.303,
    "text": "So that's like the partially observable Markov decision process that we were talking about earlier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2928.507,
    "end": 2932.471,
    "text": " it may very well be methodologically misguided.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2933.552,
    "end": 2933.772,
    "text": "Why?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2934.233,
    "end": 2943.302,
    "text": "Because there's an increasing tendency within neuroscience to emphasize recurrent and reciprocal neuronal processing within the newly emerging dynamical causal modeling frameworks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2944.483,
    "end": 2950.429,
    "text": "So how are we going to think about the fact that the brain does have these feedback loops?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2951.488,
    "end": 2954.949,
    "text": " and square the circle with the DAGs and the DCMs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2955.009,
    "end": 2956.889,
    "text": "And that's kind of the introduction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2957.189,
    "end": 2970.772,
    "text": "That's where we're set up, which is that Hippolyta and Kirchhoff have framed and then attacked three pro arguments for modularity and cognitive architectures related to predictive processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2971.453,
    "end": 2972.573,
    "text": "Benny is going to kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2973.493,
    "end": 2992.795,
    "text": " take some of that energy and with a weaker version or a little bit of a different version, not simply stronger or weaker, because that would actually imply transitivity of strength, but with a slightly different tack is going to recall us to life through a discussion of modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2995.393,
    "end": 2999.214,
    "text": " So this section is only going to have one slide on it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2999.474,
    "end": 3002.855,
    "text": "And then either of you, please feel free to add any comments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3003.735,
    "end": 3008.056,
    "text": "There's been a long history of debate on modularity in neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3009.097,
    "end": 3021.02,
    "text": "And Fodor, who's a very influential cognitive scientist, defined modular cognitive systems as systems that are domain-specific, innately specified, hardwired, autonomous, and not assembled.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3021.9,
    "end": 3028.81,
    "text": " That's not exactly the definition of modular that we've explored in some other slides, but the words are what they are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3030.658,
    "end": 3037.944,
    "text": " And that is the Benny quote about that functional isolation between modules is what defines them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3038.464,
    "end": 3042.908,
    "text": "So it's kind of like when there's more connection within than between, then that's modular.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3043.368,
    "end": 3049.013,
    "text": "And so Benny writes, the present paper does not intend to defend Fodor's version of the modulary thesis fully.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3049.473,
    "end": 3056.699,
    "text": "Probably because some of these pieces about like innate specification, hardwiring, autonomous, unassembled, take it or leave it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3056.879,
    "end": 3057.199,
    "text": "It was the 80s.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3058.462,
    "end": 3066.163,
    "text": " But Benny is simply aiming to show that some critiques of modularity do not need to undermine the possibility of informational encapsulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3067.163,
    "end": 3080.846,
    "text": "So, although a falsification of informational encapsulation leads to the renunciation of modularity, a defense of partial encapsulation would not establish a full-blooded form of modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3081.186,
    "end": 3087.787,
    "text": "So, if you refute encapsulation, you have to renounce modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3089.019,
    "end": 3096.124,
    "text": " However, partial or transient encapsulation doesn't give you strong modularity claims.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3096.904,
    "end": 3102.147,
    "text": "However, it can be compatible with the instrumental usage of models that have modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3103.128,
    "end": 3110.413,
    "text": "So those are some of the main arguments that set Benny up to defend a version of modularity that's quite modest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3111.573,
    "end": 3121.475,
    "text": " And it's almost like after that kind of a modest deflationary take, the question is really, is there any value in that definition of modularity at all?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3122.255,
    "end": 3125.656,
    "text": "So the debate isn't over whether we can discuss things modularly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3126.376,
    "end": 3131.397,
    "text": "If we're going to take this different tack, then really the question is like, does it matter?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3133.298,
    "end": 3134.518,
    "text": "Any comments on section two?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3137.765,
    "end": 3138.485,
    "text": " So I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.505,
    "end": 3139.926,
    "text": "I don't want to get too deep into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3139.966,
    "end": 3143.427,
    "text": "Maybe better to hold off for the dot one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3143.507,
    "end": 3146.188,
    "text": "But I just wonder about like if encapsulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3146.308,
    "end": 3154.471,
    "text": "So if it's if something's fully informationally encapsulated, like, you know, my heart is fully informationally encapsulated from my brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.991,
    "end": 3158.032,
    "text": "Like, how do you how does the living system function?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.112,
    "end": 3158.372,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.432,
    "end": 3165.855,
    "text": "So so this partial encapsulation, if that's not strong enough for modularity, like I don't know how full encapsulation is possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3166.335,
    "end": 3167.736,
    "text": " I just, I don't see it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.037,
    "end": 3169.258,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3171.439,
    "end": 3175.342,
    "text": "Section three is entitled A Golden Thread, Re-Energy Principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3175.883,
    "end": 3187.212,
    "text": "And so we just had to go there with a Blake reference because on his gravestone and one of his most famous lines is, I give you the end of a golden string, only wind it into a ball.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3187.572,
    "end": 3190.455,
    "text": "It will lead you in at heaven's gate built in Jerusalem's wall.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3190.595,
    "end": 3195.599,
    "text": "And then here's a drawing that he made with a mythological character walking with a golden string.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3198.052,
    "end": 3207.217,
    "text": " So the general idea, according to Benny, behind predictive coding is that the brain uses approximate Bayesian inference to decrease discrepancy between predictions and inputs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3209.638,
    "end": 3213.18,
    "text": "That is one of the key contentions of the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3214.441,
    "end": 3219.404,
    "text": "And the organism's interaction with its environment can be represented by Markov blankets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3221.038,
    "end": 3226.585,
    "text": " Here, I am using representation and modeling when speaking of Markov blankets and consider them to be Markovian models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3227.146,
    "end": 3231.692,
    "text": "So check out Benny's guest stream appearance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3231.732,
    "end": 3235.216,
    "text": "I think it's number one on Markovian monism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3237.685,
    "end": 3260.063,
    "text": " this sentence makes it clear we're talking about models we're in the realm of instrumentalism we're talking about markovian models not about whether we're making an ontologically real claim about markov blankets like being the structure of reality so in these models markov blankets are describing the conditional independence of internal and external states",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3261.158,
    "end": 3270.926,
    "text": " And then it's that Friston innovation beyond Pearl and Markovs to describe the incoming dependencies as sensory and the outgoing dependencies as active states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3272.067,
    "end": 3274.289,
    "text": "So what is the golden thread?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3275.39,
    "end": 3278.653,
    "text": "The FEP is an approach for embroidering or what?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3279.153,
    "end": 3281.295,
    "text": "Creating Markov blankets, finding them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3281.936,
    "end": 3282.916,
    "text": "What is the golden thread?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3283.717,
    "end": 3285.719,
    "text": "What is the silver thread and golden needle?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3288.413,
    "end": 3292.155,
    "text": " So what do you think the illusion means and what does the FEP have to do with it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3296.036,
    "end": 3298.157,
    "text": "Well, I'll speak a little bit on this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3298.537,
    "end": 3300.398,
    "text": "I might get it wrong, but that's okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3300.418,
    "end": 3301.839,
    "text": "We're in still point zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3302.859,
    "end": 3312.463,
    "text": "I think the predictive coding as an entailment question fits inside of the, what did he call it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3312.523,
    "end": 3313.784,
    "text": "BCC brain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3316.44,
    "end": 3318.666,
    "text": " Uh, brain brain brain brain brain brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3321.025,
    "end": 3322.286,
    "text": " I can't find it now in here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3322.766,
    "end": 3333.01,
    "text": "Anyway, I think there's a subtle and a nuanced difference between what FEP is as a process and as a principle and what FEP architecture is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.09,
    "end": 3338.332,
    "text": "And I think that is what he is trying to bring to the table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3339.052,
    "end": 3348.596,
    "text": "There is a difference between the architecture or the product that results from the use of an FEP process and the FEP process itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3349.178,
    "end": 3355.386,
    "text": " And once I figure out my own notes here, I can speak to what that BCC is, but I'll shut up for a second.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3357.208,
    "end": 3357.569,
    "text": "Very well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3358.47,
    "end": 3362.796,
    "text": "Interesting to describe the difference between the principle and the realized architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3364.458,
    "end": 3367.342,
    "text": "Section four, the track of a storm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3368.965,
    "end": 3371.148,
    "text": " So here's another single slider.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3372.169,
    "end": 3376.215,
    "text": "So there's some apparent tension between the modularity thesis and the predictive architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3376.876,
    "end": 3380.601,
    "text": "So that's what Kirchhoff and Hippolito described.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3381.542,
    "end": 3386.469,
    "text": "While the thesis of modularity points in the direction of segregation and encapsulation,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3388.072,
    "end": 3399.1,
    "text": " the predictive architecture grounds the integration of information in a hierarchical top-down architecture that unifies the mechanisms of cognition, perception, and action under the FEP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3399.781,
    "end": 3401.442,
    "text": "So it's like what Blue just said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3402.082,
    "end": 3409.408,
    "text": "Wait, if it's encapsulated and defined by its separation, then how is it part of this integrated whole?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3410.689,
    "end": 3410.889,
    "text": "Well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3411.769,
    "end": 3433.541,
    "text": " Howie, in 2013, the book, The Predictive Mind, and other people in other places have suggested that this conditional independence between the various levels of the hierarchical structure of predictive coding under FEP could be construed along the lines of functional segregation and informational encapsulation, which is why Fodor was brought up earlier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3436.647,
    "end": 3452.016,
    "text": " Drayson argued that the predictive architecture can be modeled in terms of this causal probabilistic dependency where different nodes could influence the adjacent levels, but there isn't global transitivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3452.376,
    "end": 3458.079,
    "text": "So like the lowermost nodes are not influencing all, just the ones directly above them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3460.154,
    "end": 3465.398,
    "text": " However, the Hippolyto and Kirchhoff paper challenge that vertical and horizontal account.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3465.718,
    "end": 3468.7,
    "text": "So the vertical account is like the multi-scale nested systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3468.74,
    "end": 3473.523,
    "text": "The horizontal account is like the collective behavior interactions across within a level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3474.444,
    "end": 3479.608,
    "text": "And so they aim to refute this account of functional informational modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3480.828,
    "end": 3483.63,
    "text": "According to Hippolyto and Kirchhoff, and let's...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3484.557,
    "end": 3485.838,
    "text": " Hear from them if it's not the case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3486.739,
    "end": 3489.921,
    "text": "The intransitivity argument for modularity is based on DAGs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3490.722,
    "end": 3499.448,
    "text": "However, they're going to argue that DAGs are not suitable for that kind of modeling because the brain has these cyclic mechanisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3500.028,
    "end": 3506.333,
    "text": "And so DAGs have to be replaced by cyclic models, which don't have the limitations of DAGs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3508.67,
    "end": 3520.795,
    "text": " And then with respect to the Markov blanket point, Benny asserts that Hippolyto and Kirchhoff argued that the argument from Markov blankets is of little avail to establishing modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3522.415,
    "end": 3525.076,
    "text": "He will get to both of those arguments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3525.677,
    "end": 3531.419,
    "text": "He kind of doesn't really worry about the courtroom as much, but the intransitivity and the Markovian blanket is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3532.498,
    "end": 3534.52,
    "text": " Arguments are what Benny's going to focus on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3534.72,
    "end": 3539.045,
    "text": "But first, remark on the importance of scientific models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3540.266,
    "end": 3544.09,
    "text": "So kind of a fun tack, but that's section four.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3544.611,
    "end": 3545.192,
    "text": "Yes, please, Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3545.953,
    "end": 3550.334,
    "text": " Yeah, so I found out BCC is brain's cognitive capacities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3550.554,
    "end": 3552.255,
    "text": "That's how he described it in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3552.995,
    "end": 3556.476,
    "text": "So I don't think it's a rock, paper, scissors issue either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3557.076,
    "end": 3562.298,
    "text": "I believe that predictive coding is entailed by the brain's cognitive capacities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3562.998,
    "end": 3568.083,
    "text": " I believe that the brain's cognitive capacities are entailed by the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3568.363,
    "end": 3579.012,
    "text": "So it sounds like you've got a rock, paper, scissors, but that's not the same as the free energy principles architecture being entailed by predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3581.074,
    "end": 3586.919,
    "text": "I would have to diagram that out for you, but that's where he's saying it's not an intransitivity argument.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3587.591,
    "end": 3589.352,
    "text": " And that's just notes to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3589.372,
    "end": 3601.921,
    "text": "And that's where I kind of ran into his corner, even though I wanted to actually do a paper later this year, a review of one of Hippolyta's papers on an action that I think is fantastic in instrumentalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3602.542,
    "end": 3609.347,
    "text": "But this was the moment where it was clear to me that it's not an intransitivity argument.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3609.827,
    "end": 3613.91,
    "text": "Because back to what Axel pointed out to, we have to know what entails what.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3616.735,
    "end": 3617.735,
    "text": " Very cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3620.016,
    "end": 3622.456,
    "text": "Section five, a knock at the door.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3625.276,
    "end": 3627.037,
    "text": "Models and modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3628.077,
    "end": 3630.577,
    "text": "We really do need to do that joke stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3631.117,
    "end": 3632.078,
    "text": "Knock, knock jokes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3632.358,
    "end": 3634.418,
    "text": "Like, you know, who's there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3634.498,
    "end": 3634.818,
    "text": "I don't know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3634.878,
    "end": 3635.638,
    "text": "Who are you expecting?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3636.318,
    "end": 3636.918,
    "text": "Who do you prefer?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3639.719,
    "end": 3646.1,
    "text": "In this section, Benny is going to describe some comments on modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3649.105,
    "end": 3656.068,
    "text": " He writes, I do not think we can find a reliable model independent handle on the architecture of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3657.068,
    "end": 3660.769,
    "text": "So it's kind of like saying, if we're gonna science, we're gonna model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3661.49,
    "end": 3664.751,
    "text": "So let's not think that we could science without modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3666.151,
    "end": 3673.394,
    "text": "The general insight is that the interface of scientific theories and their target systems takes place through scientific modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3673.854,
    "end": 3675.435,
    "text": "So theories about the brain,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3676.69,
    "end": 3680.732,
    "text": " the brain itself, and then the edge is the scientific modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3681.212,
    "end": 3688.195,
    "text": "Now the brain is like a special and fascinating system because it can be reflexively modeling itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3688.815,
    "end": 3694.858,
    "text": "But if you think about theories of pendulums, theory of pendulum,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3695.658,
    "end": 3698.361,
    "text": " and then the target system of the actual pendulum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3698.941,
    "end": 3701.324,
    "text": "It's pretty clear to see where the modeling relation comes into play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3701.944,
    "end": 3705.327,
    "text": "However, again, it gets kind of strange loopy with the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3706.348,
    "end": 3709.111,
    "text": "And Benny is drawing upon various works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3709.672,
    "end": 3716.518,
    "text": "Some of it is the Weisberg work on like simulation and similarity using models to understand the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3717.279,
    "end": 3719.661,
    "text": "And also some of Benny's earlier work",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3720.362,
    "end": 3740.912,
    "text": " for example the ways in which markov blankets are construed as scientific models and similar points have been discussed by mel andrews 2021 that was actin 14. so scientists are making and applying models and so we're not going to break out of that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3742.29,
    "end": 3744.211,
    "text": " VIP room in Plato's cave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3745.052,
    "end": 3759.803,
    "text": "So we have different kinds of models and maybe some of them are preferable, but like if your argument is predicated on breaking free of a given scientific model, it is something to hear if you think you have it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3760.664,
    "end": 3760.904,
    "text": "Dean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3762.925,
    "end": 3765.828,
    "text": "So this is, it got interesting for me here too, because if you,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3766.84,
    "end": 3778.027,
    "text": " If you look, for example, at a slice of time in an fMRI image, you could be focused on the concentration of heat in different areas of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3778.408,
    "end": 3781.51,
    "text": "That would be one bit of information that you could take away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3781.79,
    "end": 3794.719,
    "text": "Or you could look at the proportion of blood in different areas of the brain, which is going to tell you a little bit of different information than the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3795.512,
    "end": 3799.486,
    "text": " than the actual concentration of heat, that heat bump per se.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3800.109,
    "end": 3801.634,
    "text": "And so I was kind of curious,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3803.606,
    "end": 3812.212,
    "text": " who is a modeler here, because he talks about, we can't take the observer out of the observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3812.733,
    "end": 3830.066,
    "text": "So again, what relative bit of information do we tend to hone in on, or do we think is the more priority information to take away from one of these slices of time representations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3831.052,
    "end": 3852.917,
    "text": " That was really important to me right here because if you think of encapsulation as that sort of frenetic image a few slides back where all the brain is chopped up like here's the bacon and here's the ham and the different parts of the pig, you're choosing what it is that you think is the way of encapsulating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3853.237,
    "end": 3854.857,
    "text": "But I don't think that's what he's talking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3857.197,
    "end": 3859.198,
    "text": "We'll explore it, but yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3860.407,
    "end": 3868.109,
    "text": " Taking this kind of a really strong principled stance on scientific modeling means that we can always ask, who is doing the modeling?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3868.549,
    "end": 3868.829,
    "text": "Why?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3869.41,
    "end": 3872.71,
    "text": "And so actually it's not just this sterile philosophical point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3873.391,
    "end": 3877.412,
    "text": "It really brings us to consider the social and the operational aspects of science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3877.752,
    "end": 3882.093,
    "text": "So it's a very important like socio-technical point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3883.313,
    "end": 3888.035,
    "text": "Section six, the game made, the intransitivity argument.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3889.116,
    "end": 3891.437,
    "text": " Okay, we're not going to go through all the details here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3891.477,
    "end": 3911.748,
    "text": "We might have time in the dot one and two, but there, Benny is going to focus on Hippolyto and Kirchhoff's specific reply to the intransitivity argument that is centering the distinction between the directed acyclic graphs and directed cyclic graphs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3915.106,
    "end": 3921.442,
    "text": " Benny is going to argue that these two kinds of statistical models do different things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3922.875,
    "end": 3927.237,
    "text": " It turns out they actually also map onto the difference between functional and effective connectivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3928.017,
    "end": 3941.303,
    "text": "And so applying one sort of the model DAG or the cyclic model in a specific situation is a matter of practical exigency and methodological consideration, as well as the goals and the interest of the modeler.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3941.803,
    "end": 3945.385,
    "text": "So it's like, we're a hundred miles down choosing a model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3946.93,
    "end": 3969.833,
    "text": " freeway, and then whether you take this slight difference between one topology of graphical model that's quantitative versus a different topology, maybe that is not going to be super philosophically impactful because we already have taken like the big pill, which was making a scientific model or making a graphical quantitative model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3972.737,
    "end": 3985.059,
    "text": " There's a citation to the Fristin-Visa-Hobson 2020 paper that also describes like where the cyclic versus acyclic are preferable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3986.26,
    "end": 3999.142,
    "text": "And Benny recaps, and just basically to summarize, there is no universal reason for extolling DAGs over DCMs because the focus on functional connectivity or effective connectivity",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4000.41,
    "end": 4003.652,
    "text": " is a matter of explanatory, predictive goals and interests.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4004.652,
    "end": 4007.694,
    "text": "So scientists are using different kinds of models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4008.795,
    "end": 4026.825,
    "text": "And so maybe we should pull back to scientists use models and think about the implications of that rather than try to finesse out some philosophical implications from the very specific kind of last mile modeling choices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4028.39,
    "end": 4034.414,
    "text": " DCMs can do certain things, whereas DAGs can do other things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4035.975,
    "end": 4040.178,
    "text": "Which one of these approaches can be used to analyze data in the context of the FEP?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4040.778,
    "end": 4043.24,
    "text": "We're going to discuss it in 35.1.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4045.822,
    "end": 4051.605,
    "text": "Benny says, I do not think Hippolito and Kirchhoff 2019 are bound to concede a non-realist reading of DCM.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4052.726,
    "end": 4053.807,
    "text": "Rather, the critique is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4054.944,
    "end": 4062.109,
    "text": " of how H and K confute the intransitivity argument is pointed at their unjustified partiality towards DCMs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4063.15,
    "end": 4071.417,
    "text": "So it's like, if you could just scapegoat the DAG, then the DCM is the savior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4072.217,
    "end": 4082.024,
    "text": "But if both of them are just types of scientific models that are chosen situationally, operationally, as Fristian described, then there is no...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4083.231,
    "end": 4084.932,
    "text": " savior model coming in to save the day.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4085.933,
    "end": 4087.574,
    "text": "DCMs are formal devices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4088.715,
    "end": 4094.138,
    "text": "And then there's a citation to the Emperor's New Markov Blankets with Yella et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4094.978,
    "end": 4095.479,
    "text": "Livestream number 20.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4097.148,
    "end": 4107.714,
    "text": " And so drawing attention to the difference between DAGs and DCMs, which are complementary modeling tools, as we discussed earlier, they're defined as complementary, could not confute the intransitivity argument.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4108.314,
    "end": 4120.901,
    "text": "So if we have already committed to the instrumental perspective, so we're talking about our model, not about the world, then the difference between different modeling approaches is purely situational or operational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4122.401,
    "end": 4133.048,
    "text": " And so all scientific models have roughly similar philosophical grounding or they're part of a broad category with respect to this intransitivity argument.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4135.749,
    "end": 4140.472,
    "text": "Nice philosophy and interesting points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4143.014,
    "end": 4144.495,
    "text": "Okay, column in the storm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4145.782,
    "end": 4150.506,
    "text": " the indispensability of modularity and the indispensability of scientific models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4151.066,
    "end": 4155.63,
    "text": "Oh, I wonder if there's gonna be like a parallelism between models and modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4156.27,
    "end": 4161.314,
    "text": "And here's like a person in their Markov bubble in the storm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4163.696,
    "end": 4169.18,
    "text": "This section focuses on a realist interpretation of DCM in terms of dynamical causal models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4170.761,
    "end": 4173.864,
    "text": "So even instrumentalists can,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4175.56,
    "end": 4176.36,
    "text": " bat both ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4177.32,
    "end": 4182.682,
    "text": "We're not obliged to never talk about stances that in one certain situation we didn't prefer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4183.142,
    "end": 4189.244,
    "text": "It's just really wide ranging intellectual exploration that's being characterized here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4190.604,
    "end": 4200.347,
    "text": "And here, Benny does play on a little bit of a acronym play, which is that DCM applies to dynamic causal modeling as well as directed cyclic modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4201.067,
    "end": 4203.648,
    "text": "So cyclic graphs or the dynamic causal graph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4205.157,
    "end": 4211.541,
    "text": " And he'll argue through an example that we're going to discuss not today with Alison Bob.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4212.321,
    "end": 4226.348,
    "text": "He argues that the modularity in the context of DCM, it's not as strong as the Fodorian isolationist concept, but in interesting and important ways, it's going to be enough.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4229.05,
    "end": 4232.772,
    "text": "And so a moderate form of modularity is retained.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4234.728,
    "end": 4244.412,
    "text": " And Hippolyto and Kirchhoff argue that this weakened notion of modularity is explanatorily vacuous, it's empty, and there would be no reason for keeping it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4245.412,
    "end": 4247.433,
    "text": "And that's the bone of contention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4249.134,
    "end": 4255.777,
    "text": "He's going to dissent and say that the benefit of this modest notion of modularity is remarkable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4256.617,
    "end": 4258.498,
    "text": "So that's the claim.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4259.178,
    "end": 4260.398,
    "text": "Any comments on section seven?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4262.479,
    "end": 4264.14,
    "text": "What would happen if we couldn't categorize",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4271.218,
    "end": 4274.941,
    "text": " then it would be impossible to give a categorical response to that question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4277.422,
    "end": 4278.283,
    "text": "And a lot more, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4278.523,
    "end": 4280.384,
    "text": "That's basically what this comes down to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4280.644,
    "end": 4289.37,
    "text": "It doesn't mean that things aren't arbitrary and not necessarily put into the correct silos, but there is a great benefit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4289.45,
    "end": 4293.373,
    "text": "I don't think it's dispensable, our capacity to categorize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4293.393,
    "end": 4294.654,
    "text": "It doesn't mean we always...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4296.105,
    "end": 4298.627,
    "text": " are obliged to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4299.207,
    "end": 4301.168,
    "text": "But when we do do it, is there a benefit?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4301.868,
    "end": 4302.148,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4302.369,
    "end": 4303.109,
    "text": "Is there a cost?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4304.25,
    "end": 4304.57,
    "text": "Maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4305.791,
    "end": 4311.033,
    "text": "But if we took it away, what would the world look like then?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4312.634,
    "end": 4314.735,
    "text": "A triangle is a triangle is a triangle, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4315.756,
    "end": 4317.357,
    "text": "There would be no specificity then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4320.126,
    "end": 4320.606,
    "text": " Interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4320.726,
    "end": 4326.97,
    "text": "We'll talk more about categorization models and the parable of Alice and Bob.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4328.431,
    "end": 4328.651,
    "text": "Section 8.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4329.992,
    "end": 4330.632,
    "text": "Still knitting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4331.353,
    "end": 4332.093,
    "text": "Markov blankets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4333.734,
    "end": 4344.101,
    "text": "So here they return to this idea of the vertical insulation and the horizontal insulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4344.921,
    "end": 4347.243,
    "text": "Like there's encapsulation laterally",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4348.257,
    "end": 4353.64,
    "text": " collective behavior and then encapsulation like an onion, like a multi-scale system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4354.66,
    "end": 4357.102,
    "text": "So that's very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4357.142,
    "end": 4364.446,
    "text": "And this is also where we get to this point about the scale-free or scale-friendly nature of Markov blankets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4367.547,
    "end": 4372.35,
    "text": "The main reason that H&K resist this argument about the Markov blankets",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4373.47,
    "end": 4378.453,
    "text": " is based on the fact that the regimentation of states into Markov blankets is scale-free.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4379.154,
    "end": 4381.335,
    "text": "So it can range across scales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4381.656,
    "end": 4383.677,
    "text": "Maybe even that is already scale-friendly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4385.718,
    "end": 4392.623,
    "text": "Because Markov blankets are scale-free, they do not imply insulation, and thus the modularity thesis does not receive support from them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4394.564,
    "end": 4396.505,
    "text": "And so Benny concedes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4396.525,
    "end": 4397.046,
    "text": "Yeah, it's true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4397.306,
    "end": 4400.748,
    "text": "Markov blankets can be applied to basically a wide range of phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4401.189,
    "end": 4402.87,
    "text": "However, this is overlooking a subtle point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4403.959,
    "end": 4408.362,
    "text": " Markov blankets in the abstraction in principle are scale-free.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4408.862,
    "end": 4411.183,
    "text": "There's no inherent constraint on their size and scope.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4411.784,
    "end": 4415.526,
    "text": "Linear models are inherently a priori scale-free.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4415.546,
    "end": 4418.168,
    "text": "It could be centimeters versus the GDP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4418.308,
    "end": 4421.65,
    "text": "It could be astronomical units versus temperature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4421.95,
    "end": 4429.895,
    "text": "Like it doesn't have a tie-in to a certain spatial temporal scale or any feature for a linear model or for a Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4430.635,
    "end": 4443.465,
    "text": " However, cue Dean from stage left or running in from the audience, their application or imputation to various target systems will impose a definite scale on Markov blankets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4444.165,
    "end": 4458.656,
    "text": "To make a long story short, in the context of their application under FEP, not in the context of FEP, Markov blankets are not necessarily scale-free mathematical models because they're being used in models",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4459.517,
    "end": 4465.84,
    "text": " So even though the formal tools could be scale-free, application mandates calibrating to a certain scale.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4466.981,
    "end": 4481.128,
    "text": "If that's the case, and it seems like it is, then counter arguments based upon the scale-free nature of Markov blankets could not undermine arguments from Markovian formalisms soundly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4481.569,
    "end": 4486.451,
    "text": "So this is really nicely framed and placed in space and time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4486.771,
    "end": 4487.752,
    "text": "Dean, what do you think about that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4489.625,
    "end": 4492.61,
    "text": " Well, I'm still, as I said, first of all, I want to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4494.44,
    "end": 4496.241,
    "text": " I want to make sure to disclaim this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4496.581,
    "end": 4499.923,
    "text": "I never saw this paper until three days ago, four days ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4500.543,
    "end": 4513.91,
    "text": "So my guess, my WAG about scale friendly and sort of whether that was something we should consider, it was nice to read this and have somebody else go, maybe it's something we should consider.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4514.39,
    "end": 4520.514,
    "text": "I'm going to leave it at that because I don't know if somebody's going to come along and disprove that and, you know, because if that's,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4521.394,
    "end": 4530.901,
    "text": " If it's falsifiable that calibrating doesn't matter and categorizing doesn't matter, I'm open to hearing that too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4531.681,
    "end": 4549.814,
    "text": "But in the meantime, I think it's something that if we don't recognize the difference between the abstraction and that thing that we're focusing on right now, we can get lost in the idea that a triangle is a triangle is a triangle and nothing else matters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4552.904,
    "end": 4555.186,
    "text": " Lou, anything you want to add on this section?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4556.768,
    "end": 4556.948,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4557.028,
    "end": 4561.572,
    "text": "I mean, I really think that, I mean, just hits the nail on the head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4561.632,
    "end": 4565.656,
    "text": "Like we're the ones like putting the Markov blanket on something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4565.736,
    "end": 4572.462,
    "text": "And so like, just because something can be, you know, modeled using a Markov blanket doesn't necessarily mean it doesn't scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4572.482,
    "end": 4573.443,
    "text": "And, and like the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4574.184,
    "end": 4576.606,
    "text": " things don't Markov blanket themselves, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4576.626,
    "end": 4581.931,
    "text": "Like, so, I mean, even like my layer of skin, like cells are popping off and new cells are adding on all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.971,
    "end": 4585.494,
    "text": "And so like, there's, it's not a hard boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4585.534,
    "end": 4586.875,
    "text": "It's not a solid boundary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4586.935,
    "end": 4587.956,
    "text": "It's very fluid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4587.996,
    "end": 4590.238,
    "text": "Like what goes in and out of a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4590.479,
    "end": 4599.447,
    "text": "So I think like our imputation of a Markov blanket on a system, I mean, yeah, they're scale free means you can impute them on any system at any scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4600.348,
    "end": 4606.934,
    "text": " So, so maybe scale friendly is, is the way to go, but it's not like the blanket itself is scale free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4606.974,
    "end": 4610.518,
    "text": "I mean, all blankets are, are composed of stitches, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4610.538,
    "end": 4615.282,
    "text": "Like, so are you using big stitches or little stitches or like different layers of cloth or what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4615.403,
    "end": 4616.063,
    "text": "So I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4616.303,
    "end": 4617.925,
    "text": "It's, it's I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4617.945,
    "end": 4619.687,
    "text": "I think it really drives it home.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4619.707,
    "end": 4621.429,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4621.449,
    "end": 4621.629,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4622.91,
    "end": 4628.072,
    "text": " And the paper was, I mean, we can double check, but it's from December 21.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4629.732,
    "end": 4635.914,
    "text": "So we have proof of live stream, Dean, that, you know, you were there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4638.134,
    "end": 4641.836,
    "text": "Can I just say one last, because I completely agree with what Blue just said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4641.916,
    "end": 4645.877,
    "text": "I was never of an opinion that Markov Blanket isn't scale free.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4645.897,
    "end": 4646.557,
    "text": "Of course it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4647.768,
    "end": 4650.87,
    "text": " And it's kind of like saying there are subject matter experts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4651.47,
    "end": 4660.676,
    "text": "Of course there are, but as we had in the conversation with Dr. Friston, you could also say that there's a prediction matter expert.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4662.717,
    "end": 4665.459,
    "text": "All I'm asking is for people to consider that there could be both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4666.323,
    "end": 4668.104,
    "text": " and they could be running in parallel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4668.244,
    "end": 4672.466,
    "text": "I wasn't trying to push back in the sense that people are wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4672.966,
    "end": 4679.509,
    "text": "What I was saying is what else could we include to fill in the wholeness of what is happening here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4679.569,
    "end": 4681.85,
    "text": "That's all I was trying to point out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4682.21,
    "end": 4682.51,
    "text": "And again,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4685.254,
    "end": 4704.241,
    "text": " We could take active inference and focus it completely on the minimizing of free energy and getting what we're attending to, or we can talk about the availability piece and what, for example, when we're having new people on board to our lab, how we make that entry point so efficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4705.43,
    "end": 4706.752,
    "text": " so relationship-based.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4707.332,
    "end": 4707.953,
    "text": "We could do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4708.453,
    "end": 4714.881,
    "text": "We could make, for them, we could make them prediction matter experts before they even realize it in themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4715.121,
    "end": 4718.385,
    "text": "Now, whether we do that or not, it's not up to me, but we could.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4718.885,
    "end": 4722.229,
    "text": "So that's what I was trying to bring up, and that's what I like about this paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4723.78,
    "end": 4749.154,
    "text": " great last section last content slide isn't it something they say like if the newspaper article ends with a question mark I forget which one is it the it's always yes or it's always no but the footsteps die out forever so this is a summary in the ninth section Benny challenges the main points of hippolyto and kirchoff",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4750.54,
    "end": 4753.422,
    "text": " Hippolyta and Kirchhoff confuted the modularity thesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4754.162,
    "end": 4759.785,
    "text": "So Benny is salvaging the modularity thesis from the pincer attack of Hippolyta and Kirchhoff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4760.906,
    "end": 4768.51,
    "text": "To support the argumentation of the paper, Benny draws upon the indispensability of a model-based conception of modularity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4769.03,
    "end": 4773.793,
    "text": "That's where that kind of science and society angle and philosophy angle came into play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4775.711,
    "end": 4782.874,
    "text": " Benny argues that DAGs and DCMs are complimentary models and the choice between them is operational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4783.415,
    "end": 4784.095,
    "text": "It's pragmatic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4784.735,
    "end": 4788.557,
    "text": "It's not metaphysical per se.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4789.257,
    "end": 4790.918,
    "text": "So modeling is situational.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4791.278,
    "end": 4795.34,
    "text": "We can take a deflationary approach even to how we think about science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4796.741,
    "end": 4802.704,
    "text": "Benny argues that when we think about dynamic causal modeling, there is modularity",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4804.127,
    "end": 4808.851,
    "text": " because of how the statistical model pulls out differential coupling between brain areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4809.992,
    "end": 4812.815,
    "text": "And that's not a statement about the brain, it's a statement about the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4814.116,
    "end": 4827.587,
    "text": "Benny also challenges Hippolito and Kirchhoff's answer to the argument from the Markovian formalism by showing that although these models are in principle scale-free in order to represent any specific target system,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4828.493,
    "end": 4832.814,
    "text": " They have to be associated with interpretations that do give definite scales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4832.994,
    "end": 4843.036,
    "text": "So the Markov blanket formalism is conceptually scale-free, but any realization application is scale-specific, thus scale-friendly, tickles 21 at best.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4845.336,
    "end": 4846.376,
    "text": "Personal communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4848.637,
    "end": 4851.117,
    "text": "And basically- I'll be citing the live stream soon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4851.357,
    "end": 4851.637,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4853.097,
    "end": 4855.978,
    "text": "Benny closes with just saying, it doesn't undermine the claims.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4857.085,
    "end": 4860.408,
    "text": " And this isn't like a radical pro modular thesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4861.128,
    "end": 4863.51,
    "text": "It's not the isolation of brain regions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4863.57,
    "end": 4866.132,
    "text": "And they're each like virtual machines that are totally separated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4866.152,
    "end": 4873.158,
    "text": "The only point that comes to light by our enterprise in this paper is that the debate over modularity",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4874.352,
    "end": 4882.514,
    "text": " needs to take the role of scientific models into account and a model relative conception of modularity cannot be waved away easily.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4883.634,
    "end": 4889.475,
    "text": "So it is a great service and an interesting paper in form and function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4890.756,
    "end": 4893.356,
    "text": "We have an empty slide for the implications and questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4893.916,
    "end": 4899.477,
    "text": "We have the early slide with what we're gonna discuss in 35.1 and 35.2.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4903.237,
    "end": 4905.879,
    "text": " And it was an awesome discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4906.139,
    "end": 4910.583,
    "text": "So if you have any final comments, now would be a good time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4914.686,
    "end": 4930.758,
    "text": "Do you think that when you get people who've worked together as this author and the two people that he was kind of pushing back against, do you think when they take it into this kind of a formal setting of paper writing, that that changes their relationship",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4931.627,
    "end": 4932.307,
    "text": " fundamentally?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4933.288,
    "end": 4940.93,
    "text": "I suppose we could only ask the authors themselves, but does it have to be a debate necessarily?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4940.99,
    "end": 4942.83,
    "text": "Does it have to be drama necessarily?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4942.91,
    "end": 4948.352,
    "text": "Or is there kind of a moving forward hand-in-hand part to this I'm not seeing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4951.413,
    "end": 4953.293,
    "text": "It's a really interesting question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4953.333,
    "end": 4958.235,
    "text": "I'm sure scientists and all kinds of different people are going to have different answers, but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4959.485,
    "end": 4967.871,
    "text": " I think about the papers in their exact phrasing as like pheromones, digital stigmergy in the literature corpus.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4968.331,
    "end": 4971.493,
    "text": "And then the person is like the nest mate who is weaving on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4971.913,
    "end": 4975.496,
    "text": "So any artifact is gonna be made by that person in the past.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4976.136,
    "end": 4976.777,
    "text": "So I could be like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4977.637,
    "end": 4992.167,
    "text": " talking to blue and it's like, oh yeah, you know, night 2018 said this, or, you know, but you just said this, but, but didn't night 2009 say this, it's not a contradiction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4992.967,
    "end": 4999.892,
    "text": "It's just like the trajectory and the pheromone deposition of active and complex entities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5000.392,
    "end": 5005.256,
    "text": "And so I think that that I'd hope is the best of both worlds, which is we can humanize the,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5006.343,
    "end": 5014.074,
    "text": " Kirchhoff and Hippolyto and Benny and all the humans involved and take like a compassionate and even friendly,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5016.211,
    "end": 5024.636,
    "text": " tack while also being very scrutinizing of the specifics of the knowledge artifacts that people leave.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5024.736,
    "end": 5038.003,
    "text": "Because a lot of times there is like a gray zone where it'll say something in text, but then, oh, if you're in the club, then you know that they actually meant something else, or you got to read between the lines with the methods, or you have to read between the lines with the citations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5038.703,
    "end": 5043.946,
    "text": "And that's kind of a conflation of the person and the arguments that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5044.506,
    "end": 5054.369,
    "text": " like when people give an overly charitable reading or even try to insinuate things that weren't there in the initial text because they want to uphold their legend of a person.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5055.35,
    "end": 5063.952,
    "text": "And rather we can just kind of separate those two in how we model the generative process and the generated product.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5065.553,
    "end": 5068.394,
    "text": "I just think that there's so much you can learn when you're wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5069.346,
    "end": 5074.768,
    "text": " And that doesn't mean you want to be a serial mistake maker, but I don't think anybody that's publishing is looking to do that either.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5075.528,
    "end": 5089.673,
    "text": "But if you're comfortable, if you're actually comfortable with putting wrong answers out there and having people kind of prove that you're wrong, but you're comfortable with that, I think that makes a huge difference, at least in terms of the culture that you're participating in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5090.461,
    "end": 5093.162,
    "text": " It's a lot safer if you can throw stuff out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5094.483,
    "end": 5098.284,
    "text": "In four weeks or five weeks' time, somebody can say, no, Dean, you were wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5098.585,
    "end": 5100.125,
    "text": "We've got to take that citation down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5100.966,
    "end": 5101.846,
    "text": "I wouldn't take it down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5101.886,
    "end": 5102.586,
    "text": "I would leave it up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5102.706,
    "end": 5109.329,
    "text": "I would simply say, no, in that moment, I thought I was right, and now I've updated my generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5110.69,
    "end": 5112.251,
    "text": "Yeah, it's like showing your work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5112.351,
    "end": 5117.073,
    "text": "Like, here's what I knew at this time, and this is what leads me to my conclusions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5117.793,
    "end": 5119.414,
    "text": "And then someone says, well, you missed this paper from –",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5121.181,
    "end": 5148.088,
    "text": " right 1855 okay then that updates the next round of pheromone deposition exactly blue any last comments good yeah it's a fun start to 22 and it's the two architectures 2022 second year of act inf lab two two two two two two two is coming up i mean it just couldn't it couldn't get any better that's great",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5149.173,
    "end": 5149.695,
    "text": " Thank you, folks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5150.076,
    "end": 5150.758,
    "text": "Appreciate it.",
    "speaker": "SPEAKER_02"
  }
]