[
  {
    "start": 6.684,
    "end": 7.524,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 7.985,
    "end": 9.566,
    "text": "Thank you very much for joining.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 10.026,
    "end": 15.209,
    "text": "This is the Active Inference Lab, and you are listening to the Active Inference livestream.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 16.175,
    "end": 18.095,
    "text": " Welcome to the Active Inference Lab, everyone.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 18.576,
    "end": 24.717,
    "text": "We are an experiment in online team communication, learning, and practice related to active inference.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 25.037,
    "end": 31.079,
    "text": "You can find us on our website, Twitter, email, YouTube, Discord, or Keybase team.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 31.859,
    "end": 37.82,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 38.82,
    "end": 45.302,
    "text": "All backgrounds and perspectives are welcome here, and we will follow good conversational livestream etiquette.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 46.209,
    "end": 56.691,
    "text": " Today we're really excited to be discussing the Neural Correlates of Consciousness under the Free Energy Principle with one of the two authors, Wanjo Wiese.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 57.431,
    "end": 64.973,
    "text": "And today we're going to be having our first discussion, 16.1, and then next week we'll be having a follow-up discussion on the same paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 65.013,
    "end": 70.214,
    "text": "So if you have more thoughts or questions arising in the next week, that will be a great time to bring them up.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 71.442,
    "end": 78.726,
    "text": " Today in ACT InfoStream 16.1, our goal is to be learning, discussing and hearing from everyone.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 78.886,
    "end": 85.11,
    "text": "And that is gonna be facilitated by this awesome presentation that we are about to hear from Wanja.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 85.51,
    "end": 94.376,
    "text": "So for 16.1, we're gonna have a presentation and then we're gonna just pick up with the participatory discussion.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 94.796,
    "end": 98.338,
    "text": "So Wanja, thanks again for joining us and please take it away.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 100.199,
    "end": 101.32,
    "text": " Thank you for having me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 101.34,
    "end": 107.025,
    "text": "It's a real pleasure to have the opportunity to present this paper here and discuss it with you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 107.826,
    "end": 110.128,
    "text": "I'm just going to share my slides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 122.734,
    "end": 124.395,
    "text": " I think you can see the looks great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 125.116,
    "end": 138.767,
    "text": "So first, I'd like to make a short advertisement for my journal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 138.947,
    "end": 142.07,
    "text": "So together with Sasha Fink and Jennifer Wind, I",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 142.91,
    "end": 153.778,
    "text": " Founded Philosophy in the Mind Sciences, an open access journal for work at the intersection of philosophy, neuroscience and psychology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 154.859,
    "end": 165.568,
    "text": "And we recently published a special issue on the neural correlates of consciousness, which you can find at philosophymindscience.org.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 165.588,
    "end": 170.952,
    "text": "So if you're interested in this topic, you might want to check this special issue out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 172.754,
    "end": 180.197,
    "text": " Now, in this short presentation, I'm going to mention just some key points from the preprint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 181.298,
    "end": 183.759,
    "text": "And this is the structure of the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 183.779,
    "end": 186.94,
    "text": "These are just section titles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 189.961,
    "end": 211.382,
    "text": " from all sections after the introduction and we are currently revising the paper so we received some very useful reviewer comments and actually one of the reviewers pointed out that if you're not already committed to or interested in the free energy principle",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 212.743,
    "end": 220.869,
    "text": " the results that we present in this paper may not be that interesting or may not seem that relevant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 221.37,
    "end": 235.82,
    "text": "And in fact, in part, this is, I think, a fair comment, because in the first section after the introduction, we review the standard notion of a neural correlate of consciousness",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 237.041,
    "end": 241.803,
    "text": " which has been provided by David Chalmers in a seminal paper in 2000.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 242.483,
    "end": 248.505,
    "text": "And we then mentioned some challenges for this concept.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 249.545,
    "end": 256.248,
    "text": "And this motivates moving from the neural correlates of consciousness to the computational correlates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 257.489,
    "end": 271.448,
    "text": " and actually then in the next discussion you also relate this to the free energy principle and then it turns out that there are some problems if you want to apply the free energy principle to this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 272.529,
    "end": 280.354,
    "text": " kind of research, because the main reason is that the free energy principle is not itself a theory of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 281.415,
    "end": 287.478,
    "text": "And it's not a theory of computational correlates of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 288.479,
    "end": 302.329,
    "text": " and there are first some obstacles that have to be overcome if you want to apply the free energy principle to research on consciousness or on neural and computational correlates of consciousness in particular.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 303.43,
    "end": 321.206,
    "text": " And if you're not already committed to the free energy principle or not really interested in it, you may wonder, well, why should I even bother thinking about this if it only creates new problems that you don't get into if you're not dealing with the free energy principle in the first place?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 321.946,
    "end": 325.089,
    "text": "So this is, I think, a fair question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 325.349,
    "end": 329.573,
    "text": "And we're trying to highlight the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 330.262,
    "end": 336.184,
    "text": " on genuine contributions that we're making or that we're trying to make in this paper and the revisions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 336.924,
    "end": 357.109,
    "text": "And these mainly relate to the final two sections before the conclusion in which we talk about computational explanations of consciousness in general and what the free energy principle can provide or can contribute to this project.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 357.849,
    "end": 366.951,
    "text": " And then we try to explain what the specific role of the free energy principle can be here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 367.031,
    "end": 370.832,
    "text": "And we suggest that it may provide unification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 371.872,
    "end": 378.134,
    "text": "So I will take a few minutes to talk about these things in a bit more detail.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 379.174,
    "end": 382.675,
    "text": "So let's see, this is a more detailed",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 383.608,
    "end": 385.889,
    "text": " overview of the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 385.929,
    "end": 403.134,
    "text": "So in the section in which we talk about the neural correlates of consciousness, we mentioned that according to the standard definition, a neural correlate of consciousness is a minimally sufficient neural structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 403.714,
    "end": 407.256,
    "text": "And then there are three challenges that we mentioned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 407.536,
    "end": 408.136,
    "text": "One is that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 409.497,
    "end": 423.007,
    "text": " Actually, what is interesting about the neural activity associated with consciousness may not be that it happens in a particular place in the brain, but more that it displays a certain dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 423.668,
    "end": 426.15,
    "text": "And this can even be global dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 426.891,
    "end": 437.399,
    "text": "So it's not what's happening at a place, but what's happening over time and maybe in the entire brain or in large parts at least of the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 439.545,
    "end": 445.082,
    "text": " Then another question is, even if you can map certain",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 446.451,
    "end": 452.994,
    "text": " types of neural activity to conscious experiences, this mapping can be seemingly arbitrary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 453.314,
    "end": 462.538,
    "text": "So we need to understand why or would like to understand why that particular type of activity is associated with consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 463.698,
    "end": 470.321,
    "text": "And then a third challenge is that the notion of a neural correlate of consciousness",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 471.401,
    "end": 483.285,
    "text": " as defined by Chalmers and as used in much research on NCCs, only applies to usual conditions and does not apply to unusual conditions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 483.325,
    "end": 491.307,
    "text": "So after brain damage, for instance, and another very unusual condition is provided by",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 492.619,
    "end": 495.101,
    "text": " potential cases of islands of awareness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 495.181,
    "end": 513.337,
    "text": "So this is from a recent paper by Tim Bain, Anil Seth and Marcello Massimini, in which they ask the question whether there can be systems that are constantly isolated from the body and the environment and still be conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 514.153,
    "end": 524.55,
    "text": " So can there be conscious states in systems that neither receive sensory input nor produce motor output?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 526.041,
    "end": 535.127,
    "text": " And there are some potential candidates for such systems, which include X cranial brains, hemispherotomy and cerebral organoids.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 536.048,
    "end": 548.076,
    "text": "So an X cranial brain is a brain that has been extracted from the cranium, but is kept alive and which can still display some non-trivial activity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 550.118,
    "end": 552.66,
    "text": "And in hemispherotomy,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 554.073,
    "end": 562.648,
    "text": " a large part of the brain is more or less disconnected from other parts or the rest of the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 562.988,
    "end": 567.556,
    "text": "So neuronal connections to other parts of the brain are cut.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 569.099,
    "end": 575.305,
    "text": " And in, well, organoids such as neural structures grown in the lab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 576.025,
    "end": 587.736,
    "text": "And in all cases, well, one may wonder, well, could such structures, such systems give rise to activity patterns that are sufficient for consciousness?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 589.137,
    "end": 594.362,
    "text": "And what we suggest is that computational correlates could",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 595.973,
    "end": 604.217,
    "text": " provide at least some progress towards an answer because computational correlates can be applied to different kinds of system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 605.058,
    "end": 610.861,
    "text": "And in fact, the authors of this paper mention complexity measures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 611.521,
    "end": 618.345,
    "text": "So there's some evidence that neural activity associated with consciousness displays",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 619.389,
    "end": 625.513,
    "text": " large or high complexity, high algorithmic complexity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 626.213,
    "end": 640.942,
    "text": "And in principle, one could measure the complexity of activity generated in these isolated systems, and that could provide some evidence for inferring the presence of consciousness in such systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 641.563,
    "end": 643.624,
    "text": "Now, actually,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 647.56,
    "end": 651.862,
    "text": " Complexity is also an issue when it comes to applying the free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 652.382,
    "end": 654.403,
    "text": "I will talk about that in a minute.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 655.023,
    "end": 673.372,
    "text": "And one of the things we do in the next section is that we relate the free energy principle to work on computational correlates of consciousness and computational principles that have been associated with consciousness",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 674.792,
    "end": 679.954,
    "text": " And we in particular, we also discuss the challenge of islands of awareness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 679.994,
    "end": 687.436,
    "text": "And this is not just a challenge for neural correlates of consciousness, but also especially a challenge for the free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 687.936,
    "end": 694.077,
    "text": "One of the problems that is created by trying to apply the free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 694.718,
    "end": 696.338,
    "text": "And the reason is this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 697.258,
    "end": 703.06,
    "text": "The free energy principle is mainly applicable to systems that are",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 703.8,
    "end": 706.141,
    "text": " in causal interaction with the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 706.801,
    "end": 721.785,
    "text": "So systems that are part of an action perception loop in which internal states interact with external states mediated by blanket states, which contain sensory and active states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 722.245,
    "end": 730.808,
    "text": "But if you have an isolated system which is cut off from sensory input and motor output,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 732.085,
    "end": 737.748,
    "text": " it's not clear that you can apply the free energy principle to describe what's going on in the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 738.768,
    "end": 748.532,
    "text": "But actually, there's some existing work on the free energy principle and dreaming by Alan Hobson and Carl Fristen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 748.992,
    "end": 757.796,
    "text": "And in that work, they suggest that, well, I just go a bit forward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 760.425,
    "end": 774.169,
    "text": " As is well known, I guess, you can formulate or describe the free energy functional as involving an accuracy and a complexity term.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 774.249,
    "end": 781.311,
    "text": "So you can write variational free energy as complexity minus accuracy or complexity plus inaccuracy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 784.164,
    "end": 796.484,
    "text": " As it turns out, the accuracy term contains a term denoting particular states which involve blanket states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 797.811,
    "end": 800.973,
    "text": " And the complexity term does not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 801.053,
    "end": 806.057,
    "text": "So the complexity term can be minimized by changing internal states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 806.757,
    "end": 815.603,
    "text": "And so in previous work, it was suggested that during dreaming, the causal interaction with the environment is attenuated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 815.743,
    "end": 822.247,
    "text": "And so this free energy gradient is mainly driven by the complexity term.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 822.848,
    "end": 827.131,
    "text": "So basically what the brain's doing during dreaming is minimizing complexity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 827.951,
    "end": 836.413,
    "text": " And we suggest that the same holds a fortiori for cases of islands of awareness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 836.434,
    "end": 844.876,
    "text": "So such systems should at least for some time minimize free energy by minimizing complexity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 845.888,
    "end": 866.307,
    "text": " And now this brings up complexity again, and the question how this relates to empirical research, according to which neural activity associated with consciousness maximizes complexity, or at least displays high complexity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 869.009,
    "end": 893.219,
    "text": " this tension can be resolved by noting that the free energy functional contains a statistical form of complexity and complexity measures in consciousness science are measures of dynamical complexity that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 894.969,
    "end": 900.092,
    "text": " are often based on an approximation to algorithmic complexity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 900.953,
    "end": 905.195,
    "text": "So there are actually two different notions of complexity in play here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 905.955,
    "end": 908.957,
    "text": "And according to the free energy principle, islands of awareness should",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 909.844,
    "end": 920.528,
    "text": " minimize one type of complexity, but it leaves open the question whether they maximize a different type of complexity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 920.548,
    "end": 929.271,
    "text": "And we suggest that it would be useful to formulate or develop a notion of dynamical complexity",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 930.231,
    "end": 933.014,
    "text": " within the framework provided by the free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 933.134,
    "end": 950.832,
    "text": "So it would be useful to define dynamical complexity or measure of dynamical complexity in terms of the intrinsic information geometry of a system as opposed to a definition in terms of the extrinsic information geometry",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 952.515,
    "end": 956.962,
    "text": " Um, but this is actually not something I want to dwell on here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 957.002,
    "end": 960.507,
    "text": "So, um, let's go to the next point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 960.667,
    "end": 963.531,
    "text": "Um, computation explanations of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 964.032,
    "end": 964.413,
    "text": "Um, we,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 966.172,
    "end": 981.615,
    "text": " Well, that's a fundamental problem associated with trying to develop a computational explanation of consciousness, because computations can be performed by vastly different types of system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 982.256,
    "end": 991.938,
    "text": "So you can perform computations in the game of life, and you can compute mathematical functions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 993.198,
    "end": 1021.063,
    "text": " by playing magic the gathering so the game of life is turing complete and as i recently learned magic the gathering is turing complete as well but i wouldn't suppose that anything that happens in the game of life gives rise to consciousness or that you can instantiate consciousness by playing magic the gathering in a particular way so um just",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1022.236,
    "end": 1030.823,
    "text": " Computing the right mathematical functions in a physical system is not sufficient for consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1032.525,
    "end": 1040.792,
    "text": "Or in other words, there's a difference between simulating consciousness in a system and actually instantiating consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1042.725,
    "end": 1046.212,
    "text": " And the question is, okay, how can we make this difference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1047.394,
    "end": 1052.102,
    "text": "How can we understand the difference between simulating and instantiating consciousness?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1052.944,
    "end": 1054.908,
    "text": "And here we,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1056.172,
    "end": 1063.434,
    "text": " think that the free energy principle can make a perhaps tiny, but we think relevant contribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1064.195,
    "end": 1075.638,
    "text": "And the main idea is this, as I already mentioned, this is the causal flow in an action perception loop, according to the free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1076.279,
    "end": 1076.979,
    "text": "So here we have a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1078.437,
    "end": 1080.839,
    "text": " physical system with internal states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1082.16,
    "end": 1091.808,
    "text": "And it's coupled to external states via blanket states, which comprise sensory and active states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1092.469,
    "end": 1095.832,
    "text": "And so the main cause of flow we have here is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1096.572,
    "end": 1101.754,
    "text": " in this physical system is between internal states and external states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1102.734,
    "end": 1111.796,
    "text": "So internal states act on external states via active states and external states act on internal states via sensory states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1112.897,
    "end": 1119.258,
    "text": "Okay, now what happens if we simulate this, such a system in a digital computer?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1120.639,
    "end": 1125.02,
    "text": "Now this is a caricature or simple",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1125.936,
    "end": 1131.03,
    "text": " visual model of a computer with a von Neumann architecture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1132.091,
    "end": 1147.061,
    "text": " And one of the characteristic features of such a computing device is that it has a distinct memory unit, which is separate from the CPU of the central processing unit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1147.441,
    "end": 1161.831,
    "text": "So if you simulate a system with this causal flow in such a system, you'd have to store the values of these variables of external, internal, and blanket states within the memory unit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1162.932,
    "end": 1168.677,
    "text": " And in order to compute updates of these variables, you have to engage the CPU.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1168.757,
    "end": 1176.303,
    "text": "So the main causal flow would be between the memory unit and the CPU.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1176.983,
    "end": 1185.671,
    "text": "Of course, there are also variants of this architecture in which the CPU contains the memory unit, but then the main causal flow would",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1186.351,
    "end": 1195.02,
    "text": " be within the CPU and also between the memory unit within the CPU and the rest of the CPU.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1195.46,
    "end": 1202.968,
    "text": "So it's a different kind of causal flow in this physical system, although the computations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1203.809,
    "end": 1217.661,
    "text": " performed by these systems can be the same in the sense that internal states can be interpreted as conditional probabilities of external states given blanket states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1219.503,
    "end": 1219.803,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1220.324,
    "end": 1228.771,
    "text": "So this is, we suggest, one of the differences between simulating and instantiating consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1230.994,
    "end": 1239.778,
    "text": " There's a constraint on the causal interaction or causal flow between the system or the system's internal states and its environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1240.499,
    "end": 1247.322,
    "text": "And of course, this may be different in a computer with a neuromorphic architecture.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1247.342,
    "end": 1247.382,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1251.024,
    "end": 1260.829,
    "text": " Then in the final section, we relate these ideas to previous work on minimal unifying models of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1261.53,
    "end": 1266.272,
    "text": "And so I'll just explain this very briefly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1267.213,
    "end": 1270.475,
    "text": "In general, what can computational models bring to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1271.535,
    "end": 1276.199,
    "text": " bring to, or how can they facilitate an understanding of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1276.839,
    "end": 1284.525,
    "text": "So computational models may serve as a bridge between phenomenal properties of experience and properties of neural activity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1285.126,
    "end": 1288.208,
    "text": "They may operationalize theories of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1288.869,
    "end": 1295.133,
    "text": "They may explain theological functions, that is cognitive capacities associated with consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1296.517,
    "end": 1302.681,
    "text": " And so these are things that, for instance, active inference models could provide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1303.322,
    "end": 1311.927,
    "text": "And the free-energy principle together with such models can then serve as a unifying framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1312.748,
    "end": 1314.909,
    "text": "And how can it be unifying?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1314.949,
    "end": 1317.071,
    "text": "So here's just one possibility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1320.373,
    "end": 1340.327,
    "text": " start with what jonathan birch calls the facilitation hypothesis in a recent paper so there he writes phenomenally conscious perception of a stimulus facilitates relative to unconscious perception a cluster of cognitive abilities in relation to that stimulus so this is just a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1341.087,
    "end": 1344.749,
    "text": " a hypothesis which can be empirically investigated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1344.789,
    "end": 1351.413,
    "text": "You can, for instance, look at different non-human animals and see whether",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1353.226,
    "end": 1371.961,
    "text": " non-human animals that have one of these cognitive abilities in that cluster also have the other cognitive abilities and whether animals that do not have one of these abilities also lack the other cognitive abilities and so this would then corroborate the hypothesis that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1374.164,
    "end": 1384.119,
    "text": " There's some mechanism that facilitates or enables all of these, an entire cluster of cognitive abilities, and this could be what consciousness does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1386.334,
    "end": 1409.549,
    "text": " In addition to that, one could also find theoretical supportive evidence if one builds minimal models of these cognitive abilities, and if one could show that a minimal model of one cognitive ability in that cluster is also a minimal model of other abilities, or if one could show that there's a common",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1410.316,
    "end": 1422.339,
    "text": " computational mechanism that accounts for all of these cognitive abilities and hypothetical example just to illustrate would be active inference models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1424.16,
    "end": 1429.181,
    "text": "If active inference models of such a cluster of abilities",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1429.981,
    "end": 1435.823,
    "text": " or required deep temporal processing or maybe deep counterfactual processing or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1436.383,
    "end": 1458.15,
    "text": "So if one would have to posit a certain generative model with a certain architecture in order to account for these different abilities, then that could be something like a common computational mechanism which then could further corroborate the hypothesis that there's something that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1459.185,
    "end": 1465.993,
    "text": " that facilitates these cognitive abilities together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1468.075,
    "end": 1473.02,
    "text": "Okay, and this is gonna lead to something like a minimal unifying model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1473.281,
    "end": 1477.525,
    "text": "I introduced this term in a paper in Neuroscience of Consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1478.326,
    "end": 1482.127,
    "text": " A minimal unifying model specifies only necessary conditions for consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1482.887,
    "end": 1489.128,
    "text": "It involves determinable descriptions that can be made more specific and unifies existing accounts of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1489.968,
    "end": 1503.39,
    "text": "And I would now add that it can also unify cognitive abilities associated with consciousness, not just accounts of consciousness, not just theories of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1504.31,
    "end": 1506.891,
    "text": "OK, but we can talk about this in the discussion and the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1507.851,
    "end": 1515.039,
    "text": " A general picture would be that there are these different aspects of the science of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1515.579,
    "end": 1516.88,
    "text": "There are theories of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1518.186,
    "end": 1524.469,
    "text": " potential teleological functions of consciousness, that is cognitive capacities associated with consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1525.069,
    "end": 1529.231,
    "text": "And there are mathematical functions that are computed by conscious systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1529.972,
    "end": 1542.077,
    "text": "There's the notion of complexity and then neural correlates of consciousness and perhaps minimal unifying models could be useful here as I've suggested.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1542.597,
    "end": 1544.899,
    "text": "And the free energy principle can provide",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1546.019,
    "end": 1554.366,
    "text": " a way of relating these different notions and different branches of research together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1554.406,
    "end": 1565.096,
    "text": "For instance, active inference models can be used to develop operationalized theories of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1565.896,
    "end": 1567.318,
    "text": "I mean, there's been this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1568.378,
    "end": 1582.386,
    "text": " recent active inference model of the global neuronal workspace theory of consciousness and active inference can be used to model cognitive capacities and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1582.566,
    "end": 1592.051,
    "text": "And relating these different notions and these different kinds of work together could then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1593.312,
    "end": 1611.703,
    "text": " also lead an insight into why different neural structures are associated with consciousness and what role complexity actually plays in consciousness and many other questions and problems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1611.803,
    "end": 1614.865,
    "text": "Okay, so this is the end of my short presentation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1615.605,
    "end": 1620.488,
    "text": "Thank you for listening and I'm very much looking forward to the discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1625.14,
    "end": 1625.44,
    "text": " Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1625.46,
    "end": 1626.642,
    "text": "Thank you for that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1626.682,
    "end": 1627.603,
    "text": "For that really awesome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1629.665,
    "end": 1630.626,
    "text": "So you could great.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1633.032,
    "end": 1651.629,
    "text": " Well, what a awesome way to begin this conversation with a presentation and also really appreciated that you're revising the paper and kind of giving us this glimpse of not just a research field that's in evolution, but the paper itself is undergoing changes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1652.21,
    "end": 1655.352,
    "text": "So for the rest of this presentation,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1656.053,
    "end": 1678.974,
    "text": " actim stream 16 we'll kind of play it by the usual rules if anybody wants to just raise their hand we'll get to everybody who does um also we do have the slides and blue who's um here and i had done 16.0 so we had thought through a couple of topics so um at this point i guess we'll",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1679.634,
    "end": 1685.957,
    "text": " open it up to people who want to raise their hand and can also just say hello on their first time speaking.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1686.537,
    "end": 1690.359,
    "text": "And then in the absence of hand raising, we'll just continue through these slides.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1690.439,
    "end": 1692.18,
    "text": "So thanks again, Juancha.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1692.36,
    "end": 1695.701,
    "text": "And let's go to Stephen first and then anyone else who raises their hand.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 1697.582,
    "end": 1698.643,
    "text": "Yeah, I'd just like to say thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1698.703,
    "end": 1701.624,
    "text": "Very interesting to hear the developments on the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.785,
    "end": 1704.506,
    "text": "I was just going to ask about the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1706.107,
    "end": 1708.168,
    "text": " Well, I suppose there's a lot of things that come up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1708.248,
    "end": 1715.67,
    "text": "Stephen, by the way, just say I'm based in Toronto, but I'm working on a practice-based PhD through the UK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1716.61,
    "end": 1720.211,
    "text": "And one thing that came up on your slides there was interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.531,
    "end": 1734.895,
    "text": "When you were looking at the potential for there to be some sort of memory that relates to those states, and I was curious whether that memory itself might have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.161,
    "end": 1764.447,
    "text": " to be connected to sensory states or whether that might be something that which is standalone and if so whereabouts you might think that might be in the brain like is it a hippocampus type question grid cell type question or something like that so thank you thank you and that's a very interesting question and i think it could be useful to show my slides again",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.961,
    "end": 1769.022,
    "text": " Let's do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1778.106,
    "end": 1781.108,
    "text": "OK, so you're referring to this picture, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1783.049,
    "end": 1796.196,
    "text": "And yeah, so the idea would be that in a system that simulates a system that is in an action perception loop,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1798.465,
    "end": 1810.249,
    "text": " There would be some internal states that encode the internal states of this system that is being simulated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1810.989,
    "end": 1816.871,
    "text": "So this digital computer would have some physical states that encode the internal states of the simulated system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1823.186,
    "end": 1829.35,
    "text": " coming to the first part of your question, that there would have to be some interaction with sensory input.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1829.79,
    "end": 1831.071,
    "text": "But what is sensory input?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1831.091,
    "end": 1845.559,
    "text": "So this, in principle, one could say, well, any of the other physical states of this digital computer could serve as the sensory input to these internal states, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1847.16,
    "end": 1848.241,
    "text": "And the question is,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1849.867,
    "end": 1868.038,
    "text": " would the causal relations between these physical states that encode internal and sensory states of the simulated systems, would these causal relations be similar to the causal relations we see here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1868.738,
    "end": 1871.4,
    "text": "And I would suggest no.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1873.802,
    "end": 1874.302,
    "text": "And then there's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1875.751,
    "end": 1884.98,
    "text": " Another aspect you mentioned in your question, which is whether there could be some memory unit in the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1885.941,
    "end": 1891.046,
    "text": "And so perhaps you can elaborate a little on this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1891.446,
    "end": 1896.131,
    "text": "Were you thinking about simulations that are going on in the brain?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1897.941,
    "end": 1924.616,
    "text": " yeah i was kind of thinking um or curious if if you could have maybe two parallel kind of you've got the real time real sensory input being like experienced and then there's like an update to this kind of memory but that memory doesn't you know that memory rather than it being a representation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1925.902,
    "end": 1927.903,
    "text": " that memory, it could be different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.823,
    "end": 1937.126,
    "text": "And with that memory, I'm curious whether that memory itself then connects back to the actual sensory organs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1937.146,
    "end": 1949.31,
    "text": "So it's not like it's in some computed form, but somehow the sense of smell, the multi-sensory integration is still happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1950.379,
    "end": 1957.727,
    "text": " at some level, you know, but maybe in a different way, which then helps in dreaming and stuff like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.032,
    "end": 1965.014,
    "text": "Yeah, so this is really interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1966.856,
    "end": 1967.177,
    "text": "I mean, you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1969.02,
    "end": 1975.805,
    "text": " I think it could be useful to distinguish different types of simulation that could occur in the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1976.526,
    "end": 1988.234,
    "text": "One would maybe be involved in imagining certain counterfactual situations, and another would be involved in dreaming.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1988.955,
    "end": 1995.4,
    "text": "And you're suggesting that there must be some memories somewhere and which",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1997.884,
    "end": 2011.937,
    "text": " that maybe have, which would be some states that give rise to these",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2013.22,
    "end": 2037.66,
    "text": " conscious experiences but they're not directly connected to a sensory input is that what you're yeah they're not maybe not directly connect they're connected to the sensory organs and so so it's not that it's like a separate it's like you in a way I'm saying it needs to keep some connection to the sensory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2039.178,
    "end": 2042.201,
    "text": " what we would call inputs, I suppose, but in a different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2042.221,
    "end": 2059.115,
    "text": "So it's not like it's completely offline, if that makes sense, but it might be online in a different way, which would then still allow you to have a dynamical system in both cases and a plausible route for how they came about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2061.898,
    "end": 2063.86,
    "text": "So I'm curious about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2064.16,
    "end": 2064.861,
    "text": "So basically,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2065.948,
    "end": 2089.114,
    "text": " um you you know whatever these priors are this they're still somehow um engaged in the sensory organs in in being alive and conscious thanks steven um wangia go for a response there and then we'll continue with adam and marco and then anyone else",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2091.338,
    "end": 2102.946,
    "text": " So one thing that comes to mind here is that it may be useful to talk about nested Markov blankets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2103.666,
    "end": 2111.971,
    "text": "So you'd have the brain with sensory states and active states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2112.832,
    "end": 2118.836,
    "text": "And the states of the brain can be regarded as internal states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2119.414,
    "end": 2140.771,
    "text": " But within the brain, there would then be another Markov blanket and internal states within these internal states, which would then be directly associated with simulations or with dreaming or other kinds of experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2141.772,
    "end": 2148.457,
    "text": "And so there would be an indirect connection to sensory organs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2150.472,
    "end": 2173.485,
    "text": " but the, as it were the sensory states that immediately affect these internal states that are associated with say dreaming, what would be within the brain and not directly connected to sensory organs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2176.506,
    "end": 2176.867,
    "text": "Cool.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2177.407,
    "end": 2178.047,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2178.548,
    "end": 2178.648,
    "text": "Adam,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2180.922,
    "end": 2185.184,
    "text": " at Denmark.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2185.204,
    "end": 2185.724,
    "text": "Can you hear me?",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2186.084,
    "end": 2186.264,
    "text": "Yep.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2187.685,
    "end": 2189.225,
    "text": "Hi, everyone.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2189.986,
    "end": 2190.486,
    "text": "Hi, Juanjo.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2190.566,
    "end": 2191.426,
    "text": "Thanks for that.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2192.727,
    "end": 2209.674,
    "text": "This is really fascinating work, and it's disturbing me in that I've recently attempted to present a minimal unified model using the free energy principle as an overarching framework.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2211.288,
    "end": 2216.093,
    "text": " And I'm wondering whether I need to backpedal on some of the claims I made.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2216.794,
    "end": 2224.061,
    "text": "So I tried to bring together integrated information theory and global neuronal workspace theory.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2225.382,
    "end": 2231.629,
    "text": "But in doing this, one of the things I pushed back against in IIT is the... Sorry, I tried my little breathless.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2233.345,
    "end": 2244.41,
    "text": " One claim I was trying to push back on is that you needed a neuromorphic architecture to have consciousness and that you couldn't do it on a von Neumann one.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2244.47,
    "end": 2255.394,
    "text": "I think this issue is probably largely moot due to just what probably it would take to get enough compute.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2255.734,
    "end": 2257.995,
    "text": "We probably need neuromorphics just for energy efficiency.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2258.135,
    "end": 2262.397,
    "text": "But I'm wondering with respect to that,",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2263.049,
    "end": 2285.543,
    "text": " that slide and in terms of causation, whether like by the time we commit to a core screening that involves those entities, that actually we might need to core screen over the workings of the Von Neumann architecture and actually go into the virtual machine.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2286.583,
    "end": 2292.767,
    "text": "And that the causation is in terms of like a, like in Perlian causation, we have to like",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2293.479,
    "end": 2295.761,
    "text": " commit to an ontology.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2296.442,
    "end": 2300.705,
    "text": "And then once we have our directed graphical model, then we're doing the operations and that's like our causation.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2301.766,
    "end": 2320.181,
    "text": "And so I'm wondering if there might be like a mixing in that figure and that if we're like, I don't know if that makes sense, but I guess with relation to nested Markov blankets and Steven's question also, I'm wondering if this might end up taking",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2321.633,
    "end": 2339.739,
    "text": " biological consciousness and potentially putting it in the same kind of epiphenomenal boat in terms of degrees of how much directness allows us to actually treat sensory motor coupling as actually being real and causal.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2340.339,
    "end": 2347.622,
    "text": "So I'm wondering if we do that, we end up like being in the same boat of not ascribing consciousness to",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2348.988,
    "end": 2357.653,
    "text": " biological systems either, even though they're using massively parallel operations and they're in their very dynamics, having this dual aspect character.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 2361.255,
    "end": 2361.735,
    "text": "I do not know.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2363.496,
    "end": 2363.796,
    "text": "Cool.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2363.876,
    "end": 2366.338,
    "text": "Wonja, go for it, and then Marka.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2367.458,
    "end": 2368.099,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2368.739,
    "end": 2371.541,
    "text": "By the way, Adam, thanks for attending this session.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2373.631,
    "end": 2379.113,
    "text": " And immediately, I had some comments on Twitter when I posted the link to the preprint.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2379.273,
    "end": 2382.375,
    "text": "And I didn't have time to respond to these comments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2382.395,
    "end": 2390.478,
    "text": "So I'm really grateful to you for attending this so we can actually discuss the points that you raised.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2391.218,
    "end": 2396.14,
    "text": "And yeah, so how real are virtual machines?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2396.32,
    "end": 2401.362,
    "text": "And I think there are two issues that have to be separated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2402.449,
    "end": 2404.891,
    "text": " And so this is one thing I'm sure about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2405.091,
    "end": 2408.073,
    "text": "And then there's one thing that I'm less confident about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2408.113,
    "end": 2430.067,
    "text": "So the thing I'm sure about is if you have a coarse grained description of a system and abstracting away from certain details, that doesn't mean that you end up describing things that are not as real as the things that are happening at a more detailed level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2431.93,
    "end": 2458.855,
    "text": " So if you're describing a brain in terms of what's going on in individual neurons and describe that in a lot of detail, that's a more specific description you have than if you're just considering the average activity of neuronal populations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2459.994,
    "end": 2486.704,
    "text": " But that doesn't mean that what's going on at a population level is less real or that this average activity cannot have causal powers or that relations that you could describe as causal relations at this more coarse-grained level, that these relations are not really causal relations or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2487.244,
    "end": 2489.205,
    "text": "So I think we agree on this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2490.066,
    "end": 2516.882,
    "text": " part and then the question is well if at such a coarse-grained level if i understand you correctly at this at such a more coarse-grained level if this instantiates a virtual machine doesn't this mean that the virtual machine is um as real as the physical machine that instantiates the machine and i'm",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2518.655,
    "end": 2531.12,
    "text": " I actually I don't know, but there are some things that follow if you accept that virtual machines can be conscious that are really, really counterintuitive and disturbing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2531.934,
    "end": 2547.217,
    "text": " So if you've watched the series Black Mirror, there are these episodes in which a person is uploaded to a computer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2547.617,
    "end": 2552.478,
    "text": "And then there's a virtual version of that person in a virtual environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2553.298,
    "end": 2558.279,
    "text": "And that virtual person is being tortured for, I don't know, for weeks or even months.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2562.069,
    "end": 2564.991,
    "text": " The assumption is that this virtual entity is conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2566.732,
    "end": 2576.757,
    "text": "And this happens over a course of, I don't know, minutes in the external real world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2577.358,
    "end": 2587.643,
    "text": "So if a virtual machine can be conscious, then conscious experiences that we have during",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2590.302,
    "end": 2598.085,
    "text": " during over the course of several weeks or months could take place within minutes or maybe even within seconds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2599.345,
    "end": 2600.786,
    "text": "And that's really strange.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2600.966,
    "end": 2607.988,
    "text": "But you could also run these computational processes backwards.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2608.148,
    "end": 2613.57,
    "text": "And then you'd have backwards conscious experiences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2613.59,
    "end": 2617.392,
    "text": "Or you could stop them at any moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2618.439,
    "end": 2619.76,
    "text": " and then continue them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2620.841,
    "end": 2644.416,
    "text": "Or you could have physically highly distributed systems that are connected by some device, which then enables this collection of physically scattered systems to perform some computations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2645.136,
    "end": 2646.177,
    "text": "And if this can then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2647.21,
    "end": 2675.545,
    "text": " a rise to consciousness you'd have a very strange conscious entity and other things like that and then there are these thought experiments such as uh netblocks blockhead um experiment in which the chinese nation instantiates consciousness and or at least the functional states that may be associated with consciousness and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2676.531,
    "end": 2681.194,
    "text": " So there are these really counterintuitive consequences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2683.356,
    "end": 2692.942,
    "text": "And this is the main motivation for me for trying to make a distinction between simulating consciousness and instantiating consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2694.063,
    "end": 2698.526,
    "text": "And maybe there are some virtual machines that are conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2700.347,
    "end": 2705.07,
    "text": "But my intuition is that it would have to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2705.933,
    "end": 2708.954,
    "text": " fulfill very specific conditions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2709.094,
    "end": 2727.76,
    "text": "And one of these conditions may be that the interaction it has with its physical environment must be the same type of interaction that the simulated system has with the simulated environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2728.86,
    "end": 2732.442,
    "text": "And that's what I tried to illustrate here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2732.702,
    "end": 2733.682,
    "text": "But of course, you could",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2735.014,
    "end": 2743.821,
    "text": " You could argue, well, this is just motivated reasoning because you don't want to accept these counterintuitive consequences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2744.122,
    "end": 2752.649,
    "text": "And why would you make this accept?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2752.809,
    "end": 2754.991,
    "text": "Why should one accept this requirement?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2757.89,
    "end": 2758.17,
    "text": " Thanks.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2758.29,
    "end": 2761.751,
    "text": "It's an interesting style, the argument from consequences with consciousness.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2761.811,
    "end": 2765.411,
    "text": "Well, that can't be correct because then this would be conscious and we know that's not true.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2765.451,
    "end": 2766.832,
    "text": "It's like, wait, do we know that?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2767.452,
    "end": 2769.572,
    "text": "So Marco and then blue.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2770.592,
    "end": 2771.132,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2771.652,
    "end": 2772.653,
    "text": "Another question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2773.613,
    "end": 2777.573,
    "text": "Another comment about a massive mark of blankets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2777.813,
    "end": 2786.295,
    "text": "And so you suggested that maybe this requirement is too strong if we",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2787.657,
    "end": 2790.229,
    "text": " Maybe it's fine if we apply that to, to,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2793.172,
    "end": 2820.093,
    "text": " digital computers but um if we then apply that to actual to biological organisms that we would regard as conscious then the result would be that they are not really conscious at all so it's too strong i guess that's what you're suggesting about what you're um the question that you're raising so um yeah",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2821.877,
    "end": 2829.122,
    "text": " I guess one would have to flesh this out in a bit more detail.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2829.182,
    "end": 2836.468,
    "text": "But one way would be to say, look, the free energy principle makes some idealizing assumptions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2837.328,
    "end": 2842.833,
    "text": "And the very notion of a Markov blanket as used in the free energy principle is as",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2844.913,
    "end": 2873.042,
    "text": " I think many know by now, slightly different from the notion used by or proposed by Judea Pearl because Pearl's notion of a Markov blanket is just a feature, Pearl's Markov blanket is just a feature of a model of certain causal graphs and the Markov blanket used in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2874.073,
    "end": 2884.898,
    "text": " The free energy principle is an ontological notion or metaphysical notion because it's meant to be actually part of a physical system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2885.858,
    "end": 2898.284,
    "text": "And one quick question that it really exists and yeah, so, or that,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2900.692,
    "end": 2928.315,
    "text": " actual biological organisms that are conscious that they actually have these or that they fulfill these idealizing assumptions made by the free energy principle and for this reason if we derive a a constraint on what it means to be a conscious system as opposed to simulating a conscious system from the free energy principle we're actually",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2929.864,
    "end": 2945.558,
    "text": " requiring that a system has these or fulfills these idealizing assumptions which may be features of a model of a system but are not actually satisfied or not actually instantiated",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2946.792,
    "end": 2948.072,
    "text": " by the system itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2950.153,
    "end": 2968.357,
    "text": "I think there's an ongoing discussion or there will be an ongoing discussion about the notion of a Markov blanket and whether it's justified to treating it as a ontological notion, as a feature of an actual physical system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2970.597,
    "end": 2975.258,
    "text": "And we are committed to this strong reading in the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2976.167,
    "end": 2984.374,
    "text": " So we're using the notion of a Markov blanket in the ontological sense, not just in the epistemic sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2985.154,
    "end": 2986.776,
    "text": "So this may be a problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2989.438,
    "end": 2989.818,
    "text": "Cool.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2990.238,
    "end": 2991.86,
    "text": "Thank you for that addition.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2992.04,
    "end": 2993.801,
    "text": "So Markov, then Blue.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2996.523,
    "end": 2997.084,
    "text": "Thanks.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2997.925,
    "end": 3000.527,
    "text": "Thanks for the presentation, the great paper.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3001.539,
    "end": 3003.84,
    "text": " I've been significantly excited by reading it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3004.16,
    "end": 3010.603,
    "text": "It's actually a great use of FEP and bias, because it articulates a lot of intuitions I had.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3011.703,
    "end": 3025.369,
    "text": "And it's also very nice in the spirit of pluralism, this approach of really embracing the unifying quality or power of the FEP and focusing on unification rather than another universal or overly exaggerated claim or proposition.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3026.925,
    "end": 3031.948,
    "text": " And it's going to be probably some scattered thoughts, but I'm trying to also touch on what Steven said.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3031.988,
    "end": 3036.972,
    "text": "I'm not sure if I understood what it meant, but I'm reminded of amortization.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3037.212,
    "end": 3039.714,
    "text": "So Sam Gershman has some nice papers on this.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3040.567,
    "end": 3067.527,
    "text": " has a nice paper called uh remembrances of influences past so the parameters or the the components the factors of the strategies used in influence could also be remembered and so maybe that's what i thought you meant when you said something related to or associated with sensory states but not actually central states themselves maybe in the physical substrate that enacts these sensory inferences and there might be partial might be parts or parameters or factors",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3068.928,
    "end": 3071.389,
    "text": " that can be remembered and that these are the ones that can be updated.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3071.61,
    "end": 3076.112,
    "text": "These are the ones that also are reactivated during dreaming despite the absence of sensory inputs.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3077.312,
    "end": 3081.374,
    "text": "But anyways, if it's not what you meant, then let's talk about that later.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3081.394,
    "end": 3094.26,
    "text": "About your conversation with Adam, I have a bit of a... I'm not sure if you meant virtual machines as popular as actual computers and software.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3095.083,
    "end": 3122.587,
    "text": " For me, it's very important to distinguish a mere embeddedness, such as the normal virtual machines, and an embeddedness where the relation between the embedded subsystem and the larger system is one that's related by active systematic mutualistic inference, that these are mutually contextualizing and there is a kind of cybernetic relation to it, which is not the case with normal virtual machines, especially in phenomenon architectures, because these are",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3123.439,
    "end": 3125.24,
    "text": " more sterile channels, as I would like to say.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3127.202,
    "end": 3145.816,
    "text": "So as for my own points upon reading it, so I very much appreciate that you elaborating, emphasizing the notion of dynamical complexity as opposed to mere complexity, and very elegantly avoiding the many perceptual traps that tends to be lurking in these woods.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3147.297,
    "end": 3150.6,
    "text": "But as a suggestion or question, so",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3153.324,
    "end": 3161.729,
    "text": " you suggest that the notion of accuracy kind of falls away in the determination of free energy, variation of free energy, for honest awareness.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3162.05,
    "end": 3167.153,
    "text": "But I actually would argue that, in fact, accuracy is still relevant, but it's a reflexive kind of accuracy.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3167.593,
    "end": 3181.843,
    "text": "So because of the embeddedness of these ecosystems, you could say that to some subsystems, their concerns of accuracy are relatively the other subsystems, the entire subsystems.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3182.478,
    "end": 3184.559,
    "text": " And so you see this in dreaming, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3184.699,
    "end": 3190.522,
    "text": "So the different subsystems of the brain need to update themselves in relation to each other.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3190.542,
    "end": 3198.065,
    "text": "And so, for example, I think Tononi has some work, I'm not sure if it's published yet, but that the activation of, during dreaming,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3198.652,
    "end": 3207.394,
    "text": " where the epicenters of the activity radiating outwards seem to correlate with the sites of activation during the waking experience, where something new is learned.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3207.794,
    "end": 3214.376,
    "text": "And under the FVP, it becomes extremely clear, well, it suggests an intuitive explanation for why.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3214.936,
    "end": 3219.197,
    "text": "Because if there's a local kind of improvement, a local updating occurred in that model,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3219.781,
    "end": 3231.307,
    "text": " but all the subsystems in the ecosystem are mutually contingent or contextualized by each other, then it would be useful to extend the fruits outward or share the fruits of an experience with other systems.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3231.827,
    "end": 3242.312,
    "text": "And so you also then lose the necessity of a global coherence of the ecosystem because there is no unified external world.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3243.312,
    "end": 3244.853,
    "text": "All the contents become local.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3245.313,
    "end": 3248.455,
    "text": "It's simply a constellation of local contents.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3248.915,
    "end": 3268.461,
    "text": " which in my opinion is an elegant way to look at it because it seems parallel to the phenomenology of dreaming which argues for your paper's motivation because this tentative computational explanation has immediately a nice pathway to the phenomenological aspects to be explained.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3269.841,
    "end": 3281.528,
    "text": " So I would just really like to hear your thoughts about whether accuracy should really be dropped, or whether we should see accuracy as still being a part of the variation of energy in the lower levels.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3281.968,
    "end": 3291.733,
    "text": "So more specifically, it's as if the complexity at one level is partially constituted by the accuracy improvements in the lower levels.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3293.154,
    "end": 3296.776,
    "text": "Especially because you mentioned embedded this, but I don't see it as",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3297.692,
    "end": 3311.867,
    "text": " well integrated in the paper, but I think it would much more bolster your claims, especially because of its relations with other material and consciousness research, especially the 4E camp and their whole emphasis on embeddedness.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3312.608,
    "end": 3314.39,
    "text": "And this also relates a bit",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3315.535,
    "end": 3322.103,
    "text": " Well, I would say that another way you can see this as a contextual reduction can be seen as configurational accuracy.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3322.504,
    "end": 3334.038,
    "text": "So if we assume that the act of choosing the configuration is itself a question of policy selection or the action of configuring yourself in relation to the context, then complexity can be seen.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3334.671,
    "end": 3337.452,
    "text": " as configurative accuracy.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3338.312,
    "end": 3340.253,
    "text": "And so now you get this weird thing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3340.333,
    "end": 3356.978,
    "text": "So a decomposition of complexity reduction in terms of intrinsic complexity reduction, so kind of the Bayesian model reduction you see in the active intrinsic curiosity paper, and an extrinsic model reduction, a model reduction in relation to the contextual systems in which it stands.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3357.298,
    "end": 3358.739,
    "text": "Anyways, I'll stop here.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3358.759,
    "end": 3360.259,
    "text": "I think I'm rambling on too much.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3360.279,
    "end": 3362.22,
    "text": "So yeah, I would love to hear your thoughts.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3366.786,
    "end": 3370.628,
    "text": " So thank you so much for your comments and questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3372.829,
    "end": 3387.077,
    "text": "Yeah, so this point about embedded systems and nested Markov blankets, that's definitely something that I have to think about a bit more, which will be relevant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3387.097,
    "end": 3389.658,
    "text": "So when you talked about complexity and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3390.796,
    "end": 3411.524,
    "text": " how within an embedded system within the brain there could still be accuracy maximization despite a lack of sensory input via the sensory organs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3413.464,
    "end": 3420.147,
    "text": "I actually was reminded of a discussion we had with a reviewer",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3421.089,
    "end": 3431.135,
    "text": " but not a reviewer of this paper, but of the Markovian monism paper we published last year.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3431.975,
    "end": 3443.282,
    "text": "So one of the reviewers brought this question up, what happens in an isolated system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3443.522,
    "end": 3445.303,
    "text": "And they mentioned that, according to IIT,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3448.647,
    "end": 3451.208,
    "text": " I think it could still be conscious, something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3451.248,
    "end": 3456.29,
    "text": "It reminded me of what you said, or the other way around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3456.33,
    "end": 3459.131,
    "text": "What you said reminded me of this discussion we had.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3459.231,
    "end": 3478.199,
    "text": "And my intuition I had, or the initial reaction I had was that, OK, well, in such systems, we have maybe no sensory input from the external environment, but there's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3479.122,
    "end": 3486.928,
    "text": " some environment within the system, within the organism that can provide some simulated sensory signals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3487.928,
    "end": 3490.91,
    "text": "I think this is what you were referring to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3490.93,
    "end": 3496.454,
    "text": "And I don't really remember what happened.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3496.714,
    "end": 3507.302,
    "text": "I think Carl had a slightly different opinion regarding this and suggested that most",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3509.134,
    "end": 3522.559,
    "text": " The more elegant way of treating this case would be to regard the system as a system that just minimizes complexity and ignores accuracy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3523.44,
    "end": 3530.943,
    "text": "But now that it comes up again, I don't think that's the end of the story.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3531.123,
    "end": 3536.905,
    "text": "And it may be relevant and interesting to make this a bit more",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3538.834,
    "end": 3546.38,
    "text": " complicated by actually considering nested systems and simulated sensory signals and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3547.426,
    "end": 3556.028,
    "text": " And I don't think that this is something we can throw into the revisions because the paper's already getting quite long.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3556.068,
    "end": 3560.769,
    "text": "But it's something that we should focus on in future work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3560.909,
    "end": 3568.631,
    "text": "And I would be grateful if you could point me to some of the literature that you mentioned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3570.152,
    "end": 3572.913,
    "text": "You can send me an email or DM me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3576.673,
    "end": 3591.491,
    "text": " And then there's another thing you mentioned, a distinction between two types of virtual machines or two senses in which a virtual machine can be things that can be associated with that term.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3592.212,
    "end": 3594.695,
    "text": "And I've",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3596.055,
    "end": 3601.72,
    "text": " I don't think I am aware of this distinction, and I'm not sure I really understood it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3601.76,
    "end": 3604.823,
    "text": "So perhaps you can repeat what you said.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3604.843,
    "end": 3613.151,
    "text": "So it's that one is nearly embedded, and the other has some additional features.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3613.912,
    "end": 3617.155,
    "text": "I think that could be really interesting and relevant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3618.629,
    "end": 3619.57,
    "text": " Should I do it now or later?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3619.81,
    "end": 3620.951,
    "text": "Yeah, go for it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3620.991,
    "end": 3626.915,
    "text": "Keep in thread, and then we'll go to Blue, and then to Dave and Adam, and another question from the chat.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3627.956,
    "end": 3629.557,
    "text": "I'll try to keep it brief.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3630.618,
    "end": 3638.244,
    "text": "So actually, one of the reasons why I'm so motivated about this is actually because when I did my master thesis with Carl, I had the same argument of complexity.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3638.604,
    "end": 3640.806,
    "text": "So he's also like, no, no, no, it's just complexity reduction.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3641.446,
    "end": 3641.967,
    "text": "But the thing is,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3642.831,
    "end": 3645.076,
    "text": " As you know, it's about redundant parameters.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3645.196,
    "end": 3647.761,
    "text": "But I don't think that's going to be the issue in the story that I told you.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3648.002,
    "end": 3649.164,
    "text": "It's not about redundant parameters.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3649.244,
    "end": 3651.569,
    "text": "It's parameters that are misattuned because of their...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3652.156,
    "end": 3655.258,
    "text": " contextual contingencies having been updated, but they themselves not.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3655.658,
    "end": 3659.881,
    "text": "Because in the real life awakening experience, it wasn't, they weren't interacting.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3660.301,
    "end": 3665.044,
    "text": "But in a more extended context, it's kind of a weird kind of counterfactual marginalization.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3665.124,
    "end": 3670.107,
    "text": "But it's like expanding the scope in which the newly accrued experience might be relevant.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3670.348,
    "end": 3671.048,
    "text": "That's how I see it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3671.528,
    "end": 3677.052,
    "text": "And so it doesn't seem to me that it's valid to say it's merely about removing redundant parameters.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3678.236,
    "end": 3689.579,
    "text": " It is improving the configurative preparation or anticipation in the future, given the limited scope of the experience that was newly acquired.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3689.979,
    "end": 3700.122,
    "text": "As for the virtual machines, one important difference is, for example, the mutualistic relation between, for example, merely the transistors and the virtual machine they're in.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3702.123,
    "end": 3705.706,
    "text": " It's kind of flat or low dimension.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3706.026,
    "end": 3707.567,
    "text": "There's no multi-scale, multi-level thing.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3707.587,
    "end": 3722.539,
    "text": "There's no adaptivity all the way, as in the driving force behind the generation of the virtual machine itself is simply sent out.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3723.26,
    "end": 3725.342,
    "text": "It is not in the path itself.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3725.502,
    "end": 3728.104,
    "text": "It's not contingent upon the path integration.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3728.65,
    "end": 3734.697,
    "text": " So there is this non, it's not an active integration of their relation.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3734.857,
    "end": 3735.498,
    "text": "Okay, never mind.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3735.738,
    "end": 3737.26,
    "text": "I'll try to think about how to phrase it.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3737.32,
    "end": 3746.43,
    "text": "But my intuition says there's a very important difference between virtual machines, classical form, and the kind of virtuality that is relevant for minds, but especially consciousness.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 3748.168,
    "end": 3750.149,
    "text": " Thanks, Marco, for these awesome points.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3750.209,
    "end": 3761.613,
    "text": "And that's the fun of the synchronous moments that we share is to surface all these new connections and ideas, and then we return to the work and the sharing on platforms with each other.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3762.133,
    "end": 3763.013,
    "text": "So thanks again for that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3763.153,
    "end": 3766.414,
    "text": "Wanda, if you wanted to add anything, otherwise we can go to Blue and Dave.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3769.335,
    "end": 3770.056,
    "text": "Okay, awesome.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3770.116,
    "end": 3776.298,
    "text": "So we'll go Blue, Dave, and then we'll have heard from everybody once, then the chat, and then return to Adam and everybody else.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3778.496,
    "end": 3787.504,
    "text": " Hi, so I want to go back to your discussion with Adam also, and it incorporates virtual machines really.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3788.144,
    "end": 3795.29,
    "text": "So you were discussing simulating consciousness versus instantiating consciousness and the necessary conditions for both.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3795.53,
    "end": 3804.358,
    "text": "And in describing like the Black Mirror episode, which I've seen and is awesome, you know, you really implied that there's this necessary like",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3805.265,
    "end": 3827.877,
    "text": " arrow of time going forward for maybe instantiating consciousness that's not present in simulating consciousness and so is that like one of the required conditions like does the arrow of time play a role like this bi-directional like time is like not that that can't be conscious and maybe it would also help um and i'm sorry if i missed this in your presentation",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3828.157,
    "end": 3852.698,
    "text": " because I was a few minutes late, but I don't know how exactly you define consciousness, and I mean, I did the .0 with Daniel, and it's really kind of difficult to measure or ascribe scientific properties to something that's not clearly defined, and I know that there's many definitions, but I just was wondering, Wanja, what you personally take consciousness to be, or how you understand it?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3856.374,
    "end": 3858.676,
    "text": " Okay, thank you very much for these questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3858.896,
    "end": 3873.367,
    "text": "I'll start with the second question, because in a way it's easier to answer that question, not because I can define what consciousness is, but because I can just tell you that I don't know what consciousness is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3876.969,
    "end": 3903.445,
    "text": " i mean that there are various ways of operationalizing consciousness and ways that are used in research on the moral quality of consciousness in particular and many of these measures of consciousness involve some kind of report verbal or behavioral report and for instance the question is then just",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3905.53,
    "end": 3914.094,
    "text": " Can the subject reliably report the presence of a certain visual stimulus or not?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3916.975,
    "end": 3918.875,
    "text": "And that would just be an example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3919.075,
    "end": 3926.898,
    "text": "And so I don't have a strong opinion about what's the best way to measure consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3930.88,
    "end": 3933.401,
    "text": "So what we are kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3935.246,
    "end": 3948.461,
    "text": " building on here is just the existing work on neural collars of consciousness, which use various ways of operationalizing consciousness, various ways of measuring consciousness, whatever it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3949.622,
    "end": 3952.445,
    "text": "But of course, this is a bit unsatisfying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3952.625,
    "end": 3954.387,
    "text": "And we would like to know what is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3955.828,
    "end": 3956.489,
    "text": " consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3958.13,
    "end": 3964.537,
    "text": "Perhaps you can tell us how to measure it in different ways, but what is it that is being measured?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3965.518,
    "end": 3978.312,
    "text": "And here I actually think that a computational explanation of consciousness could provide an insight into the very concept of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3979.481,
    "end": 4003.346,
    "text": " the notion of consciousness in that if there's a common computational mechanism associated with different cognitive capacities that are facilitated by what we call consciousness, then this could provide part of the puzzle that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4004.568,
    "end": 4006.629,
    "text": " gives us a definition of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4007.409,
    "end": 4017.954,
    "text": "Just as an example, think of the global workspace theory according to which consciousness is basically global availability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4017.974,
    "end": 4021.876,
    "text": "You could use that as a definition of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4021.956,
    "end": 4026.378,
    "text": "Consciousness is of global availability",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4027.304,
    "end": 4029.867,
    "text": " to different cognitive subsystems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4031.288,
    "end": 4047.826,
    "text": "So information is processed consciously if it's not just available to some individual subsystems, but to all or most of the cognitive subsystems within the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4049.022,
    "end": 4058.813,
    "text": " And this is, of course, a bit unsatisfying because it seems that it doesn't capture everything that we associate with consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4059.674,
    "end": 4064.299,
    "text": "So consciousness has many interesting features.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4065.54,
    "end": 4069.905,
    "text": "So if we try to describe the phenomenology of consciousness,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4071.067,
    "end": 4073.83,
    "text": " And we can say that it's typically structured.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4074.131,
    "end": 4078.736,
    "text": "We experience spatial relations between things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4078.997,
    "end": 4090.15,
    "text": "So you're not just experiencing, say, a desk and a computer screen and whatever else you're",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4090.811,
    "end": 4092.534,
    "text": " consciously perceiving right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4092.614,
    "end": 4098.223,
    "text": "You're not just hearing something, but you're experiencing these things in relation to each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4098.804,
    "end": 4102.471,
    "text": "And there are spatial relations that you're experiencing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4102.491,
    "end": 4104.213,
    "text": "There are part-whole relations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4105.433,
    "end": 4123.084,
    "text": " and there are also temporal relations of course you're experiencing not just isolated events but successions of events and um it seems that what is happening right now is not just a an instant but is somehow extended or a um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4124.907,
    "end": 4150.238,
    "text": " um yeah a um species present as william james called it and and there are further general structural features of consciousness and what a definition of consciousness should provide is a means of making sense of these different properties so for instance um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4151.129,
    "end": 4167.562,
    "text": " If consciousness is global availability of information in the cognitive system, why does this mean that why does consciousness have these phenomenological features that characterized",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4168.319,
    "end": 4172.502,
    "text": " characterize most or maybe all types of conscious experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4173.043,
    "end": 4184.192,
    "text": "So that's something that a definition of consciousness should provide in addition to just saying what's happening in the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4184.853,
    "end": 4193.42,
    "text": "And computational models I think could provide a means of bridging",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4195.426,
    "end": 4216.255,
    "text": " levels of descriptions, let's say descriptions of neural activity and neural mechanisms and then phenomenological descriptions that describe features of consciousness as they appear from the first person perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4216.955,
    "end": 4223.758,
    "text": "And integrated information theory is of course an example of a theory that tries to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4224.682,
    "end": 4253.673,
    "text": " achieve just that, starting with phenomenological axioms that characterize consciousness or typical forms of conscious experience, and then trying to operationalize these axioms in a formal way such that they can be applied to neural structures or neural activity or other kinds of systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4254.551,
    "end": 4264.94,
    "text": " And in principle, I think this would be how one should try to define consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4267.642,
    "end": 4282.075,
    "text": "Finding computational mechanisms underpinning cognitive capacities that are associated with consciousness and trying to relate models of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4283.092,
    "end": 4293.639,
    "text": " neural activity or maybe computational models of cognitive capacities to characteristic phenomenological features of conscious experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4294.48,
    "end": 4303.806,
    "text": "And then, yeah, so this is what I think how one should approach the question, what is consciousness?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4304.287,
    "end": 4306.468,
    "text": "Can I ask a follow up really quick?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 4307.629,
    "end": 4307.909,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4308.81,
    "end": 4309.93,
    "text": "So I just wanted to",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 4311.521,
    "end": 4327.609,
    "text": " So you're describing really this global availability and like able, it sounds a lot like David Krakauer described individuality like in 2020 with like this bi-directional information flow in an individual, right?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 4327.729,
    "end": 4328.59,
    "text": "But there was no...",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 4329.691,
    "end": 4335.916,
    "text": " conscious, so you have to have that downward causation, which sounds a lot like the global availability that you're describing.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 4336.397,
    "end": 4344.083,
    "text": "And so I just was wondering, I don't know if you've read the paper or not, but it also, I got that out of what you were responding, but I also...",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 4344.824,
    "end": 4372.886,
    "text": " tended to think that um you're maybe only talking about human consciousness but then when you went into iit maybe not so so do you actually draw a line like what what kind of the system can be conscious does it have to be biological does it have to be like higher order vertebrates or um can do you think that this is especially in terms of computationally like defining consciousness which i also think is a great place to start um but but does does this mean that maybe",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 4373.746,
    "end": 4393.354,
    "text": " all systems up and down the um you know evolutionary ladder can maybe have some degree of consciousness or what do you think what are your thoughts on that thanks for the question um so where to start maybe first um you mentioned top-down causation i wouldn't assume that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4394.417,
    "end": 4396.939,
    "text": " consciousness involves top-down causation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4397.179,
    "end": 4399.941,
    "text": "So I don't see a reason for assuming that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4400.021,
    "end": 4404.204,
    "text": "And that's not what I meant by global availability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4406.546,
    "end": 4412.871,
    "text": "So I'm not familiar with this work by David Krakauer that you mentioned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4413.511,
    "end": 4416.994,
    "text": "But it seems to me that it may not be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4420.492,
    "end": 4425.236,
    "text": " may not be directly connected to what I was trying to convey.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4426.397,
    "end": 4434.424,
    "text": "And then the question, where to draw the line between conscious and unconscious systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4434.944,
    "end": 4438.407,
    "text": "That's, I think, a really interesting question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4438.967,
    "end": 4445.833,
    "text": "And further, I mean, in the beginning of the talk, in the beginning of the presentation, I mentioned",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4446.309,
    "end": 4453.444,
    "text": " one motivation for going into research on computational correlates of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4453.584,
    "end": 4456.811,
    "text": "And that was trying to,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4458.01,
    "end": 4481.316,
    "text": " have some correlates of consciousness or criteria for consciousness, maybe necessary conditions for consciousness that can be applied not just to human beings or to human beings in ordinary states or human beings with a normal brain, as it were, but also to unusual cases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4482.317,
    "end": 4484.517,
    "text": "And in the presentation, I only mentioned",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4487.807,
    "end": 4491.289,
    "text": " possibility of islands of awareness, isolated systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4491.369,
    "end": 4507.356,
    "text": "But of course, unusual cases also include non-human animals that are physiologically different from human beings, invertebrates, artificial systems as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4508.076,
    "end": 4509.197,
    "text": "And this is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4511.334,
    "end": 4516.378,
    "text": " largely, I would say, an empirical question where to draw this line.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4517.218,
    "end": 4536.632,
    "text": "And there's recent work, for instance, by Eva Jablonka and Simona Ginzburg, who have an evolutionary hypothesis about consciousness or hypothesis about the evolution of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4536.792,
    "end": 4539.034,
    "text": "And they suggest that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4540.399,
    "end": 4558.819,
    "text": " a particular type of learning that is a learning capacity can maybe the evolutionary transition mark of consciousness or creatures that learning species that developments capacity",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4560.356,
    "end": 4562.358,
    "text": " were then also conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4562.918,
    "end": 4581.595,
    "text": "And the learning capacity they call unlimited associative learning, which involves particular types of learning, such as cross-model learning and other types of learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4585.578,
    "end": 4607.233,
    "text": " their suggestion would be to look if there are what systems are capable of this or have this learning capacity and what other what other capacities cognitive capacities they have and so this is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4609.025,
    "end": 4614.487,
    "text": " basically an empirical question trying to determine which creatures are conscious and which are not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4614.988,
    "end": 4622.851,
    "text": "And we, of course, need to have some criteria that can be applied to determine whether the creature is conscious or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4623.672,
    "end": 4626.373,
    "text": "And if we don't have a definition of consciousness or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4627.568,
    "end": 4631.354,
    "text": " theory of consciousness that can be applied to non-human animals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4631.414,
    "end": 4633.918,
    "text": "And it's really difficult to tackle this question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4634.799,
    "end": 4641.89,
    "text": "But focusing on teleological functions of consciousness and cognitive capacities of consciousness is one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4642.788,
    "end": 4645.049,
    "text": " I think, particularly promising strategy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4645.729,
    "end": 4663.273,
    "text": "And I also mentioned Jonathan Birch, who has proposed this, that there may be clusters of cognitive capacities associated with consciousness, such as race conditioning or cross-modal learning capacities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4665.294,
    "end": 4668.715,
    "text": "Yeah, so I don't know where to draw the line.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4670.296,
    "end": 4671.597,
    "text": " is an empirical question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4672.538,
    "end": 4691.472,
    "text": "And these more empirical projects trying to investigate cognitive capacities of certain types of non-human animals can, I think, be complemented by theoretical research",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4692.495,
    "end": 4716.833,
    "text": " using computational models, because that's one of the advantages of computational models, that it can be applied to different types of systems, not just the systems that have a central neural nervous system, such as ourselves, but also systems that have a different physiology or, in principle, also artificial systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4717.514,
    "end": 4721.617,
    "text": "I wouldn't assume or wouldn't make the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4722.765,
    "end": 4730.145,
    "text": " assumption that artificial systems cannot be conscious, but I think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4731.169,
    "end": 4746.953,
    "text": " will be really relevant to determine what constraints, what conditions have to be fulfilled by an artificial system in order to be conscious, and which systems, which types of systems will never be conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4747.573,
    "end": 4759.976,
    "text": "And if, for instance, this Black Mirror scenario is a physical possibility, if we could actually build such",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4761.633,
    "end": 4769.455,
    "text": " devices that simulate conscious beings and thereby create real suffering, for instance, that would be horrible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4770.575,
    "end": 4786.899,
    "text": "And it would also mean that we could just make hundreds of copies of these virtual systems and instantiate the same type of maybe horrible conscious experience",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4788.482,
    "end": 4795.62,
    "text": " And multiple times, that would be really a disgusting scenario.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4797.832,
    "end": 4825.031,
    "text": " I think it would be it's extremely relevant to investigate the difference between simulating a system and instantiated consciousness to avoid creating unnecessary suffering or disturbing conscious experiences and you had a very interesting question about the arrow of time going forward and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4826.051,
    "end": 4831.378,
    "text": " Yeah, this is something that I guess I have to think about in a bit more detail.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4832.359,
    "end": 4843.993,
    "text": "What happens to the causal flow or the action perception if you reverse the temporal direction of the simulated system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4849.938,
    "end": 4870.527,
    "text": " So intuitively, I would say that it's important whether the arrow of time goes forwards or backwards, that you wouldn't have conscious experience if you rewind the experience of a simulated system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4871.968,
    "end": 4873.349,
    "text": "But I'm not sure about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4873.389,
    "end": 4875.289,
    "text": "It's a really interesting question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4875.85,
    "end": 4876.15,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4876.19,
    "end": 4876.49,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4878.032,
    "end": 4879.052,
    "text": " Thanks for the response.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4879.152,
    "end": 4883.774,
    "text": "So we're going to do Dave, then a question from the chat, then Adam and Marco.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4885.435,
    "end": 4894.138,
    "text": "It sounds like getting a handle on consciousness may be suffering because it's been deflated too much.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4895.399,
    "end": 4903.302,
    "text": "If you assume that something you're examining is a predicate, it gets really easy to turn it into not just a predicate, but a thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4904.393,
    "end": 4908.216,
    "text": " And things are pretty hard to work with, mostly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4908.836,
    "end": 4909.997,
    "text": "They seem too easy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4912.638,
    "end": 4927.488,
    "text": "The first over deflation is assuming that conscious acts or conscious activities are",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4929.663,
    "end": 4932.884,
    "text": " persistent, long-term things, a predicate of an organism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4933.264,
    "end": 4934.764,
    "text": "The organism is present.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4934.824,
    "end": 4945.746,
    "text": "Now if you subscript that and say, is present of certain things now and then under some conditions, well then you can ask what conditions enable consciousness?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4945.786,
    "end": 4946.506,
    "text": "What's achieved?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4946.566,
    "end": 4951.647,
    "text": "What's the evolutionary advantage of being able to be conscious when you need to?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4955.388,
    "end": 4955.508,
    "text": "And",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4956.308,
    "end": 4972.976,
    "text": " People as disparate as Gerald Edelman talking about conscious flashes in the brain, the dynamic core crystallizing now and then, and then there's conscious activity, and then maybe it's not needed because the problem has been resolved.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4973.917,
    "end": 4984.082,
    "text": "Earlier, Alfred North Whitehead talking about threads of higher experience within a brain, for instance, something that happens now and then.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4985.334,
    "end": 4993.801,
    "text": " and the transformational psychologist Gurdjieff actually gives an exercise to force people to be conscious.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4994.622,
    "end": 4999.546,
    "text": "His background is most people are non-conscious the great majority of the time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4999.646,
    "end": 5003.589,
    "text": "However, if I ask you, are you conscious?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5005.13,
    "end": 5010.935,
    "text": "The answer is always yes, because I've made you conscious by asking you that specific leading question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5013.735,
    "end": 5019.139,
    "text": " Now the notion that consciousness is something that comes into you from the outside, that's been around for a good while.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5019.66,
    "end": 5025.104,
    "text": "That's what the physiologists in the 1870s and 80s assumed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5026.045,
    "end": 5039.535,
    "text": "So Freud, since he was busy thinking about so many things, didn't want to tackle that, and he just assumed, yeah, consciousness comes in, something's going on, the outside of my brain, my neocortex, responds to that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5039.935,
    "end": 5042.117,
    "text": "And that's where the consciousness comes from.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5042.137,
    "end": 5042.197,
    "text": "And",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5044.372,
    "end": 5049.754,
    "text": " If I'm not being stimulated, well, I enter into nirvana.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5050.195,
    "end": 5054.076,
    "text": "I don't dislike and I don't like.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5054.356,
    "end": 5057.638,
    "text": "I'm just in a great blah state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5059.058,
    "end": 5064.38,
    "text": "And the engine is just idling and waiting for something else to make it do something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5070.583,
    "end": 5072.464,
    "text": "Oh, and the other way conscious...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5073.658,
    "end": 5080.061,
    "text": " activity is getting deflated too much is, as I said, being treated as a predicate.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5080.941,
    "end": 5091.285,
    "text": "Well, it seems that if you expand it to a relation, it might be a lot easier to start dissecting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5091.746,
    "end": 5094.767,
    "text": "I'd say off the top of my head a relation among ten terms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5097.308,
    "end": 5101.63,
    "text": "Self A is conscious with Self B",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5102.962,
    "end": 5130.335,
    "text": " of object X in that conscious relation between A and B of X, given the presuppositions of A, B, and the emergent relation, and the three sets of dissatisfactions or goals, whether it's an unpleasant",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5131.73,
    "end": 5141.192,
    "text": " stimulus, wanting to get away from something, or getting towards something of A and of B and of that emergent relation between the two.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5141.392,
    "end": 5144.152,
    "text": "So that's a 10-place predicate right there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5145.112,
    "end": 5158.015,
    "text": "And when I'm thinking hard, I don't really see any of those 10 dropping out because when I'm in dialogue with myself, I'm at least that complex and so is my dialogue with myself.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5158.035,
    "end": 5159.175,
    "text": "How about you?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5163.015,
    "end": 5164.055,
    "text": " Thanks, Dave, for the question.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5164.836,
    "end": 5166.596,
    "text": "Wanja, and then I'll ask something from chat.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5167.417,
    "end": 5167.817,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5168.777,
    "end": 5172.599,
    "text": "Yeah, so you made some really interesting remarks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5172.879,
    "end": 5180.582,
    "text": "And in fact, I think it's important to see consciousness not just as a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5182.964,
    "end": 5194.947,
    "text": " property that an organism has static property, but as something dynamic that can be transiently lost, and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5196.368,
    "end": 5208.331,
    "text": "And so your suggestion to suggestion to treat consciousness as a 10 phase relation is highly interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5208.411,
    "end": 5210.012,
    "text": "And I think this speaks to the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5211.567,
    "end": 5226.595,
    "text": " the idea of investigating nested Markov blankets and interactions between subsystems within the brain or within conscious organisms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5228.236,
    "end": 5231.718,
    "text": "And I think you're completely right that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5232.762,
    "end": 5259.122,
    "text": " a lot of the relations that can hold between a conscious being and other conscious beings or conscious beings and parts of the environment must in some way be mirrored by relations between parts of the system, of subsystems of the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5262.621,
    "end": 5285.831,
    "text": " These are really complex issues that we try to ignore in the paper, but which I think we should get into at some point, especially the idea that they're nested systems, nested Markov blankets within the brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5287.632,
    "end": 5289.453,
    "text": "So I think this is really important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5291.735,
    "end": 5292.635,
    "text": " Thanks for the response.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5292.875,
    "end": 5296.557,
    "text": "So I'm going to ask a question from Cambridge Breaths in the chat.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5297.177,
    "end": 5301.939,
    "text": "And just for this last 25 or a little bit longer, I have the slide up for 16.2.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5301.999,
    "end": 5306.28,
    "text": "So we don't need to worry about answering consciousness in the next 20 minutes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5306.4,
    "end": 5312.142,
    "text": "Let's actually build the energy for continuing our discussion as we do in between the weeks.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5312.643,
    "end": 5318.665,
    "text": "So Cambridge Breaths' question was, and this is related to this discussion, does every memory or thought episode",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5320.065,
    "end": 5324.108,
    "text": " have a Markov blanket of its own that can be mathematically characterized and measured?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5324.508,
    "end": 5332.393,
    "text": "In other words, can we consider every thought episode, every minimal phenomenal experience as an independent island of awareness on its own?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5333.233,
    "end": 5335.635,
    "text": "So, Wanjo, I'd love for you to give a thought on that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5335.715,
    "end": 5337.956,
    "text": "How do we operationalize the Markov blankets?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5338.096,
    "end": 5342.659,
    "text": "Are we a singular blanket or is it just this constellation of little transient bubbles?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5343.079,
    "end": 5346.621,
    "text": "And how does it relate to this islands of awareness idea that you mentioned in the paper?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5348.502,
    "end": 5348.783,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5350.011,
    "end": 5362.902,
    "text": " Yeah, so I'm not sure how to formalize a memory or thought episode, but I'm sure it would involve some Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5364.444,
    "end": 5365.585,
    "text": "But that doesn't mean that there's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5366.886,
    "end": 5371.067,
    "text": " isolated system or island of awareness within a conscious system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5372.347,
    "end": 5379.789,
    "text": "Because there would be some interaction with the internal environment as it were.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5381.85,
    "end": 5394.453,
    "text": "Another question that comes to my mind now is that if you imagine something, I have a thought episode, there will be some part of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5395.778,
    "end": 5416.552,
    "text": " And if we assume that some part of your brain realizes this thought episode, would there be a conscious system within a conscious system because of it if it has the right, engages in the right causal interactions with its environment?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5417.872,
    "end": 5424.537,
    "text": "And I think this should be added as a, or could be built into",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5425.529,
    "end": 5432.774,
    "text": " a further constraint of what what it means to simulate as opposed to instantiate consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5434.034,
    "end": 5446.222,
    "text": "I'm not sure how exactly but so no, I wouldn't say there's an island of awareness when you have a thought episode or remember some",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5447.927,
    "end": 5448.247,
    "text": " events.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5450.009,
    "end": 5455.493,
    "text": "But there are some really, I think, relevant points associated with this idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5456.334,
    "end": 5456.594,
    "text": "Thanks.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5456.694,
    "end": 5463.76,
    "text": "And it's just funny how we talk about instantiation and for instance, and we talk about instances of virtual machines in the Linux sense.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5463.981,
    "end": 5466.983,
    "text": "So it's actually nice computational language.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5467.424,
    "end": 5473.689,
    "text": "So I have Adam, and then Marco, then anyone else who wants to raise their hand.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5474.249,
    "end": 5476.111,
    "text": "So Adam, or Yeah, go ahead.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5478.428,
    "end": 5479.089,
    "text": " Hi, can you hear me?",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5479.409,
    "end": 5480.41,
    "text": "Yep, as usual.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 5481.571,
    "end": 5483.052,
    "text": "Stop asking then.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5483.632,
    "end": 5496.982,
    "text": "So you mentioned with the reviewers, you had these lists of places where your intuition is balking.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5497.462,
    "end": 5499.544,
    "text": "And I share a lot of those.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5500.344,
    "end": 5503.046,
    "text": "Could a nation be conscious?",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5503.126,
    "end": 5506.689,
    "text": "Could a bunch of tin cans and ropes strung together",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5507.315,
    "end": 5513.658,
    "text": " And there's a sense in which like, just like Church-Turing thesis, I guess, like there should be a certain universality of computational realisability.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5513.698,
    "end": 5527.505,
    "text": "And maybe we can do like, in principle, tin cans and string, but it just might not be practically realisable because there aren't enough, you know, there's enough aluminum in the multiverse or in the universe.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5528.246,
    "end": 5528.406,
    "text": "But",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5529.741,
    "end": 5535.903,
    "text": " I actually liked your proposal that you kind of dismissed it as maybe being a little bit special pleading-y.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5536.443,
    "end": 5537.823,
    "text": "But I didn't find that to be the case at all.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5537.843,
    "end": 5551.267,
    "text": "So if you actually created a rich embodiment and embedding within a virtual world, and then if there are some sort of homomorphism between this and this, I guess.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5552.088,
    "end": 5557.949,
    "text": "Actually, I don't even know if it needs to actually couple with the physical world.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5561.058,
    "end": 5577.025,
    "text": " The importance would be that you're having this sort of functional closure with respect to active and perceptual states in this sort of self-evidencing and self-making that you're having within the system you're doing inference on this interaction.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5577.845,
    "end": 5587.35,
    "text": "And within the context of the virtual machine, the virtual world in which you're running this,",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5590.316,
    "end": 5594.018,
    "text": " It seems like we could say that consciousness is arising here, but I'm not sure.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5595.358,
    "end": 5616.549,
    "text": "In terms of functions of it, I've been wondering whether we can think of consciousness as a kind of like world model that we're doing divergence minimization with respect to, and it's having some causal significance of this kind, and where it needs to have certain additional necessary",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5617.773,
    "end": 5630.48,
    "text": " properties for it to be a world-model capable of generating experience of having basically coherence with respect to like spatial, temporal, and causal kinds of coherence.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5631.261,
    "end": 5638.225,
    "text": "And I'm wondering if that could potentially speak to the issue to bring up functions of",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5638.766,
    "end": 5642.689,
    "text": " which systems are more or less likely to possess consciousness.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5642.809,
    "end": 5664.384,
    "text": "Like, we just add in additional stipulations as additional necessary conditions, and I'm basically wondering if, like, quasi-Kantian, like, a priori categories are some of the things people talk about in terms of core knowledge, that these might just be necessary for any kind of world to appear to any being whatsoever, for any kind of coherent sense-making.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5664.484,
    "end": 5666.286,
    "text": "With the function being, you have, um,",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5667.714,
    "end": 5678.846,
    "text": " some sort of data structure corresponding to the agent and its situation to the world, and this is acting as a top-down controller and in ways maybe is a virtual machine of sorts.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5685.313,
    "end": 5687.516,
    "text": "If you have any thoughts on that, otherwise",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 5688.847,
    "end": 5691.749,
    "text": " Yeah, thank you, Adam.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5692.069,
    "end": 5696.931,
    "text": "Does a system need a world model in order to be conscious or not?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5701.634,
    "end": 5710.798,
    "text": "So I think if it needs a world model, it doesn't have to be a very compact model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5712.239,
    "end": 5712.359,
    "text": "And",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5718.188,
    "end": 5733.479,
    "text": " I mean, it must have a world model in the sense that its internal states must encode probability distributions over external states given blanket states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5734.92,
    "end": 5738.923,
    "text": "But this is not the world model you were thinking of, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5741.685,
    "end": 5742.025,
    "text": "You were...",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5742.611,
    "end": 5768.987,
    "text": " I'm wondering if we need a little more to actually have like composition and I guess like the kind of like to have like things melted to things with particular like distinct properties, um, where those properties are situated for the various things that are in relation to each other and whether this is basically serving the function of, um, allowing you to serve uncertainty, basically like allowing you to both, uh,",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5769.838,
    "end": 5773.359,
    "text": " be informed by and inform these action-perception cycles.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5773.999,
    "end": 5784.363,
    "text": "And maybe you need additional structure built in for this to actually be like a world represented by the eternal states.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5785.943,
    "end": 5788.484,
    "text": "Not sure though.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5788.564,
    "end": 5794.186,
    "text": "I think perhaps you don't have to have a model that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5795.438,
    "end": 5801.1,
    "text": " contains objects, like a system that is conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5802.441,
    "end": 5807.643,
    "text": "You can have a conscious system that doesn't know what a tree is or what an apple is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5808.483,
    "end": 5815.866,
    "text": "But I think, I mean, you hinted at spatial, temporal, and causal relations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5816.146,
    "end": 5822.548,
    "text": "I think it must have a sense of spatial and temporal relations and causation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5826.502,
    "end": 5836.963,
    "text": " candidate i guess so that would be a world model which um could be fairly abstract in a way about um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5838.373,
    "end": 5842.276,
    "text": " gives the system a notion of time and space and causation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5843.597,
    "end": 5856.647,
    "text": "One thing that I completely sidestepped here is the issue of what Jennifer Wynne has called minimal phenomenal experiences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5856.767,
    "end": 5863.553,
    "text": "That is, conscious experiences that are characterized by the absence of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5864.767,
    "end": 5872.993,
    "text": " spatial relations or even temporal relations in which there's no subject-object structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5874.514,
    "end": 5879.097,
    "text": "So these are also sometimes called non-egoic states or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5880.018,
    "end": 5904.94,
    "text": " are states of pure awareness or consciousness as such, and are described especially in the literature from Eastern traditions, because these are states that can be experienced during meditation, but also in other states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5907.91,
    "end": 5915.111,
    "text": " Perhaps you don't need a world model and these types of experience and minimal phenomena experiences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5918.952,
    "end": 5919.252,
    "text": "Thanks.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5919.512,
    "end": 5919.752,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5919.772,
    "end": 5920.412,
    "text": "Adam, go for it.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5921.332,
    "end": 5929.694,
    "text": "Do you think it's possible in those sorts of non-dual states that there could be a very minimal coherence along those lines?",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5929.734,
    "end": 5935.755,
    "text": "Sometimes it's described as just spaciousness.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5935.795,
    "end": 5937.695,
    "text": "It's just the space of awareness.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5938.507,
    "end": 5940.088,
    "text": " as these stripped down non-dual states?",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5940.108,
    "end": 5945.473,
    "text": "Could there still be sort of, it's not enough that it's necessarily a movie.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5945.953,
    "end": 5962.266,
    "text": "It's not clearly like identifiable as like, here's a movie from your point of view and you're separate from the world and you're an agent represented, but still there's just enough of a point of view, just enough, like they're in there, but they're not like reflexively modelable or nothing.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 5964.488,
    "end": 5969.91,
    "text": " Yeah, that's a possibility and actually a really interesting option.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5970.53,
    "end": 5991.016,
    "text": "So with respect to a so-called non egoic states of consciousness or states which the ego dissolves, there's a possibility that actually the subject object distinction disappears.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5991.096,
    "end": 5993.617,
    "text": "So those are non dual states of awareness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5994.414,
    "end": 6004.959,
    "text": " but not because there's no subject, but because the subject is expanded and contains everything there is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6005.499,
    "end": 6017.965,
    "text": "So, I mean, in such states or in the transition to such states, subjects often describe a dissolution of the boundary between themselves and the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6019.086,
    "end": 6023.788,
    "text": "And one possibility is that what happens is not that the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6024.935,
    "end": 6033.725,
    "text": " a word that the boundary becomes blurry and then the self disappears, but actually that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6034.705,
    "end": 6035.806,
    "text": " I become the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6035.986,
    "end": 6039.147,
    "text": "And so I cannot distinguish myself from the world anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6039.808,
    "end": 6045.991,
    "text": "And that's why people say there was no I. So that's at least one possibility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6046.011,
    "end": 6051.574,
    "text": "I think Sasha Fink has argued for this point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6052.435,
    "end": 6058.798,
    "text": "And one could apply the same idea to space, I would say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6058.818,
    "end": 6063.14,
    "text": "And that would be similar to what you suggested.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6064.201,
    "end": 6074.238,
    "text": " there's there are no points in space anymore no place where i am but if i'm the world then i'm everywhere so there are no",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6075.848,
    "end": 6089.111,
    "text": " points in space that I could distinguish from the point at which I myself am located, because I am everywhere and have become one with the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6090.111,
    "end": 6101.694,
    "text": "And so there's only space as such, perhaps, only the world, but no places within the world, no points that could be differentiated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6104.226,
    "end": 6105.226,
    "text": " Thanks for the response.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6105.607,
    "end": 6113.25,
    "text": "Makes me think of king of infinite space and a circle with circumference of everything and inside of nothing or however you want to phrase it.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6113.63,
    "end": 6115.311,
    "text": "So we've got 10 minutes left.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6115.931,
    "end": 6118.232,
    "text": "Marco, and then anyone for closing thoughts.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6118.352,
    "end": 6121.494,
    "text": "And again, I have this slide up where we're writing things down for next week.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6121.794,
    "end": 6124.755,
    "text": "So Marco, and then anyone else who wants to give a closing thought.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6125.115,
    "end": 6126.816,
    "text": "And there's one last little question in the chat too.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6126.996,
    "end": 6127.636,
    "text": "So go ahead, Marco.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6128.697,
    "end": 6131.258,
    "text": "I'll do my best to keep it short.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6131.338,
    "end": 6133.779,
    "text": "Regarding the last few comments, hopefully",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6134.498,
    "end": 6141.846,
    "text": " say that which is called space is called by Buddha as no space, therefore it is called space.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6142.487,
    "end": 6149.655,
    "text": "And so your conversation was very much about the notion of emptiness or the rate of luminosity, which is a fascinating body of literature in Buddhism, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6150.729,
    "end": 6163.922,
    "text": " But I would argue against the notion that we should take as valid the context, the idea that, oh, now we contain the whole world, because it's exactly in that phenomenological state where language breaks down.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6164.103,
    "end": 6167.987,
    "text": "And so any reports of that phenomenology must be taken with a heavy grade of salt.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6168.747,
    "end": 6177.009,
    "text": " So the way I would see it in semi-FEP terms is that it's a state of maximum potential reach.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6177.469,
    "end": 6182.91,
    "text": "So it's not that everything is contained within that state, it's that everything is reachable from that state.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6183.33,
    "end": 6186.17,
    "text": "It's a kind of optimal readiness.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6186.49,
    "end": 6194.012,
    "text": "But contrasting that maximum potential reach is a minimal determinacy, which relates to the Buddhist notion of no grasping or no clutching.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6194.032,
    "end": 6196.612,
    "text": "You're not grasping to any duality, any determination.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6197.324,
    "end": 6210.514,
    "text": " you're just letting go of any determination whilst being ready to determine whenever it arises or is necessary, which is related to the codependent arising, which again, is beautifully congruent with active inferential tracks.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6212.115,
    "end": 6223.364,
    "text": "So I've tried to refrain too much from trying to solve consciousness, but since some things already been raised, so I think I've pinned down why I talked about the virtual model in that sense.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6224.116,
    "end": 6224.677,
    "text": " virtual machine.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6225.257,
    "end": 6238.407,
    "text": "And so just like Adam, as always, I also agree very much with with with emphasizing the cybernetic imperative, which I found surprising for you not to have included from what I saw so far in the paper.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6239.068,
    "end": 6247.15,
    "text": " So, so, so, um, I think, I think one problem in the, in the kind of the folks ecology slash language we're used to when talking about these things.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6247.45,
    "end": 6255.891,
    "text": "So we say that the brain is conscious, but we only say that because we don't have the ability to specify in what way the brain generates relates to consciousness.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6256.431,
    "end": 6262.633,
    "text": "And so following David Chalmers, I would argue that it's better to use something neutral, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6262.653,
    "end": 6263.793,
    "text": "Instead of saying consciousness.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6264.634,
    "end": 6275.844,
    "text": " we could take seriously the phonological invariance across people's reports and say that this must be some integrated reality, let's call that a local space or a local ontology, I prefer to call it the C-space.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6276.704,
    "end": 6288.534,
    "text": "And so you could say that the C-space embedded in the mind's brain, which nicely has an acronym with NB, like Markovnik, is that the C-space effectively has primarily a cybernetic imperative.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6289.155,
    "end": 6292.858,
    "text": "But in the pursuit of that cybernetic imperative, it actually",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6293.739,
    "end": 6305.328,
    "text": " Finds itself doing different things or inferential tips simply by the virtue of the fact that it needs to model its environment Which would see space where that's a sensible conscious space?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6306.309,
    "end": 6311.893,
    "text": "Would not be the world as such but but the world modeling mind-body system",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6312.549,
    "end": 6318.07,
    "text": " And so you get this weird tripartite distinction, which actually Joshua Bach is the first one who actually pointed to this idea.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6318.611,
    "end": 6329.973,
    "text": "So that you have embedded in the universe, in the physical world, a particular system called the body with the brain, with the systematicity that we call the mind, and embedded in turn, we have something called the sea space.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6330.313,
    "end": 6340.656,
    "text": "Importantly, that itself, due to its imperative cybernetics or good regulation, learns about that my body,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6341.525,
    "end": 6343.547,
    "text": " And it's the mutual contextualization therein.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6343.807,
    "end": 6349.773,
    "text": "So upon instantiation or realization of this kind of sense, they become mutually dependent on each other.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6350.394,
    "end": 6354.959,
    "text": "The mind-brains activity or let's say fitness,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6355.829,
    "end": 6363.259,
    "text": " would translate transitively to the fitness of the species, which in turn transitively translates back to the fitness of the entire mind-body.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6363.579,
    "end": 6371.71,
    "text": "And so this is very important to note, the requisites of the problem, the initial challenge of creating enough",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6372.33,
    "end": 6377.013,
    "text": " challenge enough free energy gradients to necessitate the instantiation of such a space.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6377.294,
    "end": 6382.717,
    "text": "And so I don't agree at all with these unnecessary debates about whether organelles are goddamn conscious.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6383.118,
    "end": 6383.718,
    "text": "Like, what the hell?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6383.798,
    "end": 6385.059,
    "text": "What's going to come in for them?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6385.299,
    "end": 6386.64,
    "text": "They have no adaptive imperative.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6387.06,
    "end": 6392.904,
    "text": "There's no incentive to instantiate some kind of regulatory space, regulatory subsystem, right?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6393.244,
    "end": 6395.826,
    "text": "There is no coherent instantiator to even lead to that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6396.126,
    "end": 6399.869,
    "text": "There's no initial ignition to scaffold that complexity.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6400.478,
    "end": 6403.839,
    "text": " And so, yeah, anyways, that's my personal annoyance.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6404.219,
    "end": 6407.48,
    "text": "Another notion I would like to share is the island is the awareness.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6407.68,
    "end": 6415.321,
    "text": "The fact that the island is embedded in this huge amorphous sea is what we should relate to that seemingly secluded experience.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6416.081,
    "end": 6420.963,
    "text": "And crucially, and this is very intensive, but I want to share it because of your paper.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6421.343,
    "end": 6422.903,
    "text": "So I would argue...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6423.647,
    "end": 6432.554,
    "text": " or propose that the C-space is there where the intrinsic manifolds and the extrinsic manifolds become equivalent, or at least approximately or asymptotically.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6432.574,
    "end": 6432.635,
    "text": "Why?",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6433.115,
    "end": 6436.638,
    "text": "Because it's another way of phrasing that it's pure reflexivity.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6437.098,
    "end": 6443.944,
    "text": "Those causal flows, spatial, temporal, causal activity, that is purely reflexive,",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6444.691,
    "end": 6449.013,
    "text": " therefore would not pertain to directly that which is outside there.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6449.133,
    "end": 6453.434,
    "text": "In other words, that sea space is by definition the self-referring islands.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6453.954,
    "end": 6458.596,
    "text": "And now comes one more crazy thing, because Chalmers said we need crazy ideas, so here's a crazy idea.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6459.696,
    "end": 6464.578,
    "text": "So the point is that it's possible, perhaps, that this tentative islands",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6465.098,
    "end": 6491.766,
    "text": " um should be embedded in something and therefore we can potentially say there's a blanket or an encapsulation which can be seen as like a channel like a two-dimensional surface which acts as a channel but each channel mathematically has a bottom a limit so what if what happens when that island that sea space um generates more entropy than can actually be expressed through the interface with which it stands relation to the greater world right",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6492.699,
    "end": 6508.045,
    "text": " And so I basically was trying to vindicate, in part, Adam's suggestions, and in turn elaborate what I meant with the difference between virtual machines, because normal virtual machines aren't in this mutually contextualized relation, not at the level of the physics as such.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 6508.863,
    "end": 6527.381,
    "text": " um and because it's purely in the virtual whereas here the physics themselves are co-opted in that mutually contextualized relation okay sorry that's enough for now yeah all good thank you marco so everyone thanks so much for participating if anyone wants to raise their hand and give a final just",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6527.941,
    "end": 6530.803,
    "text": " little tweet length recap.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6531.223,
    "end": 6538.549,
    "text": "But what I'll say here as organizer is our next conversation live is going to be on February 23rd.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6539.329,
    "end": 6543.272,
    "text": "And we wrote down a bunch of questions for next time.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6543.812,
    "end": 6550.937,
    "text": "And there was also things that were asked in the chat, like about the difference between quantum and classical computers and simulation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6551.358,
    "end": 6557.001,
    "text": "So I know that we're going to have so many fun directions to go to in our next synchronous and asynchronous",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6557.822,
    "end": 6560.123,
    "text": " conversations and communications through the interface.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6560.643,
    "end": 6566.106,
    "text": "So if anyone wants to give a final thought, um, Wanda, thanks so much for coming on.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6566.146,
    "end": 6569.648,
    "text": "It really, it was, um, it's a, it's a special paper.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6569.688,
    "end": 6575.45,
    "text": "It was a lot of fun to work through in live in our lab and our collective thought processes.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6576.211,
    "end": 6577.571,
    "text": "And, um, yep.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6577.932,
    "end": 6587.136,
    "text": "So if anyone else wants to give any final thoughts, um, Steven, and then anyone else raises their hand just for the last short thoughts, Steven unmute.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6590.228,
    "end": 6608.821,
    "text": " just wanted to say thank you very much and I know there's a lot of stuff has come at you so you've managed to field a huge amount of questions but I'd be really curious to maybe see your thoughts on how this work can pan out in the world in terms of people's practices and ways of thinking about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6610.262,
    "end": 6636.415,
    "text": " other research and how this kind of way of understanding consciousness could you know play out possibly in because a lot of work in psychology is using brain neural correlates to justify what they think people are thinking you know so it'd be interesting maybe next week to think about how how does some of these ideas have implications and application which I think they do so thank you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6637.23,
    "end": 6637.85,
    "text": " Thanks, Steven.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6638.451,
    "end": 6640.151,
    "text": "Adam, and then anyone else with a raised hand?",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 6640.171,
    "end": 6644.933,
    "text": "Yeah, this, I mean, fantastic as usual.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 6644.973,
    "end": 6649.375,
    "text": "And this is my most fascinating thing there is.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 6649.995,
    "end": 6653.157,
    "text": "And I also think, though, it's extremely important we get this right.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 6653.177,
    "end": 6657.058,
    "text": "So like Marco was just discussing, I'm organized and we're talking about Islands of Awareness.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 6657.679,
    "end": 6665.622,
    "text": "Like, how quickly do we move forward with this research program, which could potentially help countless people, but we don't want to inadvertently",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 6666.274,
    "end": 6668.015,
    "text": " create like black mirrorish scenarios.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 6668.055,
    "end": 6679.464,
    "text": "So if we can place a very low prior on consciousness for organoids due to not having the proper cybernetic grounding contextualization embedding, that would be great.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 6680.044,
    "end": 6686.409,
    "text": "Like similarly, like with artificial intelligence, we might eventually create systems where it is in question.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 6686.969,
    "end": 6690.832,
    "text": "And so then we're dealing with, you know, are these ethical beings on our own?",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 6690.872,
    "end": 6694.555,
    "text": "Are we like doing mind crime against these beings or like,",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 6697.126,
    "end": 6707.714,
    "text": " both avoiding negative outcomes and maybe wanting there to be positive outcomes in terms of creating beings who are conscious and are of value in their own right as subjects who experience and there's something that it's like to be them.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 6707.855,
    "end": 6709.456,
    "text": "So they should be part of our moral communities.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 6710.196,
    "end": 6715.38,
    "text": "Maybe, you know, it's not, we're not there yet, but we might get there eventually.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 6715.42,
    "end": 6721.065,
    "text": "And these might be the questions that are the key questions for what really matters for those events.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 6724.249,
    "end": 6749.926,
    "text": " yep and what's on the table adam as you often highlight is everything from who we include in our moral community false positives and false negatives are quite vitally severe in this issue um so looks like that's all the raised hands 16.1 thanks everyone for coming this is really a great discussion and look forward to continuing this discussion in 16.2 and beyond thanks",
    "speaker": "SPEAKER_07"
  }
]