[
  {
    "start": 10.25,
    "end": 10.871,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 10.911,
    "end": 13.415,
    "text": "Welcome to the Active Inference live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 14.316,
    "end": 15.958,
    "text": "And this is the Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 16.299,
    "end": 21.025,
    "text": "I'm Daniel Friedman, and I'm really excited to be having this conversation with my friend, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 22.848,
    "end": 23.128,
    "text": "Hi, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 24.318,
    "end": 26.059,
    "text": " Welcome to the Active Inference Lab, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 26.58,
    "end": 32.264,
    "text": "We are an experiment in online team communication, learning, and practice related to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.745,
    "end": 38.369,
    "text": "You can find us on our website, Twitter, email, Discord, YouTube, whatever it may be in the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.19,
    "end": 44.273,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.114,
    "end": 51.296,
    "text": " All backgrounds and perspectives are welcome here, and we will look forward to using good dialogue video etiquette.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 52.116,
    "end": 62.98,
    "text": "Today in 16.0, we're going to be setting the stage for February 16th and February 23rd, 2021's events, which are both going to be discussions on this same paper we're talking about today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 63.56,
    "end": 69.282,
    "text": "And for the 16th, we're going to have the author, Wanda Weiss, join us for the discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 70.382,
    "end": 90.328,
    "text": " today in 16.0 the goal is really to set the context for 16.1 and 16.2 which are participatory group discussions the paper we're discussing is the neural correlates of consciousness under the free energy principle from computational correlates to computational explanation by weiss and carl friston november 18 2020 and there's a link given",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.509,
    "end": 95.911,
    "text": " The video is an introduction to the context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.971,
    "end": 97.732,
    "text": "It's not a review or a final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 98.152,
    "end": 99.573,
    "text": "Blue and I just gave it a read.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 99.633,
    "end": 100.814,
    "text": "We're still working through these issues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.834,
    "end": 103.916,
    "text": "We hope to kind of surface what we're thinking about on those topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 104.476,
    "end": 114.802,
    "text": "And one of the punchlines is that FEP, it's not a singular theory or a definition of consciousness itself, but it lends itself to some pretty powerful thinking and theory development in this area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 115.802,
    "end": 122.104,
    "text": " And in the video of 16, we're gonna go with an introduction section and thanks Blue for the structural tip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.164,
    "end": 127.965,
    "text": "We're gonna talk about the author's perspective on their introduction, really like aims and claims, abstract and roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.506,
    "end": 138.828,
    "text": "Then we'll consider the keywords kind of just where we were at with those topics and where we think there might be a nice bi-directional road kind of on and off ramp from active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 139.328,
    "end": 144.81,
    "text": "And then we'll actually go through a fair amount of the details of the paper, including some of the formalisms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.59,
    "end": 164.265,
    "text": " close with a couple questions and thoughts and in 16.1 and 16.2 we'll be discussing this paper so that is all for the introduction let's go to the aims and claims of the paper um the paper was as stated blue do you want to um be the aims and claims so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 165.388,
    "end": 175.533,
    "text": " The first theme is how can research on neural correlates of consciousness lead to an explanation of consciousness and what role could the free energy principle, the FEP, play in this endeavor?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 176.254,
    "end": 186.979,
    "text": "We have suggested that research on neural correlates should be complemented by research on computational correlates of consciousness, CCCs, in order to yield a computational explanation of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.685,
    "end": 202.43,
    "text": " Moreover, according to the free energy principle, neural correlates of consciousness must be defined in terms of neural dynamics, not neural states, and compilational correlates of consciousness should be defined in terms of probabilities encoded by neural states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 203.791,
    "end": 212.914,
    "text": "All we hope to have shown is that a computational explanation of consciousness is possible and that the free energy principle can make a significant contribution to this project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 214.38,
    "end": 239.088,
    "text": " big aims and claims and a lot of interesting things that are already being mentioned a lot of these words we're going to dive into so if it's your first time hearing some of these terms and acronyms or whether these are things where you're already bringing a lot of priors to the table hopefully you'll be able to look at it in a new light and these are big topics so there's just going to be a lot underlying these aims and claims anything else you'd add on those",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.709,
    "end": 265.401,
    "text": " cool let's talk about the abstract which is how the authors have distilled and summarized their work for broad uh reading so this is the section that most people read it's kind of like a power law where a few people see the title then the smaller subset see the abstract and it goes down so we always look at how the authors reflect their um work in the abstract so i'll read the first half the abstract and then you can give a thought on something in there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 266.468,
    "end": 273.534,
    "text": " How can the free energy principle contribute to research on neural correlates of consciousness and to the scientific study of consciousness more generally?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 274.315,
    "end": 286.345,
    "text": "Under the free energy principle, neural correlates should be defined in terms of neural dynamics, not neural states, and should be complemented by the research on computational correlates of consciousness, defined in terms of probabilities encoded by neural states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 287.226,
    "end": 293.051,
    "text": "We argue that these restrictions brighten the prospects of a computational explanation by addressing two central problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 295.489,
    "end": 296.53,
    "text": " So just a thought there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 296.55,
    "end": 307.642,
    "text": "I think that the FEP is really well suited to providing a computational explanation of consciousness or a computational correlate of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 308.082,
    "end": 309.384,
    "text": "If we can kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 310.342,
    "end": 317.546,
    "text": " Maybe talk about the easy problem of consciousness, right, which which will get into the hard, easy and medium problems of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 317.626,
    "end": 322.149,
    "text": "But but really, the easy problem of consciousness is well described by the FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 323.409,
    "end": 329.933,
    "text": "And I don't know that we can really even in like nail down what exactly consciousness is, except from that computational standpoint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 331.527,
    "end": 331.827,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 332.047,
    "end": 345.614,
    "text": "And this question of defining consciousness, it's going to rear its head a million different ways, not the least of which when deciding what to measure or which analogy to use, having a computational versus some other type of adjective that you could put there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.154,
    "end": 352.897,
    "text": "So how about you go for recapitulating that last point, which is there's two central problems that are going to be addressed and then continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.92,
    "end": 362.122,
    "text": " So we argue that these restrictions brighten the prospect of a computational explanation of consciousness by addressing two central problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 362.562,
    "end": 366.803,
    "text": "The first is to account for consciousness in the absence of sensory stimulation and behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 367.243,
    "end": 383.006,
    "text": "The second is to allow for the possibility of systems that implement computations associated with consciousness without being conscious, which requires differentiating between computational systems that merely simulate conscious beings and computational systems that are conscious in and of themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 383.766,
    "end": 397.44,
    "text": " Given the notion of computation entailed by the free energy principle, we will derive constraints on the inscription of consciousness in controversial cases, for example, in the absence of sensory stimulation and behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 398.241,
    "end": 403.887,
    "text": "We show that this also has implications for what it means to be as opposed to merely simulate a conscious system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.175,
    "end": 413.16,
    "text": " So the two key problems, the central problems, one is what happens in the absence of stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.18,
    "end": 420.385,
    "text": "And then the second big block of text is the difference between actually being conscious versus simulating it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.846,
    "end": 431.994,
    "text": "And then by thinking about these two central problems and using the FEP as our guide, remember we're under, according to the title, under the FEP, not because of the FEP or some other way of talking about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.814,
    "end": 459.165,
    "text": " under the fep we're going to think about how this notion of computation is actually going to lead to some unique predictions and explanations and hypotheses that then we can talk about in a really scientific way that will take it out of the land of abstraction and well what about this thought experiment and what about this uncertainty here and towards the realm of well this model predicts that this kind of a brain or this kind of an agent will have this type of a measurement or response in this context",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.465,
    "end": 463.608,
    "text": " We want to have that consciousness-o-meter, the measuring device.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.128,
    "end": 467.75,
    "text": "But without the definition, it's hard to have the measuring device and vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.131,
    "end": 472.193,
    "text": "And so FEP looks like a promising way to sort of navigate that paradox.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 473.394,
    "end": 474.395,
    "text": "Let's go to the roadmap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.649,
    "end": 498.706,
    "text": " so this is a paper structure with six sections an introduction and a conclusion and with four internal sections the first internal section and we're going to go through a lot of these keywords in just a second starts from neural correlates of consciousness and moves the discussion from thinking neurally to thinking computationally so that's the movement from neural correlates to computational correlates of consciousness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 499.747,
    "end": 506.172,
    "text": " Then the third section moves from the computational correlates of consciousness into the free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 506.573,
    "end": 507.333,
    "text": "Surprise, surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.094,
    "end": 521.645,
    "text": "The fourth section goes back to computational correlates and moves the focus, the regime of attention from computational correlates alone, which have already been linked to the FEP to computational explanations of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 522.406,
    "end": 531.872,
    "text": " And then the fifth section brings together the computational explanations of consciousness with some of the first author's previous research on minimal unifying models of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.232,
    "end": 538.756,
    "text": "And all of this is implicitly interwoven with FEP, which is kind of what is being tied together with this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 539.136,
    "end": 542.298,
    "text": "So any thoughts on the structure or the roadmap, Lou?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 543.379,
    "end": 543.859,
    "text": "No, it's good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 543.899,
    "end": 545.58,
    "text": "It was a good flow, I thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.36,
    "end": 548.001,
    "text": "Yep, a dense paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.382,
    "end": 548.542,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 550.006,
    "end": 555.209,
    "text": " Definitely okay to take it in many sections and skip around and skim it through it first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.249,
    "end": 559.251,
    "text": "There's a lot of ways that each person will read different genres of paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 560.152,
    "end": 564.514,
    "text": "Okay, the keywords, the part we've been excited to talk about, I guess, all of it though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 565.234,
    "end": 577.121,
    "text": "And we just took the keywords from the paper and laid them out in an order and tried to present each keyword in a way that was standalone on just one or two slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.095,
    "end": 581.276,
    "text": " Again, thinking about the on and the off ramp for active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 581.496,
    "end": 591.661,
    "text": "So if you read this because Fristin's one of the authors or because it came up in a keyword search for free energy principle, but maybe you haven't thought about some of these other topics, that's one mode of listening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 592.101,
    "end": 600.184,
    "text": "And then the other mode of listening is like maybe with more experience or having thought more about these topics, where's free energy principle and active inference playing into all that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.625,
    "end": 604.726,
    "text": "And then beginner's mind and learning by doing plays on both directions of the road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.347,
    "end": 605.787,
    "text": "So our first",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.607,
    "end": 627.681,
    "text": " keyword uh well let's just actually read through the keywords free energy principle and active inference consciousness minimal unifying model neural correlates of consciousness computational correlates of consciousness computational explanation and islands of awareness okay so first free energy principle so how about you read it and i'll give a comment on the first half and then we'll flip",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.031,
    "end": 629.331,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 629.492,
    "end": 636.618,
    "text": "So the free energy principle provides an information theoretic analysis of the concept of existence of self-organizing systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 637.199,
    "end": 647.089,
    "text": "It entails that self-organizing systems at non-equilibrium steady state bound the entropy of their sensory signals by minimizing, on average, a quantity known as variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 647.649,
    "end": 650.312,
    "text": "As such, FEP is not a theory of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.254,
    "end": 653.615,
    "text": " Do you want me to read the second part or do you want to switch now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.995,
    "end": 656.236,
    "text": "I'll give a thought and then we can switch if there's two, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 656.556,
    "end": 665.561,
    "text": "But just that in the first paragraph, if you only dipped a toe in, you'd already find that FEP is not itself a theory of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 665.981,
    "end": 667.662,
    "text": "So the debate's not done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.222,
    "end": 670.083,
    "text": "We're looking at what the FEP is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 670.183,
    "end": 671.644,
    "text": "That's the first part of the paragraph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.084,
    "end": 678.467,
    "text": "It's a certain information theoretic analysis for thinking about self-organizing systems for complex adaptive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 679.227,
    "end": 681.168,
    "text": " And it's not itself a theory of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 681.688,
    "end": 686.83,
    "text": "So I think that that's just a really nice way to open the tone of the paper and the discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.69,
    "end": 693.032,
    "text": "So the second part here, referring to what is the free energy principle and how is this going to relate to the paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.753,
    "end": 699.375,
    "text": "A fundamental constraint provided by FEP is that it only applies to active systems that engage with their environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 699.915,
    "end": 709.04,
    "text": " Hence, a computer simulation of a system that minimizes variational free energy may perform computations that are also instantiated by a conscious agent that interacts with its environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 709.581,
    "end": 719.046,
    "text": "But if these computations are realized by a piece of hardware that cannot be regarded as an agent, e.g., they cannot move or change external states, then they can at most lead to a simulation of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 721.588,
    "end": 724.55,
    "text": "I think that this is interesting because it's like, it doesn't really...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 726.383,
    "end": 751.423,
    "text": " just like delineate what exactly is an active system and what what is engaging with the environment like for example if you have like an unborn baby inside of the mother is that like an active system engaging with its environment like can it doesn't have any control over like the environment of the environment is delivered to it like all non-stationary like self-organizing systems that are maybe more passive like i think about like ocean you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 752.003,
    "end": 758.808,
    "text": " creatures that just sit there like... I know that the FEP does apply, but it just doesn't really delineate exactly what those systems are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 760.389,
    "end": 760.589,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 761.47,
    "end": 761.81,
    "text": "Agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.35,
    "end": 766.333,
    "text": "And so if this is your first time hearing about it, it's obviously a big topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 766.353,
    "end": 767.674,
    "text": "There's a lot of ways to go about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 768.915,
    "end": 774.338,
    "text": "Also, I had a question like whether other physical systems like a proton, are we going to include that as an active system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 774.518,
    "end": 779.662,
    "text": "But there's a lot of... Is that an active... It's engaging with the environment, yes, but is it active?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 780.382,
    "end": 780.503,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 781.283,
    "end": 802.68,
    "text": " that's where we're going what is simulation versus actual consciousness where's the fep let's in this keyword section think about just what is the fep before we go that far out with the paper because we wanted to draw on the quotes from the paper to see where they were going with the fep and now let's pull back to just thinking about what is the free energy principle and this is a slide that had been used actually a couple uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 803.34,
    "end": 808.084,
    "text": " active streams ago, but it actually, a lot of the terms got reused.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 808.545,
    "end": 822.458,
    "text": "Fokker-Planck, Helmholtz, non-equilibrium steady state, Markov blankets, active inference, everything here, except for some of these more specific like sub process theories on the neural side, almost everything here was discussed in this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.098,
    "end": 828.223,
    "text": " So this is why it's so interesting to think about convergences between the papers, because there's a lot of overlap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 828.603,
    "end": 832.447,
    "text": "We're on the right track and we can hopefully start to reduce our uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.967,
    "end": 840.074,
    "text": "Just to run through these, the Fokker-Planck, and this is from Mel Andrews' paper and the history of thermodynamics of the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.094,
    "end": 844.718,
    "text": "So active 14, if you want to listen more, but the Fokker-Planck is bringing in a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 847.14,
    "end": 862.643,
    "text": " uh vector way and the helm holds as well of dealing with vectors and mathematics for certain kinds of systems namely these non-equilibrium steady state densities which we're going to go into in more detail so we're not going to go into it here and the free energy principle is a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.644,
    "end": 869.288,
    "text": " just as was said on the previous slide, it's an information theoretic analysis approach for these kinds of systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.528,
    "end": 886.819,
    "text": "Doing interesting stuff, non-equilibrium, steady state, cybernetic systems, and using that type of vector maths on it, and then it leads to all of these consequence, falsifiable, testable hypotheses, the process theories up at the top, and there could be other things as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 887.82,
    "end": 889.081,
    "text": "Anything else to add on that, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.362,
    "end": 890.762,
    "text": " Not at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 891.043,
    "end": 903.531,
    "text": "To go into one of the process theories that we like, active inference, and this is from another paper we've discussed a while ago, Vassal et al., A World Unto Itself, and this was thinking about communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.172,
    "end": 907.534,
    "text": "On 11, we said, okay, it's about active systems engaging with their world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 907.954,
    "end": 912.378,
    "text": "Slide 12, we're going to think about that in this kind of thermo, info, statistical way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.038,
    "end": 929.524,
    "text": " And then 13, okay, let's bring in almost the real processes and almost a systems engineering or just a systems modeling perspective to what kinds of systems are engaging with the world, active with a generative model of their niche, and how are we gonna think about that under the free energy principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.004,
    "end": 931.785,
    "text": "That's where active inference comes into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 932.465,
    "end": 940.188,
    "text": "And this is a diagram we see in many guises where you have internal states and external states, which are separated by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.908,
    "end": 951.431,
    "text": " an interface that can be modeled as a Markov blanket, but we'll also go into more detail on that later, where what goes inside or from one side of the interface to the other is sensation coming in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 951.972,
    "end": 953.112,
    "text": "That changes internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.612,
    "end": 954.872,
    "text": "Internal states such as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.593,
    "end": 967.217,
    "text": " different policy estimates for the world or different policy estimates for what one's self will engage in result in different action patterns, which influence external states, which also have their endogenous dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.597,
    "end": 968.917,
    "text": "So that's active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.418,
    "end": 973.679,
    "text": "That's what active inference lab is like thinking about and coming at from many angles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.979,
    "end": 976.82,
    "text": "So that's one little just snapshot of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 977.301,
    "end": 980.041,
    "text": "What is active inference for you today, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.062,
    "end": 981.242,
    "text": "Or what does this make you think about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 983.476,
    "end": 1006.989,
    "text": " so i'm always interested in reflecting on the internal states like hunger right how that results in an external action like a behavior like i'm gonna go find some food so i'm always interested in reflecting on on this and whether it's um it can be reduced to computation right like we know if we have a good estimate of what our predictive model is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.885,
    "end": 1014.071,
    "text": " or our generative model is, if we have that estimate, then we know what's coming at us, what is the input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1014.412,
    "end": 1015.773,
    "text": "Can we always predict output?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1015.993,
    "end": 1019.056,
    "text": "Are we just the sum of... Are we just a computation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1019.537,
    "end": 1021.579,
    "text": "I always think about that, so it brings that up for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1022.22,
    "end": 1026.744,
    "text": "Yep, this is a skeleton, but then if it's skeletons all the way down, where's the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1027.768,
    "end": 1048.358,
    "text": " meet where is the actual self or is it something other than that maybe it's that that is the self or some other thing like that so active inference active inference eight we talked about it from a reinforcement learning and a control theory perspective we've talked about it from a historical angle with mel and from a philosophical angle um in 15",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1049.659,
    "end": 1055.503,
    "text": " We're reintroducing consciousness, which we also talked about in nine with a projective consciousness model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.963,
    "end": 1066.429,
    "text": "So that consciousness free energy principle active inference discussion was about geometry and the projections and then the way that agents did active inference on this projective geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.05,
    "end": 1072.073,
    "text": "We're actually not going to talk about that projective, almost peripersonal space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1072.873,
    "end": 1088.46,
    "text": " relationship with the fep and this paper is going to take the same topics go in a little different way with more of a focus on the information theory and on the generative model and on the divergence of a few different kinds of surprise and measurements of the world so it's another facet",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1089.6,
    "end": 1118.034,
    "text": " let's talk about the main piece of the paper which is consciousness so how many ways to start or cover it um just when we were planning this as a lab and talking about it people were just bringing up good stuff in live discussion so someone said a felt sense of isness people were asking like where do we look for consciousness what do we measure and where what spatial temporal scales what kinds of systems and many people just pointed out there's so many",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1118.954,
    "end": 1146.489,
    "text": " understandings here and uh areas to study i mean if one is curious there's a great wealth of resources um before we dive into each facet of this hexaflower blue what does consciousness what like what interested you in this paper what makes you curious to study these things so i don't know consciousness is one of those things it's like love like we don't really have a good like definition for it we all kind of like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.381,
    "end": 1148.882,
    "text": " I think we know what it is, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1148.942,
    "end": 1155.687,
    "text": "Like we think we know what it is and what it isn't, but it's like a very, you know, ethereal concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1157.048,
    "end": 1165.155,
    "text": "So I don't know, it's always interesting to try to tackle these like things that can't really be pinpointed or like nailed to a certain like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1166.201,
    "end": 1185.141,
    "text": " bored right like you can't really exactly define consciousness it's always fun to kind of take a scientific approach to evaluate these things right like reduce love to you know oxytocin or whatever but it's more than that like it's it's I mean clearly consciousness is more than what any one thing that where it's more than the FEP it's more than what we're able to you know",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1186.022,
    "end": 1208.804,
    "text": " attached to it project onto it but it's it's always interesting to try to tackle these hard problems and i love the hexaflower so i've got to say like daniel put this together it's like a um a super cool design that takes consciousness as the center point and then integrates all of these keywords that we're going to be discussing the minimum unifying model islands of awareness neural correlates of consciousness computational correlates of consciousness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1209.284,
    "end": 1214.95,
    "text": " computational explanation, and then the easy, medium, and hard problems of consciousness, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1214.99,
    "end": 1217.873,
    "text": "So all these are surrounding the consciousness as the center point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.913,
    "end": 1218.253,
    "text": "I love it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1218.874,
    "end": 1222.658,
    "text": "What was kind of fun about that and almost meta is like, I was trying to arrange the list.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.898,
    "end": 1225.321,
    "text": "It's like, okay, we got active inference, free energy principle, keywords.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.781,
    "end": 1226.402,
    "text": "Get them out of the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1226.922,
    "end": 1229.885,
    "text": "Then we have consciousness-related keywords and consciousness itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1230.706,
    "end": 1232.808,
    "text": " And so how can they be arranged linearly?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1232.908,
    "end": 1235.61,
    "text": "And it was like there's no single linear arrangement.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.07,
    "end": 1238.532,
    "text": "Everyone could have a different way of seeing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1239.092,
    "end": 1255.665,
    "text": "So then it's just something that from studying the bees, we see the hexagon and then I see it more like when we want to reflect tiling, but a coherent tiling like Settlers of Catan, you can play on a bigger board, smaller board, but instead of just something that's blocky, it's like a it's yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.485,
    "end": 1279.772,
    "text": " okay so let's go to the first little sub pedal because thinking about the problems that steer us or that motivate us in consciousness research so this is like not you know moral proclamations on consciousness this is about scientific study of consciousness and about investigations um about people who are coming together from different perspectives not just living from within um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1280.942,
    "end": 1282.123,
    "text": " one specific definition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.604,
    "end": 1286.527,
    "text": "So people are going to be kind of playing fast and loose and having different takes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1286.627,
    "end": 1288.129,
    "text": "That's kind of the wildness of the field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1288.749,
    "end": 1295.555,
    "text": "So there was famous framing of the hard problem of consciousness by Chalmers in the 90s and subsequent research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1296.116,
    "end": 1299.219,
    "text": "That's a pretty famous singular moment, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.726,
    "end": 1326.801,
    "text": " just thought of you know easy medium and hard problems but different people are going to perceive different difficulties for some people they're really hung up on mind and body other people it's like a speed bump they just say yeah i mean it's this other way so that's just something that studying the field of consciousness studies is so interesting to me is some people a word they just they spend their whole life investigating it other people they just blow right by it or it seems like a question that totally it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.862,
    "end": 1344.897,
    "text": " even if they're aware of it isn't something super relevant so which problems are easy medium and hard it fits in that category there are hard problems like how could a physical thing or can a physical things generate conscious awareness and how would we know there's a lot of hard problems um but it's an interesting topic what did this make you think about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.528,
    "end": 1359.578,
    "text": " I think I already divulged what I was thinking about in the easy, medium, and hard problems of consciousness and how the FEP really lends itself to the easy problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1360.098,
    "end": 1364.082,
    "text": "Really, are we so reducible to the easy problem of consciousness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1364.362,
    "end": 1369.227,
    "text": "We all know that there's something more than that, and when we get into that more than that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1370.717,
    "end": 1382.277,
    "text": " thing do we become then like less scientific and more like spiritual right like like do we take some leap of faith going into the hard problem of consciousness or are we just like ascribing some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1383.649,
    "end": 1406.592,
    "text": " property like if we're going to really be scientific about it like consciousness is one of those things that if you're going to buy into it like it has to kind of be everywhere like i mean we make this like hard cut off like if you look at research like only higher vertebrates that have a central nervous system those are the only like things that are conscious in the world right like and some people have like lines within that like only humans right so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1407.413,
    "end": 1410.394,
    "text": " Really, can we draw these like hard boundaries?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1410.434,
    "end": 1411.474,
    "text": "Like, I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1411.514,
    "end": 1419.597,
    "text": "I kind of feel like if consciousness exists, it's pervasive, but maybe pervasive only among living systems, but then as a tree conscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1420.397,
    "end": 1422.438,
    "text": "So it's one of these, it's hard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1422.458,
    "end": 1423.158,
    "text": "It's a hard problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.175,
    "end": 1446.488,
    "text": " yes um agreed and the easy one is almost the part that explains it's like when people make fun of daniel dennett's book consciousness explained consciousness explained away it's like yeah we know how a robot would respond to a sensory um you know cue to engage in action but that's not the hard part that's not really the heart of the matter",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1447.768,
    "end": 1467.587,
    "text": " next topic so minimum unifying model of consciousness what what did you find interesting about this or what did you like about what you read um i liked this quote that um i pulled out from from the end of the uh paper like i think it was right before the conclusion maybe the end of section four",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1468.548,
    "end": 1473.751,
    "text": " that says, you know, minimizing variational free energy could count as a minimum unifying model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.131,
    "end": 1481.874,
    "text": "Variational free energy must be minimized by every self-organizing system that persists and hence also by any conscious system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.894,
    "end": 1487.797,
    "text": "I liked that and I thought that it was applicable and kind of really right on target.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1489.138,
    "end": 1492.259,
    "text": "The challenge is decompiling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.459,
    "end": 1495.541,
    "text": "So every self-organizing system that persists",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.86,
    "end": 1498.041,
    "text": " Are those the conscious systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1498.341,
    "end": 1499.762,
    "text": "Are those two sets the same?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.982,
    "end": 1503.605,
    "text": "So self-organizing storm cloud, what is it like to be a storm cloud?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1503.645,
    "end": 1505.446,
    "text": "What is it like to be a volcano?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.347,
    "end": 1508.528,
    "text": "That's the question of what is it like to be a bat?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.888,
    "end": 1512.271,
    "text": "And then another thread is like the cultural.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1512.411,
    "end": 1524.019,
    "text": "Like maybe if there's a prior or something that's implicit or sub-personal that leads us to certain kinds of explanations being just absurd versus real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1524.659,
    "end": 1548.22,
    "text": " intuitive like panpsychism versus only vertebrates or only subclasses or or nothing it's like what do you mean nothing it's like well just nothing it's not something i wonder about why not but not not an issue if not so that's the minimum unifying model it's going to come up in the terms of this paper just because that's kind of um both of the authors are interested in that i would say",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.154,
    "end": 1557.537,
    "text": " And just to go into one of the prior papers, a solo author paper by the first author, Wanja.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.897,
    "end": 1560.738,
    "text": "So this is the science of consciousness does not need another theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1560.798,
    "end": 1567.461,
    "text": "It needs a minimum unifying model, unifying words on 7-11-2020, great date for a paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1568.321,
    "end": 1576.024,
    "text": "And here are on the right side are referring to two kind of hypotheses for how we could think about different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1576.784,
    "end": 1595.486,
    "text": " fields of meaning one way of uh arranging different fields would be like information generation is all these tan things in a so this is like computers and random number generators and die or something like that and then consciousness is a subset where maybe there's some conscious systems that don't generate information maybe there's some that do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1596.618,
    "end": 1603.762,
    "text": " Maybe you have a different feeling about how these are overlapped, like in B, where there's information generating systems, that's a big super class.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1604.363,
    "end": 1610.206,
    "text": "And then within that, there are systems like the blue, the non-reflexive behavior that are cybernetic to some extent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.647,
    "end": 1619.032,
    "text": "Like it's predictive, it's acting in a way that might have some game theory like, or some sort of adaptive seeming dynamics, but consciousness is a subset of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1619.592,
    "end": 1628.278,
    "text": " And so I just really appreciated the research direction of the author, because the difference between A and B is night and day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.398,
    "end": 1629.399,
    "text": "And there's many other options.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.499,
    "end": 1630.74,
    "text": "It wasn't an attempt to be exhaustive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1630.78,
    "end": 1638.705,
    "text": "It's like, if we could talk about this, we could have a better way of framing, oh, our computer's conscious, our human and the computer, what's conscious?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.045,
    "end": 1639.926,
    "text": "Let's take a step back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.726,
    "end": 1648.372,
    "text": " What are we overlapping with what and what's on the table here and what kinds of words do we care about and where's the territory?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1648.412,
    "end": 1662.842,
    "text": "It's okay if territories are nested within each other or overlapping or they're intercalated or they're complementary or something, but we have to pull back to kind of a level where we can at least sort through all these theories of the science of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1663.502,
    "end": 1669.193,
    "text": " because otherwise it's just a total mess and the information overload aside, it doesn't even make sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.674,
    "end": 1672.059,
    "text": "Just if everyone's working in their own wavelength, it doesn't even make sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1672.5,
    "end": 1674.043,
    "text": "So really nice direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1674.464,
    "end": 1675.325,
    "text": "Any thoughts on that, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1676.98,
    "end": 1703.357,
    "text": " so i wonder if like information generation and consciousness like aren't a full overlap like if those can just like be all lumped into one of one another and then non-reflexive behavior is like some subset of that um just just even going to like the spin of a of an electron like a coupled electron like if you're looking at at qubits right like so it it's always got to be there's a paired system and is that conscious like just getting down to the very basic like atomic particles",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1705.549,
    "end": 1719.882,
    "text": " Especially what we talked about earlier, like if the free energy principle is for so-called passive and active systems that are engaging with their niche, like systems that aren't usually thought of as very reactive, like a proton or like a rock at a larger scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.823,
    "end": 1744.623,
    "text": " are they on this consciousness continuum or are they disjoint from it or so those are the kinds of things where reading the paper helps bring us to the edge of the ideas and of research and also to the edges socially thinking about it and talking about it hearing people who have different perspectives so on the perspectives issue also computational explanations so just in the word",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1745.805,
    "end": 1746.686,
    "text": " What is computation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1747.146,
    "end": 1748.247,
    "text": "You're going to have a lot of takes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1748.748,
    "end": 1758.838,
    "text": "Some people will say, I mean, of course, you know, my Linux computer right here is a computer, but then they'll say that the hydrogen is also a computer and the football, when it gets kicked, it's also computing a parabola.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1758.878,
    "end": 1760.359,
    "text": "So it's computing everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1761.04,
    "end": 1762.661,
    "text": "And then what is explanation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1763.564,
    "end": 1770.646,
    "text": " philosophy of science rabbit hole to go down, but is it about being emotionally satisfied with what we know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.086,
    "end": 1773.166,
    "text": "Or is it about being able to usefully act?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1773.446,
    "end": 1775.427,
    "text": "Like, do we have an explanation for traffic?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.967,
    "end": 1776.327,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1776.647,
    "end": 1780.988,
    "text": "Maybe some people would say yes, no, in this situation, yes, but do we have best practices?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1781.128,
    "end": 1782.348,
    "text": "Do we have approaches?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1782.949,
    "end": 1784.409,
    "text": "So explanation versus approaches,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1785.049,
    "end": 1791.052,
    "text": " And then the last point here is just thinking, especially in the biological case, about unconventional computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1791.172,
    "end": 1800.356,
    "text": "So let's just call the Turing von Neumann genre, the binary state machine idea conventional computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.856,
    "end": 1805.598,
    "text": "There's a whole world, quite literally, of unconventional computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1805.858,
    "end": 1809.02,
    "text": "So reservoir computing, things that we're going to talk about right at the very end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.26,
    "end": 1822.17,
    "text": " Within the binary computers and then outside of the binary computers, physical computing, wetware by Bray is kind of about moving beyond software hardware distinctions, which don't exist in cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.23,
    "end": 1823.131,
    "text": "DNA is DNA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.211,
    "end": 1824.071,
    "text": "It's not hardware.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1824.091,
    "end": 1824.792,
    "text": "It's not software.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1824.832,
    "end": 1825.613,
    "text": "It's not source code.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1825.653,
    "end": 1826.153,
    "text": "It's DNA.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1826.573,
    "end": 1831.717,
    "text": "And then Leviathan cover of that famous work with a larger source.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.498,
    "end": 1859.134,
    "text": " the group made up of the individuals so that kind of multi-level systems perspective on computation multi-level cognition all of these things come into play when we're talking about computational explanation so can i just like yeah maybe add a little bit oh yeah i know i know that this is one of your chillest areas so i just think about explanation like what is the um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1860.293,
    "end": 1862.974,
    "text": " Like explanation is like the death of curiosity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1863.394,
    "end": 1865.835,
    "text": "It's like the ultimate like pacification.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.955,
    "end": 1868.376,
    "text": "Like I just explained it to you, therefore shut up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1868.436,
    "end": 1870.516,
    "text": "Like that's why, that's your answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1870.977,
    "end": 1876.418,
    "text": "So I think like explanation, like we should never be satisfied with any explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1876.778,
    "end": 1878.059,
    "text": "Like we should not...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1879.011,
    "end": 1885.097,
    "text": " presume that we understand fully like anything because it just ceases investigation at that point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1886.179,
    "end": 1895.589,
    "text": "And so I think like, you know, computational approximation might be more fun and lend itself more to deeper scientific explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1896.471,
    "end": 1920.299,
    "text": " yeah one thing that we were talking about just like um an hour ago with some other people in the lab was like if the heart of the issue is how things are realism once you get the lossless you know mp3 file the quest for what is is done but then if the song is not just the mp3 file but it's actually the relationship how could you say that that ever ends so it's kind of like yeah are we looking to engage",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1921.019,
    "end": 1923.241,
    "text": " and to do things in the world and act?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.701,
    "end": 1927.604,
    "text": "Or are we looking to come to a satisfying emotional explanation in some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1929.233,
    "end": 1952.276,
    "text": " uh topic all right so 19. so here we are getting to some of the details like the computational versus the neural correlates of consciousness so there's two double c's this is the ccc and then the next one's going to be the ncc so what are the computational correlates of consciousness what would be your definition for a ccc",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1954.694,
    "end": 1962.816,
    "text": " So, like I said, I think that the computational correlates of consciousness, you know, it goes back to, like, is a football conscious, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1962.856,
    "end": 1963.916,
    "text": "Like, it's input-output.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.096,
    "end": 1973.578,
    "text": "So, like, you know, you have – what goes into the system and what comes out of the system and, you know, is – like, can we call that consciousness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1973.898,
    "end": 1974.578,
    "text": "I don't really know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.458,
    "end": 1978.819,
    "text": "But for me, like, my interpretation is it's a decision, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1978.859,
    "end": 1979.939,
    "text": "Like, so you have the input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1980.319,
    "end": 1982.921,
    "text": " You know what you're supposed to do or what you think you're supposed to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1982.961,
    "end": 1988.645,
    "text": "You have some approximation about what you're supposed to do, how you're supposed to engage with your environment based on the input that comes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1989.106,
    "end": 1995.971,
    "text": "And then you act in accordance with what you think you're supposed to do or what you predict will lead to the best outcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1995.991,
    "end": 1997.012,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1997.212,
    "end": 1997.752,
    "text": "Something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1998.293,
    "end": 1998.393,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.517,
    "end": 2005.021,
    "text": " Well, the correlate word is suggesting that this is not an explanation that's causal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2005.482,
    "end": 2008.144,
    "text": "Correlation is not causation, as they say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2008.764,
    "end": 2010.666,
    "text": "So it's like, we're talking about correlations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2010.706,
    "end": 2017.611,
    "text": "We're talking about observables, kind of like a correlation, like a regression coefficient, but a little bit probably deeper than that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2018.172,
    "end": 2026.398,
    "text": "And then I guess my question for the authors would be, how is this related to the cybernetic correlates of consciousness or the cybernetic correlates",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2027.179,
    "end": 2044.419,
    "text": " attributes um in the paper nine with rudroff and um and other authors it was like there was the five functional invariance or something like that like the perceptual invariance so what are these computational correlates um and how are they related to algorithmic or cybernetic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.0,
    "end": 2047.343,
    "text": " Because maybe the word computer has a lot of baggage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2047.363,
    "end": 2049.406,
    "text": "We're live streaming on a computer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2049.426,
    "end": 2051.208,
    "text": "It's just used in a really specific way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2051.228,
    "end": 2051.969,
    "text": "It's a specific word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2052.549,
    "end": 2058.917,
    "text": "And then maybe there's another way to think about like processual correlates or like the informational correlates of consciousness that might be a little bit...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2060.885,
    "end": 2089.05,
    "text": " different aspect of what they're showing but the details of what they're showing we'll get to all right ncc so the neural correlates of consciousness it's another correlate um question so we're looking for neural things that correlate with consciousness so first off correlation causation again and the correlation can be like evolutionary like we think that this brain region over the breadth of species diversity is correlated with consciousness or it's correlated with this behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2089.85,
    "end": 2094.552,
    "text": " or the correlation can be like a molecular thing, or it can be a dynamical pattern.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2094.572,
    "end": 2099.414,
    "text": "It could be this fMRI pattern or this EEG pattern is a correlative consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.714,
    "end": 2104.656,
    "text": "We set them up so that it was an experiment where in this task, they did have consciousness and this one they didn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2105.356,
    "end": 2114.76,
    "text": "So it gets into defining consciousness, but they say the difference between these two conditions is the neural correlative consciousness, or the difference between patients in this category versus patients in this category is this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2115.44,
    "end": 2117.441,
    "text": "And for two takes on the issue, in 2016,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.282,
    "end": 2132.747,
    "text": " Christoph Koch at all, talked about like from their pro neural correlate of consciousness agenda direction, what were the problems and progress in their fields?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.147,
    "end": 2147.112,
    "text": "And then here's a paper from 2019 with me and a colleague where we kind of took a step back from just thinking about the neural correlates and thought, okay, what about for the ant colony or for other systems that aren't just like set up like the mammalian brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2148.072,
    "end": 2172.181,
    "text": " how would we think about consciousness because if you study only the neural correlates consciousness you're studying how would you know that that's actually the subset of systems it's like you're shining a spotlight maybe a good one maybe a distorted one on the neural system but what if it's not just neural it's glial oh well of course i meant that okay well what if it's neural and the body oh yeah i meant that too so all of a sudden okay now you're talking about neural in the niche and that's why we're talking about multi-scale systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2172.981,
    "end": 2197.495,
    "text": " so that's what there's a lot of interesting stuff happening here and about how the fep and multi-scale approaches fit together with the more neural focus and the more certain time scales and certain neural signatures that avenue of research in neuroscience humans sensu strictu now connecting it to a clearly very vast area what do you think about that blue um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2198.841,
    "end": 2201.324,
    "text": " So I think that the neural correlates of consciousness is cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2201.384,
    "end": 2207.09,
    "text": "I think that like they do the fMRI study, like when you're asleep versus when you're awake and then they take like the difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2207.25,
    "end": 2212.095,
    "text": "That's like a common way that they like estimate the neural correlates of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2213.596,
    "end": 2218.341,
    "text": "There's also like the hyper consciousness, like I can't remember the author.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2220.014,
    "end": 2243.885,
    "text": " um but he did like the information theory like aspects of like psychedelics so like expanded consciousness like what does expanded consciousness look like and how like there's more connections between uh neurons i'll have to remember the name of that paper for next time um but but it's it's just uh the neural correlation of of consciousness was really done by differentials um that's a common thing i think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.554,
    "end": 2245.875,
    "text": " Yes, exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.115,
    "end": 2256.104,
    "text": "It's an experimental way to get at using measurements, real data, real experimental setups, the kinds of things that exist in neuroscience labs, getting at questions of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2256.985,
    "end": 2262.009,
    "text": "And the question is, are we on the right track or might we be misled by the tools that we have available and the approaches we have?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2262.549,
    "end": 2264.851,
    "text": "So 21, islands of awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.051,
    "end": 2268.194,
    "text": "Okay, so this is kind of a topic that I'd never heard about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.614,
    "end": 2271.617,
    "text": "It's from a recent paper by Bain et al, 2020.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.118,
    "end": 2291.086,
    "text": " And so we're thinking about kind of the fringe cases or the areas where we might be able to have a unique prediction or an explanation that is going to be a value add for the FEP in thinking about neuroscience and consciousness or which systems are going to be useful to think about, even if other systems also agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2291.946,
    "end": 2298.308,
    "text": " And there's going to be this case proposed, like a thought experiment called the Island of Awareness, which is a conscious stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2298.348,
    "end": 2300.168,
    "text": "So I don't know, is the rabbit already in the hat?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2300.928,
    "end": 2309.19,
    "text": "It's a conscious stream or system whose contents are not shaped by sensory input from either the external world or the body and which cannot be expressed via motor output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2310.151,
    "end": 2314.352,
    "text": "Now, one could just say, well, but what if the body's part of the whole conscious system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2314.412,
    "end": 2318.093,
    "text": "So it's a kind of non sequitur to say, well, it's happening in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2318.193,
    "end": 2319.293,
    "text": "Ergo, you can cut that out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2320.376,
    "end": 2321.678,
    "text": " maybe you can, maybe you can't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2322.299,
    "end": 2331.392,
    "text": "But by looking at the paper and by believing that the authors have thought through what they wrote, it's always a useful starting point for discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.012,
    "end": 2335.617,
    "text": "So the fringe and the edge cases can be where we start to see theory differentiation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.318,
    "end": 2340.74,
    "text": " So if this thought experiment isn't very interesting to you, you'll probably find another one that might be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2341.06,
    "end": 2351.364,
    "text": "But these are like we're looking for the exceptions to prove the rule or the sort of higher level game that is revealed by us oversampling just one area of state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2351.904,
    "end": 2357.006,
    "text": "The issue with thought experiments, though, is, well, kind of like science fiction, they can provide inspiration if they're...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2358.326,
    "end": 2361.869,
    "text": " at the right place at the right time, you're never going to reach these ideal situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2362.049,
    "end": 2364.251,
    "text": "And they often have a huge amount of assumptions built in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2364.931,
    "end": 2368.254,
    "text": "And then even for, there's this dream of empirical application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2368.334,
    "end": 2371.677,
    "text": "Oh, we'll study the island of awareness then because it's such a great thought system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2371.717,
    "end": 2373.619,
    "text": "And there's a hundred papers on published on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.999,
    "end": 2376.161,
    "text": "But then it, even for a close case,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2376.741,
    "end": 2380.022,
    "text": " like, oh, maybe in this medical condition, they're locked in syndrome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.582,
    "end": 2383.203,
    "text": "It ends up that it's not exactly what people want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2383.283,
    "end": 2389.965,
    "text": "And so then it goes into a really protracted multi-year thing with just is the system the right one to test this thought experiment?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2390.445,
    "end": 2391.345,
    "text": "Short answer, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2391.826,
    "end": 2395.547,
    "text": "And it's hard to know what to do with real systems to really make a dent in the consciousness problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2395.787,
    "end": 2396.407,
    "text": "Any thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2399.328,
    "end": 2402.289,
    "text": "Just that the islands of awareness, I think,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2404.114,
    "end": 2408.778,
    "text": " are always, there's always going to be those exceptions to the rule or those hard cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2408.818,
    "end": 2413.142,
    "text": "Like we don't even really know how to get at consciousness in a system like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2413.182,
    "end": 2415.724,
    "text": "Like a brain in a dish model, is there consciousness in that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2415.744,
    "end": 2421.088,
    "text": "Like I remember working in the lab and growing cells in my like petri dish or whatever they were growing in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2421.188,
    "end": 2422.089,
    "text": "And like, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2423.329,
    "end": 2433.131,
    "text": " I was like, I wonder what my culture is thinking or if they're thinking, like I would be like doing neuronal differentiation and be like, you know, I just wonder like what they're thinking about today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2433.211,
    "end": 2435.992,
    "text": "So, so, I mean, it's just, it's always like a, this mystery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2436.012,
    "end": 2440.293,
    "text": "So we don't really know if there's, if we can approximate consciousness in a system like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2440.713,
    "end": 2446.074,
    "text": "Also the author of the information theory and psychedelic paper is Andrew Gallimore is his name.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2446.134,
    "end": 2446.674,
    "text": "Sorry, I forgot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2447.014,
    "end": 2447.274,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2447.894,
    "end": 2448.654,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.894,
    "end": 2456.076,
    "text": "And again, like how does philosophical uncertainty or debate propagate through basic research and application?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2456.876,
    "end": 2459.477,
    "text": "What about with organoid research on neural cultures?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2459.537,
    "end": 2468.718,
    "text": "And so is there a certain size of brain or what about there's a brain and a body or you recapitulated something from a stem cell, from a neuron and from a skin cell or you made some new cell type.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.798,
    "end": 2475.48,
    "text": "It's like, is it different or worse or better to throw a gallon of skin cells versus a gallon of this type of cell?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.42,
    "end": 2490.727,
    "text": " those are big questions and that's why the consciousness discussion is really important to not just resolve but to sort of like clarify and to engage with so the big picture of this paper now to get into um the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.607,
    "end": 2492.907,
    "text": " quotes and some of the key topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.107,
    "end": 2494.468,
    "text": "We're not going to go through every quote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2494.488,
    "end": 2507.931,
    "text": "We're not going to read every quote because there's a bunch of quotes, but this section is going to just describe the main three observations that link three of the big TLAs, three letter acronyms together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.211,
    "end": 2512.872,
    "text": "So FEP is the big one, but then we have the neural and the computational correlates of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2513.332,
    "end": 2515.573,
    "text": "So they're all kind of going to be joined together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2515.593,
    "end": 2519.454,
    "text": "And just to read the first point of each one,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2520.794,
    "end": 2525.64,
    "text": " If we're going to go FEP, neural correlates should be in terms of neural dynamics, not neural states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2526.32,
    "end": 2533.669,
    "text": "So in other words, patterns of neural systems through space and time, not just like, oh, the Jennifer Aniston neuron fired.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2534.089,
    "end": 2536.232,
    "text": "So they were conscious of Jennifer Aniston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2536.252,
    "end": 2541.358,
    "text": "It's going to have to move a little bit beyond that into something that's about dynamics through state spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2542.793,
    "end": 2553.042,
    "text": " This second point is that there are relevant distinctions to be made between the probabilities of movements through this neural state space and the probabilities encoded by neural states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.184,
    "end": 2560.388,
    "text": "That's going into a whole encoding representation question and a lot of statistical details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2560.408,
    "end": 2562.27,
    "text": "If that sounds interesting, read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2562.93,
    "end": 2567.995,
    "text": "And then the third point is that some of the computational correlates literature",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.586,
    "end": 2573.487,
    "text": " able to be recast within the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2573.928,
    "end": 2581.531,
    "text": "And so the FEP is going to be like a bridge or like a nexus between people have identified 10 computational correlates and 10 neural correlates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.551,
    "end": 2589.796,
    "text": "Well, you got this blood signal in this brain region when they see this thing and this auditory region when they hear this thing and this when they remember themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.196,
    "end": 2594.518,
    "text": "And then on the computational side, you have this feature ABCD, all this stuff, information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2595.118,
    "end": 2596.079,
    "text": "How are we going to bring them together?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2596.099,
    "end": 2596.159,
    "text": "FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2598.12,
    "end": 2598.62,
    "text": "Any thoughts, Blue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2600.453,
    "end": 2617.771,
    "text": " nope so let's go through kind of with a little i don't think we kept the exact order of the paper but early in the paper we start from the neural correlates of consciousness which is something that people have at least probably thought of like there's something different when there's blood loss to the brain than the hand so people have kind of thought that there's a neural correlate of consciousness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2618.291,
    "end": 2623.535,
    "text": " We're going to move the discussion from just thinking about neural correlates to computational correlates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2623.655,
    "end": 2630.98,
    "text": "So this is the narrative trajectory from being like neuro reductionist or centric to more computational perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.5,
    "end": 2637.164,
    "text": "They say CCC computational correlates are more general and promised to be more explanatory than neural correlates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2637.324,
    "end": 2664.377,
    "text": " correlates but there's also challenges so big benefits that you get you can consider ant colonies and ecosystems all kinds of cool stuff and perhaps have access to a whole new set of computational tools downside are um what computational correlates are not defined in terms of neural structures but are neutral with respect to the question of whether the conscious experience correlate with global neural activity or not so the issue is that the brain is changing state all at once",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2665.27,
    "end": 2671.634,
    "text": " And so you don't know whether that one feature you isolated is really the difference that makes a difference, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2671.654,
    "end": 2680.12,
    "text": "It's like you could run two different computers and you wouldn't really know what about their outcomes from a correlated perspective was the actual explanation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2680.58,
    "end": 2684.743,
    "text": "So one part is it's hard to get an explanation, even though they say it's more explanatory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.048,
    "end": 2698.074,
    "text": " And then basically the second challenge for the computational correlates is the mapping from any correlate to consciousness, especially in controversial cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2698.734,
    "end": 2707.418,
    "text": "And the third challenge for any correlate of consciousness is basically fringe cases and cases we don't know or don't, but even those who knows what we do and don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.099,
    "end": 2708.219,
    "text": "So-",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.946,
    "end": 2733.031,
    "text": " there's these are three of the major dimensions of the challenge for any correlate of consciousness global versus local structure mapping between um consciousness and any correlate arbitrarily or not and then cases we don't know or understand so there's big territory that's pretty open and there's a lot there what do you think about that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2735.68,
    "end": 2741.567,
    "text": " There's a lot, there's a lot remains to be, you know, elucidated in all of those areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2741.948,
    "end": 2742.168,
    "text": "So.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2742.188,
    "end": 2742.248,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2742.809,
    "end": 2743.009,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.029,
    "end": 2743.59,
    "text": "So 24.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2743.63,
    "end": 2744.952,
    "text": "So yeah, we'll kind of,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.12,
    "end": 2752.663,
    "text": " Taking computational, just at the author's word, that's the thread they tie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.023,
    "end": 2756.485,
    "text": "So it's a broader understanding than just, I think, a computer processor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2756.645,
    "end": 2760.267,
    "text": "I hope that we'll find that out, especially when we talk to the authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2761.028,
    "end": 2764.87,
    "text": "So there's a generality of these computational principles, but they also have a disadvantage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2765.49,
    "end": 2769.993,
    "text": "The properties described by them may not be necessary for many types of conscious experience, but probably not sufficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2770.393,
    "end": 2773.916,
    "text": "So probably, it's a probabilistic statement, but do we know what is sufficient?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.756,
    "end": 2778.859,
    "text": " And so in other words, what is required for consciousness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.479,
    "end": 2786.624,
    "text": "That's sort of the issue with this computational approach is you get this general toolkit that can cross scales really easily.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2786.644,
    "end": 2795.77,
    "text": "You say, oh wait, if I can make a measurement of a millimeter and a measurement of kilometers, and then I can use my tools on numbers, then it's a multi-scale model, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2796.29,
    "end": 2803.876,
    "text": "And so the challenge is, have you underspecified aspects of the system leading to a really potentially",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2805.397,
    "end": 2828.46,
    "text": " like bad false positive or false negative rate of course the question is what is the ground truth whose ground truth and how are we going to get to these edge cases and resolve them in a real finite world and then the authors say in order to address this question of what is necessary and sufficient we show that um we show to what extent and from what assumptions some computational principles can be derived from first principles",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2829.625,
    "end": 2852.516,
    "text": " so they're going to say all right this even the computational correlates of consciousness people yes there's some issues with going computationalist but we have studied those this is good phrasing then we're going to ask how even the computational correlates could be themselves generated from an underlying something first first principles which are going to be information and physical principles as we are seeing what do you think about that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2854.139,
    "end": 2861.343,
    "text": " So, I mean, I think in order to delineate what's required for consciousness, you need to kind of get at the point of what is consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2861.523,
    "end": 2866.566,
    "text": "Like, and I think that, you know, they artfully skate past that in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2866.706,
    "end": 2867.927,
    "text": "And I mean, I don't blame them, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2867.947,
    "end": 2876.051,
    "text": "Like it's a, it's a touchy and difficult and many gray areas, you know, exist within trying to define consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2876.311,
    "end": 2880.193,
    "text": "But if you can't define what is consciousness, how can you define the requirements for consciousness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2881.014,
    "end": 2881.174,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.419,
    "end": 2901.809,
    "text": " agreed and so let's uh see what any of the authors have to say on that but this is the question how is computational principles or physical principles going to come into play all right here we go into the formalism section there's a bunch of formalisms in the paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.97,
    "end": 2917.014,
    "text": " And here is just one from the paper starting on the top left that sites out to a Friston paper, this Friston 2019 long monograph that is having many active improvements and revisions and discussions on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.654,
    "end": 2927.957,
    "text": "And then here's two sections from this Friston 2019 paper from 12 and 13, I think, but really you could take it even back further, just like any other literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.977,
    "end": 2930.938,
    "text": "You kind of take it back as far as you want to learn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2931.858,
    "end": 2942.061,
    "text": " But for the purposes of the top left, the paper that we're reading today, the key formalism is here, or one of the key formalisms, just the one on this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2943.222,
    "end": 2951.404,
    "text": "We're going to express the flow of F in terms of surprisal, and hence in terms of a non-equilibrium steady state density.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2952.205,
    "end": 2958.447,
    "text": "Expressing the flow F in terms of surprisal is almost like thinking about surprisal like it were a flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.207,
    "end": 2972.738,
    "text": " So just like you could have a flow of water, we're thinking about kind of surprisal flows, which is to say using flow like dynamics to study surprisal, because that's all sort of a few different facets of the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2973.519,
    "end": 2977.903,
    "text": "And so there's going to be some flow that's going to reflect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2980.211,
    "end": 3000.187,
    "text": " some terms that can be rewritten a few different ways we're not going to go down all the details i think of every letter anything that we should add on this slide blue but this is just about the idea of expressing information as a flow which is going to set us up for some of these later discussions and formalisms yeah no i'm good",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3001.46,
    "end": 3026.371,
    "text": " yep and we just throw these slides uh in the order just that we snap them so there's other orders and other ways of going through it we had to look up a ton of stuff we learned that the uh i'm going to bring this on the dell or the nabla it's the operator used in mathematics particularly vector calculus uh that is a vector differential",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.091,
    "end": 3052.771,
    "text": " so it's like div grad curl but it's it's an upside down triangle but it does have to do with change just like a regular delta but it's a whole area of math and so this is just to say some people maybe they didn't expect an equation in a consciousness paper other people maybe they're very familiar with this math and applying it to consciousness seems like an outrageous overstep so that's the conversation yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3053.471,
    "end": 3057.835,
    "text": " If you're somewhere in the middle, I'm somewhere in the middle of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3058.735,
    "end": 3065.16,
    "text": "But if you're somewhere in the middle, just knowing that it's like about information geometries, like how Daniel was mentioning, it's about a flow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3065.24,
    "end": 3076.469,
    "text": "And so when you have like, it's a geometry, like the probabilities are thought about in these shaped spaces and kind of knowing that helps to contextualize the way that it moves, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3077.196,
    "end": 3083.663,
    "text": " You know, thinking of float, it all makes me think of like a program, it's all set up and loaded, which files to read in, what to analyze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.703,
    "end": 3087.266,
    "text": "You hit enter, it's like a bunch of grain in a silo and you pull out,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3088.334,
    "end": 3091.435,
    "text": " the stopper, and then it flows because there are forces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.515,
    "end": 3099.919,
    "text": "So the computer's having energy course through it, and there's certain irreversible processes that increment a flow of information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3100.519,
    "end": 3108.043,
    "text": "And so that's kind of, I wonder what kinds of metaphors, like this could be something for the author, like how do we think about this flow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3109.284,
    "end": 3112.805,
    "text": " And where, how do we, how can we describe it and learn about it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.646,
    "end": 3134.914,
    "text": "So this is another, this is, so yeah, maybe this one could have gone before the other one, but this is a pretty general framing of random dynamical systems that are using this Langvane formalism that was developed in the direction of Free Energy Principle by Ao, AO, 2008, and other authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.934,
    "end": 3134.994,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.786,
    "end": 3141.109,
    "text": " Basically, we can read this bottom part and go back to the equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3141.209,
    "end": 3153.466,
    "text": "So the state of the system x of t at time t, tau, is constituted by slowly changing macroscopic variables, which are grounded in microscopic variables with faster dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.423,
    "end": 3159.647,
    "text": " So it's almost like saying little things are composed of littler things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.147,
    "end": 3161.388,
    "text": "Little things compose bigger things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3161.428,
    "end": 3168.493,
    "text": "So it's kind of allowing us to go multi-scale by saying that there's gonna be a sort of big wave and a ripple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.433,
    "end": 3179.701,
    "text": "And a bunch of the ripples summating makes the big wave informationally just kind of like a bunch of physical things spatially compose a bigger thing, but this is happening",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3180.657,
    "end": 3201.788,
    "text": " through time as a random dynamical system not with a spatial metaphor so think about little things assembling into bigger things and then port it out of the physical into the dynamical systems and it's what kind of a dynamical system it could be related to information this is why the result is a stochastic differential equation comprising not only the state dependent flow f",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3203.183,
    "end": 3206.805,
    "text": " but also a stochastic term omega with a mean equal to zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.386,
    "end": 3210.087,
    "text": "So another way of thinking about this is like signal and noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.888,
    "end": 3221.314,
    "text": "And so it's all like the vibration, but you can partition it with a model into change through time of a signal and a noise that's like much higher frequency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.715,
    "end": 3224.176,
    "text": "So that noise, it's not like you're saying it's like bad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3224.296,
    "end": 3228.399,
    "text": "It's just that with the signal that you're pulling out, it's the residual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3228.979,
    "end": 3235.004,
    "text": " And the signals that are hard to find are the ones that are shorter, like they're hiding in the noise, but those can be pulled out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.124,
    "end": 3237.406,
    "text": "If you have a really long time series, you can totally pull it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.806,
    "end": 3245.892,
    "text": "And there's other signals where the signal is so strong and then the noise is so tiny, like the vibration an inch off of the orbit of a planet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.373,
    "end": 3250.156,
    "text": "It's like really easy to pull out the signal because the noise term is so small.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3251.112,
    "end": 3254.034,
    "text": " So any thoughts on that, Blue, or we can continue?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3254.054,
    "end": 3254.414,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3254.894,
    "end": 3267.142,
    "text": "So now we want to talk about what exists, which is related to Fristian's theory of every quote thing or of particular physics, which is a specific way of doing physics, and it's a physics of particles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.143,
    "end": 3271.585,
    "text": "Anything that exists will have characteristic features that do not change over time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3272.659,
    "end": 3274.261,
    "text": " This is like measure theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.281,
    "end": 3278.405,
    "text": "It's like, if it's not there through time, it doesn't exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.565,
    "end": 3281.769,
    "text": "Like the reason why there isn't, it's kind of like material costs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3281.789,
    "end": 3285.473,
    "text": "Like if there isn't a cow in my room, it's just not there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3285.493,
    "end": 3287.895,
    "text": "If something doesn't persist, it's not there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3288.854,
    "end": 3295.557,
    "text": " Formally, we express this by assuming that the system is a random dynamical system in non-equilibrium steady state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3296.117,
    "end": 3303.981,
    "text": "So the equilibrium, the total heat death equilibrium steady state of air molecules in the room would be dispersed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3304.941,
    "end": 3308.983,
    "text": " to homogeneity with some summary statistic, like the well-mixedness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3309.503,
    "end": 3317.466,
    "text": "But if it's not at equilibrium to the well-mixedness, physically or kind of informationally, then it's in a non-equilibrium steady state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3317.907,
    "end": 3329.852,
    "text": "The steady state part is because it's existing through time, like the length of your arm, but then the non-equilibrium part is reflecting that the arm is an organization beyond just dissipating air molecules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3330.632,
    "end": 3344.364,
    "text": " So when you have a non-equilibrium steady state like an arm that's persisting despite being disordered surrounding, this means that the system is exchanging with its environment and its dynamics can be described in terms of its Ness probability density, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.384,
    "end": 3348.307,
    "text": "a probability density that does not change during the time over which the system is said to exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3349.068,
    "end": 3355.955,
    "text": " So over the second to the second timescale, there's a constant measurement on the length of the arm and through time, it could be modeled as something changing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3356.435,
    "end": 3366.304,
    "text": "But in all those cases, it's like definitely not just something that's, there's something different about what that system is doing informationally relative to other systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3367.065,
    "end": 3369.628,
    "text": "Okay, and then the third kind of quote section here is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3371.297,
    "end": 3380.679,
    "text": " Such a system has a random attractor, which can be thought of in two ways, or another way to say that would be you can think about systems as having a random attractor, which then has multiple downstream consequences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3381.439,
    "end": 3385.42,
    "text": "First, it can be considered as a trajectory of systemic states that evolve through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3386.34,
    "end": 3392.582,
    "text": "So then, in this sense, the system will, after sufficient time, revisit particular regions of a state space, the attracting set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3393.002,
    "end": 3396.803,
    "text": "So we've talked on the Actim stream before about returning to a desired body temperature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3397.623,
    "end": 3403.488,
    "text": " So it's not that your body returns to the state that it was as a body a week ago, a year ago, 10 years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3404.229,
    "end": 3425.186,
    "text": "It's that on that one dimension, with respect to the modeling of the signal and noise of body temperature through time, because you're staying warmer than the background for a persistent amount of time in a way that defies the otherwise dissolving forces of thermodynamics, you can model that like it's doing some sort of strange attractor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.124,
    "end": 3427.125,
    "text": " That's what that part is saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3427.765,
    "end": 3437.57,
    "text": "And then the second part is that you can think about that as not just, you can take a trajectory view, like a single path through that state space, temperature going up in the morning or down in the morning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3438.07,
    "end": 3442.713,
    "text": "But the other way is like when you have a million paths, an infinite number of paths, it's like a density.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3443.413,
    "end": 3445.154,
    "text": "And in fact, it's a flow density.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3445.234,
    "end": 3450.537,
    "text": "So it's like one traffic you're driving, that's like one car, but then there's the traffic flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3451.497,
    "end": 3466.388,
    "text": " And so when you switch from a particle modeling to a flow modeling, there's a lot of, it's kind of like discrete versus continuous time, but it's a spatial analog, whether you go particular, like an electron is a particle, electron is a wave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3467.129,
    "end": 3468.47,
    "text": "How do you make that distinction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3468.49,
    "end": 3476.656,
    "text": "And so these are all kind of related topics, but that's what is under the scope of the pulling back to thinking this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3479.218,
    "end": 3479.578,
    "text": "Anything else?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3481.141,
    "end": 3482.302,
    "text": " All right, 27.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3483.923,
    "end": 3491.85,
    "text": "The fact that internal states are conditionally independent of external states, given blanket states, allows us to disentangle systems dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3492.01,
    "end": 3502.659,
    "text": "So now we're going to talk about the interfaces between those active interesting systems and their otherwise disordering environments, relatively speaking, or whatever the other side of the interface is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3505.149,
    "end": 3525.994,
    "text": " other words we can write down separate equations of motions for the internal states and active states that only depend on the blanket states so there's a couple things happening here we're going from this active agent model through pearl's work building on bayesian statistics and markov blankets talked about other places other people can have a lot more to say on that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3527.19,
    "end": 3535.135,
    "text": " adding as per Mel Andrews's paper, the innovation of Friston, which is the partitioning of blanket states into sensory and action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3535.755,
    "end": 3539.538,
    "text": "So sensory as being defined as inbound and active as being defined as outbound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.038,
    "end": 3547.122,
    "text": "And then we're gonna take this sort of like equations of motion, trajectory flow remix,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3548.503,
    "end": 3557.588,
    "text": " and think about that kind of a physical depiction of a system with the partitioning between now two flows, like a highway with two directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.581,
    "end": 3561.102,
    "text": " So here was just like landscape flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3561.202,
    "end": 3564.104,
    "text": "Like the elevation is a flow in one way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3564.564,
    "end": 3567.305,
    "text": "It's kind of just its own flow, the water flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.385,
    "end": 3570.247,
    "text": "But then here we're gonna have two directions in a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.407,
    "end": 3574.309,
    "text": "It's not just up and downhill, but it's like there's a sense flow and an action flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3574.329,
    "end": 3577.49,
    "text": "So there's information coming in that might have an asymmetry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3577.951,
    "end": 3582.033,
    "text": "And then there might be like a totally disjoint kind of asymmetry with respect to action going out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.573,
    "end": 3584.474,
    "text": "So if a robot has a photon sensor,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3585.174,
    "end": 3587.074,
    "text": " And then it has a physical actuator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3587.775,
    "end": 3592.136,
    "text": "This is going to allow a total obvious, really simple partitioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.176,
    "end": 3597.017,
    "text": "Yeah, photon come in, actuator go out, generative model, internal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3597.617,
    "end": 3600.138,
    "text": "Maybe I know that fully like a state machine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3600.698,
    "end": 3602.958,
    "text": "Maybe I'm modeling it like the intentional stance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3603.599,
    "end": 3608.68,
    "text": "But by partitioning into sensory input and then the motor, the behavioral, the experimental output,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3609.557,
    "end": 3635.45,
    "text": " we're going to be able to kind of like tidy our thought around interfacing with active systems and even inactive systems and then formally that's defined as um being a flow so that's this f is going to be a function of policy which is like the agents you know it is the policy of your arm to be the length it is just like it's the policy of someone to wear the clothes that they wear and then it's going to be over um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3636.738,
    "end": 3656.347,
    "text": " there's going to be this is not from the same paper but formally there are ways to define these different states and partition them and it's an area of active research and discussion which formalisms apply over which scope and how well all of these innovations of first ones line up with all the other thoughts in the area anything on markov blankets or this kind of partitioning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.223,
    "end": 3665.326,
    "text": " So something I've been thinking about like while you've been talking and just a metaphor that keeps popping up for me is like a ski resort, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3665.366,
    "end": 3675.63,
    "text": "Like we have the input information coming in and like, depending on your policy, you might select like a black diamond or a blue diamond or a bunny hill, like slope and the flow of people going out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3675.67,
    "end": 3684.594,
    "text": "And then there's like the people that like a high level of surprisal that like want to ski back country and like possibly hit a tree or like there's all of this, like, you know, all of these options.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3685.134,
    "end": 3688.101,
    "text": " That's kind of how it's been coming together in my brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3688.908,
    "end": 3689.128,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3689.448,
    "end": 3699.814,
    "text": "The ski slope, people have different affordances, different preferences, different risk tolerances, different inclination for nostalgia of a simple one versus the thrill of a new one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3699.854,
    "end": 3703.176,
    "text": "It's like, these are all, it's kind of like what Ryan Smith has been talked about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3703.196,
    "end": 3708.679,
    "text": "Like these are above level of just one repeated task that two people could perform and up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3708.739,
    "end": 3710.0,
    "text": "There's a difference in how they performed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3710.58,
    "end": 3714.243,
    "text": "We're looking at something that's actually internal about those higher order properties.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3714.783,
    "end": 3714.963,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3716.533,
    "end": 3720.416,
    "text": " Here is where we go from the flow state across an interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3720.596,
    "end": 3725.28,
    "text": "So we have this bi-directional freeway with the flow that's partitioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3725.3,
    "end": 3736.528,
    "text": "So we got like signal processing dynamics on the inbound and all the Bayesian statistics that kind of interfaces with all the cybernetics and the policy selection, and then output is behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.889,
    "end": 3740.311,
    "text": "So that's the bi-directional flow across an interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3741.973,
    "end": 3742.453,
    "text": "We can...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3744.748,
    "end": 3748.81,
    "text": " Okay, let's read this quote and then unpack these equations and read them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3749.51,
    "end": 3761.455,
    "text": "If the probability distribution Q of mu, Q sub mu, is sufficiently similar to the actual conditional distribution P of, I think it might be eta, but I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3761.475,
    "end": 3768.077,
    "text": "It looks like an N. We call it N. Curly N given pi policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3768.397,
    "end": 3771.799,
    "text": "So P of the actual, we'll just call it actual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3771.819,
    "end": 3772.579,
    "text": "Yeah, actual distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3774.854,
    "end": 3797.047,
    "text": " fancy one so if the probability distribution you know q of fancy n is sufficiently similar to the actual conditional distribution p of n given policy so states given policy how things will turn out given how i act over external states how will the external states be given my investing strategy what will stimuli will i see on my website in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3797.947,
    "end": 3820.082,
    "text": " under different policy assumptions um then we can approximate that flow so if you're treading water some motor pattern is being enacted that's resulting in treading water it's not accidental so that is self-organization in a dissipating environment and so it's as if a system that's treading water is able to approximate the flow of the actual states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3820.862,
    "end": 3843.351,
    "text": " informationally it can stay above water informationally so it has to be doing something like swimming equivalently we can say that the gradient flow of autonomous states can be considered as a gradient flow on variational free energy so now we move from the sort of general computational phrasing or physical computational phrasing of gradient flows into",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3844.58,
    "end": 3860.38,
    "text": " gradient flows being related to this variational free energy estimate which it turns out is going to allow um very easy like tractable optimization based upon minimizing variational free energy so the phrasing of a gradient flow",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3861.221,
    "end": 3886.468,
    "text": " was sort of neutral with respect to what you did with it now by porting the gradient flow into gradients of variational free energy it opens up a domain of optimization which is based upon variational base and variational free energy and just to skip to this bottom line um the variational free energy so this thing that it looks as if it's optimizing with respect to policy big f of pi um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3887.834,
    "end": 3910.274,
    "text": " uh is just equal and it throws out approximations coefficients it's just like you got to work through it and there's probably a lot of ways to do it but um this free energy value like on policy is related to this expectation of this fancy j which are we do we have that in a later slide",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3911.454,
    "end": 3937.734,
    "text": " um of basically yeah it's the it is um the self-surprise i think we have in a later slide so um it's the expectation of how surprised you are given about your policies given the states so that's like how surprised are you about where you are that's why it's about yourself surprise about policy given state estimates that value plus",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3938.936,
    "end": 3947.365,
    "text": " the divergence, which is like a KL divergence, between the state estimate versus the actual flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3948.106,
    "end": 3959.438,
    "text": "And there's probably a lot to say about these kinds of information theoretic divergences, but it turns out that that is gonna be greater than or equal to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3960.439,
    "end": 3962.802,
    "text": " how surprised you are on policy itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3963.143,
    "end": 3970.412,
    "text": "So almost reading it backwards, it's like how surprised you are to find yourself doing a policy, which is not just an instantaneous action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.432,
    "end": 3972.294,
    "text": "A policy is the trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3972.955,
    "end": 3975.639,
    "text": "Like, I can't believe I'm the kind of person who's on the top of Mount Everest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3976.22,
    "end": 3976.98,
    "text": "That is tied up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3978.132,
    "end": 3987.503,
    "text": " If you've been like, you know, a 700 pound person down to your couch at one point in your life, like, I can't believe I'm on top of Mount Everest would be kind of like, I've taken a policy that I've ran every day and hiked all this stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3987.563,
    "end": 3988.585,
    "text": "And now I'm on Mount Everest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3988.925,
    "end": 3989.185,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3989.345,
    "end": 3989.806,
    "text": "So, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3989.926,
    "end": 3996.714,
    "text": "So what we really want to know is given a optimistic self.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3997.535,
    "end": 4026.695,
    "text": " identity a persisting self-identity now some people get hung up on that they're like what if my self-identity is negative well it'd be equivalent to um the heart or lungs stopping existing it'd be then you wouldn't see that system treading water and that's why it's tragic when it does happen so we want to think about how surprised are individuals with respect to policy this doesn't tell you how to know what to expect or what policies are possible but this is how surprised one is about their own policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4027.635,
    "end": 4053.158,
    "text": " is going to be approximated with an expectation so it's tractable of surprisal of policy given states which is much easier to calculate much easier to say how surprised am i about um how much i've been investing given how much i have rather than computing the total space of everything that could happen which is infinite plus just the details of how far off you are so if you're on the ball then this divergence term is low",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4054.164,
    "end": 4073.591,
    "text": " and then your the variational free energy is like kind of closer to the idealized minimal surprise and this is something that one does want minimal surprise on because in a dissipating world you get the disorder for free and so this is something that's actually being like asymptotically converged towards",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4076.294,
    "end": 4079.797,
    "text": " So something we should maybe clarify.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4079.817,
    "end": 4084.8,
    "text": "In the paper, I think that the authors use self-information or surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4084.82,
    "end": 4087.462,
    "text": "They don't really talk about self-surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4088.243,
    "end": 4096.288,
    "text": "And this is kind of like we're conflating now with last week's paper about who is creating the model of the self?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4096.348,
    "end": 4100.932,
    "text": "When you have a self-model, who is exactly constructing that self-model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4100.992,
    "end": 4105.055,
    "text": "And I think in terms of this, it's like surprisal over policy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4105.959,
    "end": 4115.96,
    "text": " okay but like in relation to your model of yourself or i think your model of yourself is part of like your generative model overall yeah maybe yeah interesting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4116.943,
    "end": 4117.984,
    "text": " Cool, let's go to 29.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4118.384,
    "end": 4141.725,
    "text": "All right, so this was... So after thinking about this landscape of flows being operationalized as a variational free energy landscape that we're going to be able to do some kinds of operations on, now there can be sort of dimension play",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4142.768,
    "end": 4166.303,
    "text": " with mapping states from this is something I would like to ask the authors about is like which connecting which manifolds to which manifolds matter what's the hookup we need which ones are the FEP providing us with because in this quote they connect it to the information geometry and geometry is just the shape of things so it's kind of like the shape of that information landscape",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4167.028,
    "end": 4174.971,
    "text": " You can think about the physical landscape, or you can say the flow on that landscape of the water if the water fell on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4175.551,
    "end": 4178.072,
    "text": "And so it's kind of like, okay, information geometry is one thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4178.732,
    "end": 4184.114,
    "text": "And then this is partitioning with an information geometry angle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4185.862,
    "end": 4190.206,
    "text": " according to this Markov blanket active inference partitioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4191.067,
    "end": 4194.03,
    "text": "So the quote says at the end blue, you can give any thought on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4194.37,
    "end": 4198.273,
    "text": "Conversely, on this extrinsic manifold, so viewed from the outside,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4199.451,
    "end": 4203.634,
    "text": " The internal states minimize variational free energy when conditioned on the blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4204.134,
    "end": 4219.825,
    "text": "In other words, whenever the blanket states change, that could be sense or action, the expected internal state changes and there is movement on the extrinsic manifold that by construction, so is this how things are or how we're constructing them, can be cast as Bayesian belief updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4220.385,
    "end": 4225.468,
    "text": "This is because the expected internal state encodes probabilistic, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4225.508,
    "end": 4227.21,
    "text": "Bayesian beliefs about external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4227.85,
    "end": 4228.771,
    "text": "They act as if,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4229.491,
    "end": 4236.141,
    "text": " There's an internal state that's encoding and representing, or at least acting as if it encoded or represented actions about external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4236.702,
    "end": 4243.392,
    "text": "The blanket states here can be construed as the sensory impressions of the external states on the market blanket that contain the internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4244.491,
    "end": 4260.1,
    "text": " In short, it may be more useful to consider the system from the point of view of the extrinsic information geometry, the probabilities encoded by internal states like neural firing patterns going out, rather than from the point of view of the intrinsic information geometry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4260.541,
    "end": 4266.824,
    "text": "In other words, the statistical complexity of the neural dynamics considered alone might be misleading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4267.305,
    "end": 4271.047,
    "text": "We might want to actually highlight the neural dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4271.627,
    "end": 4296.401,
    "text": " projected onto a manifold of action or with respect to external states because we don't just want that raw time series like doing bitcoin analysis we want to know how that is associated with other patterns in a way that would suggest that it's acting purely responsibly or proactively or in some way that we're going to talk about how you could describe the complexity of it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.428,
    "end": 4302.609,
    "text": " I don't really have anything to add.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4302.849,
    "end": 4305.091,
    "text": "I thought, but I just was looking back through the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4305.171,
    "end": 4317.7,
    "text": "I had thought that it was, you know, mapping from one, the manifold of the internal geometry or like there was a geometry created that was over the whole internal states versus the external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4317.76,
    "end": 4319.922,
    "text": "And it was that mapping that mattered, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4320.885,
    "end": 4323.066,
    "text": " But yeah, I'm curious to revisit that now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4323.486,
    "end": 4330.169,
    "text": "So we have a question in the chat, and someone asks, can you say a few words about the islands of awareness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4330.549,
    "end": 4334.45,
    "text": "So that's like with the sensory input is disconnected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4335.031,
    "end": 4339.512,
    "text": "Can you say a few words about islands of awareness and their relationship to the equations you're explaining?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4340.473,
    "end": 4347.556,
    "text": "So on this Markov blanket model on 27, if the sensory input were damped,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4348.607,
    "end": 4377.444,
    "text": " that would be the islands of awareness model so if nothing else active inference as a process theory that is consistent with the free energy principle is helping us functionally operationally however you want to think about it get at this island of awareness problem so instead of just saying imagine that there was very low or minimal input or no input of sensory state or imagine that somebody could get sensory state but couldn't act or imagine the only sense they could get was hearing and then the only action they could have is this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4378.817,
    "end": 4387.861,
    "text": " this is a way that we can think about totally separating the sort of north and southbound traffic with the active and the sensory states being partitioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4388.302,
    "end": 4389.782,
    "text": "That's the Friston innovation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4390.563,
    "end": 4394.985,
    "text": "And so the island of awareness was from the non-FEP people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4395.645,
    "end": 4397.386,
    "text": "It's probably from a different area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.147,
    "end": 4404.65,
    "text": "And so to kind of latch onto that key topic that's being more broadly discussed,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4405.615,
    "end": 4410.218,
    "text": " this paper is saying, actually, like, here's the immediate value add of FEP and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4410.698,
    "end": 4416.842,
    "text": "We can actually subsume the debate around islands of awareness, which is something you all already agreed was an important question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4417.522,
    "end": 4420.604,
    "text": "And then we actually have our own way of thinking about islands of awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4421.064,
    "end": 4430.95,
    "text": "So maybe if that's a question you care about, maybe this is a good way that you would want to study it because it led us to these interesting conclusions about islands of awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4431.931,
    "end": 4433.432,
    "text": "Okay, so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4436.01,
    "end": 4451.069,
    "text": " Okay, so this is unpacking a little bit more about that big F of pi with expectation of the surprise of policy given states plus the divergence of the actual and the estimated states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4451.649,
    "end": 4453.171,
    "text": "So we can look at the quotation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4453.832,
    "end": 4461.0,
    "text": " Here, the divergence between the estimated and actual states describes the statistical complexity of the internal model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.44,
    "end": 4465.544,
    "text": "How much do I have to change my mind to accommodate current changes in sensory signals?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.165,
    "end": 4475.374,
    "text": "So with respect to state estimates about how bright it is, it's like about whether you estimate it to be bright and it is or it isn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.674,
    "end": 4486.305,
    "text": " Whereas this other term, the negative expectation of how surprised one is on the policy given the states, describes the accuracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.106,
    "end": 4489.889,
    "text": "And then this is a parenthetical describing why it's negative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4490.469,
    "end": 4493.453,
    "text": "So minimizing this entails minimizing the difference between these two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4494.554,
    "end": 4496.616,
    "text": "So it's accuracy and accuracy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4497.754,
    "end": 4518.196,
    "text": " model complexity and then it's just you depending on how you have the negatives and the positives you get good points for being accurate but it's a monotonic penalty to be more complex so always better to fit better always better to be simpler and those two lines always intersect",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4518.897,
    "end": 4529.325,
    "text": " because you can always have a simpler model that does worse, and you can always have a more complex model that does better, if only because it explains some little random feature of the error signal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4530.046,
    "end": 4534.79,
    "text": "So this is not about how the world is, this is about statistical partitionings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4535.33,
    "end": 4539.753,
    "text": "Like a principal component analysis, the principal components are guaranteed to be orthogonal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4540.194,
    "end": 4547.54,
    "text": "Well, there's certain assumptions that get built into here that we don't have to over-interpret with respect to how reality actually is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4549.975,
    "end": 4564.151,
    "text": " note that the accuracy depends on the particular states so the states of the particle the pi the total states now actually confusingly i wonder if this is referring to blanket and internal states instead of policy as usually we use pi to mean",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4565.237,
    "end": 4566.539,
    "text": " I had that same question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4566.559,
    "end": 4568.061,
    "text": "Oh, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4568.861,
    "end": 4570.443,
    "text": "Written on my paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4570.764,
    "end": 4573.867,
    "text": "Yeah, because, yeah, that's our little icon with the policy pie.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4574.268,
    "end": 4575.149,
    "text": "But this one's cool too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4575.189,
    "end": 4578.413,
    "text": "I like the blanket and internal states, but yeah, maybe it could be clarified.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4579.534,
    "end": 4580.716,
    "text": "And which one is in here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.076,
    "end": 4581.296,
    "text": "Because...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4582.077,
    "end": 4587.038,
    "text": " Are we thinking about the minimization on policy alone or on the entire thing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4587.478,
    "end": 4589.459,
    "text": "So let's make sure we're clear on that one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4589.959,
    "end": 4602.081,
    "text": "During a period of partial disconnection from blanket states, such as dreaming, that's the islands of awareness, the variational free energy gradient in the following equation will mainly be driven by the complexity part, which does not depend on the blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.842,
    "end": 4608.323,
    "text": "So we have the bidirectional traffic and the flow, and then we're disconnecting sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4609.523,
    "end": 4622.111,
    "text": " so now it's like the system is just emitting so to speak flow but that is being driven by the um uh divergence term rather than this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4623.822,
    "end": 4625.623,
    "text": " including the internal state policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4626.163,
    "end": 4628.144,
    "text": "We'll figure it out, but this part drops away.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4628.785,
    "end": 4636.909,
    "text": "So then, because it's not conditioned on these blanket states, it's only conditioned on the internal model and the actual model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4637.429,
    "end": 4642.111,
    "text": "So this D term is only conditioned on internal and actual states, and this one also includes blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4644.412,
    "end": 4646.954,
    "text": "So you can then do some...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4648.388,
    "end": 4672.325,
    "text": " good factorization or mathematics and then the conclusion of that at least um or the form of this equation entails that neural processes can perform the computations required to minimize free energy even when the coupling with the environment is suspended it's like you unplug the computer or something and then it's like it stops but then could you seize sensory input for the brain in a way that actually um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4674.585,
    "end": 4702.954,
    "text": " let the brain reveal a different stream of output that would reflect in complex internal dynamics now how will we measure it we'll get to in a second but the idea would be that we could use sleep and dreaming as a model i don't know and think about how the fep could be applied to these islands of awareness and we come to this same result isolated systems will minimize free energy by reducing the complexity of the generative model blue i knew i knew you thought that was interesting what did you like about that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4705.201,
    "end": 4714.304,
    "text": " So I specifically liked the fact that they said, like, when you're sleeping, there's no accuracy, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4714.324,
    "end": 4721.606,
    "text": "Or like in some island of awareness type of state, you don't have any accuracy because you don't have any sensory input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4722.006,
    "end": 4738.759,
    "text": " And so when in these situations that then you minimize free energy by reducing the complexity of the generative model, I think that that's cool because sleep, just from a neuroscience perspective, background, is really thought to integrate and solidify your experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4739.359,
    "end": 4756.429,
    "text": " shuffle things from short-term memory into long-term memory if like they're you know necessary like if it was like a peak emotional experience it'll be like cemented forever but all these things happen like during the sleep phase so it's literally like reducing complexity of the neural correlates of consciousness also which i think is interesting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4757.338,
    "end": 4759.04,
    "text": " Yep, very nicely said.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4759.26,
    "end": 4771.49,
    "text": "Like when you're getting sensory data in, there's an imperative to make it match, like to predict what the next word is so that your world doesn't seem like this like blur of just things that are uncertain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4772.071,
    "end": 4778.876,
    "text": "But then when you disconnect the sense, the only imperative, the only reason that was getting complexity pushed up was the need to fit data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4779.637,
    "end": 4802.246,
    "text": " when you don't need to fit the data there can be this radical scaling back in the complexity of the bottle so it's kind of like play or learning or higher dimensional existence or lower dimensional pretty interesting okay so 31. um this is going to be a connection now from that variational free energy landscape to computational research and optimization and machine learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4803.746,
    "end": 4804.546,
    "text": " they're gonna reveal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4805.386,
    "end": 4814.749,
    "text": "Variational free energy minimization in machine learning was predicated on minimizing algorithmic or computational complexity, which is the basis of universal computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4816.869,
    "end": 4822.091,
    "text": "People can read the citation and have their own thoughts on what it means to be universal or be a computer, but there's the citation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4823.251,
    "end": 4824.451,
    "text": "Here's pretty interesting part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.292,
    "end": 4826.532,
    "text": "Consciousness researchers assume",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4827.847,
    "end": 4830.148,
    "text": " Maybe, unsighted, who does, maybe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4830.769,
    "end": 4841.815,
    "text": "But one could assume complexity has to be large, computational complexity has to be large, yet the imperatives for universal computation in general and the free energy principle in particular say exactly the opposite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4842.735,
    "end": 4847.758,
    "text": "So are we looking for at the simple rules end or at the complex outcomes end?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4848.339,
    "end": 4850.32,
    "text": "This apparent paradox can be resolved easily",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4851.769,
    "end": 4862.095,
    "text": " by noting that free energy is a bound on marginal likelihood, AKA model evidence in the same way that the LZ, which we're gonna get to in a second, complexity is an upper bound on algorithmic complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4863.041,
    "end": 4869.947,
    "text": " So they're like, it's not enough to just look at how surprised you are by individual neural states because the brain is never going to repeat an exact state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4870.327,
    "end": 4874.191,
    "text": "So you're going to be infinitely surprised if you use parametric statistics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4874.851,
    "end": 4889.765,
    "text": "You need to actually have a type of statistical inference based upon the dynamics of the trajectories and interpreting them on a flow landscape of information geometry rather than just being infinitely surprised by the specific measurements you get.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4890.973,
    "end": 4906.802,
    "text": " And then they basically write that to kind of speak to the islands of awareness idea, it's no surprise then to see that a good model of a complex world will show a high degree of algorithmic or statistical complexity even when observed in temporary isolation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4907.363,
    "end": 4910.845,
    "text": "So this is saying, okay, you unplug the computer, it's gonna radically simplify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4911.365,
    "end": 4915.668,
    "text": "If it was a Bitcoin node, it's disconnected from the internet, it's gonna simplify its processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.368,
    "end": 4920.25,
    "text": " but there might be another kind of system that has a high degree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4920.99,
    "end": 4926.173,
    "text": "Take your empirical question, what high degree or shouldn't they be simpler or wouldn't it simplify it once it's isolated?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4927.074,
    "end": 4932.417,
    "text": "But that's the kind of interesting behavior we would expect or be predicting to see from an isolated system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4933.51,
    "end": 4946.445,
    "text": " And just my question for the author was, what does it mean that the free energy is bounding the model evidence in the same way that this information measure, which we're going to get to, of complexity is an upper bound on algorithmic complexity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4946.465,
    "end": 4948.867,
    "text": "I was just very curious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4948.907,
    "end": 4950.91,
    "text": "It's a lot of things I've only heard a little bit about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4950.93,
    "end": 4952.752,
    "text": "So it's just very interesting to think about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4952.792,
    "end": 4953.873,
    "text": "What did this make you think about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4956.37,
    "end": 4961.274,
    "text": " Well, so I think I put what I thought about this in a few slides away from now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4961.735,
    "end": 4963.296,
    "text": "We'll loop back into that, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4963.376,
    "end": 4963.636,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4963.676,
    "end": 4966.478,
    "text": "So then we're like, okay, what is this LZ complexity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4966.498,
    "end": 4972.483,
    "text": "Because Blue and I both love complexity and met while we were studying complexity a few years ago.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4972.583,
    "end": 4974.485,
    "text": "So we were both excited with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4975.085,
    "end": 4979.669,
    "text": "And this Lempel-Ziv complexity measure was our statistic, however you want to think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4980.389,
    "end": 4987.835,
    "text": " was first presented in the article on the complexity of finite sequences in 1976 by two Israeli computer scientists, Lemple and Zipf.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4988.396,
    "end": 4995.461,
    "text": "This complexity measure is related to the Kolmogorov complexity, but the only, and that's, so then another one would be the Shannon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4995.561,
    "end": 4997.623,
    "text": "So Shannon is like the surprise with the coin flip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4997.763,
    "end": 5001.766,
    "text": "Kolmogorov is like the algorithmic complexity, usually described as that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5002.487,
    "end": 5007.07,
    "text": "But the only function that the LZ is going to use is the recursive copy, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5007.09,
    "end": 5007.871,
    "text": "the shallow copy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5009.639,
    "end": 5015.844,
    "text": " The LZ complexity can be used to measure the repetitiveness of binary sequences in text like song, lyrics, or prose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.544,
    "end": 5021.108,
    "text": "Fractal dimension estimates of real-world data have also been shown to correlate with LZ complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5021.869,
    "end": 5026.972,
    "text": "So it's interesting because learning about it on the wiki page, this is apparently the whole algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5027.493,
    "end": 5033.558,
    "text": "It's kind of just like looking for repeating blocks, blocks with prefixes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5034.58,
    "end": 5059.935,
    "text": " and pointers it's a compression technique so if it was something where if your file was one two three four five you'd imagine that it would take a i i don't even want to say too much because i don't even know what would have a higher low lz complexity i'd like to ask but just like something could be easily zipped or not some things are going to be amenable amenable to lz complexity measures being high or low so that was just my main question is how do we go from this algorithm to like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5060.782,
    "end": 5078.437,
    "text": " conscious systems or to measuring real comparing real systems just pretty interesting not sure what to think about that but also really looking forward to the um everyone's perspective in like 16.1 and 2 because it was out of i didn't expect this to come into play as it cool to learn about what do you think about it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5079.378,
    "end": 5088.84,
    "text": " So I looked up like the LZ complexity versus like the Kolmogorov complexity where the Kolmogorov complexity is like total randomness, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5089.06,
    "end": 5092.72,
    "text": "Like 3.14159, like that's like a totally like Kolmogorov complexity to the max.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5093.22,
    "end": 5100.182,
    "text": "But this LZ complexity I think is related to like repetitiveness and sequences and how much they're repeated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5100.802,
    "end": 5104.883,
    "text": "So it's different than the just totally randomness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5105.543,
    "end": 5107.203,
    "text": "I guess that was like my guess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5107.463,
    "end": 5109.424,
    "text": " glint of what I read from that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5109.624,
    "end": 5123.629,
    "text": "So yeah, if something was just 10 of the same version, you know, transpose on or something concatenated 10 times, you could define it by defining the unit and then 10 pointers, you wouldn't need 100 data points, you need 10 plus 10 pointers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5123.669,
    "end": 5128.371,
    "text": "So like, for example, that would be something compressible related to LZ.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5128.871,
    "end": 5134.513,
    "text": "But let's take a step back and ask, okay, even beyond the measure of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5136.121,
    "end": 5137.744,
    "text": " complexity or the entropy measure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5137.804,
    "end": 5144.216,
    "text": "I mean, let's learn and find out what all those are, but what is dynamical complexity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5145.183,
    "end": 5154.01,
    "text": " And this is really related to complex adaptive systems and a lot of the more like non-free energy principle complexity research that we've been learning about blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5154.591,
    "end": 5157.493,
    "text": "So what is it rather than how it can be measured?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5157.613,
    "end": 5158.994,
    "text": "Now, we're not going to fall into a realist trap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5159.014,
    "end": 5165.74,
    "text": "We're not going to say systems are this way, but we're thinking about the kinds of complexity that could be dynamically instantiated and measured.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5166.441,
    "end": 5167.982,
    "text": "And this is a paper from...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5169.656,
    "end": 5172.818,
    "text": " first in 2019, A, not B, which was the particular physics one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5173.678,
    "end": 5183.683,
    "text": "And in dynamical systems theory, so this is drawing from even before complexity in some ways, like systems theory, three types of complex behavior can be distinguished.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5184.143,
    "end": 5186.364,
    "text": "So this is not feedback loops and stuff like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5186.484,
    "end": 5190.626,
    "text": "Those are the mechanisms by which we're gonna be tracking one particle in the space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5190.646,
    "end": 5193.828,
    "text": "So we've got the particle, the one ping pong ball in the airflow,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5194.468,
    "end": 5195.989,
    "text": " That's the particle trajectory model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5196.289,
    "end": 5200.672,
    "text": "And then we have the flow, which is the air that the ping pong ball is being spun around in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5201.932,
    "end": 5207.756,
    "text": "In that sort of vector flow trajectory world, sometimes we see chaotic itinerancy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5208.756,
    "end": 5214.92,
    "text": "So that's like when you have two pieces of wood in the stream, and if it's a lowly operative exponent, they go together for a long time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5215.02,
    "end": 5219.883,
    "text": "If there's a lot of chaoticness, then high chaotic divergence, they diverge rapidly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5220.865,
    "end": 5222.306,
    "text": " hetero clinic cycling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5222.346,
    "end": 5231.649,
    "text": "So this is like cycling with, so repeating to come back to some places, but often with a twist and then switching under multi-stability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5231.689,
    "end": 5236.41,
    "text": "So like you can be like, your brain can be like in a sleep mode and then it can go into the waking mode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5237.131,
    "end": 5243.493,
    "text": "And so, yes, there is a gray zone, but you tend to see like phasic or categorical transitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5243.533,
    "end": 5246.614,
    "text": "So complex systems do that kind of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5247.054,
    "end": 5253.318,
    "text": " Sometimes they're wild and chaotic itinerancy and wacky, and then they can also cycle and also they can switch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5253.398,
    "end": 5255.959,
    "text": "And sometimes we can even uncouple those ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5255.999,
    "end": 5261.662,
    "text": "Like something could switch and the switching could reflect it turning on or off chaotic itinerancy or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5262.082,
    "end": 5266.805,
    "text": "So, and then I just copied out the definitions from the chapter in the Friston book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5267.185,
    "end": 5267.946,
    "text": "What do you think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5267.966,
    "end": 5270.107,
    "text": "Or what did that make you think about with respect to complexity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5272.182,
    "end": 5282.011,
    "text": " Just like the dynamical complexity versus like, you know, what's happening in a computer is like just how things change really over time, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5282.071,
    "end": 5293.882,
    "text": "So in a dynamical system is a system that's changing, not like how complex is this number that is pi or, you know, 1.0000, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5293.962,
    "end": 5296.644,
    "text": "So it's just that basic difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5298.663,
    "end": 5298.903,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5299.864,
    "end": 5304.427,
    "text": "Okay, let's return to the kind of free energy perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5304.787,
    "end": 5310.051,
    "text": "Again, thinking about the dynamical complexity, but we want to be thinking about the complexity of these dynamical systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5311.292,
    "end": 5322.62,
    "text": "So this is because the computations performed by a system that minimizes variational free energy and inferences, which correspond to movements on the system's extrinsic statistical manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5323.3,
    "end": 5336.405,
    "text": " Existing measures of dynamical complexity, however, do not measure complexity in terms of probabilities encoded by neural activity, but in terms of statistical properties of neural activity, that is, properties of the intrinsic statistical manifold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5336.965,
    "end": 5343.907,
    "text": "Hence, dynamical complexity, at least measured by existing approaches, should be associated with NCCs, at least from the point of view of the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5344.187,
    "end": 5350.67,
    "text": "So this is to their point that we want to move from thinking about neural states to neural trajectories and flows",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5351.73,
    "end": 5358.056,
    "text": " is otherwise we don't get access to this kind of a dynamical complexity measure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5358.797,
    "end": 5363.241,
    "text": "Because if we just think in terms of snapshot states, we're going to think Shannon entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5363.581,
    "end": 5368.105,
    "text": "How surprised am I by this neuron being lit instead of unlit at this time slice?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5368.686,
    "end": 5376.233,
    "text": "Whereas in the flow model, we can think about the dynamics of trajectories through really high dimensional state spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5377.759,
    "end": 5379.961,
    "text": " And that's where FEP suggests an alternative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5380.101,
    "end": 5388.066,
    "text": "An FEP-inspired measure of dynamical complexity would be based on the information length of neurally encoded probability distributions, i.e.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5388.086,
    "end": 5392.949,
    "text": "Bayesian beliefs, instead of considering the statistical properties of a neural time series as such.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5393.069,
    "end": 5394.29,
    "text": "So that's kind of what I just mentioned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5394.31,
    "end": 5396.812,
    "text": "All right, conscious activity and complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5397.272,
    "end": 5398.653,
    "text": "Lou, what would you say about this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5400.126,
    "end": 5407.572,
    "text": " So this goes back to the LV complexity, really, and also the Kolmogorov complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5407.652,
    "end": 5409.413,
    "text": "But I'll just read this quote from the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5409.473,
    "end": 5417.279,
    "text": "So it says, to the extent that proposed measures of dynamical complexity have empirical validity as measure of consciousness, which is like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5417.959,
    "end": 5418.86,
    "text": " What is consciousness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5419.001,
    "end": 5419.802,
    "text": "What are we measuring?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5419.822,
    "end": 5422.125,
    "text": "How do we just know if it's valid?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5422.165,
    "end": 5422.485,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5422.585,
    "end": 5425.148,
    "text": "All those things are packed into that sentence for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5425.429,
    "end": 5436.382,
    "text": "They may be regarded as empirically adequate, but it would still be desirable to provide a fundamental justification because this could further support their application to controversial cases like islands of awareness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5437.023,
    "end": 5443.932,
    "text": " In addition, it could help resolve an uncertainty about whether existing measures of dynamic complexity also track algorithmic complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5444.272,
    "end": 5456.307,
    "text": "So we know that LZ complexity is not the same as Kolmogorov complexity because it just takes in the repeats, but it doesn't take in all of the different ways that Kolmogorov complexity works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5456.807,
    "end": 5457.127,
    "text": " does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5457.548,
    "end": 5463.232,
    "text": "So here it says it's well known that LZ complexity, for instance, constitutes an upper bound on algorithmic complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5463.652,
    "end": 5474.1,
    "text": "However, this entertains the possibility that conscious activity maximizes LZ complexity and related measures of dynamic complexity, but it minimizes algorithmic complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5474.56,
    "end": 5478.224,
    "text": " This hypothesis is stated, and there's a citation, Ruffini, 2017.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5478.905,
    "end": 5487.435,
    "text": "Finally, developing a measure of dynamical complexity within the FEP could help by providing a computational explanation of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5487.956,
    "end": 5490.298,
    "text": "So I think that that's a really cool idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5491.079,
    "end": 5493.681,
    "text": " thing that the authors have brought back around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5493.761,
    "end": 5503.829,
    "text": "Like, can we put dynamic complexity in the FEP framework and thereby, you know, put a computational explanation of consciousness forward?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5504.109,
    "end": 5505.09,
    "text": "I think that's really awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5505.43,
    "end": 5506.21,
    "text": "Great points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5507.225,
    "end": 5527.334,
    "text": " okay let's talk a little bit more about a formalism that people love and also just an interesting um i think question about realism and instrumentalism and also just how we think about the definitions of which things are contingent on which so here they're going to write a further assumption we shall make is that the system possesses a markov blanket so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5528.214,
    "end": 5550.523,
    "text": " the language of whether it possesses or is um or there just is one and then the system is a secondary description and it describes a little bit more about the blanket and so this was kind of related to earlier but we didn't need this level of depth and it talks about where it's drawn on in terms of developing on pearl and the directed acyclic graphs and generalizations from there",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5551.383,
    "end": 5556.245,
    "text": " But then here what matters is that the existence of a Markov blanket has subtle profound implications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5556.865,
    "end": 5559.326,
    "text": "So is that the Markov blanket exists in the world?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5559.546,
    "end": 5564.847,
    "text": "Or is it that the implications of us modeling with a Markov blanket have profound implications?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5565.288,
    "end": 5577.932,
    "text": "So how do we think about whether we're describing how the systems are versus being clear when we think that it's actually not how things are or where they might be congruent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5578.692,
    "end": 5590.499,
    "text": " And so is it, how do we know, and this is related to a general question that people has, how do we pull out these Markov blankets from the empirical data and relate it to the analytical concept?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5590.539,
    "end": 5593.481,
    "text": "So again, another slide just from Mel Andrews' paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5594.561,
    "end": 5609.976,
    "text": " uh discussion where we talked about the development of the markov blanket topic from markov's initial framing in analytical mathematics and matrix mathematics to pearl's extension into bayesian statistics and graph theory computational approaches",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5610.777,
    "end": 5631.481,
    "text": " and then where fristen has developed it over the decades and collaborators and then what is now being um done and learned about with respect to this the post markov blanket whatever it's wanting to be called any markov thoughts yep no cool",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5633.052,
    "end": 5655.983,
    "text": " um this is related to one of the global challenges that were addressed which is that mapping where does consciousness come into play it's like whoa okay all of this flow and the information theory and the geometry but how are we going to connect this back to the consciousness question and relating anything about the system to the actual um question of what is conscious or not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5657.063,
    "end": 5686.069,
    "text": " and so this is the one quote that i want to highlight on 39 is being conscious versus just simulating it and so they um write a system with an unequal room steady state and a markov blanket comprises internal external and blanket states as shown in section 3 such a system can also be described as performing certain computations inferences by virtue of causal relations between internal external and blanket states that is what we were measuring those relation dynamical contingencies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5686.909,
    "end": 5691.633,
    "text": " in the equations we talked about by virtue of the causal relations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5691.853,
    "end": 5693.775,
    "text": "This is different for a mirror simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5694.516,
    "end": 5701.241,
    "text": "To be sure, a simulating system can perform the same computations, and it will perform them because of causal relations between its parts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5701.441,
    "end": 5705.124,
    "text": "So it is true that the A matrix and the B matrix get multiplied together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5706.354,
    "end": 5707.035,
    "text": " in the program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5707.595,
    "end": 5712.481,
    "text": "However, it will not perform them because of causal relations between its internal external blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5713.061,
    "end": 5723.793,
    "text": "The simulation may instantiate a virtual machine, which may have internal external blanket states such that its internal states encode a probability distribution over external states given blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5724.634,
    "end": 5732.12,
    "text": " But the internal states of the virtual machine will not be the internal states of the physical machine on which the virtual machine is running.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5733.041,
    "end": 5737.785,
    "text": "So this is getting into the total virtualization, simulation, everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5737.865,
    "end": 5750.996,
    "text": "And we're not going to read this dialogue, but on 40, it's a section from a conversation about this topic in the book, The Mind's Eye, which is compiled by Hofstetter and Dennett.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5751.716,
    "end": 5754.458,
    "text": " And just, it's about, you're simulating a hurricane.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5755.338,
    "end": 5758.16,
    "text": "And, oh, well, programmers aren't claiming the simulation is a hurricane.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5758.28,
    "end": 5760.681,
    "text": "It's just simulating parts of a hurricane.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5760.721,
    "end": 5761.982,
    "text": "Buildings don't get wet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5763.042,
    "end": 5765.164,
    "text": "And then you have to look at it the right way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5765.544,
    "end": 5767.585,
    "text": "Well, what do you mean look at it the right way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5767.605,
    "end": 5768.826,
    "text": "You know, what is getting wet?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5769.046,
    "end": 5769.986,
    "text": "It's your perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5770.006,
    "end": 5772.588,
    "text": "It just, it's a big area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5772.648,
    "end": 5775.83,
    "text": "So it's fun because it's something that, you know, we're all just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5776.747,
    "end": 5797.245,
    "text": " learning about and again no one has a great measuring device so it's not like we can resolve these debates there's not like an open and shut answer so that's what's so interesting it's like there might be a hot take or a quote you like or something that's inspiring to you about whether computers are conscious or not but in the end it's almost like it's a bottomless pit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5798.2,
    "end": 5801.621,
    "text": " So that's why it's good that the authors are actually starting to build bridges across it, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5802.322,
    "end": 5806.803,
    "text": "All right, and then a last one slide on reservoir computing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5806.843,
    "end": 5808.464,
    "text": "This was suggested by Sarah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5809.664,
    "end": 5818.548,
    "text": "She was bringing up reservoir computing and researching maybe things that we'll hear about in the coming months, like about how it might relate to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5819.308,
    "end": 5826.791,
    "text": "Reservoir computing is a framework for computation that is sort of generalizing or building upon a neural network model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5827.771,
    "end": 5843.31,
    "text": " and it's mapping the inputs not just to a fixed array of nodes or even multiple layers like a deep neural network or something but the way that these nodes internal to the system the reservoir they can actually be any system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5844.446,
    "end": 5847.127,
    "text": " So that could be various types of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5847.487,
    "end": 5851.228,
    "text": "Could be a slowly changing or a fast changing system or a system with a lot of other structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5851.948,
    "end": 5857.79,
    "text": "And so just, we don't have answers to this, but bringing up just reservoir computing, Sarah had some thoughts on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5857.83,
    "end": 5866.272,
    "text": "So we'll look forward to hearing about this and about the niche as a reservoir and computation as happening and where's that put computationalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5866.912,
    "end": 5868.993,
    "text": "Any thoughts on that before we go to our last bit?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5869.773,
    "end": 5891.749,
    "text": " nice yeah chill and these were just some things we brought up but you know people will bring up their own in 16.1 uh and anyone else can bring up uh anything they want us to put on the screen for the author and others but there's so much to think about with this paper they concluded just by writing that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5892.896,
    "end": 5910.484,
    "text": " um how can research on neural correlates of consciousness lead to an explanation of consciousness and what role could free energy principle play in this endeavor we have suggested that research on neural correlates should be complemented by research on computational correlates of consciousness in order to yield a computational explanation of consciousness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5911.064,
    "end": 5922.179,
    "text": " Moreover, according to free energy principle, neural correlates of consciousness must be defined in terms of neural dynamics, not states, and CCCs should be defined in terms of probabilities encoded by the neural states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5923.993,
    "end": 5945.96,
    "text": " specific claims for those to engage with a lot of um footholds and challenging walls to climb by interesting topics a lot of um things that understanding could enable and we're talking about consciousness and neuroscience so everything is kind of adjacent to it any closing thoughts blue on this very nice discussion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5947.066,
    "end": 5948.829,
    "text": " No, thank you so much for having me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5948.889,
    "end": 5950.371,
    "text": "It's been fun participating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5950.511,
    "end": 5951.692,
    "text": "Yep, that was great times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5951.733,
    "end": 5958.201,
    "text": "Thanks so much for joining because it makes it a lot more interesting to make and to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5958.442,
    "end": 5963.228,
    "text": "So we hope to see people in 16.1 and beyond.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5963.248,
    "end": 5964.37,
    "text": "Other than that,",
    "speaker": "SPEAKER_00"
  }
]