[
  {
    "start": 7.622,
    "end": 10.606,
    "text": " Hello and welcome to the Active Inference live stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 11.126,
    "end": 14.03,
    "text": "Today it is Active Inference live stream 16.2 on February 23rd, 2021.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 19.244,
    "end": 21.465,
    "text": " Welcome to the Active Inference Lab, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 22.045,
    "end": 28.108,
    "text": "We're a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 28.648,
    "end": 34.911,
    "text": "You can find us on our website, Twitter, email, YouTube, Discord, KeyBase teams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 35.712,
    "end": 41.935,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so that we can be improving on our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 43.004,
    "end": 45.366,
    "text": " All backgrounds and perspectives are welcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 46.047,
    "end": 56.338,
    "text": "And as far as the netiquette, the video etiquette for the live streams, we'll be muting, raising our hand, writing down our points, using respectful speech behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 57.776,
    "end": 68.524,
    "text": " Today in 16.2, at the end of February, we are having a follow-up discussion on the paper of Wanja Wiese and Carl Fristen, Neural Correlates of Consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 69.004,
    "end": 75.369,
    "text": "And last week, it was really special to have Wanja come on the stream and quite interesting stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 76.089,
    "end": 84.596,
    "text": "And next week, we're going to be having our first-ever quarterly roundtable, which will be providing some updates on the different projects of the Active Inference Lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 85.669,
    "end": 93.556,
    "text": " Also, as far as upcoming streams and events, we have a new, I guess, series called the guest stream.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 93.836,
    "end": 97.098,
    "text": "So this is the live stream, which is the participatory group discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.599,
    "end": 102.743,
    "text": "We have the model stream, which is the walkthrough or a tutorial of a more technical piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.163,
    "end": 109.188,
    "text": "And then the guest stream is going to be kind of like anything goes, just anytime somebody has a new paper out,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 110.129,
    "end": 115.556,
    "text": " or they want to be raising some topic to visibility, we want to be there for them and help them on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 115.676,
    "end": 122.864,
    "text": "So tomorrow, we're going to be having Majid Beni speak on his recent paper, A Critical Analysis of Markovian Monism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 122.985,
    "end": 128.491,
    "text": "And then in March and in May, we'll have guest visits from Dimitris Bolas and Anna Siayunica.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 129.372,
    "end": 140.795,
    "text": " And if you have a suggestion for any of these other events, or you want to be featured on an event, or you'd like to co-organize an event with us, then all you have to do is let us know and we go from there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 142.025,
    "end": 148.35,
    "text": " Today in ActiveStream 16.2, the goal is to learn, discuss, and hear from everybody.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.911,
    "end": 169.568,
    "text": "And just knowing Dave and Adam, I think we'll be able to have a really awesome discussion where we are going to bring up a lot of fun ideas, centering and strangely attracting back to this paper, the neural correlates of consciousness under the free energy principle from computational correlates to computational explanation from Visa and Friston in 2020.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 171.169,
    "end": 179.713,
    "text": " So today, with a small group and a follow-up discussion, there's a bunch of slides from last time that we can definitely go to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 179.753,
    "end": 180.854,
    "text": "There's also the paper itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 181.374,
    "end": 183.815,
    "text": "But let's just start with an introduction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 184.415,
    "end": 187.317,
    "text": "So we're going to go around and introduce ourselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.897,
    "end": 197.942,
    "text": "And again, seeing as just Dave, Adam, and I are here, we can each introduce ourselves and maybe provide a little context on some of these warm-up questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 198.402,
    "end": 202.143,
    "text": " So whichever of you two would like to go first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 203.663,
    "end": 211.726,
    "text": "We can still utilize hand raising or perhaps it'll be a little easier to just have it like a regular tripartite conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 211.846,
    "end": 215.367,
    "text": "So we'll go with Dave and then Adam on the introduction and on the context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 215.447,
    "end": 215.667,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 217.307,
    "end": 223.929,
    "text": "Okay, I'm gathering up some reference material from a number of different ontologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 225.307,
    "end": 234.068,
    "text": " in order to get those aligned with the topics for the edu project i'm also going through a great big brain dump from uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 235.038,
    "end": 246.407,
    "text": " the most noted neuropsychoanalyst in South Africa who has gotten two papers and a book out just in the last two weeks, and I'm struggling through those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.047,
    "end": 258.916,
    "text": "He has rewritten the Project for a Scientific Psychology by Sigmund Freud from 1895 in absolutely state-of-the-art Carl Fristin",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 260.282,
    "end": 261.003,
    "text": " terminology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.143,
    "end": 267.165,
    "text": "The only thing he doesn't hammer on a lot is specifically active inference, but all the other cool stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.225,
    "end": 268.846,
    "text": "And it's just a brain breaker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 269.586,
    "end": 270.026,
    "text": "Who is this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 272.147,
    "end": 273.147,
    "text": "Thanks for the update.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 273.787,
    "end": 279.55,
    "text": "So we'll post any links and we'll try to keep it on the discussion that people are here to be listening about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.75,
    "end": 282.311,
    "text": "So if you have any other thoughts, Dave, otherwise, Adam, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 285.132,
    "end": 285.432,
    "text": "Hi.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 285.452,
    "end": 287.733,
    "text": "So I guess...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 289.4,
    "end": 289.78,
    "text": " I'm Adam.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 290.18,
    "end": 297.044,
    "text": "Uh, like an introduction or just what I'm working on or just how, um, say, you know, say hello.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 297.104,
    "end": 299.205,
    "text": "We can just ask how, how did we come to be here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 299.425,
    "end": 304.728,
    "text": "How did we follow up, fall into a followup discussion on a computational consciousness paper?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 306.088,
    "end": 306.389,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 306.429,
    "end": 316.514,
    "text": "So, um, I guess I have been, uh, working for some time to try to understand, uh, what the heck consciousness is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 316.534,
    "end": 318.975,
    "text": "Uh, if that question even makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 319.722,
    "end": 329.885,
    "text": " uh, from different perspectives where the free energy principle and active inference, um, has in general been, I guess the overarching view from which I'm attempting to think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 330.646,
    "end": 335.868,
    "text": "And so I've been following what different people are saying, proposing some ideas of my own.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 336.328,
    "end": 349.092,
    "text": "Um, and, uh, just, uh, along these lines of learning about active inference, I found like the live streams and what Daniel's doing and the, the discussions slash, uh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 350.572,
    "end": 379.032,
    "text": " potential movements that he's creating and um this is just one of the most uh interesting conversations around as far as I'm concerned thanks Adam also Dave I have a question I know you have a lot of background in classical cybernetics if it could be called that so how does cybernetics deal with this question of Consciousness or what have been some of the long-running threads as far as the way cyberneticians pre-active inference have been thinking about this question",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 381.701,
    "end": 388.304,
    "text": " Well, Gregory Bateson did a lot of work on this in the 40s through the 60s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.485,
    "end": 404.23,
    "text": "Working as a therapist and as an anthropologist, he paid a lot of attention to how people get fouled up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 405.53,
    "end": 410.212,
    "text": "He uses a term of schizogenesis, that is the origins of splits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 411.383,
    "end": 413.825,
    "text": " Sometimes it's a sort of a good thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.885,
    "end": 417.227,
    "text": "It's a way that a society can become more differentiated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.907,
    "end": 421.29,
    "text": "But in a child, it's a great danger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.31,
    "end": 434.098,
    "text": "The child, for instance, the thesis, which turns out not to be all that useful, is that small children are constantly misunderstanding what their parents are saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.138,
    "end": 437.3,
    "text": "The parents are not addressing them very effectively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 437.38,
    "end": 438.421,
    "text": "They're assuming the kid's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 439.068,
    "end": 448.497,
    "text": " either have less intense emotions than they do, or that the kids understand more about the world of shared reality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 448.897,
    "end": 457.686,
    "text": "So the kid will get flustered, demoralized, alienated, and in the best case, there's a reconciliation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 458.206,
    "end": 460.929,
    "text": "And the mother, typically, and the baby...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.385,
    "end": 463.346,
    "text": " will get back in sync.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 463.386,
    "end": 465.286,
    "text": "They're now happy with one another.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.526,
    "end": 479.19,
    "text": "But sometimes the split gets worse and worse, and those same combination of rage and demoralization plays out into adulthood and too often as parents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 481.57,
    "end": 487.732,
    "text": "And Bateson draws a lot on Bertrand Russell's theory of types.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 489.768,
    "end": 507.974,
    "text": " So he analyzes society's interactions, roles, with a very elaborate treatment of hierarchies of meaning, hierarchies of reference, hierarchies of control and communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.434,
    "end": 515.516,
    "text": "So it loops right back to the old definition of the study of communication and control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.536,
    "end": 518.517,
    "text": "Now, my teacher, Gordon Pask,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.056,
    "end": 526.301,
    "text": " put a great deal of emphasis on two areas that I don't see addressed adequately today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 527.121,
    "end": 536.167,
    "text": "On the one hand, the inevitability of dialogue or conversation in any conscious occasion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.727,
    "end": 539.709,
    "text": "He says there's no consciousness without dialogue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 541.07,
    "end": 546.674,
    "text": "Second point, there's no consciousness, in fact, no concept without emotion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.487,
    "end": 553.41,
    "text": " And third, there's no persistent concept without circular causation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 554.791,
    "end": 566.318,
    "text": "And we know how important circular causation is in explaining how the Markov bounded system and its environment co-create.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 567.559,
    "end": 577.986,
    "text": "And Stuart Kaufman does a lot of discussion of co-creation between the niche and the worker, that is, the organism, the society.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.519,
    "end": 582.702,
    "text": " the person, the evolving language, culture, whatever it might be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.243,
    "end": 596.933,
    "text": "So it's not that these concepts are completely missing, but they're not as articulated as they were even in the 1970s when PASC was developing the first really effective teaching learning systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 598.052,
    "end": 612.06,
    "text": " With tiny, clunky computers that were half made up of cards that the students had to be prompted to pick up a cardboard card and put it on the display because there was no way to display text.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.88,
    "end": 618.043,
    "text": "You had the light little lights and that would be labeled A1, which means go grab card A1 and read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 619.582,
    "end": 649.122,
    "text": " cool it's like now in some ways sounds like playing Battleship with your computer um but what what you said there about the multiple like perspectives in pursuing this Consciousness question there's the anthropologists studying humans there's the therapist who might be interested in social systems more generally but they're in a very specific relationship and they might not be trying to do a full ethnography or an anthropology research project the therapist relationship is one that's based upon",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 649.902,
    "end": 651.023,
    "text": " it's more medical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.163,
    "end": 653.224,
    "text": "It's based upon helping reduce someone's suffering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.704,
    "end": 663.129,
    "text": "And then even zooming out further and further away from the experience, there's the biologist who might compare human society or behavior with other animals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 663.309,
    "end": 669.973,
    "text": "And then even a systems researcher that might even go beyond the biological and ask about where computers fit into all this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 670.393,
    "end": 675.135,
    "text": "And so it's like in the center, we have our own experience and the experience of other people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 675.556,
    "end": 677.377,
    "text": "And that is what is negotiated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 678.217,
    "end": 692.771,
    "text": " in that sort of kernel of the therapy relationship or in the dialogue, which can be therapeutic even if someone's not licensed, but then we're going in these concentric shells out towards broader systems thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 693.171,
    "end": 699.697,
    "text": "So I think that is what I liked and remembered about the paper, and one of the things that motivates me to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 700.638,
    "end": 723.731,
    "text": " think about it go down different rabbit holes and hear from people's perspectives on it because there isn't a priori a best approach and even within an approach or one of those concentric spheres it's not like there's one way to do biology or one way to do anthropology one way to do therapy so how are we going to make adequate guidance and navigation for the bigger system when",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.671,
    "end": 742.374,
    "text": " if we just get lost in all the possible ways it could go then we are going to be doing a lot of moving words around but maybe not a lot of useful actions so looking forward to hearing about that and then also what you said about the different developmental phases having different cybernetic or communication needs",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 743.095,
    "end": 759.919,
    "text": " So cybernetic principles like having requisite variety or good regulator, whether we want to use the classical cybernetic terminology or just thinking about communicating systems, different developmental stages are able to deal with different stresses and are able to achieve different goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 760.459,
    "end": 772.162,
    "text": "And so there might be some things that are overwhelming for a child, but then maybe later on, we hope that that information could be integrated or virtualized or emulated or somehow used in a controllable way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 774.326,
    "end": 776.992,
    "text": " Any other just off the top of the head thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 777.052,
    "end": 782.985,
    "text": "Because I think we'll actually have a lot of great discussion stemming from just walking through some of these slides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 783.105,
    "end": 783.546,
    "text": "Is that cool?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 784.855,
    "end": 809.574,
    "text": " right nice um so just to recap maybe those who have listened to the dot zero and dot one conversations or not but the paper that we're following up on today is called the neural correlates of consciousness under the free energy principle from computational quotes to computational explanation and the aims and the claims of the paper were to integrate the neural correlates of consciousness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 810.652,
    "end": 825.448,
    "text": " with the computational correlates of consciousness and implicitly also the behavioral correlates of consciousness bcc if we could use that and then think about how free energy principle and active inference are going to be integrating these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 826.269,
    "end": 830.914,
    "text": " We went through the abstract and the roadmap last time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 831.694,
    "end": 839.782,
    "text": "So today we're going to just start off by looking at some of the questions that people had raised in 16.1, which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 841.604,
    "end": 847.346,
    "text": " We've now separated out into different slides and added CC images in the background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 847.906,
    "end": 853.648,
    "text": "So if anyone in the live chat is just wanting to post a question or something comes to mind, we're definitely open.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 854.168,
    "end": 861.41,
    "text": "Otherwise, we'll just slowly march through these fun slides and then hopefully get to look at some of the paper as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 862.17,
    "end": 875.834,
    "text": " So the first question and the one that Blue sort of brought back to the table in 16.1 and helped integrate into the construction of 16.0 is how do we define and measure consciousness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 876.414,
    "end": 883.657,
    "text": "So it's related to what is consciousness, but we're almost approaching it instrumentally instead of what is it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.877,
    "end": 886.398,
    "text": " Which is the realism question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 886.739,
    "end": 888.48,
    "text": "We're going to take the instrumentalist approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 888.78,
    "end": 893.523,
    "text": "How do we operationally define it and how do we measure it or what are we measuring?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 893.944,
    "end": 901.429,
    "text": "Because if you're discussing what something is or isn't without the instruments in mind, how you're actually going to be measuring it or observing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.861,
    "end": 905.042,
    "text": " What is it going to be there for?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 905.822,
    "end": 921.405,
    "text": "So we had a few different terms that people brought up, but either of you would be welcome to give a thought or Adam, I'd be curious just from, yeah, you can speak and I'll ask you a question too is in your approach to studying consciousness, what measurements do you think are the most important?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 921.565,
    "end": 929.027,
    "text": "Whether they're data sets we already have or whether it's a kind of data that doesn't quite exist yet, but what measurement would be the most informative for you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 931.368,
    "end": 932.348,
    "text": "Oh, so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 934.448,
    "end": 936.229,
    "text": " This is, oh, can you hear me?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 936.69,
    "end": 936.85,
    "text": "Yep.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 937.691,
    "end": 937.971,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 938.752,
    "end": 942.935,
    "text": "Microsoft says my microphone is noisy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 943.475,
    "end": 947.879,
    "text": "Sometimes just the little background sounds, but it doesn't sound noisy to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.919,
    "end": 949.42,
    "text": "So I would let people know if it did.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.52,
    "end": 949.761,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.642,
    "end": 963.552,
    "text": "So I guess the approach I'm trying to do is factorize as much as I can consciousness into different senses of the word and then try to bring those in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 964.411,
    "end": 966.372,
    "text": " relation to each other in some coherent way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 967.512,
    "end": 976.994,
    "text": "And so I might think of consciousness in terms of a set of concentric circles which might be approached differently at each level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 977.634,
    "end": 991.397,
    "text": "So maybe like the innermost core shell we might have, the innermost core, you might have some kind of proto-creature consciousness, we might not even want to use the word, some sort of organismic modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 993.086,
    "end": 996.51,
    "text": " whether or not we talk about this in terms of consciousness could be a matter of debate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 997.071,
    "end": 1011.048,
    "text": "And then at some point we get to this, like the appearance of a world to a creature, subjectivity, what it is likeness, qualia, phenomenality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1012.646,
    "end": 1024.97,
    "text": " There's, um, I haven't heard like a definition that really satisfies people universally and they all sound very vague, but just the, you know, the lights coming on what it is like, uh, to be us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1025.79,
    "end": 1030.212,
    "text": "Um, but then you get into this, what is likeness and then there's all the particular ways of what it is like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1030.832,
    "end": 1037.174,
    "text": "And now the actual stream of experience is shaped by in different ways and has certain other properties.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1037.194,
    "end": 1039.075,
    "text": "So you might get into like access consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1039.701,
    "end": 1044.765,
    "text": " So this would be like net blocks, distinction between phenomenal consciousness or your experience itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1045.346,
    "end": 1048.369,
    "text": "And this would be where a framework like integrated information theory would come in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1049.73,
    "end": 1062.961,
    "text": "Or you might have then another level of complexity, access consciousness, or the ability to manipulate on the objects of experience in your mind and report on them to have knowledge of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1063.762,
    "end": 1066.645,
    "text": "But then it's like we're still somewhat vague in terms of...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1067.455,
    "end": 1079.702,
    "text": " what we mean by, um, uh, knowledge of like what, how much knowledge, what kind of, and so you might have even more complex vacations, things like self-consciousness, like, uh, auto noetic or reflexive consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1080.422,
    "end": 1086.225,
    "text": "And, um, it's there, there might not be like any bound in terms of the complex vacation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1086.805,
    "end": 1089.007,
    "text": "And so at each level, you might have a different handling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1089.607,
    "end": 1095.07,
    "text": "And as you go like out at the outer shells, it seems like they blend themselves",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1095.794,
    "end": 1099.456,
    "text": " best to operationalization and experimentation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1100.156,
    "end": 1104.939,
    "text": "Or it's, you know, you can actually do tasks like, did you pass the mirror test?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1104.999,
    "end": 1107.96,
    "text": "Even though there's people debate about what that means.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1108.0,
    "end": 1110.742,
    "text": "Like, do you have certain, can you report?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1110.802,
    "end": 1112.102,
    "text": "What's the nature of the reports?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1112.122,
    "end": 1117.665,
    "text": "How sophisticated are they as you're dealing with the more complex varieties of conscious experience?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1118.365,
    "end": 1121.467,
    "text": "So that's very straightforwardly lends itself to empiricism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1122.199,
    "end": 1141.785,
    "text": " As you start to go into, like, I guess the phenomenality itself, to the degree that we want to hold to this distinction between phenomenal access consciousness or different kinds, and I personally make use of it, but once you get to experience itself, you have the problem of the first person versus third person ontology, the privateness of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1142.345,
    "end": 1149.527,
    "text": "It's like you can make inferences about different systems based on their properties and what you think is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1150.78,
    "end": 1158.886,
    "text": " helpful for realizing what might allow a world to appear to a certain type of system, which you can't know because consciousness is private.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1159.246,
    "end": 1161.228,
    "text": "You can only come at it indirectly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1161.368,
    "end": 1176.018,
    "text": "And so it's, there's things like no report paradigms that people have worked with, things like, you know, are there coherent, like most recently a paper just came out looking for basically neural dynamics and are they responsive in a certain way that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1176.771,
    "end": 1181.873,
    "text": " suggests a sensitivity and a knowledge, but still it's an indirect inference and it's a problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1181.893,
    "end": 1189.035,
    "text": "It seems like we always have to go through, usually, by some degree of directness, report and to get it experienced.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1189.835,
    "end": 1200.038,
    "text": "So to actually, where the rubber hits the road of the initial emergence of a world appearing to a system, it's, as far as I'm concerned, really super fraught.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1200.458,
    "end": 1205.98,
    "text": "And so my best attempt has been to try to basically cross-reference as many perspectives as possible",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1206.598,
    "end": 1228.064,
    "text": " and try to basically line up all three of Marian levels to the extent I can of functional, algorithmic, and implementation level, cross-reference this with phenomenality, and then try to say, okay, what types of computational principles, what types of algorithms might help to create a world that could appear to a system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1228.864,
    "end": 1233.125,
    "text": "And I've heard your thoughts on that, but I can...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1235.287,
    "end": 1252.66,
    "text": " now and keep talking about it thanks for this um this idea of cross-referencing doing the scholarship and really being up to date with what people are actually asking and the ways that they're really investigating it and then looking for some underlying or some inner",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.641,
    "end": 1269.193,
    "text": " generative processes, it's very similar to what is being done in Wanja's previous work on the minimum unifying models, which is like, could we find a cluster of attributes that seem to be co-extant, like they're existing together?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1269.654,
    "end": 1271.955,
    "text": "And then could there be some minimal underlying",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1273.716,
    "end": 1277.318,
    "text": " speculated model that would lead to those clusters of traits?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1277.698,
    "end": 1283.242,
    "text": "And then would that help us design better experiments, reduce our uncertainty about how to act?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.882,
    "end": 1288.666,
    "text": "And then the other part that I would just ask about is like, you know, we hear a lot about first person, that's the eye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1289.106,
    "end": 1294.129,
    "text": "And then we hear a lot about third person, like third person, bird's eye view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1294.77,
    "end": 1302.755,
    "text": "But then I'm wondering about the second person, because that's actually where Dave's questions about the no consciousness without dialogue or without,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1303.555,
    "end": 1315.619,
    "text": " interchange of information, as well as Vygotsky and even Demetrius Bolas's and Schilbach's work on becoming who we are through interaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1315.679,
    "end": 1324.462,
    "text": "So it's just like, will we be able to localize it in the brain or in the brain body or in the brain body niche, in the social niche?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.002,
    "end": 1330.464,
    "text": "Because if it turns out that it's something that's distributed a little bit beyond the cranium,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.164,
    "end": 1332.745,
    "text": " then maybe neural measurements matter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1332.885,
    "end": 1338.868,
    "text": "Maybe button tapping can matter, just like you could have one thermometer and make an assessment about a broader area.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1339.329,
    "end": 1343.491,
    "text": "But we shouldn't confuse the map and the territory or the measurements and the territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1343.891,
    "end": 1349.615,
    "text": "If we think it's relational, then any kind of objective measurement is only ever going to tell a partial picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1350.195,
    "end": 1351.836,
    "text": "What do you think about that, Dave?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1351.856,
    "end": 1353.517,
    "text": "Or how does the second person come into play?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1359.031,
    "end": 1363.315,
    "text": " I don't think I can advance the discussion right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1364.115,
    "end": 1365.116,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1365.416,
    "end": 1366.237,
    "text": "All good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1366.337,
    "end": 1366.697,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1366.757,
    "end": 1367.358,
    "text": "Go ahead, Adam.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1368.759,
    "end": 1379.107,
    "text": "Um, so I think in terms of like the relate, so I've tended to, um, in terms of like degrees of, I guess, internalism versus externalism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1379.928,
    "end": 1387.754,
    "text": "Um, I tended to, I guess, separate out consciousness or experience from",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1388.579,
    "end": 1417.716,
    "text": " uh mind or intelligence or modeling where i think like the relevant um generative modeling for intelligence or mind would indeed be distributed and extended and would spill out beyond and exist between agents um i've tended to reserve um thinking of like a subset of these generative processes a subset of generative modeling um as being kind of stuck in the cranium of the generation of consciousness itself",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1419.859,
    "end": 1446.498,
    "text": " And even more, I've tended to actually restrict it to even not the full, I wouldn't draw the boundary or the Markov blanket across the whole nervous system, but actually within the scope of these sort of metastable synchronous complexes, which through their synchrony would entail, I guess, message passing and the calculation of a joint estimate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1447.543,
    "end": 1454.067,
    "text": " over the entire sensorium of the agent of its embodied, embedded interaction with the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1454.928,
    "end": 1474.2,
    "text": "And so for me, this would be like a, not even like the whole, when these estimates are being generated, when these metastable states are forming, you could think of them as a kind of non-equilibrium steady state that there would be a general boundary around them that wouldn't include the whole nervous system in on the act.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1475.287,
    "end": 1502.174,
    "text": " And, but in terms of like practically what would, so, so in terms of like, so in terms of like the onion of consciousness, in terms of like the kind of consciousnesses that we have, the exact nature of our streams of experience, our self-consciousness and, you know, our autobiographical, you know, auto and allobiographical consciousness, that would definitely be relational.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1502.694,
    "end": 1503.755,
    "text": "That would definitely be,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1507.664,
    "end": 1524.627,
    "text": " even if the generative pulses for the qualia might not be, and then they might be confined in the skull, the processes whereby you would come to model yourself in a world and we would be able to coordinate and just live, that would definitely be relational.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1525.667,
    "end": 1535.509,
    "text": "But I'm wondering whether the initial generation of phenomenality itself, while practically requiring, at least for mammals and birds, most of them,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1536.104,
    "end": 1552.627,
    "text": " this communication, this relationality, sometimes even maybe like a bootstrapping or a back and forth between perspectives, between a second person point of view and a first person to actually like you figure it, figuring out like, who am I by figuring out that through interaction?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1552.647,
    "end": 1553.247,
    "text": "Like, who are you?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1553.387,
    "end": 1553.807,
    "text": "Who am I?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1553.887,
    "end": 1554.967,
    "text": "Who am I in relation to you?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1555.427,
    "end": 1557.468,
    "text": "And this is how you bootstrap the whole thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1558.128,
    "end": 1564.509,
    "text": "And also just practically like, I think you're later going to have like Anna on and like this perspective of like inherent interdependence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1565.029,
    "end": 1565.769,
    "text": "You're not going to even be,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1566.678,
    "end": 1568.979,
    "text": " homeostatic at all without the relationality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1569.539,
    "end": 1574.381,
    "text": "And so like the first priors, the exact nature of your consciousness, deeply interdependent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1574.941,
    "end": 1594.669,
    "text": "That being said, I wonder whether you can have systems that are never in relation to any other system except for the world itself, and that they come to model, and that if they have the right architecture, that this could entail an integrated world model, which",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1595.191,
    "end": 1597.416,
    "text": " would there be something that's like to be such a system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1597.977,
    "end": 1604.11,
    "text": "I don't know where this begins and ends, but I have speculations, but those are some thoughts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1605.256,
    "end": 1609.558,
    "text": " It's definitely clarifying where you're coming from with the integrated world modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1609.698,
    "end": 1617.463,
    "text": "It's almost like if you could have a program on a computer that you could know what was getting passed into the program.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1617.863,
    "end": 1624.486,
    "text": "So you could say, yes, when I hit run, this program is going to start from nothing or from the kernel that I've specified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1625.047,
    "end": 1632.371,
    "text": "And then if it ends up doing this autopoiesis or self-reflection and then can do things like the mirror test or...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.251,
    "end": 1652.585,
    "text": " responding in a way that is akin to a person then at least from a computational perspective it's exhibiting some of these important features or attributes now you're still going to have people who deny consciousness or think everything has it so for me the question will",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1653.405,
    "end": 1680.774,
    "text": " eternally be open because there's going to be people who say it's all just an illusion or it's not real even for humans and there's other people say well you just don't understand the electron consciousness so you know there's no point in even you know trying to falsify that so it's going to remain an open distribution but we may be able to focus on some of these interesting differences between ourselves and the computational system it's like a little model system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1681.8,
    "end": 1689.302,
    "text": " It's not the same thing as us, but let's return to this computational question because I think it's related to the next question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1690.123,
    "end": 1699.286,
    "text": "With a JPEG of a hand reaching out to the sky, how do we relate experience or phenomenology",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1700.31,
    "end": 1704.891,
    "text": " to neural, computational, and I'll add behavioral dimensions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1705.631,
    "end": 1712.812,
    "text": "So how do we connect seemingly, it's like a marketplace of two different types.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1713.092,
    "end": 1725.454,
    "text": "You got the soda machine that transforms the dollars into the soda cans, but how are we going to go back and forth from a behavioral observation to phenomenology to computational?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1726.054,
    "end": 1729.235,
    "text": "I think this is just, it's definitely an open question",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.875,
    "end": 1751.014,
    "text": " like these are just starting point discussions because they're not resolved questions i would say people barely even know what the structure of a resolution would look like but it has related to this question we just asked which is for a virtual machine or for any type of system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1752.438,
    "end": 1755.959,
    "text": " for it to interface out to the outside world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1756.159,
    "end": 1764.321,
    "text": "So in active inference, we call that action states, whether it's typing or your voice box, or whether it's your eye movements, it's an active state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1765.082,
    "end": 1767.082,
    "text": "It's part of the blanket states with sense and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1767.722,
    "end": 1773.104,
    "text": "So however you come to know about a system through the action and sensory states,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1774.335,
    "end": 1777.159,
    "text": " you're not going to have access to those internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1777.799,
    "end": 1782.826,
    "text": "And then it's almost like, even if you knew what those internal states were, it wouldn't always clarify the situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1783.286,
    "end": 1791.456,
    "text": "So how do we think about this connection or the interface between systems of different kinds, virtual machines or,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1792.694,
    "end": 1810.179,
    "text": " seemingly conscious systems how do those link to the outside world and how do we talk about that rigorously and then i believe it was um cambridge breaths last time who just at the end brought up this question about quantum and classical computation it's not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.263,
    "end": 1825.603,
    "text": " something I know a ton about, but it's interesting to think about whether the sort of Turing computation, zero one von Neumann architecture, just what people think of when they hear a computer, just like this laptop in front of me,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1826.906,
    "end": 1830.749,
    "text": " how is that part of a broader perspective on computation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1831.189,
    "end": 1840.256,
    "text": "Especially when we're thinking about computational dimensions, like we're not just thinking about Windows 10, we're thinking maybe about unconventional computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1840.336,
    "end": 1845.179,
    "text": "So these were just some questions that people addressed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1845.219,
    "end": 1848.362,
    "text": "If anyone has a thought, they can go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.442,
    "end": 1850.543,
    "text": "Otherwise we can just keep on walking through it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1850.563,
    "end": 1851.044,
    "text": "Yep, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1851.064,
    "end": 1853.646,
    "text": "So I guess,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1854.83,
    "end": 1883.439,
    "text": " I might start with neural behavioral in terms of like in the systems where I think I have some understanding and then move into more general like types of computational systems that could potentially realize things similarly, whether we're talking about like a von Neumann architecture or like the blockhead experiment with the nation of China or like eusocial insect colonies or",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1886.31,
    "end": 1887.11,
    "text": " any kind of system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1887.47,
    "end": 1914.158,
    "text": "But starting from, I guess, where we have maybe the most purchase, it would seem to me that experience would correspond to, potentially, or try to identify a neurocomputational object of a joint marginal distribution from a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1914.636,
    "end": 1922.74,
    "text": " probabilistic world model, which was basically the sensorium of the organism as it is coupling with the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1923.861,
    "end": 1943.17,
    "text": "And so for me, it would be basically an estimation of a visuospatial field, which would connect to like Rudroff's work with the projected conscious modeling, a point of view, but also the feeling of having a body, the live body, and the relation between these things",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1944.106,
    "end": 1948.59,
    "text": " potentially involving something like an attention schema, like bringing in like Graziano's type of work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1948.63,
    "end": 1959.539,
    "text": "And so I'm basically thinking like all, like many different theories of consciousness are actually pointed to different aspects of what we need with none of them being on their own jointly sufficient.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1959.559,
    "end": 1962.341,
    "text": "But if we bring them together, we might be able to get joint sufficiency.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1962.361,
    "end": 1972.189,
    "text": "And so the idea of in terms of neural substrates, I'm thinking that the appearance of a visual world could correspond to basically some kind of maybe the precuneus,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1973.339,
    "end": 1982.787,
    "text": " this like midline structure as like the top of the visual spatial sensorium coupling with the posterior cingulate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1984.448,
    "end": 1993.596,
    "text": "And the reason I would like point to these, I guess would be partially empirically in terms of like what happens if you lesion these areas and also the types of information available to them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1994.196,
    "end": 1999.601,
    "text": "So it's both like where they are, their high centrality being hierarchically higher",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2000.373,
    "end": 2009.456,
    "text": " the empirical associations, like if you lesion the posterior being precuneus, you're going to have lots of problems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2009.836,
    "end": 2014.237,
    "text": "But also in terms of mental imagery, this is like, these would be the neural corals that tend to be associated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2015.157,
    "end": 2023.539,
    "text": "I bring in like the cingulate, posterior cingulate, because basically I think that area might be the most crucial one for establishing a particular point of view on the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2024.42,
    "end": 2025.34,
    "text": "So you would have,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2025.947,
    "end": 2034.95,
    "text": " there's this like old idea of the Pepe's circuit where he was basically dropping electrodes, kind of like figure out epileptic form loci.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2034.99,
    "end": 2052.675,
    "text": "And he felt like this highly central inner circuit for emotional memory, where you go from the mammary bodies to, I think it's like the anterior lateral thalamus, posterior cingulate into the hippocampal formation out through the pharynx back to the mammary bodies and like this basic loop",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2053.667,
    "end": 2054.668,
    "text": " of emotional memory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2055.368,
    "end": 2066.473,
    "text": "I bring it up because if you think of the types of information that you would get there, part of what the mammary bodies are doing is they have this stretch receptor information from the neck.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2067.073,
    "end": 2070.955,
    "text": "And so this will actually tell you like where your inner lampreys head is pointing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2071.836,
    "end": 2076.998,
    "text": "And then if you go to the thalamic nuclei, they're now getting that information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2077.378,
    "end": 2080.36,
    "text": "They're also getting information from the vestibular apparatus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2081.12,
    "end": 2082.641,
    "text": "And so you have from the inner ear,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2083.154,
    "end": 2086.256,
    "text": " this like crazy conch shell nautilus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2086.276,
    "end": 2087.256,
    "text": "I don't know how to describe it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2087.296,
    "end": 2093.94,
    "text": "It's like crazy shape that basically has these like little particles and move around and stimulate these hair cells that cause different actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2093.96,
    "end": 2096.661,
    "text": "So basically you can get the yaw pitch and roll of the head.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2097.322,
    "end": 2109.328,
    "text": "And so you're getting both like the positional and the vector information of your head coming into this area before it feeds into the hippocampus top of the cortical hierarchy that basically gets your entire",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2110.6,
    "end": 2117.732,
    "text": " sensorium, all the modalities coming together, pegged according to what you need for an egocentric perspective and reference frame.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2118.213,
    "end": 2119.755,
    "text": "So that would be like in a human.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2121.279,
    "end": 2132.226,
    "text": " Just one note on this because I think it's really important is the question of estimating a visual field isn't like just what a convolutional neural network does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.346,
    "end": 2135.228,
    "text": "It's not just a fill in the dots, paint by lines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.049,
    "end": 2149.017,
    "text": "As we heard from Rudroff and Williford and others, it's actually a very complex affordance-driven projective model that entails a locus of the observer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2149.637,
    "end": 2149.778,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2150.698,
    "end": 2160.382,
    "text": " if a computer is trying to autocomplete some image, it is taking a matrix and it's doing transformations based upon statistical regularities in a matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2160.763,
    "end": 2162.904,
    "text": "So we can sort of computationally sketch that out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2163.404,
    "end": 2167.466,
    "text": "But in the locus of our awareness,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2168.286,
    "end": 2195.223,
    "text": " visually even it's not quite even the same computational problem because it's integrated like you're saying with um inputs of information that we can observe and you you made a great point with the the neck position and then the angle of your ear it's probably super non-linear how that gets integrated into the control mechanisms but that's like the gyroscope and acceleration on a phone it actually does convey the information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2196.32,
    "end": 2207.567,
    "text": " about the pitch and direction, but then it's being conveyed in this very action-oriented way, and it's egocentric action-oriented, because otherwise, if you're calculating the actions for somebody else, what's the point?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2209.148,
    "end": 2214.291,
    "text": "In some ways, it might even be the lion's share of the information, except for rare circumstances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2214.311,
    "end": 2224.977,
    "text": "Unless you're in the midst of a gale force hurricane, it might be the most purchase you have on what is causing the most change in your",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2226.058,
    "end": 2228.82,
    "text": " sensorium would be your own self-generated actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2229.44,
    "end": 2241.847,
    "text": "Whether we're talking about like overt motions or like now I'm changing what's coming in or like even just the mic, like, or saccades at three times a second, or even like these potentially faster jiggles and micro saccades, like it's actually all coming from you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2242.427,
    "end": 2255.734,
    "text": "And if you're going to try to make sense of like, make sense of your sensors without this, it might be pretty hopeless unless you're actually accounting for this inactive embedded, like situating of, of, of what's coming in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2256.516,
    "end": 2265.841,
    "text": " And so, yeah, you need all this information for, you know, we're not just like sitting there locked in, videos being displayed in us with our eyes open like in Clockwork Orange.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2266.842,
    "end": 2269.183,
    "text": "We're actually engaged in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2269.203,
    "end": 2271.224,
    "text": "And even there, your eyes are moving around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2271.304,
    "end": 2272.325,
    "text": "Even there would be hopeless.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2272.905,
    "end": 2296.744,
    "text": " without the efforts copy here's the fun thing is in active inference we know that the imperative is to reduce surprise minimize free energy of the system and there's two ways the system can go about doing that it can learn which is updating its internal model or it can act so you could do action or inference integrated under the same imperative and so let's think about this super",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2297.881,
    "end": 2303.743,
    "text": " Clockwork Orange, 1984 situation, where even the oculomotor muscles have been paralyzed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2304.043,
    "end": 2310.645,
    "text": "So someone cannot blink, they can't move their eyes, and it's like just they can't act at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2310.865,
    "end": 2311.965,
    "text": "They're maybe in an induced... Hopeless.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2312.365,
    "end": 2312.605,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.506,
    "end": 2317.887,
    "text": "In that situation, there would be an internal experience, let's just say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2318.707,
    "end": 2321.748,
    "text": "And because they couldn't act...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2322.978,
    "end": 2328.525,
    "text": " all the adaptation and the free energy minimization would have to be based upon their internal model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2328.645,
    "end": 2336.134,
    "text": "Now their internal model could be a crystallization of, I don't like what's happening to me and I'm not listening to the propaganda and that's not me, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2337.5,
    "end": 2340.664,
    "text": " but that's not always maybe the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2341.225,
    "end": 2350.556,
    "text": "And then we can go from that super limited situation into cases where we actually do have degrees of freedom of action and degrees of freedom of thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2351.036,
    "end": 2356.563,
    "text": "And it's a really interesting point that our active experimentation in the environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2357.484,
    "end": 2361.286,
    "text": " is what is leading along the trajectory of our experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2361.466,
    "end": 2363.327,
    "text": "It's like, oh, what's on the other side of this pen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.768,
    "end": 2370.011,
    "text": "I picked it up and now all the experience is my arm, all my visual field is different, but that wasn't externally induced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.571,
    "end": 2376.174,
    "text": "It was part of an endogenous active sequence of active experimentation in the niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2376.915,
    "end": 2379.296,
    "text": "And then, so it's really, okay, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2379.396,
    "end": 2381.677,
    "text": "That's where we get action and inference coming together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2382.057,
    "end": 2382.718,
    "text": "So continue on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2383.646,
    "end": 2389.709,
    "text": " Like in AI, they're trying to figure out how to get inductive biases for things like objectness and different kinds of core knowledge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2390.509,
    "end": 2396.432,
    "text": "And I think it's actually a real problem that this inactivist perspective is lacking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2397.073,
    "end": 2403.276,
    "text": "Because they just want to sort of like plop in different, as core knowledge is different evolutionary priors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2403.86,
    "end": 2405.461,
    "text": " as inductive biases right from the beginning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2405.481,
    "end": 2412.207,
    "text": "So it's like you have somehow, you know, wave your hands, base magic, objectness prior, causation prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2412.247,
    "end": 2421.094,
    "text": "You might have things such as this, but it's going to actually be helpful for an objectness prior if the system actually has experience with objects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2421.634,
    "end": 2422.475,
    "text": "That might be helpful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2423.035,
    "end": 2429.721,
    "text": "And it's still this idea of like you're trying to solve vision completely divorced from the engagement with the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2430.201,
    "end": 2432.363,
    "text": "So you can actually like reach up and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2433.131,
    "end": 2438.475,
    "text": " If you have experiences like touching and moving things around and saying, huh, I have uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2438.515,
    "end": 2440.336,
    "text": "I'm going to, like you were just saying, I can resolve my uncertainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2441.116,
    "end": 2442.117,
    "text": "Oh, that's what's on the other side.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2442.177,
    "end": 2443.638,
    "text": "And now I'm building up an object model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2444.078,
    "end": 2447.06,
    "text": "And now I'm building up causal models of like, what happens if like I let go of this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2447.08,
    "end": 2447.721,
    "text": "I'm not going to do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2447.801,
    "end": 2463.031,
    "text": "But now you've had a sense of the causation of the world that is basically allowing you to have this internal model instead of just like hammering it into the architecture somehow through something like, you know, some sort of architectural prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2463.872,
    "end": 2475.562,
    "text": " Not that those things don't exist and are going to be crucially important, but I think it's completely hopeless that they're going to solve that enduring problem of AI without this inactivist perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2475.582,
    "end": 2478.885,
    "text": "I think it's just the hypothesis space is way too unconstrained.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2479.325,
    "end": 2480.446,
    "text": "You will be lost there forever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2480.845,
    "end": 2483.266,
    "text": " You could throw all the compute of the universe at it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2483.566,
    "end": 2484.586,
    "text": "It still might not be enough.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2485.006,
    "end": 2488.327,
    "text": "I could be wrong about that, but that's a claim.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2489.067,
    "end": 2496.529,
    "text": "Another way of thinking about that is, let's say the space of all possible chess boards or the space of all possible cup designs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2496.629,
    "end": 2497.569,
    "text": "It's a big number.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2498.089,
    "end": 2500.87,
    "text": "But actually, the space of all strategies for chess...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2501.59,
    "end": 2505.715,
    "text": " it has to be bigger than the number of chess boards because any chess board, there's multiple strategies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2506.215,
    "end": 2514.665,
    "text": "Or the number of strategies for determining the coffee cup, like what is each joint going to do as you're seeking to infer what kind of coffee cup it is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2515.085,
    "end": 2516.787,
    "text": "Again, it's like chess strategies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2516.887,
    "end": 2517.928,
    "text": "It's another level of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.889,
    "end": 2539.807,
    "text": " of strategy above the state and so active inference sort of cuts the knot on seemingly the simpler problem how do we figure out what kind of coffee cup it is rather than just doing exhaustive mapping of all possible coffee cups we actually step back to asking what strategy is going to help us resolve uncertainty about the coffee cup",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2540.467,
    "end": 2545.956,
    "text": " And then that strategy might be encapsulated with just a few lines of pseudocode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2546.257,
    "end": 2550.925,
    "text": "Like a good strategy for game theory might be start nice and retaliate, but then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2552.071,
    "end": 2554.233,
    "text": " Act randomly once in a while and forget sometimes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2554.753,
    "end": 2555.334,
    "text": "Something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2555.794,
    "end": 2560.898,
    "text": "That's quite a compression of a lot of things that are relational in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2561.398,
    "end": 2569.164,
    "text": "And so it's almost like sometimes the state estimate is too hard or not even what we really want to know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2569.244,
    "end": 2573.167,
    "text": "You don't want every pixel in HD of your visual field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2573.668,
    "end": 2574.808,
    "text": "You need to know how to act.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2575.009,
    "end": 2577.15,
    "text": "And then that way, even if you're...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2578.251,
    "end": 2585.9,
    "text": " If you have something in your eye or one eye is injured or there's some sort of other visual impairment or even no visual input,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2586.818,
    "end": 2588.979,
    "text": " someone can still act effectively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2589.56,
    "end": 2597.545,
    "text": "Whereas if you just have an image recognition module, you disconnect that and now it's like you're walking on nothing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2598.165,
    "end": 2612.574,
    "text": "But if you have action as the core loop and then sense as it is an active inference is being integrated to the extent that it shapes action, it's a very different perspective than sort of this input process output",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.194,
    "end": 2614.254,
    "text": " control theory model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2614.694,
    "end": 2623.757,
    "text": "And I think this is going to come back in a second when we look at the circular closed causality of the actual action inference loop with a blanket state intermediating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2624.237,
    "end": 2625.077,
    "text": "So that's pretty cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2625.657,
    "end": 2626.758,
    "text": "Any other thoughts there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2628.958,
    "end": 2638.241,
    "text": "I guess along those lines, something that's something of an open question for me right now and also speaks to like illusionism you mentioned recently.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2641.294,
    "end": 2658.8,
    "text": " I kind of bristle against all things illusionist in that, like, I think indeed, I think it implies things, like, it implies things like you are not conscious or that consciousness is not an important, basically, adaptation or component of experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2659.3,
    "end": 2662.981,
    "text": "But this idea that it might be different than we think, I think, is valid and useful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2663.041,
    "end": 2666.562,
    "text": "So in that sense, I like illusionism, but I also bristle against it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2666.622,
    "end": 2668.523,
    "text": "But the idea, though, being with this sort of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2669.646,
    "end": 2674.227,
    "text": " the most useful compression and the most useful, like, how is it encoded?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2676.327,
    "end": 2677.988,
    "text": "What is the richness of experience?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2678.308,
    "end": 2692.051,
    "text": "We could actually be somewhat mistaken in that it might be as if we have this HD visual field all available to us all at once, or it might just be when we query it, we can have it when we need it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2692.791,
    "end": 2698.492,
    "text": "And so, like, I think, is it O'Regan, I think, like with sensory motor contingency theory,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2698.988,
    "end": 2703.49,
    "text": " That's his model and it's more extended and it's like you just query the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2704.211,
    "end": 2720.679,
    "text": "But potentially, even internally, you might just be querying an entailed generative world model and it might even be potentially at the resolution of the sensory engagements themselves, which are like, for instance, for visual sampling,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2721.069,
    "end": 2725.431,
    "text": " You have basically for the phobia, it's a thumbnail held out at arm's length.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2725.952,
    "end": 2727.232,
    "text": "That's basically all you got.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2727.913,
    "end": 2733.276,
    "text": "And so it might be at any given moment, that is actually what's in your visual experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2733.636,
    "end": 2740.119,
    "text": "It could be, but it's just you're moving it around and so you never notice because there's no place to stand to look at yourself not realizing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2740.139,
    "end": 2741.98,
    "text": "It's kind of like the refrigerator light.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2742.0,
    "end": 2743.541,
    "text": "Whenever you open it, there it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2745.182,
    "end": 2745.922,
    "text": "Interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2746.282,
    "end": 2746.963,
    "text": "The lights are on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2746.983,
    "end": 2748.904,
    "text": "The lights are on because somebody walks by.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2750.826,
    "end": 2764.957,
    "text": " I map like though, like part of like perceptually, like I suggested that there is some sort of richer filling in, and this is part of like, I think, so like, um, I've suggested and Kenai has suggested that like, you can think of Cortex in terms of principles of like variational autoencoders.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2765.517,
    "end": 2769.02,
    "text": "And part of what they can do is they can fill in a more rich thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2769.06,
    "end": 2776.486,
    "text": "So for instance, they might be used for instance, like for like a, a 4k or an 8k television or something for like super resolution for upsampling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2777.026,
    "end": 2779.408,
    "text": "And you have a, a more impoverished signal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2779.807,
    "end": 2784.43,
    "text": " and then you fill in the missing details, or you have an occluded image, and then you fill in what wasn't there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2784.471,
    "end": 2788.053,
    "text": "And maybe this is, for instance, partially how he handled the blind spot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2788.153,
    "end": 2788.754,
    "text": "That's unclear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2789.434,
    "end": 2793.077,
    "text": "But how much filling in exactly happens, I have no idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2793.617,
    "end": 2805.466,
    "text": "It could be just almost like an Etch-a-Sketch thing that is at the really shockingly low dimensional resolution of the actual sensors themselves, or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2805.706,
    "end": 2806.027,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2807.29,
    "end": 2811.074,
    "text": " Another thought on the richness or the paucity, those are comparators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2811.254,
    "end": 2812.575,
    "text": "They're relative terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2813.156,
    "end": 2819.963,
    "text": "And so imagine another agent in the niche has different affordances and say only 400 to 700 nanometers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2820.163,
    "end": 2822.966,
    "text": "You know, you can't see anything beyond this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2823.266,
    "end": 2825.809,
    "text": "It's like, who's having a rich experience now?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2826.429,
    "end": 2828.431,
    "text": "And so we are having our experience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2828.471,
    "end": 2829.512,
    "text": "And then as you're pointing out,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2830.353,
    "end": 2841.319,
    "text": " feeling like things are not changing or like we have good clarity outside of our main focal point, that's a story we're telling ourself that actually might be a very adaptive and self-protective belief.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.84,
    "end": 2846.863,
    "text": "Because if it's the case that when we're unsure about something, it produces or it is anxiety,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2847.583,
    "end": 2855.747,
    "text": " And then tunnel vision is like sort of our de facto sensory reality as far as what the resolution capacity of the retina is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.347,
    "end": 2863.65,
    "text": "So how do you square the circle with limited sensory capacity but not wanting to have over anxiety?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.01,
    "end": 2873.574,
    "text": "Well, you make rapid circuiting and then you have a continual story that everything is okay until something semantically is not okay in the visual field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2874.275,
    "end": 2874.515,
    "text": "Dave?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2877.153,
    "end": 2877.453,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.633,
    "end": 2883.779,
    "text": "Uh, did you see the, uh, the, the YouTube address that I just sent through chat several minutes ago?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.799,
    "end": 2889.583,
    "text": "Um, I don't look at any chats during the live stream, but what can you tell us about it or how would people find it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2889.683,
    "end": 2890.104,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.644,
    "end": 2890.864,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.904,
    "end": 2901.553,
    "text": "This is a recent, um, presentation by Mark Solms about, uh, why summarizing his recent, his book that just came out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.294,
    "end": 2902.354,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.961,
    "end": 2911.888,
    "text": " And he's addressing how it is that Thomas Nagel and David Chalmers ask these really good questions, really important questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2912.409,
    "end": 2917.072,
    "text": "Super smart people with a tremendous amount of knowledge have been working at this for decades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.953,
    "end": 2920.295,
    "text": "And some of them are despairing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.495,
    "end": 2923.237,
    "text": "How can we ever possibly answer these questions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2923.818,
    "end": 2928.722,
    "text": "And he said, well, if you refuse to pay attention to the brainstem...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.057,
    "end": 2943.688,
    "text": " and the midbrain, and think you're going to find the answers to consciousness, and what it's to be like, and feeling in the cortex, you are not going to find it, because it ain't there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.008,
    "end": 2951.314,
    "text": "You want to know, what does it feel like, and you want to look at, and you've confined yourself to a part of the brain where feeling isn't happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2951.835,
    "end": 2957.98,
    "text": "The part that isn't dedicated to feeling, but rather is this sort of, you might say, computing machine that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2959.299,
    "end": 2967.685,
    "text": " might pick up some consciousness when the brain stem needs the neocortex to do consciousness, rather to help it do consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2968.466,
    "end": 2972.449,
    "text": "So I'll send, I don't know, maybe I should send an email.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.709,
    "end": 2973.55,
    "text": "Or the other thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2973.87,
    "end": 2976.912,
    "text": "Leave a comment on this YouTube video and if someone's curious, they'll check back out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2976.952,
    "end": 2978.133,
    "text": "I don't know if I can do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.293,
    "end": 2986.779,
    "text": "I don't know that I've tried to put comments on the YouTube and I see no evidence that anything that I put in ever goes anywhere that anybody can see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.339,
    "end": 2987.88,
    "text": "Interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2988.939,
    "end": 2992.601,
    "text": " But anyhow, you can put it in the text maybe later on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2993.241,
    "end": 3006.509,
    "text": "The other thing, maybe you both heard me talk about this before, but some folks working on the memory that's used for the recognition of chess positions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.19,
    "end": 3017.015,
    "text": "They took a bunch of people from just really beginners who just basically know only how you can move, what are the legal moves, to really good players, to masters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3017.535,
    "end": 3018.316,
    "text": "And they would give them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.851,
    "end": 3019.612,
    "text": " Just positions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.792,
    "end": 3023.875,
    "text": "And let them look at it for a few seconds or 30 seconds or however long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3023.895,
    "end": 3024.916,
    "text": "That was varied.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3025.436,
    "end": 3027.198,
    "text": "And then say, now write it down for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.979,
    "end": 3030.741,
    "text": "Or just say, tell me what you can remember about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.761,
    "end": 3033.863,
    "text": "You know, 30, 60 seconds or 15 minutes later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.605,
    "end": 3040.849,
    "text": "And in a real position, the master was really, really good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3040.889,
    "end": 3045.333,
    "text": "They could sometimes reproduce all of the pieces in an end game or a mid game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.708,
    "end": 3050.29,
    "text": " And the amateurs could barely do it at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.35,
    "end": 3058.714,
    "text": "They'd say, well, white's kind of still in white's territory, and the right side of the board had a lot of stuff in it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3059.375,
    "end": 3073.042,
    "text": "But if they put up impossible positions, positions that you cannot possibly legally move pieces into, the masters would get really upset because they couldn't remember.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3073.302,
    "end": 3073.922,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3073.942,
    "end": 3074.863,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3075.695,
    "end": 3083.179,
    "text": " In fact, the amateurs were better than the masters at reproducing impossible boards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3084.799,
    "end": 3093.663,
    "text": "And the folks analyzing this said, well, it seems like people who know chess don't remember positions at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3094.084,
    "end": 3096.885,
    "text": "They remember trajectories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3097.674,
    "end": 3099.515,
    "text": " That seems to be the only thing they remember.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.575,
    "end": 3101.396,
    "text": "And then they drill down on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3102.016,
    "end": 3106.117,
    "text": "How can you distract from remembering trajectories and so on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.177,
    "end": 3108.919,
    "text": "And they say, yeah, this seems to be what people remember.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.959,
    "end": 3110.599,
    "text": "The meaningful moves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3110.879,
    "end": 3113.0,
    "text": "They don't remember positions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3113.48,
    "end": 3119.483,
    "text": "I think that might address some of the things Adam was saying about what's really deflated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.523,
    "end": 3124.005,
    "text": "What is really the more efficient way to store data?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.105,
    "end": 3127.286,
    "text": "You've got storage in a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3127.881,
    "end": 3144.925,
    "text": " computing machine and you've got the knowledge and the information and the information about my position and where I want to go from here that a living brain uses and they may have no relationship",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3145.848,
    "end": 3146.768,
    "text": " Thanks for that, Dave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3146.808,
    "end": 3149.209,
    "text": "And I'm going to pass to you, Adam, with a question from the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3150.11,
    "end": 3155.231,
    "text": "Cambridge Breaths asks a question to Adam regarding the computational approach to neurophenomenology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.812,
    "end": 3161.874,
    "text": "How would the generative passages possibly help to describe consciousness in a way that generative models can't do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.554,
    "end": 3163.955,
    "text": "So it sounds kind of related.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3164.015,
    "end": 3169.737,
    "text": "I'm not sure about the generative passage, but it's sort of this trajectory idea, I think, is what we're getting at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3169.777,
    "end": 3172.718,
    "text": "So anything you wanted to say or respond in that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3175.762,
    "end": 3182.805,
    "text": " Okay, so a few things off the stack, and I'll address that if I can, or to the extent I can.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3183.625,
    "end": 3197.711,
    "text": "Oh, with relation to the different types of potential illusion or richness or lack thereof, there's this one book that reviews a lot of these phenomena, The Mind is Flat by Nick Chater, which is interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3197.731,
    "end": 3204.013,
    "text": "I don't know if the book should be called The Mind is Flat or The Mind is Surprisingly Rich and Deep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3204.568,
    "end": 3206.189,
    "text": " It's just a matter of perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3206.369,
    "end": 3216.633,
    "text": "But with respect to, and I also want to address Soames and the idea of a conscious brainstem, which I'm going to push back on that a little bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3220.175,
    "end": 3226.138,
    "text": "But I guess I'll go to the generative passages versus generative model idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3226.158,
    "end": 3233.461,
    "text": "And I think that first, and I think that actually speaks to what you were saying, Daniel, in terms of like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3234.466,
    "end": 3261.355,
    "text": " wanting to have this balanced information like dealing with what's the information you actually got um and then what can the agent handle in terms of it's like um it's effective read on itself by which it's regulating itself as a cybernetic system not getting overwhelmed by uncertainty a given point and potentially a kind of additional filling in both for the sake of having um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3262.7,
    "end": 3277.212,
    "text": " a richer causal model of the world, but also just to not freak out the agent, to allow it to be more copacetic in handling the uncertainty that it's going to have to handle in engaging with the world and trying to, via potentially some sort of integrated world model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3277.953,
    "end": 3281.976,
    "text": "Now, I guess the... I'm still...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3283.191,
    "end": 3297.055,
    "text": " trying to understand aspects of B. So there's a pre-print that just came out by Maxwell Ramson and a few others on neurophenomenology, which talks about this generative passage idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3298.456,
    "end": 3312.24,
    "text": "But I guess part of it would be if the modeling processes we're doing are temporally deep and they're counterfactually rich,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3313.345,
    "end": 3320.967,
    "text": " And this would be different than, for instance, just necessarily inverting the generative model from your sensorium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3321.027,
    "end": 3339.713,
    "text": "So for instance, if you take the posterior lobes, which IIT says are the physical substrates of consciousness and could be, on another perspective, viewed as a kind of workspace that provides a global availability, or it could be viewed as a predictive global neuronal workspace.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3342.522,
    "end": 3346.066,
    "text": " predicting what you think your sensory states are at each point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3350.631,
    "end": 3354.015,
    "text": "This could get you a good amount of temporal depth and counterfactual richness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3354.695,
    "end": 3354.996,
    "text": "However,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3355.868,
    "end": 3373.035,
    "text": " Really, though, the unfolding is not just a sequence of sensory estimates just stitched together through time, but they're inactively stitched together through time, where the whole process, whether you're engaging in the world or you're imagining it, it's these action perception cycles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3373.755,
    "end": 3385.18,
    "text": "And so now the frontal lobes are in the mix, and now it's getting complicated, where now the agent is shifting its perspective around within either an actual world it's engaged with or some sort of virtual world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3385.922,
    "end": 3388.783,
    "text": " and with some sort of relation between these.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3389.684,
    "end": 3391.744,
    "text": "And this is now more extended.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3392.105,
    "end": 3400.988,
    "text": "This is a different thing where the closure of these functional cycles, the informational closure, is more extended.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3401.008,
    "end": 3410.772,
    "text": "So things like, for instance, the inherent depth of the present moment, the sort of specious present, that might be part of it in terms of, for instance, it's not just this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3411.929,
    "end": 3434.723,
    "text": " I'm suggesting like the actual quail are discrete they're being estimated at alpha frequencies primarily with a foci kind of encompassing the posterior lobes and this is where you're getting basically these nests these non-equilibrium steady state densities or I call them self-organizing harmonic modes and this is the stream of experience however the actual what's in the stream that's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3435.774,
    "end": 3443.465,
    "text": " involving other things that's involving the cybernetic action perception context and where it begins and ends.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3444.667,
    "end": 3448.492,
    "text": "The actual operations engagement, that's a different and much more complicated story.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3449.141,
    "end": 3451.362,
    "text": " And I think we're basically going to need to have things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3452.103,
    "end": 3454.824,
    "text": "I actually think like the hippocampal system might be at the core of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3455.425,
    "end": 3457.086,
    "text": "And that's going to be like the key puzzle piece.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3457.106,
    "end": 3464.41,
    "text": "And I'm currently working on moving from basically this basic, like what could do phenomenality to what could do these more complex forms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3464.47,
    "end": 3467.092,
    "text": "I'm trying to grok the hippocampal system to figure that out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3467.152,
    "end": 3469.493,
    "text": "But that's like one distinction between like generative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3470.194,
    "end": 3478.839,
    "text": "I think I might speak to generative passages versus just the components of a gender model that being, being inverted that could entail basic,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3480.165,
    "end": 3484.94,
    "text": " creature consciousness phenomenality, or just the estimates of the world, the stream of experience.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3485.404,
    "end": 3486.124,
    "text": " I don't know if that makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3486.405,
    "end": 3487.265,
    "text": "So one more thing, though.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3488.126,
    "end": 3491.348,
    "text": "Just one on the passage, then we'll go to the other topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3491.388,
    "end": 3496.972,
    "text": "So think about memorizing something like the chessboard, but think about memorizing a sequence of sounds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3497.392,
    "end": 3505.417,
    "text": "So if there's sounds that you cannot make, like some sort of whistle or some sort of sound that a human can't make, it's going to be really hard to memorize it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3505.477,
    "end": 3507.759,
    "text": "You could recognize it, but it's going to be hard to reproduce it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3508.299,
    "end": 3510.821,
    "text": "Now there's sounds that you can make in a language you don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3511.221,
    "end": 3515.084,
    "text": "If you tried hard enough, you might be able to memorize a song in a different language, but it's going to be hard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3515.784,
    "end": 3523.588,
    "text": " Next would be in the scale of how easy it is to memorize would be like random words in English or language that one speaks, but not grammatical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3523.788,
    "end": 3525.529,
    "text": "That's like the chess boards that are impossible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3525.849,
    "end": 3527.99,
    "text": "It's real pieces, but it's not linked in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3528.01,
    "end": 3533.793,
    "text": "Okay, now up another level of easy to memorize, natural language like conversation could be pretty easy to memorize.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3534.813,
    "end": 3539.076,
    "text": " Another layer up would be a composed natural language, like a story or a poem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3539.936,
    "end": 3550.202,
    "text": "And then even above the story or the poem, as we know from those who have great experience with memorizing epics, is the embodied and the inactive poem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3550.783,
    "end": 3556.546,
    "text": "So where from the head of the story to the toes of the story, or it invokes your own body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3557.206,
    "end": 3559.348,
    "text": "And so when we think about this generative passage,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3560.248,
    "end": 3575.252,
    "text": " It's almost like it's increasingly natural for us to condense or to distill memory in terms of a narrative at increasingly inactive, increasingly self-referential ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3576.613,
    "end": 3587.756,
    "text": "Whereas stimuli that aren't able to be easily brought on board our own narrative in a relational way, they're kind of like non-sequiturs to our memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3588.556,
    "end": 3592.418,
    "text": " And so that's who and what we are, the state of the system and how it responds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3592.438,
    "end": 3601.283,
    "text": "And then also on the passage versus the generative model, thinking about the generative model, even though we know in active inference that it's beyond internalism and externalism and tail of two densities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3601.303,
    "end": 3610.629,
    "text": "And so it's not just like the generative model is a matrix, but thinking about a generative model makes you think that you can like pause the sensory input and just, okay, what's the state of the model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3611.189,
    "end": 3621.012,
    "text": " But when we think about generative passages and trajectory estimates, we get past, present, future, we get self and other, and we get planning under uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3621.532,
    "end": 3630.835,
    "text": "So those are some of the very, very key aspects of passage inference that aren't quite captured by just asking about generative model, which makes it sound like you're doing like a linear regression.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3634.776,
    "end": 3634.976,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3635.136,
    "end": 3636.477,
    "text": "Then to the other aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3637.437,
    "end": 3637.537,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3639.889,
    "end": 3640.75,
    "text": " That was beautifully said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3640.77,
    "end": 3644.072,
    "text": "Just need a moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3644.793,
    "end": 3645.093,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3648.316,
    "end": 3648.616,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3648.876,
    "end": 3651.578,
    "text": "So, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3651.598,
    "end": 3653.079,
    "text": "So I guess the brainstem part.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3654.68,
    "end": 3661.065,
    "text": "So I really like Mark Soames' perspective and I'm actually...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3663.339,
    "end": 3665.16,
    "text": " very sympathetic to neuropsychoanalysis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3666.46,
    "end": 3668.901,
    "text": "I think it's developmental, it's relational.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3669.421,
    "end": 3692.81,
    "text": "I think it acknowledged, like, I think basically since we are either, you know, you could say because we're reinforcement learners, it would be shocking if there weren't things like defense mechanisms, because there's some thoughts you're having more of, some things you're having less of, and the contingencies of value optimization are too numerous and varied",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3693.246,
    "end": 3694.707,
    "text": " sometimes subtle for you to track.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3695.328,
    "end": 3697.129,
    "text": "And so you can go down all sorts of garden paths.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3697.189,
    "end": 3708.999,
    "text": "So I'm generally like, while the particular aspects of the Freudian framework you might question, I think we probably should be thinking something kind of psychoanalytic to get at the weirdness of mind and what it's like to be a person.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3709.359,
    "end": 3719.607,
    "text": "That being said, while I agree about the fundamental nature of the necessity of the brainstem as part of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3720.074,
    "end": 3725.977,
    "text": " of what's contributing to consciousness as not just as being necessary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3725.997,
    "end": 3726.997,
    "text": "You take it out, you're done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3727.618,
    "end": 3734.201,
    "text": "However, the claim that the brainstem itself is the locus of consciousness, I find to be somewhat questionable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3735.001,
    "end": 3739.644,
    "text": "And that I think we're in an even worse position in some ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3745.567,
    "end": 3746.907,
    "text": "Well, we're, it's,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3748.848,
    "end": 3752.769,
    "text": " The reason I would say, so one, I would question the evidence that's cited for this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3753.87,
    "end": 3767.974,
    "text": "But the other is I think you probably need the, at the very least, something like to do temporally deep generative modeling of a kind that would be able to give rise to an integrated world model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3768.734,
    "end": 3770.334,
    "text": "It seems like the Branson doesn't have what it takes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3770.915,
    "end": 3778.617,
    "text": "I suspect you need the thalamocortical system with its ability to do this hierarchical sequence memory,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3779.287,
    "end": 3800.929,
    "text": " and its ability to capture this hierarchy of time scales all coupled to model your hierarchically your hierarchy or the dynamics are unfolding in your engagement with the world you need a system that has those properties and i don't think the brainstem quite has what it takes um the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3802.014,
    "end": 3806.755,
    "text": " Basically, for me to have consciousness, I want to have, as I say, an integrated world modeling theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3806.775,
    "end": 3819.419,
    "text": "I want an integrated world model that has coherence with respect to space, time, and cause, and maybe also agency, some sort of basic autonomy as part of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3819.819,
    "end": 3824.26,
    "text": "And these are all necessary properties that potentially might be jointly sufficient",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3825.135,
    "end": 3826.436,
    "text": " But they're definitely necessary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3826.476,
    "end": 3828.156,
    "text": "And so I don't think the Branson can do all that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3828.917,
    "end": 3839.421,
    "text": "In terms of the data they cite, one would be ancephalic patients or children without developed cerebral cortex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3840.201,
    "end": 3841.482,
    "text": "Or rather, it's just not there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3841.922,
    "end": 3844.343,
    "text": "And they're showing this rich emotionality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3845.124,
    "end": 3852.567,
    "text": "But my pushback would be that emotions, they go all the way back",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3856.451,
    "end": 3881.296,
    "text": " all life like that's like and like Damasio's thinking and like the strange order of things um and the um 2012 book I forgot what that one's called but it's this every single it's these coherent changes in organismic modes that are corresponding to means of engaging with the world these classes of events and this is a state of basically action readiness",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3882.014,
    "end": 3884.582,
    "text": " over your system that allows you to adaptively couple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3884.642,
    "end": 3886.006,
    "text": "And I think like this is what emotions are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3886.628,
    "end": 3887.831,
    "text": "And so this is being shaped",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3888.703,
    "end": 3890.084,
    "text": " all the way back to a single cell.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3890.204,
    "end": 3892.945,
    "text": "And maybe we want to push consciousness that far down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3893.285,
    "end": 3902.649,
    "text": "I personally wouldn't, but the idea is I think you can have very rich, unconscious emotions, very rich affects, and it should be organized organismically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3902.829,
    "end": 3905.07,
    "text": "And so this will all be the level of the brainstem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3905.09,
    "end": 3905.71,
    "text": "You'll see these things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3905.73,
    "end": 3918.495,
    "text": "You'll see like, for instance, potentially laughter, you'll see fear, you'll see rage, but I would argue you'll see in some ways homologues of these things going all the way back to bacteria, bacteria going into like a sporulated form to protect itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3919.281,
    "end": 3922.984,
    "text": " That could be a kind of like fear thing or a bacteria releasing endotoxins.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3923.464,
    "end": 3930.61,
    "text": "That could be a kind of anger response or like extending a pillus to exchange circular chromosome, little chromosome bits with another person.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3930.89,
    "end": 3932.432,
    "text": "That could be a kind of bacterial lust.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3933.112,
    "end": 3935.834,
    "text": "I don't think there's anything it's like for these affects for the bacteria.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3936.435,
    "end": 3948.705,
    "text": "So I kind of push back and that basically the reflex, these reflex arcs being engaged coherently for these things that are basically at the core of our experience, in some ways the most important part.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3949.435,
    "end": 3975.869,
    "text": " still um i think this can be done uh potentially just mechanically and like from like a kind of brooksian robotics emergentist perspective uh where it's just the systems intelligence is in it's the what's available like the different modes its body can go into which will um allow for certain types of adaptive coupling yep it's the one more thing i would say would be um they also point to um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3978.387,
    "end": 3983.81,
    "text": " So, like, um, like, you'll stimulate these areas, and then they'll generate the emotion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3985.491,
    "end": 3985.611,
    "text": "Okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3986.151,
    "end": 3988.912,
    "text": "Um, but I think that might be the same story.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3989.052,
    "end": 4000.878,
    "text": "Like, the generation of affects, we don't know, or rather, okay, so, we know if you stimulate it in us, so you can stimulate these areas, and you'll generate the emotion, but that that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4001.869,
    "end": 4030.127,
    "text": " area itself is sufficient for it that we don't know i would suggest probably not and then for us have experienced the issue though is you have these looping effects you haven't cut it off it's circular causation so you stimulate these like brain stem nuclei or hypothalamic nuclei and then you generate the emotion well the cortex is still online for us and so that's uh i i would i think the evidence is questionable for the the conscious brainstem even though i love everything else about soames's perspective",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4030.836,
    "end": 4033.838,
    "text": " I think we should move away from conscious brainstems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4034.759,
    "end": 4035.379,
    "text": "Okay, thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4035.619,
    "end": 4056.473,
    "text": "Yeah, Freud talks about different, qualitatively different kinds of consciousness, the consciousness that's in the brainstem and the cortical, at least, I'm sorry, I shouldn't say it that way, the way Psalms updates Freud, that there's certain consciousness that does seem to be confined to the brainstem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4056.513,
    "end": 4058.074,
    "text": "And I know listening to his talks that,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4058.57,
    "end": 4068.873,
    "text": " he will say it's conscious, and then in the next sentence, it's unconscious, and that differentiation is really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4069.454,
    "end": 4080.017,
    "text": "It may be that if we were in the habit of talking about what I'm kenning just now versus what we're witting, it wouldn't be as confusing if we separate the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4080.447,
    "end": 4096.961,
    "text": " body knowledge from the um visual knowledge or visual oral knowledge thank you yep thanks for that david um i'm not ready to say that consciousness isn't a helpful word but when you're talking about subtypes just brainstem function",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4097.621,
    "end": 4125.118,
    "text": " or the neurocomputational components of brainstem function in this or that state it's all of a sudden like it's like explained away and then also this question about the lesions and the measurements which is what is really important to us when we're thinking about this pragmatically it reminds me a lot of genetics where they'll take a gene even just going with the molecular dna concept of a gene so just saying they'll take a gene and they'll knock it out or they'll remove its function and then let's say blood pressure goes up when you delete the gene",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4125.578,
    "end": 4129.242,
    "text": " And they'll say, oh, well then this gene lowers blood pressure because it went up without it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4129.783,
    "end": 4130.784,
    "text": "But that's actually not true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4131.124,
    "end": 4137.491,
    "text": "To use out of your terminology, the blood pressure is a phenotype that is like a self-organized harmonic mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4138.192,
    "end": 4140.314,
    "text": "And then when you change one of the nodes,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4141.368,
    "end": 4146.752,
    "text": " it's going to lead potentially to a, if it's a buffered node, then it's not going to change the mode at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4146.872,
    "end": 4153.096,
    "text": "So it'd be like a phenotypically silent mutation, or it could be like a key linchpin, just like the epigenetic landscape behind me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4153.656,
    "end": 4158.199,
    "text": "It changed one of these guys that are key, and then it changes the self-organizing mode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4158.64,
    "end": 4165.684,
    "text": "And so, just like you said, a brain region, when you lesion it, if it removes some trait, that doesn't mean the trait was in that region.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4166.185,
    "end": 4171.068,
    "text": "It's actually a total integrated network, and then you change the network or the system's phenotype,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4171.688,
    "end": 4172.809,
    "text": " when you change the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4173.249,
    "end": 4177.812,
    "text": "So I'm always extremely skeptical of, well, this removal of this brain region, remove this trait.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4177.912,
    "end": 4178.432,
    "text": "So it's in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4178.452,
    "end": 4183.655,
    "text": "It's like, actually, you could almost say it isn't in there because the system was able to reorganize without it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4184.275,
    "end": 4189.838,
    "text": "And so it's just, it's almost like the opposite of what people think is being shown with lesion experiments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4189.938,
    "end": 4194.441,
    "text": "It's being shown that the system has capacity that is modified by key elements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4194.461,
    "end": 4196.622,
    "text": "Like if you inject ketamine into your wrist,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4197.202,
    "end": 4200.504,
    "text": " there's gonna be a different phenotype than if it goes into some brain region.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4200.804,
    "end": 4206.268,
    "text": "Like there's brain regions where a different drug being dripped on is gonna lead to different phenotypic changes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4206.928,
    "end": 4210.851,
    "text": "So that's actually not simply evidence that the brain is the locus of consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4211.271,
    "end": 4216.374,
    "text": "It's just saying, yeah, there's, you know, your elbow is a pivotal spot for the movement of your arm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4216.915,
    "end": 4222.739,
    "text": "And there's brain regions that play critical message passing roles and neuro-functional roles",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4223.559,
    "end": 4230.705,
    "text": " But that doesn't uniquely identify this sort of object reductionist or regional perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4231.966,
    "end": 4233.227,
    "text": "This is fun stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4233.287,
    "end": 4236.209,
    "text": "I think we can, let's, Adam, yeah, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4236.229,
    "end": 4237.85,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4240.352,
    "end": 4250.901,
    "text": "I guess in terms of things like virtual machines and what types of systems, so I'm like kind of pushing back on brainstems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4251.527,
    "end": 4258.151,
    "text": " But I'm also, in some ways, broader, I guess, than like maybe potential wandering Carl's perspective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4258.651,
    "end": 4262.913,
    "text": "And that I'm actually really happy with consciousness being supported by a virtual machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4262.933,
    "end": 4266.035,
    "text": "In fact, I think you might want to even think about it as a kind of virtual machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4268.136,
    "end": 4280.463,
    "text": "And for me, though, part of what I want to have happen, it's not just this potentially the ability to have, you know, a hierarchy of representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4281.513,
    "end": 4284.856,
    "text": " with like synchronous dynamics, facilitating the message passing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4285.436,
    "end": 4303.97,
    "text": "But what I'm going to want is for basically these estimates of the organisms or the systems engagement with the world to be generated on a time scale that would allow it to both inform and be informed by evolving action perception cycles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4304.991,
    "end": 4309.715,
    "text": "And where basically the role for me of this basic phenomena awareness would be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4310.43,
    "end": 4320.654,
    "text": " a series of estimates who, through their basically high degree of coherence, can also exert powerful control energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4320.694,
    "end": 4334.72,
    "text": "They end up constituting this center, slow, synergetic, attracting manifold that can enslave the rest of the system to degrees and influence its dynamics, basically influencing action selection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4335.741,
    "end": 4338.922,
    "text": "Series of estimates that can influence action selection and be updated",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4340.492,
    "end": 4341.873,
    "text": " via your engagement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4342.814,
    "end": 4367.172,
    "text": "So this doesn't necessarily need to be a brain, but for me, I want basically a rich enough estimate of the global state of the system, and I want these estimates to occur on a time scale where they can significantly enough that there's a good amount of grip, enough that you can actually do active inference, both inform and be informed by the engagement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4367.592,
    "end": 4370.034,
    "text": "I want one more thing potentially, or maybe two more,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4371.355,
    "end": 4397.178,
    "text": " which would be, I would want a large enough network that you can get some sort of non-equilibrium steady state or self-organizing harmonic mode among some aspect of it, some subset of it, where the closure would be achieved within the system",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4398.644,
    "end": 4403.267,
    "text": " that you could describe such a object, such a harmonic or such a nest density.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4404.068,
    "end": 4422.241,
    "text": "And I think what you might potentially need is a big enough system that you can get an almost like an inner loop or that when you're forming like this metastable state, it's not immediately disrupted by the engagements with the world via the sensory states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4422.301,
    "end": 4426.945,
    "text": "And so I want it to be big enough that there's this, it can form these internal",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4427.813,
    "end": 4450.098,
    "text": " complexes can i tie this to a question in the chat because i think it's great okay cambridge breaths asks carl friston was asked if hurricanes have a markov blanket he said reluctantly no what would that say about markov blankets in general and is there any mathematical way to attribute markov blanket to a hurricane so i'm going to put up the image where we have the blanket states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4450.518,
    "end": 4454.34,
    "text": " whether it's a Markov or a Friston blanket and the internal states with a generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4454.66,
    "end": 4465.846,
    "text": "But what you just said there about the persistence through time of an inner loop, how would you relate that to this question about the hurricane and about what systems like is a hurricane conscious?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4467.087,
    "end": 4468.528,
    "text": "It has little inner loops, doesn't it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4468.568,
    "end": 4469.608,
    "text": "Little turbulent eddies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4470.089,
    "end": 4475.752,
    "text": "But what is it about the sort of like sustained memory and this inner looping?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4476.312,
    "end": 4477.392,
    "text": "Where does that come into play?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4477.453,
    "end": 4477.513,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4478.624,
    "end": 4490.886,
    "text": " Is that a way almost to go about identifying which systems, hint, hint, might be able to be measured as conscious because they'll have an internal dynamics that are complex?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4496.907,
    "end": 4499.488,
    "text": "No idea, especially with the hurricane.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4500.008,
    "end": 4504.249,
    "text": "But although a thought that I've been trying to think into recently is,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4507.255,
    "end": 4513.076,
    "text": " I'm wondering whether this inner loop might actually be important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4514.116,
    "end": 4533.54,
    "text": "So maybe we can only define a Markov blanket, a Friston blanket, Markov blanket, when you have this sort of separability and maybe only for these like inner loop processes, if you're not basically immediately being disrupted by the engagement where you can't draw the boundaries, just like immediately effaced.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4534.494,
    "end": 4547.344,
    "text": " And that would still, you could still do an inference, maybe that'd be kind of like, I don't know if it'd be a amortized inference, but it'd be like, you could still do inference and coupling, but it wouldn't be this, you wouldn't have these series of estimates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4547.404,
    "end": 4551.708,
    "text": "But the thing I'm wondering actually is whether in some ways,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4552.728,
    "end": 4560.391,
    "text": " the solution to the hard problem and the solution to what is life along the lines of Markovian monism, even though it might be one in the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4561.172,
    "end": 4579.02,
    "text": "And that like the boundary of life, non-life, the boundary of conscious, non-conscious, what actually makes for this adaptiveness is to have estimates which can evolve slightly independently from the world, such that you can do things like counterfactuals in terms of your modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4579.04,
    "end": 4581.401,
    "text": "So you can get this sort of, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4582.59,
    "end": 4590.654,
    "text": " sussing out of different possibilities and then using this as a means of surfing your uncertainty, your engagement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4590.894,
    "end": 4593.676,
    "text": "Now, I wouldn't want to go as far as to say that all life is conscious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4594.296,
    "end": 4596.837,
    "text": "I'm not personally of that view.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4597.438,
    "end": 4601.139,
    "text": "You can make a case for it because I want the additional coherence properties I don't think all life has.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4601.16,
    "end": 4611.545,
    "text": "But this idea, though, that the boundary problem of life and non-life, of unconscious information processing or unconscious perception and conscious perception, it might be exactly the same issue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4612.605,
    "end": 4630.782,
    "text": " let's connect it let's connect it to what the paper says because i think this is really what we're on the brink of so this is quotations from the paper this is about where free energy principle and active inference is going to step into some of these very challenging perennial questions like what is consciousness how do we measure it who gets to have it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4631.363,
    "end": 4640.09,
    "text": " So the first summary point of Wanja and Carl was according to free energy principle, we need to be thinking about neural dynamics, not just neural states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4640.41,
    "end": 4647.215,
    "text": "So I think that's very related to what we've been talking about, not just the states like, oh, well, this neuron has this action potential and this one's doing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4647.315,
    "end": 4649.497,
    "text": "We need to think about the trajectory through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4649.877,
    "end": 4651.258,
    "text": "So short, clean point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4651.779,
    "end": 4653.92,
    "text": "And the third point is also a short, clean point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4654.04,
    "end": 4659.905,
    "text": "It's more of like a literature claim, which is that other people's models were generalizing above them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4660.225,
    "end": 4662.249,
    "text": " Okay, so the first and the third point I think are,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.911,
    "end": 4691.783,
    "text": " short and sweet let's really go into the second point because it relates to what's the difference between being conscious and simulating consciousness people can have different opinions on this but this is where the authors are taking it and then what kind of biological or non-biological systems might have or be conscious so hurricane how about a pilot in the hurricane what if the hurricane yeah so what do they actually say here according to the free energy principle there's a relevant distinction to be made between the probabilities of the neural states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4692.884,
    "end": 4695.567,
    "text": " or the trajectories and the probabilities they encode.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4695.888,
    "end": 4703.779,
    "text": "So I think I had to read this a bunch of times because they sound so familiar, but it's basically saying there's the probability of the neural state itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4705.288,
    "end": 4715.922,
    "text": " which is like the probability that the brain is in that exact stance, which is actually never going to return to, and the probabilities that the brain is encoding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4716.763,
    "end": 4722.01,
    "text": "So, for example, if the brain is involved in a decision-making task,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4722.952,
    "end": 4730.136,
    "text": " there's the probability of the microstates of the brain, which you can go reduce all the way down and it's never gonna replicate those microstates.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4730.716,
    "end": 4737.8,
    "text": "So instead of focusing on the probability of the states or even the probabilities of the trajectories, which are always gonna be vanishingly zero,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4738.82,
    "end": 4753.096,
    "text": " we can think about what are the probabilities encoded by those states like the action readiness is this person in a global dynamic state where they're action ready to move like they're awake or they're not action ready so they're like asleep",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4754.178,
    "end": 4765.045,
    "text": " How are we gonna do this subtle shift from thinking about the probabilities of states and trajectories versus the probabilities encoded by states and trajectories?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4765.506,
    "end": 4779.175,
    "text": "Well, this is where they introduced the information geometry and they call this partitioning between the probability of the state and the probability encoded by the state as intrinsic versus extrinsic information geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4779.995,
    "end": 4785.976,
    "text": " So in line with this distinction, neural dynamics are movements on this intrinsic statistical manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4786.956,
    "end": 4799.119,
    "text": "And then the computational component, what the observer is modeling them as, what's the shortest algorithm that generates that behavior, that is movement on the extrinsic manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4799.939,
    "end": 4803.72,
    "text": "And so this relates to what is being conscious versus simulating it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4804.52,
    "end": 4811.249,
    "text": " For the Hurricane, let's just say, those two manifolds are actually mapped.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4811.77,
    "end": 4813.532,
    "text": "Like, there's no hidden states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4814.233,
    "end": 4818.398,
    "text": "The microstates and the macrostates are... They're...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4819.372,
    "end": 4820.674,
    "text": " they're one in the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4821.695,
    "end": 4834.088,
    "text": "Whereas when you have systems that are engaged in these very vanishingly rare microstates, but then they converge upon reproducible algorithmic or computational or behavioral features,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4835.049,
    "end": 4861.057,
    "text": " that partitioning can tell us something if there's a system where those are one in the same like it's a double pendulum and you're curious about its behavior it still could be chaotic but there's no like hidden interactors whereas there's other systems where computationally we have to approach them in a really different way i'm not sure if that's correct but that's kind of what we tried to um read about in this paper and explore where is the intrinsic and extrinsic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4862.54,
    "end": 4876.372,
    "text": " concepts coming into play, and how do we take all these interesting things that are happening here and move towards a definition or some sort of operationalization?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4876.752,
    "end": 4876.952,
    "text": "Adam?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4880.656,
    "end": 4881.336,
    "text": "Yep, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4883.098,
    "end": 4887.982,
    "text": "I don't know, but... That one stopped me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4889.864,
    "end": 4890.104,
    "text": "So...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4891.986,
    "end": 4899.71,
    "text": " I guess, so as I was saying before, I think actually we might want to think of consciousness as a kind of virtual machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4900.47,
    "end": 4908.474,
    "text": "And I think especially once we get to this sort of generative passages and these richer senses of consciousness, I think we're definitely dealing with a virtual machine in these cases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4910.155,
    "end": 4918.679,
    "text": "But in terms of this, maybe this place where it's this one-to-one mapping between the extrinsic and intrinsic,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4919.815,
    "end": 4922.737,
    "text": " manifolds is this one-to-one mapping of information geometries.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4924.858,
    "end": 4928.28,
    "text": "I guess at least within, kind of come back to brains.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4930.301,
    "end": 4944.168,
    "text": "So for instance, I focus on alpha frequencies because these are the, basically, if you look at like the scope of what could be synchronized, it's this big swaths of posterior cortices.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4945.429,
    "end": 4948.731,
    "text": "So about eight to 12 times a second, you can generate these metastable states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4949.278,
    "end": 4954.8,
    "text": " where the neurons are all basically more aligned in their activity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4955.0,
    "end": 4959.141,
    "text": "And so I think Pascal Fries would call this communication through coherence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4959.441,
    "end": 4962.202,
    "text": "You can actually get integration and message passing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4962.262,
    "end": 4976.266,
    "text": "And so I'm claiming that this is entailing basically some joint marginal of the sensorium, the engagement with the world, or potentially a maximum opposite or estimate thereof.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4976.526,
    "end": 4977.026,
    "text": "I don't know which.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4981.461,
    "end": 4990.945,
    "text": " And part of the relation, though, is I'm thinking that this would be maybe the first inner loop type process that you might get.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4991.906,
    "end": 5009.174,
    "text": "And in terms of its relation to the coupling of the worlds, it might have certain special properties in terms of... So I have this kind of weird idea that by the time you get to the precuneus, I mentioned, these posterior medial cortices,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5010.85,
    "end": 5030.053,
    "text": " that you're going to get these ensemble activity of neuronal ensembles, neuronal populations that would have a kind of chronotopic or consistent time varying relationship of the neuronal ensembles evolving and what's happening in the world on the organismic scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5031.194,
    "end": 5039.615,
    "text": "So it would be like, if I'm moving my hand like this, it's going above my eyes and there might be some mapping out into the ensemble activity, which is then changing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5040.566,
    "end": 5043.628,
    "text": " roughly at that time scale and you can detect this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5045.609,
    "end": 5069.763,
    "text": "What it would partially do to bring it together into this like Cartesian theater-esque thing would be is this would, I suspect it's potentially not even, there's some sort of not just chronotopic in terms of like a correspondence of time, there might even be kind of quasi topographic Euclidean properties of it in terms of the ability of, for instance,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5070.287,
    "end": 5076.952,
    "text": " what's in the mind's eye to actually couple with the oculomotor system, which itself is going to have a kind of coherent topography.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5078.253,
    "end": 5089.542,
    "text": "But I guess the idea is that the idea would be that these",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5097.523,
    "end": 5111.59,
    "text": " So I'm basically thinking of consciousness as discrete updating of the generative model, which at 8 to 12 times a second, in terms of phenomenal consciousness, and that these discrete updates, if you look at them, they're actually inner.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5111.771,
    "end": 5112.411,
    "text": "They're divorced.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5112.991,
    "end": 5117.814,
    "text": "And so there's not a direct mapping by the time that these functional cycles achieve closure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5118.634,
    "end": 5125.998,
    "text": "And so I don't know if this is consistent or not with Juanjo and Carl's arguments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5126.778,
    "end": 5131.664,
    "text": " So the 8 to 12 part seems like that's an implementation-specific detail, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5131.704,
    "end": 5136.49,
    "text": "Because that's related to our... So it could be totally important for us, but it may not be a general feature, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5136.83,
    "end": 5139.313,
    "text": "Now, let's look at this equation set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5140.763,
    "end": 5150.308,
    "text": " Um, we're thinking about this intrinsic extrinsic information approach, and it's saying it's saying the free energy of the policy of the doubt.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5150.608,
    "end": 5154.491,
    "text": "It's a little confusing because pie is used to mean policy in almost all situations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5154.531,
    "end": 5158.573,
    "text": "But here I think pie is actually comprising blanket states and internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5159.133,
    "end": 5161.555,
    "text": " So it's a slightly different pi variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5161.575,
    "end": 5162.636,
    "text": "We could get that clarified.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5163.137,
    "end": 5170.404,
    "text": "But the point is that the system is going to be acting as if it's minimizing the difference between accuracy and complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5170.804,
    "end": 5180.914,
    "text": "Now, in the case of, let's call it a one-to-one system, like whether it's a double pendulum, which is a chaotic system, it's simple, but it's chaotic, or it's a hurricane with turbulence and Reynolds numbers,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5181.875,
    "end": 5190.759,
    "text": " If it's a one-to-one system, it's not acting as if it's co-optimizing this trade-off of accuracy and complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5191.32,
    "end": 5196.102,
    "text": "Even if you said, well, the hurricane is like a model of its environment, it's just, it's actually, it's a perfect model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5196.122,
    "end": 5197.803,
    "text": "It's not minimizing the complexity at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5198.939,
    "end": 5201.62,
    "text": " Just not making an absolute claim, just saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5202.08,
    "end": 5223.545,
    "text": "On the other hand, if you take the intentional stance and you're thinking about an agent and that agent is acting as if it is minimizing the difference between accuracy and complexity, that means that it's extrinsic information manifold is rich according to this LZ complexity metric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5224.454,
    "end": 5226.936,
    "text": " So when they're the same, there's no delta.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5227.336,
    "end": 5228.777,
    "text": "It just is that system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5229.157,
    "end": 5235.281,
    "text": "So it's almost like when you have a total state space representation and the mapping, there's actually not that much more you need to express.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5235.301,
    "end": 5241.145,
    "text": "You say, well, yeah, the chatbot said I'm conscious and I love the Beatles, but that's because that's what was preloaded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5241.625,
    "end": 5250.331,
    "text": "So when you have the full, and that's actually why the neuroreductionist direction, I believe, is ultimately fallacious because let's just say you had every atom in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5250.571,
    "end": 5250.891,
    "text": "Then what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5251.111,
    "end": 5251.832,
    "text": "Are we conscious or not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5252.412,
    "end": 5255.513,
    "text": " but people are acting like just a few more measurements or a couple more EEGs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5255.773,
    "end": 5255.933,
    "text": "No.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5256.913,
    "end": 5270.196,
    "text": "On the other hand, when we think about separating the internal and the external information geometry, if we find systems that have a big delta, they're acting really, really as if they're minimizing accuracy minus complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5271.136,
    "end": 5280.858,
    "text": "And that extrinsic information manifold, we could say whether it is LZ or another type of complexity, but that extrinsic manifold is complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5281.806,
    "end": 5286.429,
    "text": " Like a human might get a tweet every hour and then engage in some like super interesting behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5287.03,
    "end": 5292.373,
    "text": "That would be a big divergence between the intrinsic and the extrinsic manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5293.294,
    "end": 5298.457,
    "text": "And the extrinsic behavior would be difficult to compress with respect to the inputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5299.178,
    "end": 5301.919,
    "text": "So that might lend it a higher complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5301.979,
    "end": 5303.38,
    "text": "So there's sort of two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5303.42,
    "end": 5309.545,
    "text": "There's how much does it look like it's minimizing its free energy according to this structure?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5312.376,
    "end": 5332.084,
    "text": " is the extrinsic information manifold complex and then what are the measures of complexity i know that's like a bunch of random stuff i'm trying to trace the argument of the paper because these might be the kinds of measurements or comparators even relative measurements or ratios that help us understand um adam so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5343.803,
    "end": 5357.648,
    "text": " I guess the first speak to what you're saying about the generalization and to not get too bogged down by the specifics of how it might be realized within, for instance, the mammalian nervous system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5358.068,
    "end": 5360.929,
    "text": "I think that's really important and I don't want to do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5364.11,
    "end": 5367.431,
    "text": "I think some of the principles would generalize.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5367.451,
    "end": 5368.371,
    "text": "And so for me, the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5374.602,
    "end": 5403.04,
    "text": " I'm wondering whether actually, in terms of this closure with respect to action perception cycles, that actually this is potentially double the frequent, or you're nesting actually two quail states within a broader envelope, a functional cycle that closes on a slower time scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5404.18,
    "end": 5414.607,
    "text": " And so for the brain, this would be something like theta potentially orchestrated by something like the Campbell system, which might be doing this kind of comparator operation as a kind of like contrastive energy-based learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5415.107,
    "end": 5432.297,
    "text": "But this would be like a more general thing where you might need to be doing is comparing things and like for the organism to adaptively navigate the world and generate a causal model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5434.901,
    "end": 5456.125,
    "text": " It might be that you have this more extended generative passage level unfolding, and that within there, you're forming other nest densities or harmonics at other timescales that you can then use these as objects, which you then compare between and put in relation to each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5456.145,
    "end": 5464.047,
    "text": "And so any system, I'm thinking you would have, like, essentially these nested Markov blankets where some of them would correspond to, like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5464.346,
    "end": 5469.128,
    "text": " the system as a whole and its engagement with the world where this is its own best model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5469.188,
    "end": 5477.653,
    "text": "And it's just the whole, it's a perfect mapping with like the hurricane or the whirlpool example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5478.493,
    "end": 5493.481,
    "text": "But then you're then getting basically on, as you move inwards or outwards, you're getting these other nest densities forming on different timescales, which are then encompassing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5494.268,
    "end": 5496.148,
    "text": " their Markov blankets encompass the other ones.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5496.588,
    "end": 5500.389,
    "text": "And some of these, I think we really should be thinking of these in terms of virtual machines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5500.929,
    "end": 5504.11,
    "text": "You can't point to it at any given point and say, aha, there you are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5504.67,
    "end": 5509.411,
    "text": "And it might actually extend not even within the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5509.831,
    "end": 5511.631,
    "text": "It would be within and between.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5511.651,
    "end": 5513.411,
    "text": "It would be relational out into the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5514.211,
    "end": 5523.293,
    "text": "And I'm personally suspecting that there's this like, within like this onion of nested Markov blankets, some of them corresponding,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5523.959,
    "end": 5537.722,
    "text": " to different, some of them corresponding to virtual machines, some of them corresponding to the world as its own best model or the world as model, that there might be a point where it's like, aha, there you are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5538.102,
    "end": 5541.122,
    "text": "I'm personally thinking this is for the mammalian brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5541.222,
    "end": 5542.542,
    "text": "It's at the alpha frequency.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5543.103,
    "end": 5545.643,
    "text": "But it would just be at that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5545.843,
    "end": 5550.924,
    "text": "And so I guess the one more thing would be, in terms of the difference between simulation and emulation,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5551.795,
    "end": 5562.68,
    "text": " I actually think in the figure that Wanda showed where he had the description of the von Neumann architecture and then you had this memory register with the terms from active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5565.401,
    "end": 5574.326,
    "text": "I think that mixed ontology is revealing and it could potentially",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5576.208,
    "end": 5594.777,
    "text": " mislead and that I'm wondering whether by the time we've committed ourselves to having these kinds of active sensory and blanket states that you can put into that memory register of the von Neumann architecture, we actually ought to be core screening differently and we shouldn't be thinking of the von Neumann architecture anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5594.817,
    "end": 5600.319,
    "text": "It's actually I don't know if you can actually do brilliant analysis on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5600.379,
    "end": 5603.881,
    "text": "I think it's like it might break the rules of causal inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5605.051,
    "end": 5605.931,
    "text": " Totally agree with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5606.392,
    "end": 5615.056,
    "text": "Whether it's Lambda, Calculus, or some other algorithmic description, the current implementations of computers are only one way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5615.156,
    "end": 5621.059,
    "text": "And so if we mistake the map for the territory or the specific for the general, then we're going to be like, well, it's the RAM.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5621.159,
    "end": 5625.282,
    "text": "And then this channel, you know, if you lesion the RAM, it doesn't have short-term memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5625.422,
    "end": 5629.324,
    "text": "Doesn't that sound like these computationalist reductionist researchers?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5629.904,
    "end": 5636.706,
    "text": " because they are working sort of not clearly whether it's general or specific, brain or computer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5637.166,
    "end": 5643.788,
    "text": "And then the quote that that reminded me of, it's by John Muir, the Californian forest lover.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5644.348,
    "end": 5652.19,
    "text": "He wrote, \"'I only went out for a walk \"'and finally concluded to stay out till sundown \"'for going out I found was really going in.'\"",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5653.05,
    "end": 5657.934,
    "text": " So it's like, I went out for a walk, it's action planning, and finally concluded to stay out till sundown.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5658.394,
    "end": 5660.015,
    "text": "Deep temporal inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5660.836,
    "end": 5669.341,
    "text": "For going out, I was really going in because when he was in the niche acting and inferring, he was being himself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5669.382,
    "end": 5672.244,
    "text": "And so it really captures like a lot of these dimensions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5673.328,
    "end": 5675.61,
    "text": " that we're getting at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5675.81,
    "end": 5679.353,
    "text": "And then also I'll raise a question from Cambridge Breaths in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5679.993,
    "end": 5682.315,
    "text": "And it's related to what you said about the nested systems, Adam.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5682.996,
    "end": 5692.023,
    "text": "Cambridge writes, can we have a non-metacognitive conscious entity, so to speak, or are consciousness and metacognition inseparable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5693.089,
    "end": 5697.931,
    "text": " So we've used this idea of self-reflexive, autopoetic, autonoetic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5697.991,
    "end": 5699.192,
    "text": "It's come up a ton of times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5699.932,
    "end": 5703.414,
    "text": "Are those one and the same to be aware, conscious, and recursive?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5704.194,
    "end": 5709.076,
    "text": "Or might there be some differentiating wedge somewhere?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5712.117,
    "end": 5716.719,
    "text": "I mean, I guess it depends what we mean by metacognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5716.759,
    "end": 5721.882,
    "text": "So if we're talking about a very minimal metacognition, I think what would be necessary in terms of...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5723.237,
    "end": 5748.778,
    "text": " a way i think you might be able to think of like precision weighting as a kind of minimal metacognition and um and even like on what levels are you doing your precision weighting but this might be essential because you can't do good inference uh without it like for it to be base it's this combination of precision weighted probabilities that's what gives it its power is weighing things by the relative reliability or part of what does that like the ability to like iteratively refine",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5749.6,
    "end": 5761.546,
    "text": " Um, by leveraging your priors, but the, and so we're going to need at least precision waiting to have probably any kind of coherent world modeling, whether it's exactly Bayesian or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5762.107,
    "end": 5771.732,
    "text": "Um, you know, but it's gotta be Bayesian-ish enough, I think in order for there to be coherence, um, you need to be able to take the reliability of information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5772.192,
    "end": 5776.274,
    "text": "And so these precision estimations could be, for instance, entailed",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5777.329,
    "end": 5802.954,
    "text": " on many different levels they might be for instance entailed um mammalian so they might be just emergent and distributed um through this like game of free energy minimization taking place among all these distributed coupling elements but there might even be also like centralized control structures which help to give you additional levels of precision weighting things like um cingulate cortices potentially or um the pulvinar and like um a",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5803.809,
    "end": 5809.376,
    "text": " The thalamus, part of what might make that so essential for humans would be its precision weighting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5809.416,
    "end": 5822.352,
    "text": "And you might see in a variety of systems, there might be like, even like within a cell, I don't know, but there could be like, you need some sort of like centralized integration structures for this more global precision weighting to occur.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5823.547,
    "end": 5823.968,
    "text": " Not sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5824.608,
    "end": 5827.172,
    "text": "But in terms of like metacognitive, go on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5827.452,
    "end": 5839.547,
    "text": "Oh, just to bring it to the frist in formalisms or formulisms, like what would you say that idea connects to when we're thinking about how it was formulated in the paper?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5843.174,
    "end": 5857.067,
    "text": " You know, to ground the conversation for listeners and for ourselves, like, when we ground it in the formalisms, then we can say, well, I don't think the formalism is trying to describe the right thing, or I don't think it correctly describes what we're agreed upon is the correct thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5859.108,
    "end": 5868.9,
    "text": " And a lot of times it's easy to invoke these formal frameworks, but then never clarify what our mapping is between like, okay, there's a kinetic, a path independent and a path dependent term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5869.46,
    "end": 5873.905,
    "text": "Sounds like kind of relevant, but then I'm not exactly sure that it's going to transmute into qualia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5874.146,
    "end": 5877.43,
    "text": "And that's like that gap that we want to be sort of hammering out again and again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5881.328,
    "end": 5886.899,
    "text": " I mean, in terms of actually thoroughgoingly connecting back to the formalism, you got the wrong guy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5892.458,
    "end": 5898.061,
    "text": " I think though this would be at least, I think actually consistent with like Marc Solme's perspective also.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5898.481,
    "end": 5903.044,
    "text": "For him, consciousness is inherently metacognitive and he is relating it to precision weighting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5903.064,
    "end": 5910.248,
    "text": "But in terms of exactly with this more, in terms of Markovian monism, that I don't know how to describe that well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5910.528,
    "end": 5913.649,
    "text": "But I guess I had one more thing in terms of like the way I'm thinking about it, which would be,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5915.347,
    "end": 5928.715,
    "text": " I personally think that you can have, in contrast to a higher order thought type theory, that you actually... So there's some theories which, for instance, try to collapse these different senses of consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5928.735,
    "end": 5933.699,
    "text": "And they would reject, for instance, potentially, the difference between phenomenal and access consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5933.719,
    "end": 5942.384,
    "text": "And they would say, you do need these high-level features for there to be anything at all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5944.921,
    "end": 5949.865,
    "text": " And I personally, um, if it depends on the richness of what we mean by metacognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5949.885,
    "end": 5952.187,
    "text": "So if we're saying precision waiting, then I'd say yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5952.907,
    "end": 5960.113,
    "text": "If we're saying though, things like, um, auto-noesis or like reflective self-consciousness, then I'd say probably not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5960.233,
    "end": 5961.113,
    "text": "We, you don't need that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5961.133,
    "end": 5967.778,
    "text": "I think there could be something that it's like, and you could be generating qualia and these could just pop up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5967.898,
    "end": 5972.542,
    "text": "There was something that it's like as they were being, as they are emerging and then.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5973.331,
    "end": 5974.792,
    "text": " They go away as soon as they were there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5975.572,
    "end": 5977.554,
    "text": "And you weren't able to reflect on them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5977.594,
    "end": 5981.616,
    "text": "You weren't able to compare them, potentially.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5982.156,
    "end": 5987.76,
    "text": "And you even less so were able to contextualize them with relation to yourself and time in a rich sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5988.32,
    "end": 5989.38,
    "text": "I think that's quite possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5991.422,
    "end": 5998.566,
    "text": "So I don't think you need the more rich kinds of metacognition to have consciousness in terms of the appearance of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5999.667,
    "end": 6002.812,
    "text": " for the appearance of a world to be like our appearance of a world, then you do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6003.253,
    "end": 6010.205,
    "text": "But in terms of just the appearance of any kind of world, any kind of what it is like this or what it feels like this, I don't think you need that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6011.483,
    "end": 6030.33,
    "text": " i i really love that connection it's like there's the what it's to be like whatever it is but then the way that we actually experience or any given individual experiences is so cultural it can really never be disentangled for example people will tell you just yeah there's xyz it's three axes and they're orthogonal at 90 degrees",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6031.05,
    "end": 6038.396,
    "text": " Except if you grew up studying synergetics and Buckminster Fuller, then there's four spatial dimensions and the orthogonal angles are 60 degrees.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6038.976,
    "end": 6047.823,
    "text": "So is it really a fact of the world that it's XYZ or is that just something that's culturally reified in the way people talk about the world and how they measure and how they communicate?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6048.343,
    "end": 6055.989,
    "text": "And so it's always like this question about what are the general attributes, but you never observe the genus, the general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6056.129,
    "end": 6058.271,
    "text": "You always observe the species, the specific.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6058.951,
    "end": 6067.054,
    "text": " And so we are in a little bit of a triple bind because we don't know what consciousness is, how to measure it, or what the observables are per se.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6067.954,
    "end": 6070.075,
    "text": "And it's sort of like, it's a catch-33.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6070.355,
    "end": 6081.879,
    "text": "You have to solve them all in one approach because if you're observing something and you're like, oh, it's all about the EEG and you're going way down the rabbit hole with a four-year transform, I mean, who's to say?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6082.46,
    "end": 6085.401,
    "text": "That might be just actually going down the wrong path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6086.141,
    "end": 6094.865,
    "text": " or it might be a very valuable piece of information or it is reducing our uncertainty about something, but it may or may not be related to the general question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6094.945,
    "end": 6102.749,
    "text": "It might be related like, yes, it turns out that this wavelength is a differentiator of whether someone is going to experience pain or remember pain during surgery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6103.229,
    "end": 6107.531,
    "text": "It's so important because we don't want to have people who are suffering unnecessarily.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6108.031,
    "end": 6110.972,
    "text": "But then again, is that the general answer to consciousness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6113.277,
    "end": 6136.639,
    "text": " interesting questions and then also to show wanja's 2020 paper 7 11 2020 with these different ways that consciousness behavior and information could be linked and then i added a little qualia maybe consciousness is qualia like you know what if there's a thought without a thinker or a thinker without a thought or there's all these different options and um it's also just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6137.611,
    "end": 6144.794,
    "text": " It's a space where there's a lot of possible perspectives in the scientific literature, in the neuroscientific literature of the last, say, 200 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6146.015,
    "end": 6152.678,
    "text": "It's only one facet of a really nuanced story of humans understanding their local world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6152.738,
    "end": 6154.799,
    "text": "So it's just really awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6154.919,
    "end": 6158.36,
    "text": "And we'll have just time for a couple more thoughts and questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6158.42,
    "end": 6161.742,
    "text": "But yes, Adam, and then Dave, if you'd like to add anything, feel free.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6171.581,
    "end": 6173.882,
    "text": " You know, I don't hear you for some reason, Adam, but you're not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6174.142,
    "end": 6176.143,
    "text": "Oh, yeah, go for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6177.143,
    "end": 6184.666,
    "text": "I personally like making consciousness synonymous with qualia, and that's the IIT stance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6185.366,
    "end": 6200.952,
    "text": "But in terms of what you were saying with respect to different types of senses of space, and in general, what you're pointing out in general is trying to find non-question-begging uses of terminology",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6201.559,
    "end": 6202.362,
    "text": " and claims.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6207.284,
    "end": 6212.886,
    "text": " So for instance, within my own thinking, I talk about spatial, temporal, and causal coherence, but at which level?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6213.407,
    "end": 6221.77,
    "text": "And actually, there's a little bit of an ambiguity there in my thinking that it's actually, I think, it's showing up and entering at every scale, but in different ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6222.33,
    "end": 6235.256,
    "text": "So for instance, you could think of a certain just entailed, and for instance, having a hierarchical predictive memory system, just having something like a hierarchical structure like cortex, you might have itself some element of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6235.735,
    "end": 6264.57,
    "text": " spatial and temporal coherence built in just there via things like um at the initial levels having a topographic mapping to the world and then preserving that to some degree and maybe reintroducing it again later but this idea of like some degree of preserving of space time being preserved by some sort of coupling and then some sort of uh homomorphism and maybe some sort of increasing temporal depth of nested causes that unfold in different time scales via",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6265.62,
    "end": 6270.542,
    "text": " a hierarchy where the deep levels are things that are unfolding more slowly, so you're getting some time just there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6271.762,
    "end": 6284.586,
    "text": "And cause, you might even think of something like spike-timing-dependent plasticity, where you wire up the system based on the predictive information coming in the right order as being like a kind of proto-causal prior since, like, causes ought to precede effects.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6285.386,
    "end": 6294.709,
    "text": "However, that's a different sense than, like, for instance, a richer sense that might be important for the appearance of a world of space-time and cause.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6295.336,
    "end": 6297.298,
    "text": " where it would come in, for instance, in terms of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6299.38,
    "end": 6301.061,
    "text": " potentially something that's more constructed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6301.501,
    "end": 6303.622,
    "text": "So what type of space are we dealing with?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6304.122,
    "end": 6308.604,
    "text": "If you're in like this Buckminster Fuller world, that might be a very different sense of space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6308.664,
    "end": 6318.567,
    "text": "It might not be X, Y, Z. And there might be a different sense of time for you and a different sense of cause by the time we get to phenomenalities or rather, I think it is a different sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6320.148,
    "end": 6327.591,
    "text": "And then there might be yet another sense in terms of like the intersubjective and the higher, like the more narrative meaning making",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6328.044,
    "end": 6337.849,
    "text": " of space time and cause where it's like the metaphors we use about space and time and the ways we construct these like linguistically and like these higher order semantics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6338.369,
    "end": 6342.391,
    "text": "And then these might couple as priors for each other in all sorts of interesting ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6343.111,
    "end": 6357.318,
    "text": "So, um, there's like ambiguity there or like there's, um, and I guess to kind of come back to this idea of like, so I've been thinking that, um, uh, you couldn't think of like within global neural workspace theory,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6358.687,
    "end": 6365.07,
    "text": " that I kind of generalize it a bit and that I treat the workspace as not just this like fronto parietal network.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6365.59,
    "end": 6382.737,
    "text": "I would consider it to be a type of workspace and potentially a type of virtual machine workspace of where it's involving these action perception cycles being closed, like these kind of fictive imaginative action perception cycles or real ones.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6382.897,
    "end": 6385.958,
    "text": "But you could also think of, let's say you're just having like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6386.343,
    "end": 6394.705,
    "text": " the estimates of the sensorium, like you're getting these nest densities or self-organizing harmonic modes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6395.425,
    "end": 6409.968,
    "text": "If you're getting big swaps of cortex, all engaging in marginal messaging, all communicating their beliefs together to create a joint estimate of the engagement of the system with its world, it may not involve the whole system, but if it's big enough, I still consider that to be consistent with a global workspace.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6410.468,
    "end": 6415.269,
    "text": "It's big, it's allowing multiple things to do this ensemble slash federated learning and inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6415.95,
    "end": 6423.593,
    "text": " creating the synergy, getting a whole that's greater than someone's parts, making information more globally available or creating like fame in the brain, as Denna called it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6424.093,
    "end": 6426.154,
    "text": "And so I'd say like, that's still very, that's a workspace.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6426.194,
    "end": 6428.575,
    "text": "It's a sort of iterated Bayesian model selection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6429.195,
    "end": 6431.476,
    "text": "But like within, but what do we mean by workspace?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6432.177,
    "end": 6437.059,
    "text": "And how much, when we say workspace, at some levels, do we mean spatial itself?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6437.339,
    "end": 6440.36,
    "text": "Is it like, is the workspace itself a kind of space?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6441.26,
    "end": 6444.161,
    "text": "And, but now to what degree is it a constructed space?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6444.221,
    "end": 6445.582,
    "text": "And what kind of constructed space?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6447.194,
    "end": 6469.556,
    "text": " ah and global oh well of course i don't mean like the globe global i mean like you know something else it when things are universal global basic there's so many adjectives that um help people share memes and ideas but really don't always reduce uncertainty about what's being discussed",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6470.157,
    "end": 6475.123,
    "text": " because they're being used in explicitly a non-helpful way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6475.764,
    "end": 6484.574,
    "text": "And so it's always a challenge to parse out and translate, sometimes even on the fly, which...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6485.655,
    "end": 6491.318,
    "text": " types of usage are actually like, okay, attention is actually supposedly about the thing we're talking about here, but global, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6491.338,
    "end": 6492.798,
    "text": "It's a totally different usage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6493.178,
    "end": 6497.42,
    "text": "And there's a bunch of times where in the same sentence, you have words that are like really drawn from different namespaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6497.941,
    "end": 6499.941,
    "text": "They're drawn from quite different views.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6500.022,
    "end": 6500.142,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6500.222,
    "end": 6500.422,
    "text": "Adam.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6500.442,
    "end": 6504.003,
    "text": "And then Dave, you ever want to add anything, go ahead and raise your hand, but go ahead, Adam.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6504.644,
    "end": 6512.127,
    "text": "Just a quick thought is it's like, in general, I think part of it is like, we need to use more words and not argue so much about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6512.828,
    "end": 6519.171,
    "text": " What words mean is if we're receiving them from Plato's philosopher king, they came on to us on high as this ideal form.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6519.711,
    "end": 6522.432,
    "text": "Rather, words as tools and making them useful tools.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6522.973,
    "end": 6530.156,
    "text": "And we're going to want to probably stick as much as we can to common usage in folk psychology as much as we can.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6530.836,
    "end": 6531.697,
    "text": "But sometimes we won't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6531.777,
    "end": 6540.821,
    "text": "But basically trying to find the one that captures the senses of use that we tend to use.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6542.21,
    "end": 6562.579,
    "text": " as much as we can, but also while sometimes pushing back on our common understandings, but I think along this though, using more words like phenomenal consciousness, access consciousness, maybe we want to break those down further.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6565.2,
    "end": 6570.202,
    "text": "There's a limit to what we can do before the tools become not serviceable in our hands, but I think",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6571.107,
    "end": 6578.872,
    "text": " we definitely should be using more than like, I think people are tending to expect like this one-to-one mapping of word to the relevant natural kinds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6579.532,
    "end": 6580.913,
    "text": "And I think that's a problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6580.953,
    "end": 6588.397,
    "text": "I think that's, uh, I think we should at least two words, maybe as many as three, more than that, I think is a problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6588.877,
    "end": 6593.2,
    "text": "Um, but I'd say two words would do so much better for always using two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6594.32,
    "end": 6594.841,
    "text": "Thanks Adam.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6595.041,
    "end": 6595.461,
    "text": "Um, Dave.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6597.682,
    "end": 6598.203,
    "text": "Yeah, the, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6599.494,
    "end": 6606.758,
    "text": " You mentioned Plato, the latest edition of Sean Carroll's Mindscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6606.778,
    "end": 6628.028,
    "text": "The guest says there's two scholars in China who are explicit and proud followers of Leo Strauss, and they have followed his method and read all the works of Plato, each one of which proves that Xi Jinping is the perfect leader and that a world that he rules is the best of all possible worlds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6630.689,
    "end": 6638.499,
    "text": " And could you please send me an invitation to the Markovian monism talk, please?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6638.779,
    "end": 6641.622,
    "text": "Thanks for the statements and claims and questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6641.842,
    "end": 6642.483,
    "text": "Yes, so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6644.594,
    "end": 6646.995,
    "text": " Yeah, go ahead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6647.315,
    "end": 6660.878,
    "text": "In terms of one concrete debate in consciousness studies, for instance, it seems like a lot of the dispute between global neural workspace theory and ingrained information theory could be resolvable, and them just talking about consciousness in different senses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6661.098,
    "end": 6662.959,
    "text": "And if we add additional words, this would become clear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6663.439,
    "end": 6670.361,
    "text": "So instead of fighting, engaging in this death match, if the word will be this, there can be only one, it would be like, okay, so maybe...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6671.241,
    "end": 6699.004,
    "text": " iit is focusing on phenomenality and maybe um gnwt is focusing on access and when iit says that the physical and potentially computational substrates of consciousness are tend to be corresponding to posterior hot zone they might be largely correct and when gnwt says it's actually a more broadly distributed frontal parietal nexus they might be correct also but on one case they're talking more about phenomenal conscious",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6699.734,
    "end": 6712.802,
    "text": " in one case you're talking more about access consciousness and so like there's this huge like adversarial collaboration happening but actually I'm worried that it's all in the wrong terms assuming that like one framework will be the victor when actually it should be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6713.76,
    "end": 6720.282,
    "text": " Not that you're all right in a wash that way, but sure, let's go for a minimal unifying model, I want to say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6720.782,
    "end": 6726.024,
    "text": "But there might be like, this minimal model might take in both parties and they might be happy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6726.584,
    "end": 6731.365,
    "text": "IIT people might be happy, GNWT people might be happy if we just use more words.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6732.826,
    "end": 6733.026,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6734.146,
    "end": 6734.426,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6734.666,
    "end": 6735.567,
    "text": "No one has to be wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6736.747,
    "end": 6738.347,
    "text": "You might be, but no one has to be wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6738.748,
    "end": 6739.468,
    "text": "I'll give a take on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6739.528,
    "end": 6739.988,
    "text": "Dave, though?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6741.223,
    "end": 6751.143,
    "text": " Yeah, maybe some of the folks who helpfully remind us that the map is not the territory should just go back and read Science Insanity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6752.822,
    "end": 6753.382,
    "text": " Sounds good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6753.502,
    "end": 6769.748,
    "text": "And what I kind of got out of there with consciousness, and this is, I guess, hopefully an approach we're enacting and carrying through is how are we going to share the tools, maybe statistical parametric mapping, SPM toolkit, maybe the developing active inference toolkit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6770.288,
    "end": 6773.589,
    "text": "How are we going to share the tools and align on action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6774.389,
    "end": 6789.341,
    "text": " that is within everyone's affordance, within everyone's niche, rather than zero in on the eternal, essential, and truly fundamental differences in our perspectives and contexts, you're not gonna get people to agree on what a pizza is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6789.881,
    "end": 6793.502,
    "text": " You're not going to get people to agree on what culture is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6793.862,
    "end": 6797.323,
    "text": "And so we're way, way, way past physical objects here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6798.003,
    "end": 6811.426,
    "text": "And so how are we going to have a story and an approach field where we can come together and reduce our uncertainty about our physiology and our emotional responses, which are part of our physiology process?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6812.006,
    "end": 6823.215,
    "text": " and focus on potentially the before the decimal point shared reality rather than the after the decimal point divergences in the seventh adjective or the list ordering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6823.756,
    "end": 6823.916,
    "text": "Adam?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6827.999,
    "end": 6837.367,
    "text": "I think that what you're saying, actually, in some ways, that's the essence of like the way to proceed in that, like I said, no one has to be wrong because we all have to be wrong all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6837.827,
    "end": 6840.109,
    "text": "Like all, you know, all models, all metaphors are wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6840.129,
    "end": 6840.87,
    "text": "Some of them are useful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6841.619,
    "end": 6843.739,
    "text": " And we're going for maximal use.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6844.22,
    "end": 6847.54,
    "text": "And it's not saying that this is a postmodern wishwash and anything goes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6848.06,
    "end": 6858.162,
    "text": "But there's going to be some uses of terminology that are more or less helpful for getting at basically different grips on the latent world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6858.902,
    "end": 6863.243,
    "text": "And for which all of our words are mere approximations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6864.523,
    "end": 6865.244,
    "text": "There is a world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6865.604,
    "end": 6867.204,
    "text": "There are better and worse ways to describe it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6867.534,
    "end": 6871.479,
    "text": " but these better and worse ways of describing it, there's always an interest and it's our interests.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6872.22,
    "end": 6878.508,
    "text": "And so I think bringing like basically our values back into the picture, hopefully our shared values and this being,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6880.452,
    "end": 6881.492,
    "text": " That's how you have to proceed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6882.072,
    "end": 6883.053,
    "text": "I totally agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6883.073,
    "end": 6902.798,
    "text": "I think that the movement that is reflected by people calling for transparency or interpretability or reproducibility in machine learning, let's say, it reflects a desire to be able to really weave together who is being served and who's being influenced and our values with technical details.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6903.418,
    "end": 6904.939,
    "text": "And so it's just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6905.953,
    "end": 6920.621,
    "text": " It's been special and been really interesting to think about how something that, you know, you could call out some technical component, but it provides a starting place for actually fully intertwining our values in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6920.721,
    "end": 6931.106,
    "text": "And yeah, it's gonna be a tight rope to walk between everyone's correct, no one's correct, everyone is neither correct nor uncorrect, or everyone's involved in a process of correction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6931.606,
    "end": 6934.588,
    "text": "How are we gonna move from the essentialist claims, like who's right and who's not,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6935.268,
    "end": 6944.033,
    "text": " or which subcomponent of myself are correct or not to a broader story of whatever it ends up being in different people's perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6944.053,
    "end": 6951.097,
    "text": "And there wouldn't be any sequence of words, English or otherwise, from any speaker that is going to end up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6952.927,
    "end": 6978.852,
    "text": " being the end all because they're just it's like the finger in the moon you're pointing at the moon you're not pointing to the spot at the tip of your finger it's something far far away and something aspirational so that's how the words are and especially with the consciousness you know again even with the food like i would say that food could be an aspirational or an asymptotic or a platonic thing but then this is like quite",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6980.04,
    "end": 6981.901,
    "text": " wrapped up in our own experience, of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6982.321,
    "end": 6985.182,
    "text": "So thanks so much to the two of you guys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6985.282,
    "end": 6992.504,
    "text": "Any last thoughts or just what does this excite you about moving forward?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6994.165,
    "end": 7004.968,
    "text": "Or what would be some next thoughts or just imagine some archetype of some listener or viewer and what would you suggest to them, ask them?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7004.988,
    "end": 7009.15,
    "text": "I mean, for me,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7011.299,
    "end": 7018.721,
    "text": " It's both fundamental, the question, what is consciousness?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7018.781,
    "end": 7019.361,
    "text": "What is life?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7019.741,
    "end": 7020.421,
    "text": "Who am I?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7020.481,
    "end": 7021.622,
    "text": "What's going on?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7022.182,
    "end": 7027.683,
    "text": "It's of an existential, meaningful character, these conversations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7028.343,
    "end": 7040.226,
    "text": "But I also think, basically, I'm hoping that we're getting close to bringing back in consciousness in a meaningful way into science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7042.21,
    "end": 7054.917,
    "text": " kind of overcoming basically a kind of behaviorist legacy where it kind of made sense to make some things somewhat taboo for a time because we didn't feel like we had purchase, but then that taboo became maybe stifling and tyrannical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7055.258,
    "end": 7065.564,
    "text": "I don't know if we've completely shrugged it off yet, but there's a sense where by we try to be as precise as we can, we contextualize, you know, what are our value commitments?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7065.904,
    "end": 7070.187,
    "text": "What is the specific way in which we're using terminology in this case, trying to be as precise as we can.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7071.109,
    "end": 7076.89,
    "text": " I think we might be at a point where we can start to bring things like consciousness back in without having to be embarrassed about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7077.51,
    "end": 7087.152,
    "text": "And I think this embarrassment actually did something really bad, which basically took your experience and removed it out of the scientific discourse and basically made it unreal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7087.752,
    "end": 7099.514,
    "text": "And I think we're going to discover not only was this bad for us personally, interpersonally, but it was bad for us scientifically because I actually suspect that consciousness is the maximally important element",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7099.969,
    "end": 7112.777,
    "text": " informational and energetic object in at least our minds and that this we basically hid the main story we made taboo telling the main story and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7113.827,
    "end": 7115.089,
    "text": " We made taboo different things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7115.109,
    "end": 7118.812,
    "text": "Part of the reason we didn't have purchase was that we were being imprecise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7118.852,
    "end": 7123.217,
    "text": "It was hard, but part of it was we made taboo the things we would need to make purchase, so phenomenology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7123.697,
    "end": 7128.002,
    "text": "We made experience taboo, and then we wondered why it was so hard to make purchase on consciousness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7128.542,
    "end": 7134.848,
    "text": "No one was talking about embodiment, and then we're like, hmm, why aren't I able to cross explanatory gaps with a giant flailing leaf?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7135.785,
    "end": 7143.891,
    "text": " And that, unfortunately, in a historical and a cultural context, it led to divide and conquer of academia.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7144.071,
    "end": 7149.835,
    "text": "It led to the bifurcation of non-academic experience with academic research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7149.975,
    "end": 7153.437,
    "text": "It led to disciplinary, unneeded friction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7153.937,
    "end": 7155.058,
    "text": "I really agree with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7155.999,
    "end": 7164.585,
    "text": "It's like it was a scientific error to think that the finger was pointing at the tip of the finger and say, well, because we don't know exactly the detail, we're going to not just...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7165.325,
    "end": 7172.269,
    "text": " you know, write a review paper and then go back to our lab, we're going to go on stage and we're going to tell people that they're zombies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7172.289,
    "end": 7176.791,
    "text": "We're going to tell people that they're robots or we're going to tell them this is how the brain generates consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7177.211,
    "end": 7180.253,
    "text": "And so that's why I'm always excited to hear about new research in the field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7180.693,
    "end": 7190.538,
    "text": "But I would hope that kind of like coffee and cream, like it would always be blended with a recognition that it's an open question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7190.598,
    "end": 7192.579,
    "text": "It's an experienced, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7194.168,
    "end": 7195.289,
    "text": " it's something we're experiencing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7196.089,
    "end": 7201.412,
    "text": "And so we're not just gonna cut it and dry it, leave on stage, 15 minute talk, it's done.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7202.092,
    "end": 7213.377,
    "text": "Because think about how many thousands of those lectures have been delivered in the last hundred years from when today's nurse, oh, that was too early, but they were just being enthusiastic to today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7213.397,
    "end": 7220.301,
    "text": "And that's tens of thousands of people or however many people who got pushed in a different direction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7221.201,
    "end": 7231.067,
    "text": " Because, um, using legacy credentials, they were told their experience was not concordant with science, which is really something that's hard to estimate the impact of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7233.209,
    "end": 7243.536,
    "text": "One more thing would be, I want, I'm also open to, there might be some things that might be cut and dry and I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7243.736,
    "end": 7247.278,
    "text": "So for instance, one of them could be at questions like it's possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7248.029,
    "end": 7256.831,
    "text": " that depending on which senses of consciousness we mean, that there might be cut and dry versus more graded distinctions we should be looking for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7256.891,
    "end": 7260.872,
    "text": "So it could be, or it could not be the case that basic phenomenality is cut and dry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7260.892,
    "end": 7261.352,
    "text": "We don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7261.372,
    "end": 7271.054,
    "text": "I have thoughts on this, but one thing would then kind of later coming in, this might have relevance now for things like animal rights, and this might have relevance going forward",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7271.601,
    "end": 7277.863,
    "text": " for things like the future of AI, maybe can we create artificial general intelligence?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7277.883,
    "end": 7287.306,
    "text": "And then when, if, and when we do, if we survive long enough and if we're smart enough, will these be morally relevant agents or will they be part of our moral communities?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7288.087,
    "end": 7292.848,
    "text": "And so whether things are graded or not, it could end up being crucial.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7292.868,
    "end": 7300.671,
    "text": "There might be some cases where it's like, aha, once we nailed down our use of words based on our interests and we have like this many qualifiers, we feel like, okay,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7301.24,
    "end": 7305.484,
    "text": " This is the optimal grip on like numeral space, whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7305.504,
    "end": 7308.527,
    "text": "This is like the optimal grip on the world, on latent space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7308.848,
    "end": 7310.69,
    "text": "And you say, okay, cut and dry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7311.45,
    "end": 7312.111,
    "text": "But it might not be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7312.592,
    "end": 7315.755,
    "text": "But these might be the most important questions ultimately that we can ever ask.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7316.416,
    "end": 7319.118,
    "text": "And here's where I think active inference might speak to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7319.198,
    "end": 7323.062,
    "text": "Dave, then, if you want to add anything or not, is here's where it's cut and dry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7323.743,
    "end": 7325.544,
    "text": " the observables, sense and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7326.144,
    "end": 7341.488,
    "text": "And so we can be clear about what we're cutting dry and say, here's how using the theory of information processing, we're talking about auditory processing, but then to go that next level of emotional salience and say, and this is why you hear this when this happens,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7342.108,
    "end": 7359.4,
    "text": " That's the part where it can be clarified that there's things that are basically cut-and-dry models, but those are cut-and-dry because they've been partitioned from a broader field of discussion, not because one day the cut-and-dry is going to be everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7359.821,
    "end": 7370.028,
    "text": "It's actually like everything isn't that way, and we've made these islands of stability that are despite that, not like the other way around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7370.308,
    "end": 7370.448,
    "text": "So...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7372.54,
    "end": 7373.741,
    "text": " Dave, any last comments?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7374.601,
    "end": 7375.222,
    "text": "Thanks so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7375.342,
    "end": 7378.204,
    "text": "This was really, really awesome conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7378.444,
    "end": 7384.527,
    "text": "As always, appreciate the live participants and those in the live chat and watching later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7385.128,
    "end": 7390.951,
    "text": "This is it for actually the first quarter of 2021 for ActiveStream, pretty fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7391.552,
    "end": 7394.414,
    "text": "Next week, we're gonna be having our quarterly round table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7394.514,
    "end": 7399.377,
    "text": "So if anybody wants to make like a three to five minute video for this one or a future round table, they're welcome to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7400.197,
    "end": 7404.199,
    "text": " then we're going to be having these upcoming events.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7404.559,
    "end": 7411.022,
    "text": "So it's going to be just on with the show and the learning and doing and participating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7411.122,
    "end": 7413.103,
    "text": "So thanks everyone and see you later.",
    "speaker": "SPEAKER_01"
  }
]