[
  {
    "start": 35.725,
    "end": 36.128,
    "text": " Thank you."
  },
  {
    "start": 41.701,
    "end": 46.722,
    "text": " Hello and welcome everyone to the Act-Inf Lab to our quarterly roundtable number four.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 47.023,
    "end": 52.384,
    "text": "That was our first ever playing of a musical intro by Dee Shvakov.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 52.704,
    "end": 56.065,
    "text": "So thank you for that and happy birthday to Yvonne.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 57.326,
    "end": 65.508,
    "text": "So welcome to this fourth lab meeting to our end of 2021 discussion, not quite, but almost.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 66.828,
    "end": 68.509,
    "text": "Welcome to Act-Inf Lab everyone.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 69.332,
    "end": 76.06,
    "text": " We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 76.38,
    "end": 79.044,
    "text": "You can find us at the links here on this slide.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 79.945,
    "end": 85.491,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 86.57,
    "end": 89.093,
    "text": " All backgrounds and perspectives are welcome here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 89.914,
    "end": 92.837,
    "text": "And we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 92.897,
    "end": 97.102,
    "text": "So just make sure to raise your hand in Jitsi because no one will be called on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 97.162,
    "end": 99.624,
    "text": "But if you want to add anything, please feel free.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 99.685,
    "end": 102.588,
    "text": "Just raise your hand in Jitsi and we will get to it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 104.83,
    "end": 128.786,
    "text": " today the way that it's going to work we're going to address the lab scale we'll have introductions then we'll talk about some updates at the lab scale and then we'll go into spending most of the meeting discussing the updates at the organizational unit scale and then talk about the future but first we can say hello and just introduce ourselves",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 130.211,
    "end": 130.791,
    "text": " I'm Daniel.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 130.991,
    "end": 135.553,
    "text": "I'm a researcher in California, and I'll pass it first to Dean.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 137.194,
    "end": 137.974,
    "text": "Hi, my name is Dean.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 138.134,
    "end": 142.916,
    "text": "I'm in Calgary, Canada, and I'll pass it to David.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 144.736,
    "end": 157.521,
    "text": "Yep, I'm in the mountains of the Philippines and pumped up that I can stop writing code in a new language and write code in another new language for a while, preferably Sumo.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 162.153,
    "end": 162.413,
    "text": " Yvonne.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 166.397,
    "end": 167.799,
    "text": "Hello, my name is Yvonne.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 167.879,
    "end": 168.7,
    "text": "I'm in Moscow.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 171.222,
    "end": 176.027,
    "text": "I'm a researcher in System Management School and Active Inference Lab.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 180.972,
    "end": 181.713,
    "text": "Alex or Steven?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 187.611,
    "end": 188.591,
    "text": " Hello, I'm Steven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.912,
    "end": 194.614,
    "text": "I'm here in Toronto, just in North York, just north of Toronto at the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.594,
    "end": 203.258,
    "text": "And I work a lot with embodied sense making and spatial approaches and community development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 203.558,
    "end": 206.159,
    "text": "And I'll pass it over to Alex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 208.496,
    "end": 208.856,
    "text": " Thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 209.797,
    "end": 210.678,
    "text": "Yes, I'm Alex.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 211.198,
    "end": 217.984,
    "text": "I'm in Moscow, Russia, and a researcher in active inference and system thinking.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 219.625,
    "end": 220.806,
    "text": "So thanks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 221.867,
    "end": 222.168,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 222.288,
    "end": 224.93,
    "text": "And RJ, if you would like to say hi.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 225.931,
    "end": 226.371,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 226.992,
    "end": 227.652,
    "text": "I'm RJ.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 227.672,
    "end": 229.614,
    "text": "I'm in New York in the US.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 230.375,
    "end": 235.919,
    "text": "I'm a non-resident fellow at the Atlantic Council, and I do research on sensemaking and knowledge management.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 236.66,
    "end": 236.78,
    "text": "Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 238.001,
    "end": 258.477,
    "text": " well thanks everyone for joining this will be a fun discussion maybe some more will join in um and anybody who's watching live can just ask a question in the live chat we're going to start with the updates at the lab scale so actin flab updates",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 260.345,
    "end": 289.645,
    "text": " we started this year with a interactive and participatory mission slash vision slash project which was to ask whether active inference could develop into a community and a field and all that comes along with that while also drawing on the best practices that we saw elsewhere especially in systems engineering",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 290.405,
    "end": 316.876,
    "text": " and uh community of practice that yvonne and alex had a lot of familiarity with and other experiences that we and every participant brings to the table uh having a community for active inference that was participatory and accessible for those with many different backgrounds and trainings having a body of knowledge that includes courses and competencies things we'll talk about soon and also",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 318.217,
    "end": 336.461,
    "text": " reflected the nature of modern work and professionalism and collaboration so these are just a few of the things that we wrote down long long ago and it's still a living document so please come get involved all actions are participatory stephen",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 338.479,
    "end": 350.962,
    "text": " I was thinking we could also say a community of communities, a nested set of communities inside a community that overlap in the kind of Markovian sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 352.883,
    "end": 353.123,
    "text": "Yes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 353.943,
    "end": 356.404,
    "text": "Let's graphically look at that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 357.401,
    "end": 361.865,
    "text": " So this is a little updated graphic and I hope it looks good for everyone.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 363.146,
    "end": 370.612,
    "text": "So on the right side in the gray background, we have the structure of the Act-Inf lab itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 371.153,
    "end": 374.335,
    "text": "So this is the lab scale that we're addressing in this section.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 375.416,
    "end": 398.01,
    "text": " we have three primary organizational units which are comms communications edu education and tools tools we also have dot admin but they won't be presenting on projects today also in the actinf lab we have some of the pieces of the puzzle that we have gleaned from systems engineering community and other areas",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 399.031,
    "end": 405.393,
    "text": " And we're going to be talking more about the advisory board soon and about other initiatives that we're undertaking.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 405.613,
    "end": 406.994,
    "text": "So that's sort of inside the lab.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 407.054,
    "end": 408.514,
    "text": "This is the lab scale.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 408.895,
    "end": 411.836,
    "text": "Under the lab blanket, we have our organizational units.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 413.316,
    "end": 422.219,
    "text": "Dotcoms is outputting different products into the broader ecosystem, like externalities or runoff.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 422.76,
    "end": 425.961,
    "text": "And so that's kind of this teal scroll image.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 427.353,
    "end": 431.855,
    "text": " And .coms is really our primary interface with the external ecosystem.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 432.715,
    "end": 438.158,
    "text": "We can think about this external ecosystem as containing all kinds of different things in it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 439.078,
    "end": 447.662,
    "text": "So there's artifacts, there's texts like papers and videos and all kinds of other documents and artifacts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 448.302,
    "end": 451.264,
    "text": "And then there's also people and their skills and their connections.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 452.024,
    "end": 456.586,
    "text": "So we can start in with this red bounded box of the current body of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 457.987,
    "end": 481.694,
    "text": " relevant publications which as we've seen stretches back and forward and left and right so there's a lot of relevant publications but there is a relevant body of publications and we have used a live stream format kind of like a journal club to go into the publications themselves each live stream is centered around a publication which we'll talk more about in comms",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 483.37,
    "end": 505.348,
    "text": " comms produces a guest stream which bridges from that circle of established knowledge and people into broader interactions amongst participants and the topics that they're interested in like a two-way street between let's just say active inference and field x so some people are going to be hearing about active inference for the first time others are going to be inside of active inference hearing about x for the first time",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 506.309,
    "end": 523.909,
    "text": " And then we look forward to having increasingly broad avenues to communicate like Orgstream that help to bridge even one step further and outside of the realm of just research and development, maybe thinking more about practice and all the different ways that people around the world are",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 524.589,
    "end": 549.729,
    "text": " engaged in practices every day that may be related to or influenced by active inference so here's kind of this nested ecosystem of circles like an onion around the active inference literature sensu strictu and then all the ways that our outputs into the ecosystem help to scaffold and modify and uh catalyze sense making in that environment which can be overwhelming",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 551.383,
    "end": 569.275,
    "text": " Also, which we picked up on from the systems engineering practices and community organization, we've engaged in several development initiatives, which we'll talk more about in the sections that are relevant, but the ontology working group is upskilling and learning about ontology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 569.955,
    "end": 573.697,
    "text": " and the systems thinking reading discussion group is doing similar for systems thinking.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 573.777,
    "end": 592.444,
    "text": "So we'll talk more about those, but this is just our initial forays into some of the kinds of products and lab functions that are important and we hope serve a positive role inside the lab and affect a positive outcome outside the lab in our local niche.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 592.964,
    "end": 594.545,
    "text": "So there's our internal states,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 595.532,
    "end": 600.974,
    "text": " over on the right side, and then there's our niche modification products in the left side.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 602.574,
    "end": 605.695,
    "text": "Any comments that somebody would like to add here?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 612.117,
    "end": 612.357,
    "text": "Stephen?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 615.998,
    "end": 623.2,
    "text": "Yeah, I suppose I like to think about how the ontology working group is hopefully helping to bridge",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.275,
    "end": 631.738,
    "text": " and fill a gap in the complexity of all the different ways that active inference gets used.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 632.018,
    "end": 640.202,
    "text": "So it's kind of hopefully going to help for that applied active inference to be more multidisciplinary, interdisciplinary, transdisciplinary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.302,
    "end": 644.984,
    "text": "No small task, but I think it's a useful endeavour.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 646.431,
    "end": 646.771,
    "text": " Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 647.232,
    "end": 647.492,
    "text": "Agreed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 648.273,
    "end": 652.718,
    "text": "And there's the ontology itself as a product in the niche.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 654.259,
    "end": 659.605,
    "text": "So multiple representations are very important for distributed systems, for complex systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 659.665,
    "end": 666.452,
    "text": "This is kind of a snapshot visual layout, but we can also look at more of a narrative overview.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 667.614,
    "end": 687.898,
    "text": " So just to recap, during 2020, Vyotkin et al, that's Alex and others, including many on this discussion now, collaborated on a paper that was released as a preprint on September 9th, 2020, called Active Inference and Behavior Engineering for Teams.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 688.398,
    "end": 696.92,
    "text": "So this is as close to a prerequisite for understanding the narrative and the context of the Act-Inf Lab as exists at this point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 698.214,
    "end": 705.78,
    "text": " After completing that paper, we sent out an initial call for collaboration with an Active Inference Lab.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 706.681,
    "end": 707.481,
    "text": "And that was at the end of 2020.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 708.862,
    "end": 718.59,
    "text": "During 2021, we engaged starting at the beginning of January in our first year of Active Lab activities, many of which we're going to be talking about today.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 718.69,
    "end": 720.711,
    "text": "That's kind of our recap moment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 722.393,
    "end": 724.034,
    "text": "And then we're going to also be looking forward to 2022.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 725.908,
    "end": 727.949,
    "text": " So this is like a sandwich.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 727.969,
    "end": 732.292,
    "text": "We're gonna have the two pieces of bread right now, and then that will be our appetizer.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 732.372,
    "end": 735.494,
    "text": "And then we're gonna spend most of it on the meat itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 735.754,
    "end": 739.176,
    "text": "So it's an odd sandwich, but please, what do you expect?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 740.096,
    "end": 745.699,
    "text": "In 2022, we're gonna do a few things similarly and a few things differently.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 746.4,
    "end": 749.502,
    "text": "So on the similar but different wavelength,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 750.242,
    "end": 755.847,
    "text": " we are going to be continuing to implement our projects and plans within each organizational unit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 756.087,
    "end": 759.87,
    "text": "So that's what we're going to discuss today in the organizational unit sections.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 760.33,
    "end": 764.974,
    "text": "It's what we talk about every week when we meet in the organizational units.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 765.314,
    "end": 766.375,
    "text": "So that kind of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 767.296,
    "end": 788.499,
    "text": " homeostatic or functional operation of the lab is the substance of what we're actually doing and so that is going to continue we're also bringing a few new ideas and structures to the table and practices so one is the inaugural advisory board cohort which we'll talk about on the next slide and then a little bit on the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 789.713,
    "end": 813.489,
    "text": " not having their own slide of their own but important ideas that we look forward and call for participation around formalizing the lab governance there have been so many important and interesting governance questions that have arisen during the past year as well as everyone experiencing similar challenges in their own located and online teams so that's something we want to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 814.309,
    "end": 822.406,
    "text": " understand better and then also as we learn more and embody and enact decentralized science or dsi",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 823.604,
    "end": 853.07,
    "text": " everything that comes along with this from who's doing research what questions are they asking how is it funded how is it communicated how is it verified the whole research stack is evolving so welcome to the 2020s and we want to understand how we as a lab can take the best aspects that are emerging from this domain of dsi while not getting lost in the technicalities or committing grievous ecological errors",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 854.713,
    "end": 856.794,
    "text": " Anything else that anyone wants to address?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 857.134,
    "end": 861.356,
    "text": "These were just a few of the kind of top level points that we all worked on when we were preparing the slides.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 861.876,
    "end": 862.096,
    "text": "Dean?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 864.017,
    "end": 866.218,
    "text": "Yeah, I think this is a fantastic summary.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 866.538,
    "end": 873.942,
    "text": "And I think for people who are kind of new to this or maybe are still constantly sort of evolving their basic understanding of this,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 875.321,
    "end": 897.83,
    "text": " I think what we're seeing right here on this slide is the tension between a lot of constant updating, which is kind of what the Active Inference Tool enables, and then the piece about, okay, so these are the things that we've established, the kind of top-down, consistent, constant, stable things",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 898.61,
    "end": 902.472,
    "text": " that we think have some shelf life and can carry forward.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 902.512,
    "end": 910.037,
    "text": "So I think by showing this sort of chronologically, we're sharing with the audience the fact that there is a tension.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 910.077,
    "end": 916.18,
    "text": "There isn't one constant that is going to take over and there isn't a constant updating mean.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 916.22,
    "end": 918.482,
    "text": "We're always throwing out the baby with the bathwater.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 919.102,
    "end": 928.553,
    "text": " And I think you may not necessarily hear or see that in a timeline, but I think that's front and center in terms of how we organize ourselves.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 928.633,
    "end": 940.286,
    "text": "We organize ourselves with the intention of remaining in a tension, that constant updating versus what's stable and is carried forward.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 941.769,
    "end": 943.33,
    "text": " Thanks, Dean, and welcome, Blue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 943.39,
    "end": 944.19,
    "text": "Great point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 944.39,
    "end": 952.235,
    "text": "And it is like the nesting of models in Active Inference where there's a slower tick at the deeper scale of the model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 952.275,
    "end": 956.317,
    "text": "So every year there's 12 ticks for months, and then within a month there's more and more.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 957.017,
    "end": 962.82,
    "text": "And that takes us to the advisory board, which is something structurally that we're introducing in 2022.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 965.177,
    "end": 974.133,
    "text": " So this lab advisory board, first we can say it's not a formal voting or governance, hashtag not legal advice, not financial advice.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 974.213,
    "end": 975.456,
    "text": "They're not our managers.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 976.317,
    "end": 978.02,
    "text": "It's a advisory board.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 979.414,
    "end": 994.466,
    "text": " The advisory board is helping to move the temporal scale of the labs organizing from the kind of day to day, sometimes it felt like we were just putting out little surprises all the time, to the annual scale and beyond.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 994.767,
    "end": 998.53,
    "text": "So as we think about deepening the deepest level of our model,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 999.431,
    "end": 1004.095,
    "text": " for vision and for alignment while also refining the finer points in our model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1004.135,
    "end": 1007.218,
    "text": "That's kind of like the eye circadian is like the micro scale.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1007.278,
    "end": 1010.521,
    "text": "And then we have deeper levels like semantics of vision.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1011.042,
    "end": 1013.864,
    "text": "So that's kind of the way that we think about these temporal scales.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1014.972,
    "end": 1021.175,
    "text": " And we're already in the process of onboarding individuals with expertise in a variety of important domains.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1022.056,
    "end": 1028.019,
    "text": "But please contact us if you have any interest before, say, the middle of December of 21.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1029.46,
    "end": 1036.123,
    "text": "And you might want to be involved in this inaugural cohort of the annual role at this point for the advisory board.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1037.372,
    "end": 1040.254,
    "text": " or we'll be there to onboard you in 23.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1041.174,
    "end": 1048.079,
    "text": "What we do when we onboard them in the advisory board, just to be clear, and because many of them will be listening to this discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1049.059,
    "end": 1054.823,
    "text": "First, we make personal contact with organizers and have consensus amongst lab organizers about that invitation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1055.603,
    "end": 1057.165,
    "text": " And we'll have more governance for that in the future.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1058.025,
    "end": 1064.392,
    "text": "We then have a live meeting with a potential board member and assign them to one or more organizational units.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1064.772,
    "end": 1067.615,
    "text": "So no side doors, no free floating.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1068.436,
    "end": 1069.416,
    "text": "I'm here, but where?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1069.937,
    "end": 1071.979,
    "text": "Everybody is in an organizational unit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1072.76,
    "end": 1080.047,
    "text": "And then we describe the specific synchronous and asynchronous affordances and roles and requirements that the advisory board members will engage in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1080.527,
    "end": 1083.708,
    "text": " So it's not just an open-ended ask for you to do work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1084.108,
    "end": 1088.41,
    "text": "It's actually a very structured conversation that will hopefully be win-win.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1088.73,
    "end": 1093.492,
    "text": "So we're really looking forward to the advisory board's service.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1093.912,
    "end": 1096.853,
    "text": "Does anyone want to add any comments on the advisory board?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1097.533,
    "end": 1101.555,
    "text": "And we'll probably hear more from them once we've confirmed the personnel.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1101.595,
    "end": 1104.356,
    "text": "But right now, we're still in the onboarding phase.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1107.802,
    "end": 1112.324,
    "text": " Okay, any other lab scale comments before we go into the organizational units?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1116.307,
    "end": 1124.171,
    "text": "Okay, our first organizational unit as a educational nonprofit is .edu education.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1126.727,
    "end": 1136.233,
    "text": " What we're going to do for each of the organizational units is we've just copied from our CODA document, which we'll talk more about, we've just copied the ongoing projects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1136.914,
    "end": 1145.94,
    "text": "So the idea is these kinds of single source of truth and centralized ways of working together allow us to have an asynchronous lab.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1146.44,
    "end": 1151.063,
    "text": "And then also when we need to present and share, we just take screenshots or copy out tables.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1151.163,
    "end": 1152.664,
    "text": "So that keeps it really efficient.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1152.704,
    "end": 1156.067,
    "text": "These are the six projects or five projects that we have in EDU.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1156.747,
    "end": 1160.45,
    "text": " So these are not the total scope of all the projects happening by participants.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1160.55,
    "end": 1164.512,
    "text": "These are within the organizational units markup blanket.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1165.633,
    "end": 1171.257,
    "text": "The goal of EDU is to scaffold a participatory and dynamic active inference body of knowledge.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1172.158,
    "end": 1175.96,
    "text": "So these five projects are the current active threads.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1176.621,
    "end": 1182.305,
    "text": "And if you see a space to improve one of these or add another one, then get involved.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1183.359,
    "end": 1185.981,
    "text": " So onto the first one of these projects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1186.201,
    "end": 1188.382,
    "text": "This is the Friston Symposium transcript.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1188.802,
    "end": 1192.124,
    "text": "So I'll summarize it, and then Dave, if you'd like to add a comment or anyone else.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1193.125,
    "end": 1203.751,
    "text": "So in June, 2021, we had our first Applied Active Inference Symposium with Professor Carl Friston, and each of the three organizational units had about a one hour session.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1204.551,
    "end": 1209.496,
    "text": " The videos are watchable and many insightful things were said and discussed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1210.277,
    "end": 1222.271,
    "text": "So the idea of this project is to use automated speech to text processing plus manual copy editing and enrichment of those texts to get an accurate transcript of the discussions",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1222.911,
    "end": 1227.718,
    "text": " so that we can upload it as a preprint, get a DOI, and make it citable.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1228.359,
    "end": 1235.308,
    "text": "So instead of, oh, I think somewhere somebody said this thing, let's have in text something we can copy out.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1236.471,
    "end": 1255.546,
    "text": " and connect core terms to translations, use it for the captioning of the YouTube videos for accessibility, and then looking beyond this one important symposium we had this year towards transcripts for maybe all live streams and integration more thoroughly with the ontology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1255.926,
    "end": 1259.328,
    "text": "So translation of terms, linking to other knowledge resources.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1259.869,
    "end": 1262.771,
    "text": "So that's the Fristin Symposium transcript.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1263.331,
    "end": 1265.233,
    "text": "Dave or anyone else, do you want to add a comment?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1267.392,
    "end": 1276.886,
    "text": " Yeah, the three transcripts are in Daniel's and Blue's and some other people's hands.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1277.927,
    "end": 1278.108,
    "text": "And...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1281.627,
    "end": 1284.169,
    "text": " As much markup as folks want to do, that's fine.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1284.209,
    "end": 1290.755,
    "text": "If you want to just take what I've got and make them perfect and get all the cross references and so on, that's great.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1290.795,
    "end": 1298.522,
    "text": "If you want to just mark up the change of speakers and maybe throw in some obvious paragraph.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1299.363,
    "end": 1302.568,
    "text": " Terminations, just empty lines, that's fine.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1304.55,
    "end": 1313.884,
    "text": "And I have the option later on of just doing some automated cleanup, trying to find end of sentences that aren't marked otherwise.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1314.565,
    "end": 1314.825,
    "text": "But...",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1316.67,
    "end": 1322.554,
    "text": " You know, I think this is going to be somewhat quicker than just taking the raw YouTube output.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1322.634,
    "end": 1323.514,
    "text": "Well, we shall see.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1325.015,
    "end": 1332.059,
    "text": "Next year, after some other things, I'm going to go in and improve the program a lot more, do the stuff that I thought I would have finished by now.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1332.119,
    "end": 1340.524,
    "text": "But, you know, when I can't change the parser and I have to live with the parse that I've gotten, it's only got half of the vocabulary and I got to get around that.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1341.185,
    "end": 1342.025,
    "text": "It takes longer.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1342.385,
    "end": 1343.446,
    "text": "So it's good.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 1344.488,
    "end": 1347.489,
    "text": " If you can't parse the one you want, parse the one you have.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1347.509,
    "end": 1348.409,
    "text": "Stephen?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1350.93,
    "end": 1366.674,
    "text": "Yeah, I was thinking that one thing to think about when we have these talks with Kristen and these presentations is we're able to, as well as clarify the stuff which is already possible to do and separate it from",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1367.557,
    "end": 1378.14,
    "text": " what is, you know, is beyond our knowledge at the moment, we get this zone of proximal development, the Vykovsky, which our Russian friends will be very fond of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.04,
    "end": 1386.422,
    "text": "So that idea of where we can be, we get a sense of where the sort of the extension of what the established knowledge might be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.442,
    "end": 1389.423,
    "text": "And I think that's also a useful thing to clarify.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.523,
    "end": 1393.284,
    "text": "Because that's also part of where these applications are going to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.114,
    "end": 1398.815,
    "text": " Good point, we're not just recapping memorized facts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1399.896,
    "end": 1401.996,
    "text": "That's the Friston Symposium transcript.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1402.376,
    "end": 1406.678,
    "text": "The second project in .edu is the Ontology Working Group.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1406.918,
    "end": 1416.001,
    "text": "So in Ontology Working Group, we are reading this textbook by Adam Peace, the Ontology, a practical guide textbook.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1416.901,
    "end": 1442.312,
    "text": " And the bigger picture here is that there's a continuum of formality and expressivity of what is called ontology, ranging on the left side from mere terms lists through more structured and enriched terms lists, like structured glossaries and informed hierarchies, verging towards more formal data structures that allow increasing computational efficiency",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1444.229,
    "end": 1446.431,
    "text": " power in many different dimensions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1447.272,
    "end": 1450.896,
    "text": "And over here, the sun rising in the east of Sumo.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1451.757,
    "end": 1457.903,
    "text": "And Sumo is the language and the framework that's discussed in the textbook, suggested upper merged ontology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1458.484,
    "end": 1462.308,
    "text": "So that's what we're learning about in the ontology working group.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1462.548,
    "end": 1463.93,
    "text": "And we meet every two weeks and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1464.41,
    "end": 1468.752,
    "text": " We discuss what we've read and work through the exercises together.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1469.552,
    "end": 1487.138,
    "text": "And over the course of the year, the ontology working group has been kind of pushing like a little train towards further and further writes from just the terms list that we started at in the beginning of the year to a lot more, which we'll talk about soon.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1487.578,
    "end": 1493.16,
    "text": "But the ontology working group is specifically those who are learning ontology by doing and reading the textbook.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1494.318,
    "end": 1497.24,
    "text": " Any thoughts or comments on ontology working group?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1497.46,
    "end": 1500.583,
    "text": "And we'll talk about the ontology more broadly in just a few slides.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1502.965,
    "end": 1503.165,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1504.946,
    "end": 1513.813,
    "text": "So another development initiative, which I'll allow Ivan to summarize is the systems thinking, reading and discussion group.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1513.973,
    "end": 1517.816,
    "text": "So Ivan, maybe you could summarize the intention or the background here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1521.098,
    "end": 1521.779,
    "text": "Yes, thank you.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1522.984,
    "end": 1535.613,
    "text": " Well, initially the system thinking course was represented by System Management School in Moscow and we decided to provide a common language for the lab.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1537.454,
    "end": 1551.164,
    "text": "All of us from different domains with different perspectives and we decided that it will be awesome where we can understand one another better.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1553.125,
    "end": 1577.059,
    "text": " here we gave some small example when where one object can be described a totally different one person can hear can see here face and another less and once of them",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1578.968,
    "end": 1593.918,
    "text": " talk about leaps they totally come to misunderstanding to prevent this situation this group",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1595.029,
    "end": 1600.391,
    "text": " Could you go to the next page?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1600.991,
    "end": 1603.892,
    "text": "There is the interface of the course.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1604.972,
    "end": 1612.955,
    "text": "This is an online course based on ISO standards and formal documents.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1615.596,
    "end": 1642.572,
    "text": " that include system approach in engineering and in different a lot of fields and of course the course has a list of concepts that",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1647.08,
    "end": 1665.88,
    "text": " interconnect with the active inference concepts and every participant can now apply to the course and in appropriate",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1667.502,
    "end": 1675.528,
    "text": " way start to learning system and thinking as System Management School provides.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1676.309,
    "end": 1687.018,
    "text": "The course has eight sections now, a lot of tasks to check your understanding.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1687.918,
    "end": 1693.483,
    "text": "You can find all information about the course on systemschool.com.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1695.097,
    "end": 1695.737,
    "text": " Thank you, Yvonne.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1695.817,
    "end": 1703.14,
    "text": "And also you and others translated it from the Russian to this English course, which were beta testing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1703.3,
    "end": 1707.101,
    "text": "So it's being offered for free and we provide them feedback.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1707.141,
    "end": 1712.483,
    "text": "So it's a cool relationship between our groups that helps benefit our participants.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1713.423,
    "end": 1715.824,
    "text": "Any comments on STRDG?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1720.365,
    "end": 1729.874,
    "text": " One of the main projects in .edu, something we spend half or more of each meeting on is the actual Active Inference Ontology itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1730.735,
    "end": 1736.26,
    "text": "So here we're showing just the top page of the working Active Inference Ontology.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1736.34,
    "end": 1740.824,
    "text": "We released versions, more stable versions earlier in the year.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1743.106,
    "end": 1744.728,
    "text": "We're working through the core terms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1746.007,
    "end": 1751.691,
    "text": " And then for each core term, getting a bunch of references and quotable, citable definitions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1752.131,
    "end": 1758.515,
    "text": "So not saying that they're the truth, just how it was used, you know, a system is a, or blanket states are.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1759.336,
    "end": 1765.12,
    "text": "Then each week we have a discussion on these terms, one term per discussion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1765.2,
    "end": 1769.583,
    "text": "And we kind of go deep and hear many different perspectives and gather more resources.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1770.123,
    "end": 1772.625,
    "text": "And then we work towards proposed",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1773.385,
    "end": 1789.18,
    "text": " synthetic definitions that synthesize in the term of synthetic not artificial that bring together a few of the senses or clarify is there just one sense or are there multiple senses that the term is being used and then the terms themselves",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1789.961,
    "end": 1796.865,
    "text": " as well as how the terms are connected to one another will form some of the early versions of our educational materials.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1797.566,
    "end": 1803.069,
    "text": "So how about that five minute video that everyone has always wanted about what is a Markov blanket?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1803.649,
    "end": 1807.232,
    "text": "Or that five minute video about how is a generative model",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1807.972,
    "end": 1834.272,
    "text": " related to epistemic and pragmatic value those are the kinds of questions that we want to have like a video but more importantly this deep knowledge linking underlying so just that's the first cover sheet and then i'll get to you steven um the second sheet has translations of those core terms into human languages so we have russian portuguese spanish french and italian very well completed",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1835.438,
    "end": 1839.42,
    "text": " we're definitely looking for more languages to be added.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1839.621,
    "end": 1852.329,
    "text": "So if you're speaking or learning any language, then it would be awesome even just to do two or five words, terms, because that helps",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1853.382,
    "end": 1860.166,
    "text": " modify the niche so that stigmatically another language speaker may be able to pick up where you left off.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1860.246,
    "end": 1882.199,
    "text": "So this would be extremely helpful and important global work for somebody who speaks one of these languages or any language to start to pin together just with the terms at first, this active inference corpus, which is primarily written in English as a natural language, mathematics and computer languages as technical languages.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1882.759,
    "end": 1888.264,
    "text": " So we'll be able to operate better across those different human and technical languages.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1888.885,
    "end": 1894.55,
    "text": "And then the last sheets of this tab here just show the supplemental terms and equations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1895.11,
    "end": 1897.732,
    "text": "So the equations, that's going to be a long game with...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1898.686,
    "end": 1906.135,
    "text": " corralling the formalism and how that has evolved and how different letters have meant different things through different times, but then also supplemental terms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1906.495,
    "end": 1918.989,
    "text": "There's so many fun terms that come up in our discussions, but they're not necessarily core or they may be, we may update them and put them in the core later, but things that people bring up that like,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1919.79,
    "end": 1944.619,
    "text": " are cool and important to learn about and link around we can add that to the the term supplement so we kind of get to have a big gutter with a term supplement while also having a very curated core terms list that'll be the basis of education so stephen yeah i'd just like to also thank again ivan and alex there for bringing in that systems work i think that's really valuable and i think this um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1945.618,
    "end": 1951.719,
    "text": " as you mentioned there, the different languages are also useful because even different languages have different ways of thinking about time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1952.139,
    "end": 1953.12,
    "text": "They have different cultural.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1953.48,
    "end": 1964.782,
    "text": "So if we're looking at pluralism, but also trying to clarify and get ways to have common languages, this is going to be actually extends that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1966.002,
    "end": 1971.504,
    "text": "And I, one other thing I'd like to mention is that it can build the bridge with the field of coaching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1971.684,
    "end": 1972.824,
    "text": "I think that coaching is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.425,
    "end": 1978.69,
    "text": " systemic coaching and ontological coaching are two very fast growing fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1978.831,
    "end": 1987.599,
    "text": "And I know from the literature that they're really moving into looking at pluralism and different types of social construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.3,
    "end": 1988.74,
    "text": "And I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.801,
    "end": 2002.025,
    "text": " So this, before it was a bit of a bridge too far, but I think with this work as well from Alex and Ivan and this other work with the ontology, that is starting to make it not a bridge too far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2002.185,
    "end": 2003.946,
    "text": "Hopefully it's spannable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2005.063,
    "end": 2005.323,
    "text": " Thanks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2005.964,
    "end": 2006.484,
    "text": "Very cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2007.265,
    "end": 2012.569,
    "text": "The last project to discuss in .edu is course development itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2012.869,
    "end": 2017.153,
    "text": "You know, what people expect of a .edu to engage in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2018.093,
    "end": 2021.416,
    "text": "And we know this is one of the most important projects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2021.796,
    "end": 2032.785,
    "text": "And we also knew that ontology, not necessarily the practice of ontology itself, but this core term ontology would be the backbone of the course development.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2033.888,
    "end": 2042.412,
    "text": " Broadly in this project, we're interested in how to provide the affordance for people to learn and apply and communicate active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2043.292,
    "end": 2050.856,
    "text": "We had great discussions during the year on live streams and in .edu about instructionism and interactionism.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2051.997,
    "end": 2056.843,
    "text": " And how do we prevent this from just being a sort of plug and chug course?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2057.384,
    "end": 2067.897,
    "text": "How do we enable interactions and the zone approximate development like was being described and this tension that Dean described earlier as well between the sort of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2068.658,
    "end": 2085.849,
    "text": " the technical, the minute particulars and the big picture and the unknown and the thirdness and the betweenness and with a special focus on applied active inference and also enabling this education for individuals of many different backgrounds",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2087.273,
    "end": 2098.187,
    "text": " inside academia outside academia there's a whole world out there and there are not paths from here to there so that's what course development is going to be exploring in 2022 and beyond especially",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2102.765,
    "end": 2128.416,
    "text": " Everyone is welcome to get involved with all projects, but in .edu, if knowledge engineering sounds interesting to you, whether it's the translations or diving into the literature to find definitions and references, bringing your experience on curriculum development, or learning by doing on the ontology, those capture a few of the projects that we talked about here, and that's some of the main practices that are involved in .edu.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2129.616,
    "end": 2131.057,
    "text": "Any .edu thoughts?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2135.399,
    "end": 2136.601,
    "text": " Okay, Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2141.106,
    "end": 2142.508,
    "text": "Wait, unmute Dean and then continue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2146.373,
    "end": 2146.513,
    "text": "Dean.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2152.097,
    "end": 2152.677,
    "text": " Sorry about that.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2152.737,
    "end": 2158.46,
    "text": "There's some cultures that we're taking a very Western-centric approach to this, which is fine.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2158.82,
    "end": 2159.8,
    "text": "We have to start somewhere.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2160.381,
    "end": 2167.884,
    "text": "And I think that there are some cultures that simply won't have words or verbs that describe some of the things that happen in their culture.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2168.644,
    "end": 2174.848,
    "text": " particular niche that those with a Western view don't necessarily have the terminology for.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2174.908,
    "end": 2191.599,
    "text": "And I think we're keeping that aspect of this open when we're trying to figure out whether or not there can be a bridge from Calgary to Moscow or if there are other ways of being able to transport ourselves and migrate that are better than trying to put a solid structure in.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2192.34,
    "end": 2195.002,
    "text": "So sometimes when we're working on this ontology piece,",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2195.942,
    "end": 2202.707,
    "text": " we might only be able to collapse to two or three different ways of describing two faces and a vase.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2203.328,
    "end": 2220.941,
    "text": "And I think that's one of the other things we want to let people understand is that there is no one singular answer to this, that when active inference is actually being used, we distribute and there are going to be times when we can agree to disagree on how to describe something.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 2222.554,
    "end": 2223.395,
    "text": " Thank you, Dean.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2223.735,
    "end": 2227.779,
    "text": "It's like, there's what was said in first in 2013, the paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2228.039,
    "end": 2230.101,
    "text": "There's how you just said it right now.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2230.421,
    "end": 2232.243,
    "text": "There's how Blue's gonna say it in six months.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2232.964,
    "end": 2234.345,
    "text": "And those are like observations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2234.725,
    "end": 2237.007,
    "text": "Those are not the latent hidden state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2237.508,
    "end": 2242.012,
    "text": "Even if they all concur, that isn't alone evidence that that is the hidden state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2242.532,
    "end": 2244.954,
    "text": "So we actually can take that kind of signal processing",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2245.615,
    "end": 2253.42,
    "text": " perspective and integrate it with ideas like pluralism and distributed systems to talk about how to have inclusive education.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2254.981,
    "end": 2260.765,
    "text": "So in .coms, the second organizational unit, we are interested in communication.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2261.872,
    "end": 2275.178,
    "text": " The goals of this organizational unit are to organize the internal lab project and activities, kind of the connective tissue slash circulatory system, and also to carry out all forms of communication with external entities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2275.698,
    "end": 2284.001,
    "text": "So if .edu needs to send an email, they can just pass it to .coms and say, please email these nine people with this information.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2284.682,
    "end": 2284.962,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2285.742,
    "end": 2287.523,
    "text": "And .coms loves emails.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2289.602,
    "end": 2292.904,
    "text": " The first project, well there's six projects on here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2293.685,
    "end": 2300.69,
    "text": "Livestreams, social media, podcast, end of 2021 treat, monthly newsletter, and updating the coda and the playbook.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2301.01,
    "end": 2308.416,
    "text": "So first on the livestreams, of which we're in one now, we had a fun year of livestreams.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2308.856,
    "end": 2312.839,
    "text": "The livestreams technically began before Act Inflab in July 2020.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2314.72,
    "end": 2320.75,
    "text": " But we have multiple series of live streams and we've done...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2321.943,
    "end": 2348.263,
    "text": " well over 100 total 85 around papers and then 14 guest streams presentations seven model streams and three math streams which are more technical and then roundtable meetings like this one org stream is a new series that just began we have one video in there about organizational design and practice and then the applied active inference symposium and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2349.733,
    "end": 2353.936,
    "text": " Lest anyone think the year is over, we still have some upcoming papers to read.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2354.897,
    "end": 2359.901,
    "text": "For 32, Stochastic Chaos and Markov Blankets in the first two weeks of November.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2359.921,
    "end": 2364.305,
    "text": "33, Thinking Like a State with Avel Serval.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2364.325,
    "end": 2365.646,
    "text": "33 in the last two weeks of November.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2366.286,
    "end": 2371.39,
    "text": "And then we'll have two more papers, probably, that we'll discuss in December, but just haven't set them yet.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2372.211,
    "end": 2376.034,
    "text": "So we'll also be probably moving this to Coda, having a nice...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2377.54,
    "end": 2384.289,
    "text": " way to look at the past and present live streams but for now if you want to give a live stream",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2385.458,
    "end": 2393.064,
    "text": " like give a presentation and or a discussion for a guest stream on your research or your thinking or your application, just let us know.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2393.824,
    "end": 2401.19,
    "text": "And also if you want to suggest somebody who would be good for a live stream, whether it's just like, I read this paper, could you reach out to this person?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2401.61,
    "end": 2407.094,
    "text": "Or whether it's somebody you know, and you'd like to co-organize the event or just make the connect.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2407.675,
    "end": 2408.275,
    "text": "We're planning for 2022.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2409.576,
    "end": 2414.1,
    "text": "So that would be great if anyone listening has any thoughts or wants to present.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2415.962,
    "end": 2443.25,
    "text": " social media um broadly just to give two updates we have um over a thousand twitter followers and uh over 600 subscribers on youtube so the slow and steady accumulation there on the podcast front uh then i'll pass this to blue so anything you want to add on social media blue and then please describe the podcast",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2447.512,
    "end": 2447.772,
    "text": " Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2447.912,
    "end": 2458.88,
    "text": "So just also on the social media front, I just kind of took over the Facebook page and or took responsibility for promoting the Acton Flav on Facebook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2458.92,
    "end": 2466.326,
    "text": "So if you're on Facebook, find us there because that's brand new and we have like, I don't know, a whole 10 likes on our page or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2466.366,
    "end": 2466.746,
    "text": "But yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2466.986,
    "end": 2470.767,
    "text": " But we've hooked up the podcast, which will feed directly into the Facebook page.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2470.887,
    "end": 2473.388,
    "text": "So if you get updates that way, that's helpful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2473.548,
    "end": 2475.629,
    "text": "And we'll try to post the live streams on there as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2476.229,
    "end": 2479.31,
    "text": "So yeah, new social media venue is always good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2479.79,
    "end": 2481.071,
    "text": "We're also on Discord, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2481.191,
    "end": 2487.593,
    "text": "So if you're on Discord and do that too, there's more social media ways to get a hold of us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2488.573,
    "end": 2492.914,
    "text": "And then podcast, I think we're up to like 30 episodes of the podcast at this point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2493.174,
    "end": 2494.175,
    "text": "And we're starting to...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2494.815,
    "end": 2500.439,
    "text": " codify them with links to each episode and the associated live streams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2500.699,
    "end": 2517.291,
    "text": "And maybe in some future rendition of the website, we'll be able to make all that information publicly available so that people can see who participated and what the topics are, because frequently the podcast will just be like the Markov blanket, even though the paper is a much broader paper or topic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2517.811,
    "end": 2520.973,
    "text": " So podcasts are coming along and yeah, get in touch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2521.013,
    "end": 2522.994,
    "text": "I mean, there's always room for people to participate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2523.074,
    "end": 2524.115,
    "text": "I've been doing a lot of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2525.055,
    "end": 2526.276,
    "text": "Also, we're looking for music.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2526.356,
    "end": 2537.442,
    "text": "So if you want to submit some musical riffs to us for evaluation, definitely that's something on my on my to do list is to like get an intro lead for the lab podcast and yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2538.162,
    "end": 2542.425,
    "text": " If you're interested in podcasting or audio production at all, get in touch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2542.545,
    "end": 2548.688,
    "text": "I've just kind of learned and figured it out, but I'm happy to work with people, show people the ins and outs of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2549.549,
    "end": 2559.095,
    "text": "Yeah, awesome job with these edits, Blue, because sometimes the discussion can have, even when it has just a few core themes, which sometimes happens, it can be...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2560.225,
    "end": 2583.882,
    "text": " interleaved complexly so it takes skill to untangle but the podcast is fun um number four the end of 2021 treat so this is just a little gift that blue and i wanted to send out so this is kind of our project we just thought um we could send people some physical stickers",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2584.742,
    "end": 2602.882,
    "text": " and potentially send a non-fungible token an nft purely as a gift no value or utility so both of these reflect the expansion of the lab into the physical space as well as the digital and the cryptographic space",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2604.273,
    "end": 2614.422,
    "text": " And we do think that cryptographic affordances will be very important for the future of science, art, and communities in Web3 and beyond.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2615.183,
    "end": 2620.448,
    "text": "We also want it to be mindful ecologically and meaningful for participants.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2620.888,
    "end": 2624.071,
    "text": "So if you'd like to be involved in this area,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2625.092,
    "end": 2636.691,
    "text": " of kind of dao's and web3 and crypto and dsi then please come get involved with act inf lab because there's a lot to uh learn and help us do here",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2638.652,
    "end": 2640.753,
    "text": " Just very briefly, we have a monthly newsletter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2641.313,
    "end": 2647.596,
    "text": "So that's, you can find that on our site, activeinference.org and find other places to subscribe.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2647.636,
    "end": 2657.0,
    "text": "But this is a kind of monthly and then a few other special affordances, but mainly just a monthly summary of our operations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2657.3,
    "end": 2661.662,
    "text": "So good, low traffic, totally not spam way to stay updated.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2662.776,
    "end": 2667.16,
    "text": " And then the last comms project is the live stream playbook.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2667.8,
    "end": 2672.544,
    "text": "So we do have a slides-based playbook for live streaming.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2672.564,
    "end": 2674.346,
    "text": "So I'll just kind of like show it here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2675.267,
    "end": 2678.65,
    "text": "This is just for participation guidelines.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2680.131,
    "end": 2690.135,
    "text": " This is checklists for roles, participant checklist, presenter checklist, broadcaster checklist, facilitator checklist, organizer checklist.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2690.615,
    "end": 2692.996,
    "text": "So that was something that we developed over this year.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2693.857,
    "end": 2702.16,
    "text": "And we're looking to move that over to Coda so that it can be implemented much more smoothly with automations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2703.12,
    "end": 2708.603,
    "text": "The playbook itself from the technical details to the behavioral and the social.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2709.721,
    "end": 2725.132,
    "text": " And then also another Coda-related improvement project is going from the list, that spreadsheet of live streams, to this enriched table where we're gonna be able to add in keywords, links, participants.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2726.133,
    "end": 2727.834,
    "text": "You see some upcoming streams here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2728.415,
    "end": 2736.821,
    "text": "So it will be possible to very easily ask a question like, I wanna know what Dave had to say about predictive processing before 2022.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2738.502,
    "end": 2757.543,
    "text": " that will be a simple query to make and when we include the speech to text and have full text transcripts not just enriched tagging that'll also be very powerful but this will be really a fun project and it's also little micro tasks if anybody wants to contribute asynchronously like oh i loved number 14.2",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2759.705,
    "end": 2780.63,
    "text": " i'm listening to it already i'm going to write down a few keywords that were spoken that's a huge way to help the lab think about how many times a podcast or live stream is listened to and no one enriches it or makes it searchable so this will help improve that situation and connect these resources to each other",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2782.15,
    "end": 2791.873,
    "text": " So if you want to get involved in .coms, if you like communication and you are familiar with Active Inference or not, of course, all activities are open to everyone.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2792.993,
    "end": 2803.416,
    "text": "Special roles or practices that could help a lot would be somebody who wants to like lead and grow and automate ActInfLab social media accounts, because that's not really our jam.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2804.657,
    "end": 2809.538,
    "text": "Also, if you want to get involved in co-organizing or facilitating or broadcasting live streams,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2811.044,
    "end": 2821.267,
    "text": " introducing new series, compiling and curating research products, onboarding participants, new kinds of communications like blogs, short writings, tutorials.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2821.807,
    "end": 2825.468,
    "text": "There's so many things that we can do in comms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2826.148,
    "end": 2835.671,
    "text": "And if you just think that's a communication I expected to have existed, I expect that five minute video on markov blankets to have existed, or I would prefer it existed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2836.787,
    "end": 2852.683,
    "text": " connect you with the affordance so that you can reduce your free energy by doing it and also helping people any comments on comms okay final organizational unit dot tools",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2855.106,
    "end": 2862.833,
    "text": " So in tools, the overall goal is to enable the effective tool and instrument use for all act and flab processes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2863.693,
    "end": 2870.379,
    "text": "The second goal is to explore and design affordances for our niche resulting in effective action as well as innovations and tool development.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2870.719,
    "end": 2873.001,
    "text": "So it's a lot like comms, there's this interior,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2873.962,
    "end": 2876.904,
    "text": " connective tissue role, and then there's an external side.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2877.364,
    "end": 2881.567,
    "text": "In tools, the internal side is our tools, what we use in the lab.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2881.847,
    "end": 2885.93,
    "text": "And that's what the participants are engaged in because we're all participants here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2886.61,
    "end": 2893.635,
    "text": "And then there's like this medium and deeper question of what do active inference tools look like?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2894.256,
    "end": 2898.118,
    "text": "Recommendation engines and robotics and all these kinds of things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2898.258,
    "end": 2903.682,
    "text": "And we have explored that in some depth during the year, but let's go over the projects themselves.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2903.882,
    "end": 2903.951,
    "text": " Thank you."
  },
  {
    "start": 2905.307,
    "end": 2907.048,
    "text": " So first is the cloud infrastructure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2907.589,
    "end": 2911.872,
    "text": "So this is an internal, but eventually we'll have an external component as well.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2912.872,
    "end": 2918.576,
    "text": "We're looking to develop accessible and powerful computational resources for the lab.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2919.377,
    "end": 2922.339,
    "text": "There are several use cases that are very important.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2923.039,
    "end": 2934.347,
    "text": "So some of them are admin tasks, like having the website, emails, file storage, CRM, like personnel management in a secure cloud environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2935.728,
    "end": 2939.951,
    "text": " There's also use cases like a personalized learning dashboard or workspace.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2940.471,
    "end": 2949.837,
    "text": "So somebody can just log into their active lab accounts and have their resources and learnings right there for them in a high attention and high trust setting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2951.698,
    "end": 2953.939,
    "text": "Two special use cases that are",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2955.421,
    "end": 2956.182,
    "text": " can be mentioned here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2957.362,
    "end": 2961.245,
    "text": "One is ontology development and natural language processing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2961.505,
    "end": 2966.809,
    "text": "So Sumo, it's an ontology, but it's actually written like a text program, kind of like Lisp.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2967.729,
    "end": 2978.817,
    "text": "So having an environment with Sigma and a few other pieces will allow people who might not be able to set up these often esoteric programs on their own computer",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2979.793,
    "end": 2987.578,
    "text": " We'll have the cloud image virtualized and ready so that you can play around in this sandbox where all the toys work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2988.51,
    "end": 3005.787,
    "text": " And then similarly on the machine learning side, although much of early work in this vein was done in MATLAB in the SPM statistical parametric mapping toolbox, increasingly modern development is happening using the languages of Python and Julia.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3006.047,
    "end": 3010.572,
    "text": "And we spoke with people in live streams and guest streams who talked a lot about that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3011.072,
    "end": 3011.913,
    "text": "And so we wanna have a...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3013.527,
    "end": 3029.912,
    "text": " What's a fairly common setup in industry and in computer science research labs to have a cloud interface with, for example, interactable notebooks that helps you do machine learning in the cloud without having hardware or software installed locally.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3030.492,
    "end": 3032.513,
    "text": "So that's kind of the cloud infrastructure side.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3033.133,
    "end": 3035.074,
    "text": "And of course, these aren't done projects.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3035.114,
    "end": 3039.075,
    "text": "These are things that people are involved in and can be involved in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3042.486,
    "end": 3048.831,
    "text": " Feel free to just raise hands if you have any other thoughts, but another project is the Act-Inf agent development.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3049.571,
    "end": 3055.816,
    "text": "So we here are curious with what does the future of Act-Inf software agents look like?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3056.157,
    "end": 3057.698,
    "text": "Can we make an interoperable",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3059.15,
    "end": 3062.893,
    "text": " software package for active inference agent modeling?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3063.694,
    "end": 3064.735,
    "text": "And where could that be applied?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3065.396,
    "end": 3079.228,
    "text": "We started with the NetHack challenge, which we didn't muster the regime of attention for this year, but it was ambitious and we had many, many good discussions and we made a lot of useful advances.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3079.268,
    "end": 3083.591,
    "text": "We just didn't end up doing this very challenging machine learning competition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3084.392,
    "end": 3088.013,
    "text": " But there'll be so many cool areas to apply active inference to.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3088.613,
    "end": 3093.795,
    "text": "So that's kind of like, just like people expect the EDU to make courses, but it does a ton of other stuff too.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3094.755,
    "end": 3098.556,
    "text": "Tools sounds like it should be making something like this and we'll do other stuff too.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3101.697,
    "end": 3104.578,
    "text": "Project three in tools is the participant onboarding.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3105.558,
    "end": 3107.479,
    "text": "Yvonne, do you want to add any detail here?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3114.508,
    "end": 3124.859,
    "text": " Yeah, as Dan already mentioned, we, this quarter, extremely more use code tools, and here we, as other activities, we",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3132.911,
    "end": 3156.21,
    "text": " model participant as a person who can simply be involved in different projects with the lab and as other our activities we based on systems here and",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3157.892,
    "end": 3187.572,
    "text": " for different scale of the lab or project and the tasks within the project we have it's not not as simple but we have a model that we use to to simplify the onboarding so within the project we have role and",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3188.744,
    "end": 3214.478,
    "text": " uh we open to assign this role to performer with the skill we understand we need to make this role and each role has been in organizational unit of the lab and to perform the task we provide some",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3222.437,
    "end": 3233.328,
    "text": " some information to have understandable task with any skill you have already.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3243.831,
    "end": 3244.672,
    "text": " Thank you, Yvonne.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3245.272,
    "end": 3255.818,
    "text": "And that relates to the CRM integration, which is usually using to refer to customer relationship manager, but they're kind of like personnel relationships.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3256.999,
    "end": 3259.921,
    "text": "And it's a project that is on Coda.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3261.064,
    "end": 3264.945,
    "text": " It's under the .coms, but the integration is a tools concern.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3265.425,
    "end": 3278.329,
    "text": "And so just like Yvonne laid out here, using these ontologies for projects, much of which are derived from systems engineering and systems thinking, we'll be able to have everybody entered into the CRM.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3279.009,
    "end": 3283.65,
    "text": "And then we'll say, okay, Blue and I are going to be doing this live stream.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3284.807,
    "end": 3290.472,
    "text": " They added us to a calendar, the template is here, the paper's here, the email's in the inbox.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3291.032,
    "end": 3301.44,
    "text": "That will allow very flexible coordination and also improve the accessibility because not everybody is going to be trying to prune every part of the garden.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3302.441,
    "end": 3306.525,
    "text": "Each person will be able to have a targeted regime of attention that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3307.423,
    "end": 3311.645,
    "text": " is according to their preferences and also will be contributing to something bigger.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3312.285,
    "end": 3318.969,
    "text": "So these are projects involving making the organizational unit engagement more accessible.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3320.669,
    "end": 3331.555,
    "text": "Project five, Yvonne, again, please describe what is the systems thinking reading and discussion group, which was an EDU project on the learning capacity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3331.955,
    "end": 3334.416,
    "text": "What does it have to do with application in the dot tools?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3337.372,
    "end": 3347.34,
    "text": " So as each project, we have to divide the project itself and the project that enabled this project.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3348.201,
    "end": 3359.59,
    "text": "So to provide all participants with all needed instruments, we need to enable it.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3361.278,
    "end": 3376.935,
    "text": " and for more understanding of the course and the discipline of system thinking we decided to set up a",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3380.382,
    "end": 3406.137,
    "text": " reading and discuss group and one per two weeks we plan to meet and and discuss what uh what we learn and what what uh hard things we met in the course",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3408.415,
    "end": 3413.679,
    "text": " And here I provided two screenshots.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3414.34,
    "end": 3420.225,
    "text": "It's that first of it is how it looks like in Coda.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3421.065,
    "end": 3434.957,
    "text": "And the second one is the backlog of the course, if during the learning.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3436.006,
    "end": 3448.541,
    "text": " report an issue or what typos the course has or any comments they would like to provide.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3449.502,
    "end": 3455.729,
    "text": "And if you move to the next slide, please.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3457.034,
    "end": 3478.974,
    "text": " yes so once once a student record an issue we have this table and each issue automatically placed to this this table and because of",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3482.125,
    "end": 3492.972,
    "text": " different translators work worked on the course and different chapters",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3496.869,
    "end": 3523.21,
    "text": " the different translators work on different chapters and each issue is assigned to a special translator and within systems systems school we we fix and like what what do we need to fix in the course",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 3525.755,
    "end": 3547.776,
    "text": " you and this will be one of the kind of templates and inspirations for the active course that will be using tools that are state of the art which were selected from a rigorous process for the systems thinking course a sixth project for those who watch all the way to the end of lab meetings you know who you are",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3549.019,
    "end": 3553.087,
    "text": " is the graphical interface and extensible knowledge graph project.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3553.127,
    "end": 3555.733,
    "text": "So this is going to be something pretty cool heading into 2022 and beyond.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3555.753,
    "end": 3556.174,
    "text": "On the left side,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3560.908,
    "end": 3566.25,
    "text": " On the left side is an image that I'll just expand so it's small.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3567.13,
    "end": 3575.392,
    "text": "This is within MATLAB, which is a proprietary program that you have to pay to have a license for.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3576.313,
    "end": 3578.833,
    "text": "Many academics are given access, but that's not everybody.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3579.533,
    "end": 3580.694,
    "text": "Within MATLAB, the program.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3581.715,
    "end": 3589.577,
    "text": " There's a package called SPM, Statistical Parametric Mapping, which has been developed by Professor Carl Fristen and many others for the previous decades.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3590.398,
    "end": 3594.719,
    "text": "Inside of SPM, you'll find a function called DEMDEMO.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3595.739,
    "end": 3610.264,
    "text": "And it will bring up this graphical interface, which has kind of sundry links to some simulations, some code examples, some visualizations, some papers, but much of it is within MATLAB itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3611.044,
    "end": 3620.147,
    "text": " So this is kind of a resource that's been developed and locally optimized within this intra SPM, intra MATLAB format.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3621.168,
    "end": 3630.071,
    "text": "However, one of our major projects for the lab and the community moving forward is going to be reimagining and deploying",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3631.36,
    "end": 3647.704,
    "text": " graphical interface and an extensible knowledge graph for active inference so what does it look like to make a graphical interface an extensible knowledge graph that is participatory with open source development and modern affordances for knowledge graphs",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3649.042,
    "end": 3652.884,
    "text": " that uses the Act-Inf ontology as a basis of the knowledge graph.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3653.124,
    "end": 3655.225,
    "text": "So for example, here it's sorted by keywords.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3655.965,
    "end": 3660.647,
    "text": "But what do you do when one button fits under two keywords or two keywords apply to one button?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3661.027,
    "end": 3667.57,
    "text": "That's why this is a local optimization because to have that kind of advanced and even personalized re-rendering,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3668.07,
    "end": 3687.565,
    "text": " It's required to have a more advanced ontological system than just terms or principled hierarchies, which is exactly why Ontology Working Group has been involved in this work and these practices, because the extensible knowledge graph starts coming into play on the far right of that spectrum.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3689.209,
    "end": 3692.27,
    "text": " We also wonder if it can be deployed in a website.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3692.97,
    "end": 3699.432,
    "text": "So not requiring you to have MATLAB, install SPM, find DEM, and then maybe it works or maybe it doesn't.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3700.052,
    "end": 3709.034,
    "text": "How about a website where there's maybe even computational resources so people can run simulations and save their own versions of the code in their own workspace?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3709.815,
    "end": 3710.335,
    "text": "And of course,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3711.235,
    "end": 3726.922,
    "text": " what else this is a project that we're barely just beginning so if you're interested in user interface or education or tool development something that would be an ontologically scaffolded",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3727.742,
    "end": 3749.82,
    "text": " knowledge graph containing very heterogeneous resources like terms and educational courses papers videos etc this could be a very important and also very active project so if that's kind of sounding cool to you then get involved overall uh dot tools",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3752.15,
    "end": 3754.751,
    "text": " has all kinds of, well, we'll just delete this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3755.572,
    "end": 3759.093,
    "text": "Dot tools has ways for you to get involved if you'd like to contribute in any way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3762.175,
    "end": 3763.396,
    "text": "Let's go to the future.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3763.936,
    "end": 3767.198,
    "text": "And then of course, everybody, please feel free to raise your hand.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3768.438,
    "end": 3773.841,
    "text": "So the future section is short because we can actually just break it down.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3775.234,
    "end": 3784.482,
    "text": " systemically and systematically, to use some vocabulary that I learned from systems thinking, into these different levels of organization of our lab.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3785.302,
    "end": 3797.832,
    "text": "There are the next steps for the lab as an entity, which involves, for example, our nonprofit registration, continuity, and the onboarding of the inaugural cohort of the advisory board.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3798.936,
    "end": 3822.333,
    "text": " there's the next steps for the units inside of each lab which were discussed for most of the meeting today there's the next steps for the projects and the teams that are inside of each unit which have specific coda spaces and timelines and roles and requirements of themselves and then there's the next step for you as a participant so",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3823.354,
    "end": 3845.616,
    "text": " if you don't know that's perfect because that means that you'll have a lot to learn by doing and reduce your uncertainty through action so if you're listening to this or if you're aware of it you're already a participant you're engaging in the regime of attention regimes of expectations related to acting of lab and active inference more broadly so",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3847.847,
    "end": 3848.948,
    "text": " If you're here, you're a participant.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3849.588,
    "end": 3856.312,
    "text": "If you know what your next steps are, what policies you're going to select in the near future or now, that's awesome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3857.013,
    "end": 3870.642,
    "text": "If you do not know what your next action states should be, what policies you should select, or maybe even what policies you can select, what your affordances are, then you can get involved by just communicating with us.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3871.102,
    "end": 3873.864,
    "text": "So anyone can feel free to contact.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3874.304,
    "end": 3876.525,
    "text": "Welcome Scott to the very tail end",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3877.626,
    "end": 3887.914,
    "text": " Um, we're literally just closing up and, uh, just have about to have an open discussion where anyone can just add any points.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3888.654,
    "end": 3892.057,
    "text": "What was something that they liked about 2021?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3892.297,
    "end": 3893.658,
    "text": "What's something they want to change?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3894.558,
    "end": 3895.799,
    "text": "What are they looking forward to in 2022?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3895.839,
    "end": 3896.5,
    "text": "Anyone's welcome here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3912.793,
    "end": 3928.005,
    "text": " Well, I'm late to the game, so I don't know what was said before, but I feel like we're on the cusp of folks benefiting from this kind of framing much more broadly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3929.065,
    "end": 3930.126,
    "text": "And I think that was interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3930.166,
    "end": 3933.569,
    "text": "I just saw on Twitter there was an interesting article on the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3934.577,
    "end": 3942.12,
    "text": " rethinking of Friston Pearl Blankets versus Friston Blankets discussion, which I thought was interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3942.14,
    "end": 3951.764,
    "text": "I haven't read the article yet, but it's interesting, that notion of the maturation of the concept and whether or not that critique is accurate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3952.524,
    "end": 3963.689,
    "text": "The critiques are helpful because they start to bound the framing and make it more useful for more people because it's not as...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3964.875,
    "end": 3968.831,
    "text": " over enthusiastic in its ambiguity on the at the edges and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3969.85,
    "end": 3977.316,
    "text": " And so I'm really excited about the maturation of both this concept and the communities that cluster around it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3977.416,
    "end": 3982.761,
    "text": "And I feel like this particular initiative is going to be really pivotal in that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3982.981,
    "end": 3996.572,
    "text": "And it's, I won't use the word priesthood and priestesshood here, but there's a lot of evangelization that will be done in the next, or evangelizing, I guess, that will be done in the next year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3997.347,
    "end": 3998.847,
    "text": " And I'm really looking forward to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3998.887,
    "end": 4022.834,
    "text": "I think a lot of people are going to find that when they enter the space that people are, for some reason, seem fairly reasonable, given a lot of other spaces, and willing to entertain the limitations and constraints of what we have here, because I think it is something that has a core of something that's new and offers helpful insights.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4022.854,
    "end": 4024.175,
    "text": "So I'm really excited about the coming year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4024.375,
    "end": 4024.575,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4025.865,
    "end": 4026.286,
    "text": " Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4027.408,
    "end": 4027.669,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4029.553,
    "end": 4034.143,
    "text": "Yeah, I think my takeaway from the months that I've participated so far is that",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4035.126,
    "end": 4064.397,
    "text": " One of the big differences, kind of a dramatic difference, if you will, is that I find that working in this medium, it's more like a CNC mill than a printer, a 3D printer, because instead of a bunch of building up, we're essentially removing a lot of noise and trying to get to the idea of what are some of the signals that we otherwise wouldn't be able to see because we have a chance to interact the way that we",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4065.077,
    "end": 4066.058,
    "text": " have and do.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4066.158,
    "end": 4078.612,
    "text": "I don't know that it's necessarily a consensus-building platform, but I do know that it is certainly a way of being able to cross-pollinate.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4079.713,
    "end": 4083.117,
    "text": "We don't tend to collapse to one particular type here.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4085.031,
    "end": 4100.119,
    "text": " that last input being a perfect example of what we're, I think what we're achieving here, and I think that the going forward piece will be really interesting because it isn't always describable in this moment.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4100.779,
    "end": 4108.303,
    "text": "I think a year from now, when we're doing our fourth quarter a year from now, God willing, I think, again, the updates will",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4110.39,
    "end": 4119.442,
    "text": " tell us a whole bunch about what we learned in the meantime instead of trying to come to a particular specific outcome.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4119.502,
    "end": 4123.467,
    "text": "And I think that's probably one of the greatest joys of participating in this.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 4124.688,
    "end": 4125.189,
    "text": "Thanks, Dean.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4126.491,
    "end": 4128.233,
    "text": "Fellow Chitzer, with a raised hand.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4131.562,
    "end": 4132.403,
    "text": " Oh, sorry.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4133.003,
    "end": 4135.985,
    "text": "Somebody who's muted, but I'm not sure who exactly it is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4136.745,
    "end": 4137.205,
    "text": "Is it me?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4137.225,
    "end": 4137.625,
    "text": "It might be me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4137.645,
    "end": 4138.586,
    "text": "Yeah, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4138.686,
    "end": 4139.526,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4140.107,
    "end": 4145.07,
    "text": "Yeah, I sort of following on from what was said there is the idea of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4146.718,
    "end": 4167.352,
    "text": " the blanket early on was kind of like a part of active inference, but having been talking a lot more and thinking about the Fristonian blanket as a particular way of thinking about blankets and knowing that these blankets are used in other contexts, I think has helped mature things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4167.392,
    "end": 4172.175,
    "text": "I mean, Scott's been talking about the idea of maybe synthetic blankets in other contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.235,
    "end": 4175.858,
    "text": "And I think what's quite interesting is I think the discussion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4176.838,
    "end": 4197.329,
    "text": " um around the nature of blankets is going to be um as a tool or maybe as part of the ontology is going to um help at least help separate out the discourse um and i think that's not a bad thing because uh there's there's there's um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4198.409,
    "end": 4207.195,
    "text": " There's Markov chains and there's lots of these processes are used in other fields which are allied but are not active imprints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4208.216,
    "end": 4211.578,
    "text": "And then, well, what happens to these when we come into that field?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4212.139,
    "end": 4217.022,
    "text": "And I think it also then starts to help with some of the pluralistic ontological questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4218.803,
    "end": 4234.644,
    "text": " allowing other parts to maybe be more formalized and then the ontologies might happen more through the way that we think about the realization of the blanket form and the sensory states and the observation states being interacting with thank you stephen",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4236.508,
    "end": 4239.493,
    "text": " So anyone else can raise their hand?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4239.633,
    "end": 4241.355,
    "text": "Definitely the core terms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4241.636,
    "end": 4241.836,
    "text": "Yep.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4242.016,
    "end": 4242.597,
    "text": "Scott, go for it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4243.338,
    "end": 4244.44,
    "text": "So, you know, it's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.5,
    "end": 4245.522,
    "text": "Steven just got me thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4245.982,
    "end": 4251.891,
    "text": "So one of the things we're doing this NSF thing, some of you know about it right now and doing it with some other folks involved in Complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4252.828,
    "end": 4257.369,
    "text": " And we're doing virtual, excuse me, verified information environments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4258.069,
    "end": 4263.971,
    "text": "And you got me thinking, Stephen, you know, credit card system, we say is a verified information environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4264.051,
    "end": 4269.292,
    "text": "We're defining it as a thing that has business operating legal, technical, and social variables that give it integrity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4270.552,
    "end": 4282.035,
    "text": "So it's interesting when you think about blankets, in a way, a verified information environment, what we're saying is there's an externality, there's an external environment that can be named.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4282.904,
    "end": 4283.825,
    "text": " and characterized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4284.365,
    "end": 4287.867,
    "text": "So it's like before there were countries, nation states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4288.608,
    "end": 4289.908,
    "text": "We didn't say they're nation states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4289.968,
    "end": 4291.81,
    "text": "We had feudal kingdoms or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4292.07,
    "end": 4295.692,
    "text": "And it was a characterization of a set of relationships.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4296.753,
    "end": 4300.915,
    "text": "And it became paradigmatic only through broad adoption.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4301.115,
    "end": 4304.717,
    "text": "So we say now there's a society, or we can say there's a museum, or there's a school.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4304.818,
    "end": 4308.22,
    "text": "Each one has a concept, but it's really a set of relationships, not a building.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4309.087,
    "end": 4330.754,
    "text": " And it feels like, I wonder if Markov blankets, it just started feeling like perhaps there's a naming of a set of interactions, a blob of interactions out there that can start to build up its own, not rigor statistically, but cultural recognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4331.574,
    "end": 4335.335,
    "text": "And that, I wonder whether Markov blankets",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4336.01,
    "end": 4337.11,
    "text": " are candidates for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4337.15,
    "end": 4339.331,
    "text": "I don't know if it's powerful enough a concept.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4339.511,
    "end": 4341.252,
    "text": "To me, it feels like it may be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4342.032,
    "end": 4350.575,
    "text": "And that set of practices that occur associated with Markov blankets, I think, can be elevated into best practices, standards, and institutions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4351.295,
    "end": 4361.678,
    "text": "So we might actually see is the Markov blankets, for instance, might become institutionalized into fiduciary layers for representing parties, things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.918,
    "end": 4363.639,
    "text": "Anyway, you got me thinking, Stephen, on that one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4364.747,
    "end": 4380.263,
    "text": " nice thank you um i was just going to say that the core terms each of them are so rich and uh the opportunity to go into technical details and discussions as well as applied discussions um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4382.025,
    "end": 4384.848,
    "text": " There's so much more that could be said.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4386.089,
    "end": 4393.876,
    "text": "The only thing I'll say is personally, I don't think that having names associated with terms is helpful because it's not referring to a person themself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4393.976,
    "end": 4402.303,
    "text": "And so I think once we move beyond some of the name based nomenclature, we'll open up into a more accessible and rigorous space",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4403.084,
    "end": 4425.326,
    "text": " not based around whether darwin really thought this way or not about evolution or whether markov which markov really thought this way or not about statistics we can just frame positively indefinitely and probably very austerely what we actually mean and that will enable translation automation and many new things that just last names don't give",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4426.274,
    "end": 4427.355,
    "text": " But that's going to be part of the fun.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4428.215,
    "end": 4429.856,
    "text": "I never even thought of the Markov part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4429.896,
    "end": 4433.479,
    "text": "It never even occurred to me it was a guy's name.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4433.639,
    "end": 4434.38,
    "text": "But, of course, it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4435.18,
    "end": 4436.841,
    "text": "So I vote for snuggly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4437.061,
    "end": 4440.223,
    "text": "We should call it a snuggly as a generic term, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4440.244,
    "end": 4442.745,
    "text": "Does that translate into Russian?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4442.805,
    "end": 4444.366,
    "text": "What's Russian for a snuggly blanket?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4444.646,
    "end": 4446.728,
    "text": "What about snuggie, like the blanket with arms?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4447.528,
    "end": 4448.389,
    "text": "It's already trademarked.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4449.23,
    "end": 4450.811,
    "text": "Let's change the prequel term to snuggly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4453.391,
    "end": 4477.782,
    "text": " um well um and then also one just markov no just uh we are actually unsure which markov is being referenced this was some scholarship by dave to actually address the question which a markov the the elder or the younger are some of these terms referencing in the english-speaking literature and that is not always clear so there are just",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4478.877,
    "end": 4483.84,
    "text": " opportunities for international scholarship that we discover when we're curious.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4484.52,
    "end": 4484.8,
    "text": "Stephen?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4486.241,
    "end": 4490.363,
    "text": "Of course, you've got the IAN we can add on, so the Fristonian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4490.723,
    "end": 4505.411,
    "text": "I mean, it is problematic being his name, or the Markovian, but I mean, that sort of opens us up to the hand-waving, but that may also sort of show that there's more than one version, because, you know, you just hear Markov blanket, it does",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4506.28,
    "end": 4509.803,
    "text": " to somebody who came for the first time, they may think, well, that's the thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4510.724,
    "end": 4511.524,
    "text": "That's it, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4511.585,
    "end": 4515.248,
    "text": "Whereas once you get into Markovian monism,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4516.48,
    "end": 4544.493,
    "text": " um and even that maybe that there's i can see why carl wouldn't want to necessarily call them friston blankets because then it gets into that whole thing about it being his name but there's there is something possibly between or beyond a markovian blanket that would help denote what is going on with an active influence blanket where it's uh bi-directional um but this is this is great conversation we talk more about this obviously",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4545.973,
    "end": 4569.923,
    "text": " yep perfect um that's all that uh we need to i think note for the lobbying but yeah thanks for sharing about that these are the literal discussions in the terms discussions in edu every week these are like the fun things that we get to talk about so um to those in this jitsi many of whom were um just totally",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4571.269,
    "end": 4581.379,
    "text": " essential and non-fungible in their contributions to the lab, as well as those who are watching the replay and who participated in every activity this year.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4581.399,
    "end": 4583.921,
    "text": "It was just an awesome year.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4584.482,
    "end": 4588.706,
    "text": "Who could have thought that one year ago things would be where they are now?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4589.987,
    "end": 4615.807,
    "text": " and the game is just beginning so we hope that everyone listening whatever their background or familiarity with active inference or other topics is they're just welcome to get involved any other last thoughts otherwise that's it for the fourth quarterly roundtable meeting okay should i play the uh theme song again",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4618.743,
    "end": 4619.263,
    "text": " Yes, please.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4619.343,
    "end": 4619.664,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4619.904,
    "end": 4627.688,
    "text": "You, I don't think you're going to hear it on the, you're not going to hear it on the stream, but so just, it'll be quiet for 30 seconds.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4634.692,
    "end": 4637.393,
    "text": "Oh wait, I need to restart it without the little filter to do the voice.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4637.473,
    "end": 4637.733,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4637.753,
    "end": 4638.374,
    "text": "So here we go.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4638.554,
    "end": 4641.015,
    "text": "Theme song is going to start now and then I'll end the stream.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4663.587,
    "end": 4665.253,
    "text": " Okay, thanks and bye.",
    "speaker": "SPEAKER_05"
  }
]