[
  {
    "start": 23.988,
    "end": 30.99,
    "text": " All right, hello, and welcome to ActInflab live stream number 37.1, Free Energy, A User's Guide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 31.13,
    "end": 32.75,
    "text": "It's February 2nd, 2022.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 32.95,
    "end": 35.451,
    "text": "Two, two, 22.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 35.491,
    "end": 37.771,
    "text": "20 days till the big one, of course.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 38.991,
    "end": 40.592,
    "text": "Welcome to Active Inference Lab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 41.432,
    "end": 47.273,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 48.033,
    "end": 50.714,
    "text": "You can find us at links here on this slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 53.186,
    "end": 57.847,
    "text": " This is recorded in an archived live stream, so please provide us with feedback so we can improve our work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 58.807,
    "end": 64.229,
    "text": "All backgrounds and perspectives are welcome, and we'll be following good video etiquette for live stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 64.369,
    "end": 70.21,
    "text": "Maybe people can raise their hand visually so there's not a little jitzy blip until we figure it out, or either way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 71.991,
    "end": 77.792,
    "text": "Go to activeinference.org if you want to learn more about participating or check the Coda link here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 79.514,
    "end": 94.11,
    "text": " okay today in 37.1 the goal is to learn and discuss and also appreciate having stephen mann the first author here with us this paper free energy a user's guide",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 95.531,
    "end": 115.889,
    "text": " And for this 37.1, we'll start with an introduction and then we'll just fire up some slides and hear perhaps an opening and a contextualizing statement from Stephen to be introduced last and then go into whatever questions that everyone else has brought and anyone watching live.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 116.59,
    "end": 117.911,
    "text": "So I'm Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 118.091,
    "end": 121.214,
    "text": "I'm a researcher in California and I will pass it to Stephen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 122.978,
    "end": 123.798,
    "text": " Hello, Stephen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.998,
    "end": 132.402,
    "text": "I'm a practice-based PhD researcher based in Toronto, and I'll pass it over to Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.422,
    "end": 135.324,
    "text": "Good morning, everybody.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 135.364,
    "end": 135.744,
    "text": "I'm Dean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 135.764,
    "end": 136.804,
    "text": "I'm up here in Calgary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 137.224,
    "end": 150.891,
    "text": "I'm somebody who did some programming, went from being an educator to a wayfinder, and I find guides really an interesting topic to have conversations around.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 150.911,
    "end": 151.831,
    "text": "I'll pass it down to Blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 154.272,
    "end": 155.033,
    "text": " Hi, I'm Blue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 155.053,
    "end": 161.557,
    "text": "I'm a research consultant based out of New Mexico, and I will pass it to the first author, Stephen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 164.319,
    "end": 164.86,
    "text": "Hi, everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.98,
    "end": 165.88,
    "text": "I'm Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 166.2,
    "end": 179.47,
    "text": "I am a philosophy PhD, currently a postdoc in the linguistics department at the University of Surrey, and a guest at the Max Planck Institute for Evolutionary Anthropology in Leipzig, where I live.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.674,
    "end": 191.678,
    "text": " Alright, maybe Stephen, would you, or Stephen M, would you like to just give a little context on the paper?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 191.758,
    "end": 196.561,
    "text": "Like, how did this fit into your PhD or research interests?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 196.701,
    "end": 200.943,
    "text": "How did this specific collaboration come to be in the format of the paper and the way it is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 203.473,
    "end": 203.733,
    "text": " Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 203.753,
    "end": 207.117,
    "text": "Well, first, thanks for having me and thanks very much for last week's session with Dot Zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 207.157,
    "end": 211.841,
    "text": "I think you did a really excellent job at overviewing and I'm really looking forward to talking about it today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 213.103,
    "end": 223.913,
    "text": "This paper came about because we, myself and Ross and Michael, the other authors, had been in discussions with a few other authors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 224.674,
    "end": 243.244,
    "text": " around a symposium discussing active inference in the free energy principle and also predictive processing at the australian society for philosophy and psychology conference in 2018 we put together a small symposium um it went relatively well and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 244.304,
    "end": 259.424,
    "text": " After a few more months of sort of passing ideas back and forth, we approached Michael Weisberg, the editor of Biology and Philosophy, about putting together a topical collection, sort of like a special issue, but sort of collected digitally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 261.136,
    "end": 271.102,
    "text": " And eventually, sort of after sort of pitching it to him and managing to get to talk to him in person, he said that he and the other editors were quite excited.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 271.142,
    "end": 289.413,
    "text": "But what they wanted was an introduction from us that would explain the mathematics and the philosophical dialectics behind sort of at the core of active inference and the free energy principle in a way that was accessible for philosophers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 291.472,
    "end": 293.993,
    "text": " And so we said, sure, we can do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 294.534,
    "end": 296.615,
    "text": "And that was a little while ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 296.635,
    "end": 298.176,
    "text": "We started soliciting out for papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 298.376,
    "end": 301.238,
    "text": "We've now published most of the papers in that topical collection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 302.239,
    "end": 319.35,
    "text": "And since then, at the same time, sort of finalizing, finishing off my PhD and then moving to Europe from Australia where my PhD was, we were getting to grips with the real mathematical core of active inference and trying to figure out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 320.271,
    "end": 331.637,
    "text": " what was the necessary mathematics to explain the basics of the framework, and then how to present that mathematics to a philosophical audience who has sort of some mathematical competence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 332.537,
    "end": 334.878,
    "text": "And the result is the current preprint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 335.018,
    "end": 344.963,
    "text": "So we think we're probably about one more set of revisions away from submitting for publication, and it will eventually come out as the introduction to that topical collection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 345.603,
    "end": 348.305,
    "text": "So what I'm really interested in hearing from everyone else today",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 349.285,
    "end": 371.457,
    "text": " uh this the same thing we're interested from hearing from the wider community which is the reason we release the preprint which is just comments and suggestions and any kind of corrections that can help improve the paper um so that its final form is sort of even better as good as we can make it okay thanks for the awesome context stephen s",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 373.097,
    "end": 373.497,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.557,
    "end": 376.579,
    "text": "Yeah, we're really enjoying this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.659,
    "end": 387.984,
    "text": "And one thing that'll be interesting to think about, even though you sort of aimed it at maybe a philosophy audience, is some of the aspects of it at this nascent kind of foundational level",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 389.144,
    "end": 393.927,
    "text": " could help in an applied context that may be beyond the modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 395.027,
    "end": 396.828,
    "text": "So we're kind of interested in some of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 396.908,
    "end": 409.515,
    "text": "So that might be something we might tip into, even if it's not in the remit of this paper's direct publication, I think it would be really helpful in the broader sort of journey of using active inference in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.758,
    "end": 413.958,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 415.615,
    "end": 436.3,
    "text": " okay um blue or dean would you like to start with a question or we can return to one of the points that were already kind of brought up i'm good for now um okay so maybe just one starting point was just what backgrounds like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 437.506,
    "end": 444.571,
    "text": " How did you go from thinking about who you wanted to make the paper accessible to, to writing it a certain way?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 445.072,
    "end": 447.394,
    "text": "And then you mentioned it was for philosophers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 447.454,
    "end": 455.88,
    "text": "So what is the impact in this community that you'd like to, how would you like to update their generative models?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 460.103,
    "end": 460.664,
    "text": "Nicely put.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.024,
    "end": 474.084,
    "text": " First and foremost, we would like to fix in their mind the relationship between variational inference and Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 475.191,
    "end": 478.533,
    "text": " So I know that's something you've talked about before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.133,
    "end": 486.338,
    "text": "It's something that predates the free energy principle and active inference as an explanatory framework for cognitive science and biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 487.018,
    "end": 494.803,
    "text": "And it's something which, as far as I can tell, is sort of the first step in understanding what's going on with that mathematics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 497.236,
    "end": 501.999,
    "text": " So that's the sort of the key thing we want philosophers to sort of have in their minds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 502.159,
    "end": 511.245,
    "text": "Also because almost all philosophers, especially philosophers of cognitive science, but also philosophers of biology, will be familiar with Bayesian inference, at least to some extent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.925,
    "end": 525.413,
    "text": "So by pointing out that what active inference is, is something sort of a step to the right of Bayesian inference, something that they can start to understand by analogy with that, we hope it will stop them from sort of getting scared of all the complicated mathematics that you can read in a lot of the papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.98,
    "end": 529.1,
    "text": " So that's on the math side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 529.54,
    "end": 544.225,
    "text": "On the philosophy side, a lot of the stuff in section four of the paper was our attempt to really strip back a lot of the claims that were being made, but also sort of categorize the claims that were being made.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 544.985,
    "end": 555.249,
    "text": "One thing that I noticed in reading the literature and attempting to understand it was that different kinds of claims were being conflated and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 555.762,
    "end": 571.428,
    "text": " there was jumping around from claims in different domains, mathematical claims that suddenly leveraged to justify an empirical claim and then suddenly moved to an extremely general claim about all of cognitive science or all of biology in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.189,
    "end": 585.494,
    "text": "So that's the second thing we want the philosophers to get, that it is possible to disentangle these claims despite the fact that they are habitually sort of conflated or not made distinct enough in the rest of the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 588.677,
    "end": 592.34,
    "text": " All right, one follow-up, and then I see Steven and Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 592.44,
    "end": 601.606,
    "text": "You mentioned that Bayesian inference may be more familiar, especially because it's used in all kinds of modern statistical descriptive approaches as well as generative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 602.306,
    "end": 607.23,
    "text": "Just to hear it in your own words, where do you think variational inference is more familiar?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 607.61,
    "end": 612.754,
    "text": "So who does it represent who's more familiar with variational methods or who would be familiar?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.214,
    "end": 614.515,
    "text": "And then what are the key differences",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 617.54,
    "end": 626.871,
    "text": " Sure, so my understanding is that physicists, statisticians, and machine learning practitioners",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 629.077,
    "end": 639.465,
    "text": " may well have come across variational inference certainly will have had a much better chance of having come across variational inference than philosophers, at least as of 2022.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 641.126,
    "end": 651.755,
    "text": "What I understand variational inference to be is a certain kind of technique for choosing a probability distribution over unobserved states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 652.659,
    "end": 659.255,
    "text": " that started in physics, as I understand it, with Feynman, although I put a little footnote in the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.64,
    "end": 675.01,
    "text": " preprint pointing out that I haven't been able to translate the stuff in that Feynman book to the latest stuff, especially stuff that David McKay talks about in his textbook on information theory, which includes some issues in variational inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 675.451,
    "end": 688.32,
    "text": "But as I understand it, it started in physics, then was adopted into sort of statistics more broadly as a means of approximating Bayesian inference in cases where exact Bayesian inference is too difficult to carry out, too computationally difficult.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 689.801,
    "end": 698.626,
    "text": " and then moved from statistics into machine learning, where it's possible to actually build machine learning algorithms or systems that can perform variational inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 699.246,
    "end": 701.867,
    "text": "And then from there, it ended up in the active inference framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 701.887,
    "end": 706.389,
    "text": "All right, thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 706.449,
    "end": 707.77,
    "text": "So Dean first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 710.211,
    "end": 711.312,
    "text": "Stephen, thanks for joining us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 711.352,
    "end": 713.052,
    "text": "I really appreciate it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 713.333,
    "end": 714.113,
    "text": "Here's a question for you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 715.013,
    "end": 715.274,
    "text": "Now that...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 717.802,
    "end": 726.104,
    "text": " an examination of the situation and the situation, as you stated, was kind of math and philosophy",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 727.276,
    "end": 733.241,
    "text": " have now got a relationship and we're going to out pops a guidebook or a primer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 734.162,
    "end": 749.996,
    "text": "When the pump is primed, what do you see as being the effect of that relationship between the sort of philosophical audience and the math that was used to get us to this place?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 754.525,
    "end": 759.032,
    "text": " relationship between the philosophical audience and the math that was used to get us to this place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 759.212,
    "end": 767.924,
    "text": "I mean, first and foremost, I want the philosophical audience to gain a certain kind of facility with the maths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.449,
    "end": 778.832,
    "text": " I think one of you, I'm not sure who of you it was, but in the point zero, put it extremely well by saying it's like learning how the horse moves in chess.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.392,
    "end": 781.693,
    "text": "I think it might have been Daniel, but I don't want to misattribute it to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 782.393,
    "end": 786.755,
    "text": "Giving the philosophical audience the basic understanding of the most basic maths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 787.591,
    "end": 800.958,
    "text": " will give them that first kind of tool, which they can then go on, if they so wish, to build up and learn more of the moves, learn more of the complex maths, if they want to then go on and interrogate the rest of that literature, which is more complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 802.138,
    "end": 807.06,
    "text": "We've tried to sort of forego too much critical analysis in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 807.101,
    "end": 809.142,
    "text": "There is some in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 809.382,
    "end": 816.005,
    "text": "We've tried to forego that a little bit just in order to get the understanding of that maths across.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 820.717,
    "end": 822.159,
    "text": " I can follow up there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 823.8,
    "end": 827.244,
    "text": "What does it matter for the philosophers?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 827.284,
    "end": 832.209,
    "text": "So what are they in your sense or their sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 833.11,
    "end": 836.654,
    "text": "What will knowing the difference between Bayesian and variational help them evaluate?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 837.615,
    "end": 840.858,
    "text": "Or what will seeing it structured this way help them evaluate?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 843.576,
    "end": 858.845,
    "text": " think there's a few so i hope other people also can think of philosophical questions that knowing the difference between the two would help you change your mind on yeah i mean the simple answer is just it will help them understand what friston is claiming",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 859.659,
    "end": 876.244,
    "text": " And by Friston, of course, I'm using him as just an umbrella for anybody who's writing positively in the active inference tradition, attempting to demonstrate that the active inference framework can provide or inform certain process theories that explain cognitive or biological systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 877.705,
    "end": 888.028,
    "text": "Philosophers need to know the difference between Bayesian inference and variational inference because they need to know what it is that Friston is claiming can be attributed to systems like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 893.902,
    "end": 894.182,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 894.342,
    "end": 895.102,
    "text": "Blue on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 898.683,
    "end": 906.846,
    "text": "So I have a question and, um, like maybe I missed it and I was looking, I just did like a quick control up on the paper just to make sure that I didn't miss it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 906.906,
    "end": 917.689,
    "text": "And I'm not like misinterpreting, but, um, in your explanation of, um, the generative model, like, I just wonder why you didn't choose to.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 918.735,
    "end": 920.917,
    "text": " go into the recognition model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 920.997,
    "end": 928.365,
    "text": "And I think that while you discussed at length P's and Q's, why did you leave that out?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 928.565,
    "end": 930.547,
    "text": "Or do you think it's not significant?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 930.647,
    "end": 931.608,
    "text": "Or did I miss it?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 931.688,
    "end": 933.21,
    "text": "And did you talk about it at length?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 936.03,
    "end": 945.866,
    "text": " So by the recognition model, I understand that to be a sort of alternative way of doing inference that an agent could employ.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 945.886,
    "end": 950.733,
    "text": "So I'm saying what I understand by it so you can correct me before I try and answer the question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.694,
    "end": 963.602,
    "text": " I understand it to be, yeah, an alternative to generative inference is just to employ a kind of recognition model which simply takes in data and immediately produces some kind of statistical result from that data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 964.203,
    "end": 969.226,
    "text": "It doesn't need to simulate or generate its own data and then compare that to what it sees.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 969.707,
    "end": 970.687,
    "text": "That would be the generative way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 971.128,
    "end": 978.513,
    "text": "Instead, it just applies some kind of, say, mathematical statistical function to the data and then gets a kind of result.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 979.409,
    "end": 981.15,
    "text": " which describes what it hasn't observed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 981.21,
    "end": 982.77,
    "text": "Is that what you meant by recognition model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 986.012,
    "end": 986.352,
    "text": "No.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 986.372,
    "end": 994.435,
    "text": "So I'm referring to the paper, The Tale of Two Densities, the 2019 paper by Bramsted et al.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 994.576,
    "end": 1002.479,
    "text": "And in that paper, they refer to the recognition model as the Q, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1002.499,
    "end": 1004.36,
    "text": "The inverse of the likelihood model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1004.5,
    "end": 1006.861,
    "text": "It's the mapping from the consequences to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1007.594,
    "end": 1009.115,
    "text": " the hidden causes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1009.555,
    "end": 1021.039,
    "text": "And so you got really into the maths and discussed the generative model, but just didn't acknowledge this recognition model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1021.079,
    "end": 1023.6,
    "text": "And I just was curious as to why.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1025.06,
    "end": 1032.363,
    "text": "OK, so you just mean the distribution queue by the recognition model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1034.227,
    "end": 1036.449,
    "text": " Am I using a different cue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1036.469,
    "end": 1039.512,
    "text": "I haven't read A Tale of Two Densities, I should say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1040.794,
    "end": 1048.441,
    "text": "The recognition model is in the kind of namespace of expectation maximization modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1049.022,
    "end": 1051.864,
    "text": "The recognition model is like the sensory update",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1052.833,
    "end": 1075.109,
    "text": " and then the generative part was like emphasized i hope that's not too simplified or what two densities were and then the outbound was more like associated with the generativity and that's also um that's why it's important to go from the frequentist to the bayesian at all because with bayesian generative modeling like the model can be run both ways",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1076.417,
    "end": 1083.389,
    "text": " though it's used with different adjectives that's like variational autoencoder that's um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1084.454,
    "end": 1111.594,
    "text": " all these methods where it's not just descriptive modeling on a data set like principal component analysis or multiple regression it doesn't just describe then it can be used although those can be used or be thought of as bayesian like and be used in a generative way as well but that's the part that people will have less empirical experience seeing but let's think about this and then return to it next week um yeah okay so stephen s",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1113.646,
    "end": 1123.068,
    "text": " Just following on from the Bayesian, which is often used in the embodied context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.088,
    "end": 1127.049,
    "text": "People think about embodying and multisensory integration and that type of work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1127.409,
    "end": 1135.731,
    "text": "And that field is a bit challenged by moving over to this variational machine learning paradigm because it's highly mathematical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.111,
    "end": 1139.072,
    "text": "But what's interesting with active inference, it sort of comes back into...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.373,
    "end": 1146.276,
    "text": " that being grounded in embodied action, because that gives the preferences somewhere to be anchored.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1146.336,
    "end": 1158.302,
    "text": "So how do you see this going back into embodied cognition as a way for those preferences to be grounded?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.629,
    "end": 1181.585,
    "text": " That's a difficult one for me to answer in part because I'm not really part of the tradition that emphasizes embodied and inactive approaches to cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1183.948,
    "end": 1186.49,
    "text": "The way I was taught it, they were sort of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.475,
    "end": 1211.677,
    "text": " alternatives to the representationalist tradition and i was much more in the representationalist tradition so there has been some talk of whether and how free energy approaches support one or the other of those two traditions uh and to some extent because i'm already sympathetic to the representationalist tradition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1212.421,
    "end": 1227.392,
    "text": " I'm already leaning towards the idea that a free energy approach will support that, you know, as opposed to an embodied or an inactive kind of approach, which is sort of a shame because like all of those kinds of binaries, it's probably somewhat a false dichotomy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.532,
    "end": 1234.737,
    "text": "And it just means that, you know, my direct, my attention has been directed elsewhere than your attention in looking at these issues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.657,
    "end": 1241.982,
    "text": "And so, yeah, I don't have enough of value to add, unfortunately.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1245.762,
    "end": 1256.668,
    "text": " Yes, Stephen, one second, but our previous paper, 36, was like a taxonomy of perspectives on the representation question in FEP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1257.028,
    "end": 1262.952,
    "text": "So I think we're all very primed to just take a totally open stance and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1264.258,
    "end": 1285.502,
    "text": " is is every possible stance for every person to focus on it's just kind of not within our time and attention capacity so i think it just speaks to um like a diverse field where of course people are focusing on chemistry of this element of that element it won't be exactly that split but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1286.94,
    "end": 1293.563,
    "text": " in the broadening field of active inference and FEP, there's going to be people who are focused more on one question or other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1293.583,
    "end": 1298.284,
    "text": "So that's kind of cool to know where we have similar regimes of attention or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1298.544,
    "end": 1298.784,
    "text": "Stephen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1300.045,
    "end": 1301.445,
    "text": "Yeah, I'm agreeing with Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1301.485,
    "end": 1314.33,
    "text": "And also, actually, we found this really, really helpful from an embodied perspective, because the way that you separated or you gave the probabilities and preferences of working together was...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.459,
    "end": 1320.37,
    "text": " it was kind of like a deflated or a more nascent form of representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1320.892,
    "end": 1322.637,
    "text": "And that jives quite nicely",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.567,
    "end": 1330.649,
    "text": " with potential ways that inactive approaches are also potentially there because of the nature of preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1331.229,
    "end": 1334.39,
    "text": "So you start to have a way where they can both live together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1334.41,
    "end": 1343.632,
    "text": "Because I don't know, we were talking about this the other day, weren't we, Daniel, that it wasn't so clear how these two can live together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1343.652,
    "end": 1349.234,
    "text": "And often when people who are from philosopher quote the free energy principle, they talk about early papers like 2008,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.785,
    "end": 1357.792,
    "text": " maybe 10 years ago even, and that is often then a false argument that gets painted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.852,
    "end": 1359.554,
    "text": "So now we've almost got a new paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1360.353,
    "end": 1363.635,
    "text": " which can kind of help ground those philosophers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.655,
    "end": 1385.787,
    "text": "So I'm wondering what your thought is in terms of whether you're trying to help people use the most latest form of free energy principle when they were talking about philosophy and to stop some of the conflation of just people criticizing models which are now out of date, if that was part of your rationale for the way this paper was created.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1388.55,
    "end": 1396.373,
    "text": " Yeah, we absolutely wanted to direct people's attention to what we thought of as the real issues, in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1397.053,
    "end": 1398.514,
    "text": "The appropriate issues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1398.534,
    "end": 1401.715,
    "text": "I mean, we reckon that...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1403.089,
    "end": 1414.957,
    "text": " A critical assessment that is not well informed by the actual workings of the theory is not going to be helpful because you might accidentally hit on a critique that works, but only accidentally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1415.417,
    "end": 1419.48,
    "text": "If you're going to criticize a framework, you better at least understand what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1421.322,
    "end": 1427.663,
    "text": " My worry is that it will become out of date as things change, but there's not a lot you can do about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1427.763,
    "end": 1438.285,
    "text": "I mean, it took us quite a long time to get this first draft together, to get this preprint together, and I'm sort of hoping that things haven't changed so much that it's out of date by the time it comes out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1439.045,
    "end": 1445.367,
    "text": "I mean, one way to forestall that is to just be as basic as possible so that you're really capturing the core that can't possibly change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1447.647,
    "end": 1456.674,
    "text": " But otherwise, your best chance is just to publish what you've got at a particular time and keep your eye on how things change and update as you go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1458.435,
    "end": 1458.715,
    "text": "Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1458.835,
    "end": 1459.316,
    "text": "Yes, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1460.557,
    "end": 1463.719,
    "text": "Stephen, I use a lot of metaphors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1463.919,
    "end": 1470.584,
    "text": "So if you walked into a singles bar and one of the singles was a philosopher and the other single was a mathematician.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1471.67,
    "end": 1476.231,
    "text": " And you had to guess now going through the process of building that guy, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1476.251,
    "end": 1478.612,
    "text": "Like you're not match.com, but right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1478.632,
    "end": 1486.573,
    "text": "You have to make a guess as to whether that long-term relationship, they walk out hand in hand or they're completely repulsed by one another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1486.593,
    "end": 1490.654,
    "text": "I know it always depends, but you're talking about updating the guide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1491.114,
    "end": 1493.975,
    "text": "I'm kind of want to go back one previous step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1494.455,
    "end": 1495.756,
    "text": "What keeps them together?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1496.376,
    "end": 1497.536,
    "text": "What pulls them apart?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1502.54,
    "end": 1514.811,
    "text": " Yeah, so how do you write what is essentially a philosophy paper but include mathematics in a way that does justice to both is roughly how I'm hearing that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1514.851,
    "end": 1516.192,
    "text": "Well, a long-term relationship, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1516.212,
    "end": 1518.094,
    "text": "Like, they've still got to have some compatibility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1518.114,
    "end": 1519.755,
    "text": "Compatibility, right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1519.795,
    "end": 1520.816,
    "text": "And Steven Sillard's point was...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1522.237,
    "end": 1525.539,
    "text": " Up to now, it's been, I don't know if I even want to go to the bar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1526.299,
    "end": 1533.043,
    "text": "So that's what I'm asking you now, based on what you've journeyed into, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1533.243,
    "end": 1540.367,
    "text": "Because not everybody... I appreciate the idea of the guidebook because not everybody goes into situations...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1541.465,
    "end": 1542.245,
    "text": " Freely, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1542.265,
    "end": 1546.128,
    "text": "Sometimes you get dropped into situations and it's a little bit more intense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1546.668,
    "end": 1554.813,
    "text": "But what causes people to go freely into that kind of relationship and sustain it over a long enough period that it does make sense?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1555.753,
    "end": 1560.716,
    "text": "It doesn't remain kind of a superficial thing or just a concept, but it actually becomes realized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1560.756,
    "end": 1562.377,
    "text": "I was curious what your thoughts on that are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1567.741,
    "end": 1567.941,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1571.656,
    "end": 1578.041,
    "text": " I think that, you know, trying hard not to repeat myself too much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1579.482,
    "end": 1589.67,
    "text": "The way I try to think about that question is to try and think about what has prevented philosophers from really accessing the mathematical parts of active inference so far.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1589.71,
    "end": 1595.995,
    "text": "And that's just from sort of communicating with philosophers and talking to them and hearing their dissatisfaction with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1596.656,
    "end": 1600.599,
    "text": "And it was always just that there was too much of it too fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1602.236,
    "end": 1611.778,
    "text": " And so the, the sort of the only approach we could see that could remedy that was to go as slow as possible in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1611.798,
    "end": 1628.202,
    "text": "Uh, and so spend sort of have a much heavier, racier ratio of words to equations in a way, and go into much, much more depth in explaining each equation as it comes along.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.979,
    "end": 1633.882,
    "text": " rather than throwing all in at once and then decomposing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.902,
    "end": 1640.807,
    "text": "I mean, one of the earlier versions of the draft, we started with the main equations and then decomposed them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1641.488,
    "end": 1647.372,
    "text": "In the current draft that you've read, we start with the components and then build up to the main equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.733,
    "end": 1654.798,
    "text": "That was a little bit risky, I thought, because I was worried that people would feel we were holding the main event back for too long.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1655.598,
    "end": 1655.799,
    "text": "But...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.875,
    "end": 1658.856,
    "text": " So far, it seems to be working, I'll say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1659.196,
    "end": 1663.979,
    "text": "I'd be interested to hear your thoughts on that approach, whether you think that meshes together well enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1664.499,
    "end": 1666.22,
    "text": "Yeah, no, that's one of the things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1667.281,
    "end": 1670.343,
    "text": "And again, I don't think mathematicians are trying to be pushy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1670.943,
    "end": 1674.125,
    "text": "But if you don't have that context, it can feel pushy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1675.0,
    "end": 1688.186,
    "text": " And so how long you're willing to leave something open before you drop the big question is sometimes easier for somebody then to size the situation up and contextualize it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1688.246,
    "end": 1693.728,
    "text": "So in this delivery, I don't know previous versions, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1693.808,
    "end": 1697.29,
    "text": "But in this delivery, in that respect, I actually think it makes it easier",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1698.143,
    "end": 1715.515,
    "text": " less intimidating but that's just my that's my personal opinion sorry steven i know you wanted to say something steven yeah just carrying on from what dean was saying as well is um you you looked at the inference model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1716.636,
    "end": 1718.678,
    "text": " almost prior to having a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1718.999,
    "end": 1720.5,
    "text": "And I thought that was quite useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.52,
    "end": 1730.671,
    "text": "And one thing that made me think as I was reading it, and I'd be interested in your thoughts, is it helps with this idea of really thinking about how are we going to create the blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.131,
    "end": 1732.453,
    "text": "When does the blanket come into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.493,
    "end": 1734.855,
    "text": "And what assumptions are there about the blanket?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1734.875,
    "end": 1735.556,
    "text": "And in some ways,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.418,
    "end": 1744.604,
    "text": " it's easy to pick up a pre-built idea of what blankets are and then model off that, whereas it's like, okay, well, let's question that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1745.045,
    "end": 1751.55,
    "text": "And that actually could be useful at a more heuristic level, you know, for other fields of practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.111,
    "end": 1764.001,
    "text": "So I'd be interested in your thoughts about what you think your motivation for that and also maybe the sort of surprising or unsurprising outcomes of not going straight for the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.008,
    "end": 1781.079,
    "text": " Well, one of the big revelations for me in researching this paper was that you can talk about variational inference and you can talk about minimizing expected free energy without talking about Markov blankets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1781.339,
    "end": 1791.568,
    "text": "I had sort of come into this with just sort of a huge deluge of literature from the active inference tradition, lots and lots of like keywords,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1792.978,
    "end": 1802.987,
    "text": " Well, what could more uncharitably be called buzzwords like Markov blanket and non-equilibrium steady states and things like this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1803.347,
    "end": 1810.874,
    "text": "And it was a concern that I would first have to understand statistical physics and fluid dynamics before I could understand the claims that were being made about inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.454,
    "end": 1816.318,
    "text": "But looking back into the history and you realize that, first of all, variational inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.159,
    "end": 1818.84,
    "text": " is a precursor to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1818.88,
    "end": 1823.843,
    "text": "So you can think about variational inference in its own little bubble as we have it in its own little section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1824.724,
    "end": 1837.172,
    "text": "And then the sort of next step, which is novel and is quite excitingly novel, which is minimizing expected free energy, can also be construed just in terms of decision theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1837.192,
    "end": 1845.137,
    "text": "You don't, as far as I can see, you don't have to think or talk about Markov blankets at all to talk about decision theory as",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1846.232,
    "end": 1847.773,
    "text": " minimizing expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.774,
    "end": 1851.736,
    "text": "So the reason why we separated them was because they're separable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1852.116,
    "end": 1860.183,
    "text": "The reason why we put those two first variational inference and expected minimizing expected free energy is because I think they are simpler and easy to grasp.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1860.643,
    "end": 1864.025,
    "text": "And we were trying to start from the simple and build up to the more complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1864.906,
    "end": 1873.653,
    "text": "It's, I think it's definitely true that the most sort of intriguing and possibly the most sort of difficult part of understanding this whole idea",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1874.637,
    "end": 1883.275,
    "text": " system which friston is building is understanding the things to do with markup blankets in real like physical situations um but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1884.42,
    "end": 1890.122,
    "text": " what I'm sort of interested in now to give you a preview of what I'm like thinking about next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1890.602,
    "end": 1897.964,
    "text": "The thing which I'm more optimistic about being able to make headway on is investigating minimizing expected free energy as a decision theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1898.524,
    "end": 1904.746,
    "text": "That sort of gets the middle ground between, it's not just something that prefigured active inference as variational inference did.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1905.346,
    "end": 1912.608,
    "text": "It's not something that seems to require a very large amount of mathematical understanding as the Markov blanket stuff does seem to, to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1913.408,
    "end": 1917.509,
    "text": " It's something which is claimed to be a certain way of approaching decision theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1917.83,
    "end": 1921.651,
    "text": "Decision theory is sort of a philosophical sort of technical term or statistical term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1922.051,
    "end": 1934.455,
    "text": "So it's that nice middle ground between novel but understandable, which is why the thing that I'm sort of most interested in investigating next is the expected free energy approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1934.535,
    "end": 1938.617,
    "text": "And again, I don't think you need to talk about Markov blankets to talk about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1945.609,
    "end": 1967.951,
    "text": " okay thanks for sharing that one thought on where the Markov blanket comes in so you said that variational inference and the minimization of expected free energy in the context of a paper that was structurally laid out with first perception and then introducing action into the loop so it kind of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1969.212,
    "end": 1997.831,
    "text": " fits this perception of case as like action affordances are not possible and so that's the special case the more general case is when action can come into play that whole realm of action theory decision theory game theory cybernetics signal processing none of that it was said requires the markov blanket formalism",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1999.082,
    "end": 2023.434,
    "text": " I'd like to maybe add that there may be a weak sense requirement, like in the sense that on a Bayesian graph or using Bayesian methods, using Perl 1988 version of the Markov blanket, there are Markov blankets in the machinery of these Bayesian methods, because there are variables that are isolated or conditioned on each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2025.722,
    "end": 2044.316,
    "text": " so that's like the trivial markov blanket the non-contentious one that people are not spending a lot of time and attention on that um and then part of the unknown or at least less clear is the action and perception",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2045.427,
    "end": 2072.387,
    "text": " interpretation or concordance that fristen has introduced kind of taking the unitypal markov blanket concept and splitting it into like an incoming sense state dependency and an outgoing action state and then none of that gives a clear action perception topology which is why we've seen like around the clock and then with the ones like action and sense are connected and backwards arrows so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2073.558,
    "end": 2091.702,
    "text": " There's the part about the partitioning of the Markov blanket and then taking something that's kind of a trivial consequence of statistical models and then tying it to potentially realism in the strong cases, like people saying Markov blankets as defining things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2092.383,
    "end": 2102.485,
    "text": "And then even just within the formalism, how do you go from, how do you ramp up the meaning of this Markov or does it need to even be that way?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2105.069,
    "end": 2125.206,
    "text": " which is kind of related to this question which I'll ask and then anyone can give a thought like you talked about necessary and sufficient so is this some of the necessary and sufficient pieces of FEP what is what is necessary like what's the kernel that everything else can continue to elaborate around",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2127.27,
    "end": 2128.571,
    "text": " What section and page number, please?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2132.433,
    "end": 2143.601,
    "text": "Well, you'll notice that we were cheeky in defining three distinct free energy principles, probably none of which would be assented to by the actual proponents of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.822,
    "end": 2145.742,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2147.443,
    "end": 2156.79,
    "text": "Could you go through and just describe in a few sentences or just what is each one of these, the three free energy principles, inference, action, selection, what did they mean to you?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2158.507,
    "end": 2168.209,
    "text": " First one, free energy principle for inference, as we've defined it, is when updating your... Sorry, my cat is biting me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2168.429,
    "end": 2168.609,
    "text": "Ow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2170.95,
    "end": 2171.23,
    "text": "Sorry."
  },
  {
    "start": 2171.37,
    "end": 2174.931,
    "text": "I'll hold him up here so he doesn't bite me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2175.191,
    "end": 2186.393,
    "text": "Well, the short version is choose Q by minimizing F. So choose your beliefs about hidden states by minimizing variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2187.915,
    "end": 2192.701,
    "text": " So that's a principle in the sense that philosophers would call a normative principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2193.261,
    "end": 2195.484,
    "text": "It's a command for how to act.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2195.844,
    "end": 2199.368,
    "text": "In this case, the specific kind of action that is how to choose your beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.356,
    "end": 2205.556,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2206.992,
    "end": 2211.915,
    "text": " And free energy principle for action, also a normative principle telling you how to act.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2212.675,
    "end": 2225.243,
    "text": "And this one is, again, in our terminology, choose Z by minimizing G. So choose your action by minimizing its expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2228.186,
    "end": 2251.396,
    "text": " this is all for anybody who's watching this who hasn't looked at the paper we've tried to sort of describe um in very slow but understandable way what what these different sort of letters are standing for uh let me give the definitions for a discrete case okay so we have perceptual inference",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2252.452,
    "end": 2255.033,
    "text": " Bayesian expectation maximization like.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2255.834,
    "end": 2268.621,
    "text": "Choose Q, the member of the variational family distribution, by minimizing this snapshot F based upon your priors, basically, and new information coming in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2269.361,
    "end": 2272.243,
    "text": "And then that takes on a normative interpretation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2272.423,
    "end": 2277.766,
    "text": "It's kind of like saying, if you were doing linear regression, you would do the L2 norm least squares.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2278.766,
    "end": 2281.568,
    "text": "If you're doing this type of regression,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2282.748,
    "end": 2309.802,
    "text": " then do this kind of inference the second one is also normative but it's action theoretic because you introduced action and then that introduced the elaboration on f to the g function um maybe stephen s how would you say that this movement into the future first matters for maybe not necessarily how a philosopher but how um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2311.44,
    "end": 2314.843,
    "text": " any other relevant area might see this in an applied context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2315.103,
    "end": 2317.985,
    "text": "Like what does the F to G movement have to do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2318.786,
    "end": 2329.234,
    "text": "Well, I think it's, I think what's useful is that it's like, it's almost taking what's evolved out with a Markov blanket with the expected free energy and bringing it back down into a more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.825,
    "end": 2339.23,
    "text": " a form which isn't only a form which is involved in the modelling out of particular systems at low dimensionality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.31,
    "end": 2342.512,
    "text": "It's coming in and saying, okay, this is a broader principle that can be talked about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2343.293,
    "end": 2347.635,
    "text": "And I think that then ties into some of the stuff the Active Inference Lab is trying to look at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2347.675,
    "end": 2359.702,
    "text": "So how can active inference itself be used as a way to think of organising and structuring our lives, like George Parekh might have thought about it, and how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2361.363,
    "end": 2378.917,
    "text": " Can it be used as a heuristic in areas like coaching psychology, in areas where you're looking at action-orientated decision support in complex, evolving ways?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2378.937,
    "end": 2380.479,
    "text": "So you can't model it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2384.987,
    "end": 2406.011,
    "text": " the in the traditional sense of a market because there's nowhere near the dimensionality can be approached so what's useful is they say okay look we've got these general ideas we've got a route to it but that this the general deflated forms of that actually then because they're not so high order and they're not so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2407.373,
    "end": 2417.198,
    "text": " nailed down to one idea of a Markov blanket maybe has a more universal application when someone's trying to look at complex contexts and how to act in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2417.218,
    "end": 2424.422,
    "text": "So I don't know what your thoughts on that, but that's what I'm very interested in is this idea between sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2425.393,
    "end": 2446.202,
    "text": " diagnostic kind of syndrome-based psychology and how do we look at actually what's going on in a context look at the the symptoms look at the context unfolding and work on modeling using our own apparatus as dialogical sort of collaborative human beings",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2450.575,
    "end": 2462.206,
    "text": " steven uh uh dean first and then steven m if you want to give a thought on that and we're just going to talk about this inference and action piece because i think there's a few more pieces to draw out and then we'll get to the third selection but dean go for it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2463.732,
    "end": 2466.013,
    "text": " Yeah, so back to my strange twisted metaphor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2466.053,
    "end": 2483.1,
    "text": "So now all of a sudden the philosopher walks into the bar, and instead of one math showing up, we'll call it the geometry, which is much more amenable to the model in terms of how a philosopher might walk into a space and see the geometry first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2484.401,
    "end": 2486.542,
    "text": "All of a sudden there's two maths.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2487.383,
    "end": 2491.225,
    "text": " There's a statistical math that's showed up at the same time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2491.846,
    "end": 2493.247,
    "text": "Are they twins?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2493.687,
    "end": 2494.848,
    "text": "What's going on here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2495.468,
    "end": 2505.775,
    "text": "And I think that's where the guide is kind of handy because if you first walk into the space, I'm not arguing that a Markov blanket exists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2505.995,
    "end": 2507.496,
    "text": "I think relationship matters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2507.916,
    "end": 2510.398,
    "text": "But I think what most people that walk into that bar",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2511.331,
    "end": 2520.375,
    "text": " don't realize is that you're walking in on two different maths and they're both showing up at the same time when you were expecting one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2521.476,
    "end": 2523.897,
    "text": "You were expecting to be able to work with a model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2524.921,
    "end": 2531.546,
    "text": " which is, as I said, it's far more proximal to the geometry math than to the statistical one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2532.207,
    "end": 2545.937,
    "text": "And so I think that again, when we're talking about guides, I don't have to, I can put my hand in the ocean and figure out what the current is, and I can look up at the stars and figure out where I am in that invariant space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2546.618,
    "end": 2548.9,
    "text": "I don't necessarily have to have a laptop",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2549.66,
    "end": 2551.682,
    "text": " with the statistical distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2551.882,
    "end": 2556.385,
    "text": "I mean, that might help, but that's not a tool that I need at first hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2557.346,
    "end": 2564.031,
    "text": "Whereas I think the modeling part, which is what you were trying to bring up with this guide, is at hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2564.671,
    "end": 2568.614,
    "text": "And so it's the availability piece that I think philosophers are trying to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2570.239,
    "end": 2572.56,
    "text": " What did I walk into here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2572.88,
    "end": 2586.565,
    "text": "That's essentially what am I walking into and what is the betweenness of those two types of math that they're probably, if they're like me, but I'm not a philosopher, they're asking when they're being introduced to this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2587.065,
    "end": 2595.669,
    "text": "So I'm just curious, again, if I'm going way off on a tangent or if we're introducing something, we actually know what we're being introduced to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2596.664,
    "end": 2599.185,
    "text": " And that's the part where Stephen Hughes talked about slowing down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2599.746,
    "end": 2600.686,
    "text": "Because I really agree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2600.726,
    "end": 2601.967,
    "text": "It's not a breaking down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2602.547,
    "end": 2605.149,
    "text": "It's an actual slow down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2605.849,
    "end": 2606.55,
    "text": "Nothing wrong with that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2606.69,
    "end": 2607.33,
    "text": "Whoa.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2611.032,
    "end": 2616.656,
    "text": "I mean, I could try and approach an answer by sort of extending your metaphor if you'll give me license to do so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2618.637,
    "end": 2625.581,
    "text": "Imagine you're going to the bar and there's dozens or even hundreds of people",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2626.474,
    "end": 2629.815,
    "text": " Maths or different components of maths or different approaches to maths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.976,
    "end": 2638.458,
    "text": "And what you'd really like is some way of pairing that down to something that is approachable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2639.498,
    "end": 2644.02,
    "text": "You know that only a few of these will be approachable, but you don't know which ahead of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2645.495,
    "end": 2651.878,
    "text": " I'd like to think that you could use what we've written as at least the first step to pairing some of that away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.998,
    "end": 2658.122,
    "text": "So what we've left out essentially is the stuff that you could pair away and say, I can't approach that yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.242,
    "end": 2662.644,
    "text": "What I know I can approach is these first few things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2663.724,
    "end": 2666.046,
    "text": "And what I like to think is that we've...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2667.213,
    "end": 2672.479,
    "text": " done okay at getting at least some of those first few things in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2673.179,
    "end": 2674.861,
    "text": "You know, not too much, not too little.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2674.901,
    "end": 2676.643,
    "text": "It's really trying to find that Goldilocks zone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2677.143,
    "end": 2681.788,
    "text": "And those will be the ones that are approachable, even, you know, approachable for a philosopher.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2682.645,
    "end": 2684.726,
    "text": " who's met very little maths before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2685.006,
    "end": 2693.309,
    "text": "I know I owe Stephen S a response to your earlier question as well, but if you want to go ahead first, Stephen, or Daniel, you'd say what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2693.349,
    "end": 2694.929,
    "text": "Yeah, Stephen S, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2694.949,
    "end": 2700.011,
    "text": "Yeah, I was just saying, maybe bring up slide 13 if you're able to, Daniel, because that might be a useful one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.031,
    "end": 2700.091,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2702.692,
    "end": 2703.752,
    "text": "Just as it has.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.774,
    "end": 2707.094,
    "text": "I have it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2707.834,
    "end": 2707.994,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2710.404,
    "end": 2715.974,
    "text": " Because that's got a little bit there about the penalty for overfitting, penalty for failing to explain the data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2719.941,
    "end": 2720.362,
    "text": "And that has...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2723.482,
    "end": 2723.863,
    "text": " Oh, is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2723.983,
    "end": 2724.563,
    "text": "Oh, wait a sec.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2724.583,
    "end": 2726.445,
    "text": "Maybe I'm looking at the numbers at the bottom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.625,
    "end": 2726.905,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2726.946,
    "end": 2729.628,
    "text": "But on page 23 or slide 35 here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2729.668,
    "end": 2729.748,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2730.829,
    "end": 2731.07,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2731.57,
    "end": 2731.75,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2731.77,
    "end": 2731.87,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2731.89,
    "end": 2732.151,
    "text": "Slide 21.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.351,
    "end": 2732.511,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.571,
    "end": 2732.751,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.771,
    "end": 2734.553,
    "text": "This definitely juxtaposes the F and the G.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2743.655,
    "end": 2760.027,
    "text": " it's like a Pokemon evolution, but it includes those different pieces about bringing in action with the uncertainty on the consequences of action and the fundamental and the ability to impact it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2760.588,
    "end": 2764.491,
    "text": "But that was actually what I had kind of written down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2764.631,
    "end": 2767.433,
    "text": "So Steven made the point about how action is a lower dimensional space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2768.513,
    "end": 2769.935,
    "text": "And that's like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2771.115,
    "end": 2797.223,
    "text": " making an algorithm tractable like conditioning inference on action which is something that's very different structurally than a lot of other control theory where the target of inference is a policy selection here the affordances play a little bit of an upstream role and they make the downstream calculation conditioned on action so that speaks to a different embeddedness of action in active inference and then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2799.315,
    "end": 2804.948,
    "text": " a few other things but first stephen m what would you what was the answer that you owed the other stephen",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2806.661,
    "end": 2814.187,
    "text": " Yeah, I mean, I was really just picking up on the point that Stephen made about the difficulty of accurately modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2814.827,
    "end": 2817.889,
    "text": "And we talk about this a lot in the philosophy of science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2817.989,
    "end": 2825.935,
    "text": "I mean, in the philosophy of any of the special sciences, but in the sort of philosophy of science more broadly, one of the biggest topics is modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2826.656,
    "end": 2829.058,
    "text": "And one of the biggest questions is how...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2829.778,
    "end": 2840.264,
    "text": " how do you trade off between getting a model which is a perfectly accurate representation of the thing that you are modeling versus something that is tractable and that you can handle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2840.785,
    "end": 2843.366,
    "text": "And the analogy is always made with maps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2843.666,
    "end": 2844.907,
    "text": "That's sort of the first analogy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2844.987,
    "end": 2854.253,
    "text": "You can't have a map that is an exact replica of its territory because you wouldn't be able to use it to navigate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2854.293,
    "end": 2855.934,
    "text": "It could not provide you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2857.256,
    "end": 2860.059,
    "text": " with anything that was more helpful than the territory itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2860.799,
    "end": 2866.264,
    "text": "So we have some kind of practical knowledge of how to make maps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2866.324,
    "end": 2867.485,
    "text": "We know what to leave out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2867.786,
    "end": 2868.867,
    "text": "We know how to condense it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2869.007,
    "end": 2873.551,
    "text": "We should at least shrink it, usually, if we're creating a map from a territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2874.011,
    "end": 2875.312,
    "text": "What we don't really have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2877.671,
    "end": 2901.499,
    "text": " in a very general sense across all of science, is a set of principles for how, given a specific situation that is too complex to produce a perfect representation of, what ought you leave out and what ought you keep in, and how should you transform that space into a representation of that space in order to produce a representation that is a useful approximation of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2902.389,
    "end": 2921.04,
    "text": " So the question coming, you know, back to the formalism would be, how do you choose a kind of a Q distribution, your approximate distribution, the thing that you're going to harbor in your brain and believe that throws out enough of the useless stuff of the real world, but keeps in enough of the stuff that you really need to keep in, in the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2921.86,
    "end": 2930.005,
    "text": "This is sort of the, one of the big questions in philosophy of science and I guess science proper at like the early 21st century.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2930.025,
    "end": 2930.085,
    "text": "Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2933.723,
    "end": 2934.324,
    "text": " Awesome answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2934.364,
    "end": 2935.184,
    "text": "Thank you, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2936.785,
    "end": 2937.246,
    "text": "And then Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2938.207,
    "end": 2939.167,
    "text": "Yeah, just real quick.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2939.247,
    "end": 2950.056,
    "text": "So, Daniel, when Daniel talked in the point one about the third P, but he called it the P-H-I-T-N-E-S-S, the fitness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2950.096,
    "end": 2952.458,
    "text": "That's what basically you're describing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2952.558,
    "end": 2954.58,
    "text": "How do we take that fitness?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2955.481,
    "end": 2961.866,
    "text": " variance field and collapse it down to something more tractable as you said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2961.906,
    "end": 2972.854,
    "text": "And so at some point later on, either later on today or in our next live stream, I think that's what the active inference model, which is not a map,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2974.484,
    "end": 2975.865,
    "text": " And it has probably two parts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2975.925,
    "end": 2979.348,
    "text": "It has a frame, but it also has a filtering effect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2979.668,
    "end": 2985.912,
    "text": "Maybe we can talk a little bit about that because that's what the fitness is really about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2986.032,
    "end": 2994.919,
    "text": "So I'm looking forward to sort of diving a little bit deeper on that because it's not just a back and forth across and reaching edges.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2994.999,
    "end": 2998.581,
    "text": "It's actually going deeper into it and then returning from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2998.681,
    "end": 3003.685,
    "text": "So, yeah, I'm kind of looking forward to that from a mathematical standpoint as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3006.257,
    "end": 3006.677,
    "text": " Thanks, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3006.717,
    "end": 3006.917,
    "text": "Blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3009.419,
    "end": 3015.143,
    "text": "So that's a perfect segue, fitness, into what I was going to bring up.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3015.223,
    "end": 3031.194,
    "text": "And so, Stephen, something that you mentioned earlier is your attempt to capture the essence of the FEP and the things that will not change and kind of build slowly, incrementally.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3031.755,
    "end": 3032.075,
    "text": "And so...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3033.544,
    "end": 3040.829,
    "text": " if we have a theory that does not change, essentially like does not evolve, it will die.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3041.129,
    "end": 3045.232,
    "text": "Like it will become extinct because we're constantly learning new things.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3045.412,
    "end": 3059.262,
    "text": "And so, I mean, I think I like from a counterpoint think that it's kind of critical to capture the evolution of the FEP over time because",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3060.326,
    "end": 3071.155,
    "text": " it really changes the potential applications and ways that people interpret the principle and the theory of active inference also.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3071.175,
    "end": 3077.079,
    "text": "And so if it doesn't change, I mean, will it not ever change?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3077.159,
    "end": 3078.52,
    "text": "Or is it subject to change?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3078.6,
    "end": 3080.242,
    "text": "Or just what are your thoughts on that?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3080.322,
    "end": 3084.385,
    "text": "Like, is it totally inflexible, these points that you've attempted to lay out?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3087.557,
    "end": 3090.56,
    "text": " No, I mean, yeah, that general point is very well taken indeed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3090.58,
    "end": 3111.359,
    "text": "I guess I think that by trying to capture something that we thought wouldn't change, I think we meant or I should have said we're trying to capture the parts of it that the rest of the framework will continue to depend on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3113.663,
    "end": 3115.306,
    "text": " for sort of as long as possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3115.446,
    "end": 3126.964,
    "text": "We've tried to keep the most stable parts of it without necessarily implying that active inference could survive without these mathematical components, but just that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3128.444,
    "end": 3141.049,
    "text": " The change to the theory or the change to the approach would have to be so radical once you'd got rid of these core mathematical components that someone could legitimately ask, is it still the same theory?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3141.77,
    "end": 3144.331,
    "text": "So that's roughly what I would mean by essential such that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3145.151,
    "end": 3154.481,
    "text": " If, for example, tomorrow, Friston were to say, we don't need to talk about variational inference anymore, or we don't need to talk about minimizing expected free energy anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.141,
    "end": 3160.006,
    "text": "Someone could legitimately ask, okay, is he now talking about a new theory that's no longer active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3160.687,
    "end": 3166.233,
    "text": "Is it so different because he's thrown out that sort of fundamental part that he's now actually proposing something completely different?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3167.733,
    "end": 3169.975,
    "text": " I think that someone could legitimately ask that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3170.015,
    "end": 3184.924,
    "text": "I think that a reasonable person could say that he's now talking about a different theory because I think that those mathematical parts are so crucial to it, as opposed to some of the other parts, which seem, some of the more complex parts seem more dispensable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3185.525,
    "end": 3192.929,
    "text": "You could throw out some of the more complex things, keep these more basic things, and you would still more likely be having the same theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3195.211,
    "end": 3195.511,
    "text": "Yablou?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3196.923,
    "end": 3203.084,
    "text": " So just to respond quickly, so for me, that's kind of an arbitrary line in the sand.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3204.771,
    "end": 3214.076,
    "text": " And one thing that we've talked about back and forth a lot is this concept of ergodicity and an ergodic system versus a non-equilibrium steady state density, locally ergodic.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3214.896,
    "end": 3216.237,
    "text": "What does it mean?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3216.457,
    "end": 3221.8,
    "text": "And if we throw out ergodicity and eliminate this requirement, is the theory still the same theory?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3222.36,
    "end": 3230.004,
    "text": "And so that's one point, but I mean, there are many points in the minimization of free energy and so on and so forth.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3230.084,
    "end": 3234.026,
    "text": "And so as we add on to the theory,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3235.003,
    "end": 3237.146,
    "text": " we are changing the theory all the time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3237.346,
    "end": 3249.523,
    "text": "Like as new papers come out, like the recognition model versus the generative model and, you know, Bayesian mechanics for stationary processes was kind of really highlighting a couple of key points, but as the theory goes and changes,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3251.105,
    "end": 3255.147,
    "text": " It's like at any point we could say, well, that's not the same theory.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3255.227,
    "end": 3264.57,
    "text": "And so if the theory is not allowed to evolve over time, like it's just this arbitrary point in the sand that we don't want to cross, like the minimization of free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3264.59,
    "end": 3267.851,
    "text": "What if we decided that the minimization of free energy means something totally different?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3267.871,
    "end": 3277.855,
    "text": "Like even in this paper, I mean, you had in a footnote about the complexity versus accuracy, but to refer to free energy as inaccuracy is like,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3278.28,
    "end": 3280.641,
    "text": " I've not heard of it described that way before.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3280.781,
    "end": 3292.867,
    "text": "And so for me, I mean, it is this complexity and accuracy and I understand like the, um, the way that you framed it, but it's a completely like novel way to talk about free energy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3292.887,
    "end": 3299.17,
    "text": "Like I always hear about as here, here it's been framed in terms of like uncertainty or surprise, but not in accuracy.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3299.19,
    "end": 3300.07,
    "text": "Like that was completely.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3300.578,
    "end": 3302.399,
    "text": " like caught, took me off guard actually.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3302.819,
    "end": 3310.222,
    "text": "So, I mean, as the theory evolves, like, I don't know, it's just, what are the, what's the irreducible component of the FPP?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3310.282,
    "end": 3314.143,
    "text": "Like does such a thing exist or is it just turtles the whole way down?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3316.257,
    "end": 3318.058,
    "text": " Yeah, you're asking me the really hard questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3318.158,
    "end": 3319.478,
    "text": "I like this because it's tough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3319.558,
    "end": 3320.398,
    "text": "It's really tough to think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3320.679,
    "end": 3329.742,
    "text": "It's honestly, yeah, it's tough to think and answer that and to ensure that I'm answering sort of honestly as to what I really believe as opposed to just trying to sort of dismiss what you say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3331.182,
    "end": 3334.163,
    "text": "You know, I'm not trying to dismiss what you say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3334.584,
    "end": 3335.304,
    "text": "I do think...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3336.104,
    "end": 3340.165,
    "text": " that the line is blurry, so it's not clear and distinct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3340.705,
    "end": 3342.765,
    "text": "I don't think that it's arbitrary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3342.845,
    "end": 3345.666,
    "text": "I might be wrong in that, but I don't believe that it's arbitrary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3347.426,
    "end": 3353.007,
    "text": "Let me just leave to the side for a moment the description of free energy as inaccuracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3353.027,
    "end": 3363.89,
    "text": "I'll come back to that, because I'm interested in picking up what you think about the different interpretations of the function f. But I'll try and go back to the idea of herbicity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3366.496,
    "end": 3369.619,
    "text": " Yeah, there's a sense in which things are still being worked out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3370.199,
    "end": 3380.668,
    "text": "And one of the things we put in the paper is something that we were urged to make clear, which is that active inference is a work in progress.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3381.889,
    "end": 3386.153,
    "text": "Even the sort of mathematical underpinnings are still being worked",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3387.381,
    "end": 3415.887,
    "text": " fleshed out in a sense or still being put together in a way that helps connect the different parts of the theory okay that's okay that that in fact was a little bit difficult for me to swallow at first because i felt that if that's true then it doesn't legitimate all of the strong claims that are being sort of made but all of our complaints about that are in that fourth section of the paper um so we tried to make clear what we think is sort of justified and not justified on that basis but it's still true to say that it's fair to have a framework and to you know to expend time trying to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3416.327,
    "end": 3420.47,
    "text": " put together the mathematical underpinnings of this framework, even though they don't yet exist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3420.49,
    "end": 3426.934,
    "text": "You know, we don't have to, we shouldn't just throw out the theory or disparage it just because the full maths hasn't been worked out yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3426.994,
    "end": 3427.315,
    "text": "I agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3427.335,
    "end": 3428.275,
    "text": "We should allow it to change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3428.596,
    "end": 3429.676,
    "text": "We should allow it to evolve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3430.057,
    "end": 3434.68,
    "text": "We should allow it to be applied to different things and see what works and what doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3435.785,
    "end": 3452.675,
    "text": " With all that being said, I don't think, in this particular case, maybe it's true of other theories, but for active inference, I don't think that it's true that there are things that you could remove and still reasonably say, yeah, this is still active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3452.775,
    "end": 3453.055,
    "text": "I think...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3455.107,
    "end": 3465.554,
    "text": " a theory could not be that amorphous and still be treated seriously as a way of pursuing science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3466.355,
    "end": 3475.722,
    "text": "I think that you would have to say, if you threw out minimizing variational free energy, or you threw out minimizing the expected free energy, or some other of the core components,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3476.602,
    "end": 3483.508,
    "text": " I think you would have to say, if you're being reasonable, again, the word reasonable is doing a lot of work in this paragraph that I'm building up to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3483.928,
    "end": 3485.709,
    "text": "I think you would have to say, okay, it's a different theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3485.969,
    "end": 3496.238,
    "text": "I think you'd have to say, okay, we were wrong to pursue the minimization of variational free energy as a principle for understanding the behavior of biology and cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3496.498,
    "end": 3497.519,
    "text": "We were wrong to pursue that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3497.759,
    "end": 3499.24,
    "text": "We're going to pursue something else instead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3499.78,
    "end": 3505.365,
    "text": "And so you couldn't just say, oh, it's still the same theory, but we've changed this core component of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3505.865,
    "end": 3507.066,
    "text": " I don't think that line is arbitrary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3507.086,
    "end": 3512.791,
    "text": "I think there are some things that if you change, you have to sort of admit that you're wrong about that approach and go on to something else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.252,
    "end": 3515.413,
    "text": "That's sort of my piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3515.734,
    "end": 3516.975,
    "text": "I've talked for a real long time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3517.055,
    "end": 3525.162,
    "text": "I do want to pick up the idea of free energy as a function that measures inaccuracy, but I don't want to talk for like a huge amount of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3525.182,
    "end": 3527.824,
    "text": "So maybe I should put a pin in that and we could potentially return to it later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3529.485,
    "end": 3539.492,
    "text": " How about first free energy selection, Stephen M, finish that three, then as the inaccuracy, then I have a point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3541.453,
    "end": 3541.813,
    "text": "Right, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3541.833,
    "end": 3546.016,
    "text": "Yeah, I forgot we were only two thirds of the way through our descriptions of the different free energy principles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3546.056,
    "end": 3547.117,
    "text": "I'm sorry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3547.157,
    "end": 3548.718,
    "text": "So free energy principle for selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3549.779,
    "end": 3553.301,
    "text": "Let me try and pull it up here so I can just read it directly off the page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3556.674,
    "end": 3578.313,
    "text": " What we have it as is any system that survives long enough will act so as to appear to be minimizing F. One of the issues here is that we've left out G, but for the sake of sort of focusing our attention, we can just talk about F. Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3578.993,
    "end": 3584.518,
    "text": "And then how about the FEP or free energy as inaccuracy interpretation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3585.814,
    "end": 3586.474,
    "text": " Great, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3586.594,
    "end": 3597.278,
    "text": "So this is something that I was hoping would be, again, a way to present it to philosophers so that it would be easier for them to grasp what was going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3597.898,
    "end": 3600.859,
    "text": "I wanted them to understand, why do we care about this function f?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3601.379,
    "end": 3603.22,
    "text": "Why do we care about variational free energy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3604.13,
    "end": 3609.734,
    "text": " Well, suppose that I tell you that in order to do inference, what you ought to do is minimize variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3610.854,
    "end": 3612.555,
    "text": "And then you could very well say, why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3612.595,
    "end": 3613.996,
    "text": "Why should I care about minimizing this thing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3614.076,
    "end": 3623.262,
    "text": "And then if I tell you, oh, it's the measure of the cost of inaccuracy in belief, then you immediately say, OK, I understand why I would want to minimize that, because I want to maximize my accuracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3624.823,
    "end": 3631.147,
    "text": "So very simply put, it's a way of explaining why we should care about f. It's a measure of inaccuracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3632.466,
    "end": 3647.517,
    "text": " I think that that interpretation holds up just to the extent that if you look at the two components, which can be sort of thought of as a cost penalty for overfitting, a cost penalty for being inaccurate, there's a part of that which is inaccuracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3648.297,
    "end": 3653.361,
    "text": "It's not the whole story, of course, because the other part is to do with complexity, not just to do with accuracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3653.981,
    "end": 3659.865,
    "text": "So what I think we've done by describing free energy as a measure of inaccuracy or the measure of the cost of inaccuracy is...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3660.962,
    "end": 3671.735,
    "text": " trading off that sort of ability to enter into understanding the maths for a perfectly clear, mathematically very precise way of describing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3672.976,
    "end": 3679.103,
    "text": "But I definitely think that it should be thought of as containing a term which is a cost of inaccuracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3681.983,
    "end": 3696.687,
    "text": " So we talked in the dot zero about it's kind of like finding the shape from the data and the fineness of the mesh and inaccuracy in the real world kind of has elements of both, or at least we're used to thinking about complex decision trade-offs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3696.727,
    "end": 3707.35,
    "text": "Like you could make a bad decision because it took too long, but then you came to the right outcome in the scheme of thinking bigger than just one p-value.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3707.991,
    "end": 3708.651,
    "text": "And so it's kind of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3709.591,
    "end": 3727.667,
    "text": " opening up even this very kernel piece of the puzzle to the whole question of how specific and how many subgroups and always leaving space for not overfitting given this whole map territory borges discussion um stephen s",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3731.118,
    "end": 3750.889,
    "text": " And would you say that the overfitting inaccuracy is more around when you talk about adaptive active inference, where there's a way to adaptively look and have an idea of beliefs in some way, and that underneath that, there could be a kind of a,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3752.578,
    "end": 3773.805,
    "text": " more abductive swarming kind of entropic kind of process which is sits in the background but in terms of how we normally explicitly think about meaning we would think about it more in terms of what can be understood as beliefs so just be interested how that how you see that from a philosophical point of view",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3777.366,
    "end": 3795.229,
    "text": " Well, one of the things that's still unclear to me about the overfitting part of F is that it seems that it can only be interpreted as sort of a cost of complexity if what you already believe is simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3796.24,
    "end": 3801.481,
    "text": " because what it's really measuring is how far you are straying from what you already believe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3802.281,
    "end": 3813.283,
    "text": "So that there's kind of an implication there that everybody always has simple beliefs in the first place and that therefore they ought not stray from those simple beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3814.323,
    "end": 3823.285,
    "text": "One of the things that I'm trying to think about now is what happens if you are starting with sort of more complex beliefs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3824.011,
    "end": 3836.586,
    "text": " Maybe that's not a sort of appropriate question to ask given the framework or the way we're supposed to interpret the maths, but I can't help wondering it, given that it strikes me that in order to interpret it, there's a penalty for complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3837.335,
    "end": 3842.619,
    "text": " You have to say, you have to assume that what you're starting with is simplicity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3842.999,
    "end": 3847.622,
    "text": "And I guess there would be real life situations in which you don't start with simple beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3848.382,
    "end": 3862.932,
    "text": "And then presumably this would tell you, well, if your beliefs are complex, then they ought to stay complex because that penalty is a penalty for straying from that kind of complexity, which seems, you know, different from how it's usually described.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3864.85,
    "end": 3887.769,
    "text": " Yeah, Stephen S. And would you say that that falls into our more recent move from science as creating models and fitting things to those models in the most simple way to be modelers, like with post-normal science and even Friston's work with the COVID.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3888.489,
    "end": 3894.354,
    "text": "So there's a belief in engaging with a complex, non-resolvable world",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3895.427,
    "end": 3903.967,
    "text": " system question which is different to science's traditional role which is to have an answer and to fit things to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.929,
    "end": 3934.637,
    "text": " Well, one of the most exciting and sort of scary aspects of active inference is the idea that it's applied not just as a way of understanding what our target systems are doing, so not just as a way of understanding what a biological system or a brain that I'm studying is doing, but also as a way of understanding what I myself am doing when I represent that target system in order to try and understand it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3935.178,
    "end": 3935.938,
    "text": "You get a kind of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3937.014,
    "end": 3949.882,
    "text": " loop in a way, in a sort of sense in which you feel as though you could model your own activity by using these technical tools which Active Inference is giving you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3950.742,
    "end": 3955.686,
    "text": " but then you feel like how could that be done in a way that doesn't invite any kind of infinite regress?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3956.106,
    "end": 3958.568,
    "text": "That's why it's scary as well as exciting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3959.049,
    "end": 3976.523,
    "text": "It's exciting because it seems to potentially provide some kind of extra power or insight into our own activities as scientists or as modelers of any kind, but it's scary because it seems to then drop you into a kind of spiraling hole of the modeler who is modeling themself, modeling themself, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3977.571,
    "end": 3982.373,
    "text": " That's something which I can't think around even informally, let alone try and get to the formalism of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3983.933,
    "end": 3987.374,
    "text": "That was the very structure of paper number 36.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3987.994,
    "end": 3996.317,
    "text": "So even in its qualitative application, just at the terms and concept level, it does turn the mirror back.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3996.757,
    "end": 4003.939,
    "text": "And that is speaking to the pre and post or pre-post trans distributional aspects of ACT-INF.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4004.54,
    "end": 4004.66,
    "text": "The...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4006.577,
    "end": 4032.528,
    "text": " all the funny things that dean says as well and the strange loop there so what that made me think of is like the statistics and then the famous quote like the statistician can come in for the post-mortem or something like that but a lot happens before the statistics happen like the design of the experiment and so the optimal experimentation and then the knowledge that it will be passed through a distributional filter",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4033.504,
    "end": 4047.573,
    "text": " in the big macro of the scientific method, like planning months in advance for how many minutes and hours one is going to count insects or how many microliters of a fluid they're going to move.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4048.374,
    "end": 4051.256,
    "text": "That is sort of the implementation phase.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4051.776,
    "end": 4053.097,
    "text": "And then there's a design time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4053.598,
    "end": 4059.642,
    "text": "And so that's also what ties science to engineering in a way that it hasn't been in design thinking in a lot of other areas too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4059.942,
    "end": 4060.102,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4062.631,
    "end": 4063.712,
    "text": " Yeah, this is awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4063.952,
    "end": 4073.359,
    "text": "So, I mean, one of the things that we talk about is some of those density questions around what's the linear aspect of it and what's the solenoidal aspect of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4073.419,
    "end": 4078.683,
    "text": "And we also talk about walking into a room of mirrors with a mirror suit on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4079.642,
    "end": 4103.605,
    "text": " I mean, it all comes together in the sense that there, I think one of the things that Steven Mann pointed out is that there are, I think there are, one of the things I think we can say about active inference that's consistent is that it has at least a minimum of two in that back and forth up and down the density bump and around the density bump, you can go either direction and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4105.154,
    "end": 4126.094,
    "text": " So that has me asking whether every time we say that this is a framework, whether we're only giving it half its due, whether it's a framework and also a filtering exercise, like does there have to be a minimum of two, not just the boundary, but then what is actually going on dynamically within that border",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4127.017,
    "end": 4134.003,
    "text": " so that we know when we're crossing, when we know when we're within the boundary that we've maybe are looking at empirically, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4134.023,
    "end": 4151.577,
    "text": "Because we selected our unit of analysis, but then when we know when we've crossed outside that, when we've gotten to a place where the mesh is holding certain things back while other things that are of a smaller circumference are still able to sort of pass through.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4152.318,
    "end": 4154.32,
    "text": "And so I think as a guide,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4156.689,
    "end": 4162.754,
    "text": " that question of as we model, as we model, the model is the minimum.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4163.455,
    "end": 4167.258,
    "text": "I think if we just say the model, we don't do it justice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4167.298,
    "end": 4177.325,
    "text": "And if we just look at that as we model, the act of doing that, I think, again, we're looking at sort of a side of beef and expecting to be able to milk it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4177.385,
    "end": 4178.726,
    "text": "And I don't think that that works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4178.947,
    "end": 4183.41,
    "text": "I think you have to have the whole thing or else you don't really have active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4183.77,
    "end": 4183.951,
    "text": "So...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4185.988,
    "end": 4194.73,
    "text": " I think that's kind of where we're at when we're coming to the place where we're trying to decide what goes in and what doesn't go into a guide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4195.77,
    "end": 4197.051,
    "text": "And it's a struggle, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4197.411,
    "end": 4209.754,
    "text": "There's no question it's probably one of the hardest things that you can do because the majority of people that are guides are there because they've been there before versus the one who hasn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4211.377,
    "end": 4220.442,
    "text": " And that would require upending that basic premise, which is, no, everybody has to get into the boat and we're sailing off onto the event horizon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4221.282,
    "end": 4223.304,
    "text": "That would be the only way that we would change that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4223.924,
    "end": 4231.768,
    "text": "So the actual nature of guides would only change if everybody had to get their skin in the game and start at that basic place of not knowing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4232.769,
    "end": 4234.59,
    "text": "But we'll leave that for another discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4236.01,
    "end": 4237.051,
    "text": " another live stream.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4237.091,
    "end": 4239.413,
    "text": "But at this point, that's what's really interesting here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4239.733,
    "end": 4249.742,
    "text": "One of the assumptions that we made is somebody has taken the time to go and search and explore and come back with information and the other people don't have it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4250.803,
    "end": 4259.751,
    "text": "And the only way that changes is if everybody gets in the boat and sails off and hopes that they don't come to the edge of the cliff and fall off, so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4263.493,
    "end": 4291.859,
    "text": " okay a lot there thank you dean just a few other points people have different perspectives on what is core or not some of the uncertainty let's get at it with the ontology development and making some definitions and translations and the formalisms clear in the history of science and all of that but even then it might be pretty fundamental like if it includes action and inference these variational methods necessary",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4293.689,
    "end": 4294.79,
    "text": " So who knows?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4295.85,
    "end": 4299.092,
    "text": "People will have different interpretations just about a lot of things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4299.152,
    "end": 4302.214,
    "text": "And so that's, again, all part of the fun.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4302.454,
    "end": 4303.075,
    "text": "So Stephen?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4308.178,
    "end": 4314.922,
    "text": "So one question I'd be interested in is talking about guides in terms of that book, Life, a User's Guide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4316.463,
    "end": 4317.764,
    "text": "That's a very deep...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4318.903,
    "end": 4338.331,
    "text": " read it for a long time and then i lost it but it's sort of like it takes you into all these aspects of people's lives in that parisian neighborhood and um it never gives you an answer it doesn't but it in some ways it's leaving it to your intuition it's leaving to um your",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4339.429,
    "end": 4363.364,
    "text": " integration and i'm wondering where you see that that integration that's happening at a non-perspectival level the integration the intuition the the affective consciousness that is part of our knowing and how that relates to this and maybe if it's even something that's not part of science but is part of this kind of work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4367.418,
    "end": 4375.982,
    "text": " Well, I mean, firstly, you sort of cracked the code in a way because the title of the paper was directly and explicitly stolen from the correct book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4378.223,
    "end": 4380.944,
    "text": "It wasn't necessarily a sort of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4382.714,
    "end": 4405.821,
    "text": " the best like joke because it's not it's in a in the sense in which the book is about an incredibly hyper specific and detailed description of a system you know an apartment block at a specific time point on a specific day of the year gave me the idea about okay it's like it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4407.611,
    "end": 4409.912,
    "text": " It's not true that we ever really represent things that way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4410.492,
    "end": 4415.454,
    "text": "It's not true that science intends to represent things that way in the way that Perrette does and is sort of making fun of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4416.054,
    "end": 4421.376,
    "text": "But also he's incredibly constrained in the way that he wrote the book, as I understand.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4421.477,
    "end": 4422.017,
    "text": "There's some...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4423.066,
    "end": 4428.048,
    "text": " there's some really crazy games that he plays with language in writing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4428.549,
    "end": 4439.934,
    "text": "And that caused, for example, translators a huge amount of difficulty in translating it because how do you know, how do you translate the game that he's played in French into a game that you can play in English while writing the English version of the novel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4440.575,
    "end": 4444.437,
    "text": "So definitely the idea of representation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4445.495,
    "end": 4447.497,
    "text": " and sort of naturalism was on my mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4448.118,
    "end": 4451.862,
    "text": "But the short reason we called it that is because we wanted a punchy title.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4452.362,
    "end": 4454.364,
    "text": "We wanted something that people would think was accessible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4456.066,
    "end": 4462.373,
    "text": "But definitely when it came to casting about for punchy and accessible titles, that was the one that primarily came to mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4464.015,
    "end": 4464.896,
    "text": "Where it comes to sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4466.204,
    "end": 4472.129,
    "text": " affective consciousness and sort of experience, again, it's a little outside my wheelhouse.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4472.569,
    "end": 4480.535,
    "text": "I was very, very impressed upon by the novel, even just in the English translation because I can't read French.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4481.456,
    "end": 4488.982,
    "text": "I was really, really sort of moved by it in various different ways, you know, intellectually, emotionally, things like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4489.603,
    "end": 4493.526,
    "text": "There's a lot about sort of representation in there, just the concept of representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4494.557,
    "end": 4496.079,
    "text": " And that's something that I'm interested in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4496.219,
    "end": 4501.684,
    "text": "But again, that pulls sort of in the opposite direction from an activism or affective consciousness and things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4502.245,
    "end": 4510.593,
    "text": "And I'm very much situated in that kind of formal dry approach to philosophy, the kind of analytic tradition where we try and chop things down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4510.633,
    "end": 4514.416,
    "text": "We think we're scientists inspecting the human condition under a microscope.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4515.396,
    "end": 4524.42,
    "text": " Um, and so, but you know, I can't deny that in reading a novel, it flows over me in the same way, you know, I'll experience it in a similar way that you experience it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4524.48,
    "end": 4524.72,
    "text": "I hope.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4527.361,
    "end": 4527.981,
    "text": "Yes, blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4531.443,
    "end": 4532.804,
    "text": "So totally funny.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4532.824,
    "end": 4540.767,
    "text": "Um, I was also had a question about a guide, but like on the opposite of like life, a user's guide, I was reminded of the movie Beetlejuice.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4541.708,
    "end": 4546.552,
    "text": " and they, like, the couple dies, and they have this, like, handbook for the recently deceased, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4546.592,
    "end": 4550.496,
    "text": "And, like, the core of, like, the theme that they can put, well, did you read the guide?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4550.736,
    "end": 4551.516,
    "text": "Well, did you read the guide?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4551.576,
    "end": 4559.163,
    "text": "And it's apparently, like, a very thick, dense book, like, that, no, like, you can't, I mean, we're dead, and we don't know what to do, and we're freaking out, and we don't have time to sit down and read this book.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4559.763,
    "end": 4569.391,
    "text": "And so I was reminded of that, which is kind of totally juxtaposition, but it's, like, when you are creating a guide, it's very difficult to, like,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4569.835,
    "end": 4571.679,
    "text": " make it usable, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4571.699,
    "end": 4574.465,
    "text": "Like the map versus the territory, like what,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4575.174,
    "end": 4588.538,
    "text": " what will people read and be able to take away and walk away with some kind of general understanding versus like, if you really want to know what to do when you're dead in this situation, you've got to read the book, you know, how to like haunt the house and all these things.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4588.658,
    "end": 4597.461,
    "text": "And so like, do we really need to like pull grip of the FPP to really sit down with the guide, you know, whatever, like 3000 page manual",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4600.642,
    "end": 4605.746,
    "text": " Or, like, how do you distill the essence of something that's so complicated?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4605.806,
    "end": 4606.987,
    "text": "Like, what is it to be dead?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4607.868,
    "end": 4609.169,
    "text": "Or what is the FEP, right?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4609.189,
    "end": 4609.629,
    "text": "It's hard.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 4611.65,
    "end": 4613.372,
    "text": "That's such a good example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4614.693,
    "end": 4621.918,
    "text": "It's a handbook for the long-lived, I guess, the free energy principle, as opposed to a handbook for the recently deceased.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4623.872,
    "end": 4626.312,
    "text": " Yeah, what is the line that they have in that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4626.332,
    "end": 4631.433,
    "text": "It's something like some incredibly dry statement, which is absolutely no help at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4631.473,
    "end": 4635.834,
    "text": "Like operational parameters vary from manifestation to manifestation or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4636.434,
    "end": 4651.577,
    "text": "And yet, I mean, the idea behind it was that the philosophers that we talked to that urged us to try and research and write this were pointing out that when they attempted to read those papers in the active inference tradition, even those that were billed as tutorials,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4652.239,
    "end": 4654.983,
    "text": " It was like trying to read the handbook for the recently deceased.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4655.083,
    "end": 4658.208,
    "text": "It was, if not too long, then at least too dense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4658.949,
    "end": 4662.955,
    "text": "And they couldn't pick apart those statements because they were too condensed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4663.516,
    "end": 4666.581,
    "text": "And so, yeah, the difficulty was big.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4667.759,
    "end": 4674.443,
    "text": " un-condensing it, pulling it apart, selecting what was necessary, and then presenting it in an accessible way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4674.503,
    "end": 4678.885,
    "text": "I mean, all I'll say is that it took sort of on the order of years to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4679.105,
    "end": 4682.387,
    "text": "We sort of got commissioned, as it were, in 2019.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4682.467,
    "end": 4685.789,
    "text": "I started researching it in earnest at the beginning of 2020.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4686.269,
    "end": 4692.232,
    "text": "And it went through a few drafts, and people gave us a lot of comments behind the scenes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4692.252,
    "end": 4694.133,
    "text": "But the first preprint came out in December 2021.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4695.914,
    "end": 4715.568,
    "text": " yeah it's for me at least and for us the authors it was that difficult to trawl through the literature find what was necessary and then present it in a presentable way but that's such a great example thanks so much that hadn't crossed my mind but i love that film and the concept of the handbook as well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4717.725,
    "end": 4745.016,
    "text": " just a few comments on that it's not called free energy principle a user's guide it's actually very specific it's about the variational free energy and the expected free energy f and g respectively what's the fep so that's sort of where it takes you and it's very subtle then um that was pretty interesting a handbook for the long lived and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4746.244,
    "end": 4772.982,
    "text": " it reminded me about metacognition in learning and about what we expect and prefer and think we can know and how like just being a um learner and like a teacher's assistant seeing how there'd be lecturers that would give um maybe it could be thought of in sort of an effigy framework another day but they would simplify and learners would have high precision on a very simple model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4774.045,
    "end": 4777.906,
    "text": " And then other times they would convey too much of the complexity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4778.526,
    "end": 4788.608,
    "text": "And so at the end of the quarter, even if the students learned a ton and they would still feel like lost in a bigger space and there's like good and bad aspects of all of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4789.148,
    "end": 4794.689,
    "text": "So I think this is kind of like a snapshot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4794.709,
    "end": 4796.59,
    "text": "It's kind of cool that it is so recent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4797.89,
    "end": 4799.851,
    "text": " That was only a few months ago, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4801.672,
    "end": 4802.872,
    "text": "Now that it's February 22.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4803.493,
    "end": 4808.635,
    "text": "But this is very recent and still kind of ongoing that you're looking to update it to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4809.727,
    "end": 4815.872,
    "text": " So it's sort of like a kind of window where there's interactions with the community and hopefully people really think about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4815.972,
    "end": 4828.984,
    "text": "And the people for whom a section isn't clear have an opportunity through this affordance we have now as scientific publishing with preprints like to ask or correct or you missed a citation here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4831.038,
    "end": 4832.159,
    "text": " That is awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4832.559,
    "end": 4838.601,
    "text": "And it's a world apart from sort of three people with it on their desk who are delaying it in review.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4838.621,
    "end": 4841.423,
    "text": "And then maybe they have good comments, maybe they don't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4842.369,
    "end": 4849.333,
    "text": " But here there can be something that's so much beyond that as this is just like one thing that you're working on and you're developing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4850.114,
    "end": 4858.379,
    "text": "And then one last comment on that is like SPM, the textbooks are still kind of classics, cult classics, we might even say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4858.399,
    "end": 4871.448,
    "text": "And it's not that the notation hasn't changed a lot because it has in some cases, it's a snapshot and there's some amount of linking back to the past that's clarifying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4872.352,
    "end": 4878.138,
    "text": " And then there can be an understanding that there's drift and focus and evolution of techniques.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4878.659,
    "end": 4882.703,
    "text": "And the SPM textbook, it's going to have sentences that you wouldn't include if you're writing it today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4883.364,
    "end": 4883.624,
    "text": "Great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4884.705,
    "end": 4885.626,
    "text": "That's why it's different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4885.786,
    "end": 4888.369,
    "text": "But also there's something about it that helps inform.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4888.809,
    "end": 4892.553,
    "text": "So every snapshot that's well intended always is good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4892.914,
    "end": 4893.074,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4895.083,
    "end": 4909.349,
    "text": " Yeah, I think one of the other things that's really interesting about this is Stephen M. has kind of pointed to the length of time when the question was posed, can you summarize this for us?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4909.729,
    "end": 4911.429,
    "text": "Can you synopsize this for us?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4912.49,
    "end": 4917.292,
    "text": "Basically what the philosopher, it sounds to me is what the philosophers were asking was, can you go and do",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4918.561,
    "end": 4922.642,
    "text": " the figuring out and then present that to us in a finding out way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4922.822,
    "end": 4925.083,
    "text": "Will you save us time?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4925.863,
    "end": 4935.327,
    "text": "And so I think that's one of the things we have to keep front of mind when we look at this, because those philosophers now didn't do the two years of heavy lifting and searching and foraging.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4936.067,
    "end": 4938.068,
    "text": "That's a whole different aspect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4938.088,
    "end": 4945.77,
    "text": "That figuring out is a whole different processing method and mechanism than the finding out, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4945.91,
    "end": 4947.751,
    "text": "And so again, if you want people",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4949.261,
    "end": 4960.808,
    "text": " If you want people to come away from guide use with more than the finding out, they're still going to have to get in the field and do the figuring out themselves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4961.369,
    "end": 4963.09,
    "text": "And it's that interaction part which",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4964.408,
    "end": 4970.433,
    "text": " Thank goodness for Blue and Beetlejuice because that was, again, that was just a wicked example, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4970.553,
    "end": 4976.858,
    "text": "Because the timing of this, the when-ness of this really, really matters.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4977.519,
    "end": 4981.822,
    "text": "And I know that in a lot of educational settings, time is at the essence, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4981.842,
    "end": 4984.624,
    "text": "13 weeks, X number of hours, blah, blah, blah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4985.024,
    "end": 4986.666,
    "text": "We tend to get that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4986.906,
    "end": 4989.968,
    "text": "That's the only part of the when-ness that we focus on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4990.388,
    "end": 4990.709,
    "text": "Not...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4991.727,
    "end": 4999.631,
    "text": " Should the guide or the plan be the thing that initiates all the action, or is that the thing that falls out afterwards?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5000.032,
    "end": 5004.954,
    "text": "If we're doing figuring out, it has to fall out afterwards, not before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5005.715,
    "end": 5007.096,
    "text": "And we have a really hard time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5008.163,
    "end": 5025.513,
    "text": " with that because traditionally it's always been the legitimizing of guides because they've been there before and they'll help you find out, but they don't necessarily help you figure out just because of the amount of time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5029.335,
    "end": 5030.396,
    "text": "Yes, please, Stephen M.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5031.656,
    "end": 5044.023,
    "text": " I mean, yeah, so both of the things that you both just said, Daniel and then Dean, like they both open up huge topics which have so many interesting questions and so many interesting ways of approaching them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5046.405,
    "end": 5050.267,
    "text": "Dean, I think I agree 100% with what you just said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5052.508,
    "end": 5053.509,
    "text": "They've done the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5055.452,
    "end": 5068.796,
    "text": " they're going to have to use our guide as a kind of shortcut in a way to doing the initial stuff, the finding out, but it behooves them in a way to do some extra work of figuring out afterwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5069.656,
    "end": 5080.099,
    "text": "The thing that that most sort of resonates with me regarding is just the idea that our mandate, what we had to do in producing this,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5080.962,
    "end": 5087.184,
    "text": " was give them the ability to work through the examples themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5087.724,
    "end": 5095.286,
    "text": "Because that's a part of, I mean, I'm not sure how you're distinguishing these two things, but to me, that's a part of figuring out as well as just finding out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5096.127,
    "end": 5100.168,
    "text": "To me, we're not just saying, this is a measure of inaccuracy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5101.443,
    "end": 5104.126,
    "text": " And this is the algorithm by which you minimize it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5104.546,
    "end": 5109.932,
    "text": "We're saying, look at this example with these numbers in the imaginary situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5110.493,
    "end": 5119.081,
    "text": "And if you work through it, and if you print out the graph yourself, you will find that this is where the minimum lies, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5119.462,
    "end": 5121.104,
    "text": "And you will compare that with this other thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5121.644,
    "end": 5134.496,
    "text": " So we're doing the sort of the first tiny step in helping them figure out how they would figure it out in a way, if you see what I mean, giving them the means to go ahead and do it again themselves in a different kind of situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5135.177,
    "end": 5143.104,
    "text": "But the sort of the other thing that it brings up, I mean, I shouldn't say that, you know, they they like Michael Weisberg didn't say, you know, go and do this for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5143.124,
    "end": 5146.467,
    "text": "Go and be my research assistant for two and a half years to print this thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5147.569,
    "end": 5160.351,
    "text": " He, along with Peter Godfrey Smith, who is another person not connected with the journal in that capacity, but very interested in having this framework explained for a wider audience, pointed out that first and foremost,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5161.235,
    "end": 5166.957,
    "text": " we ourselves would get some kind of like plaudits for having done the work, having helped people to understand it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5167.397,
    "end": 5184.942,
    "text": "So, you know, there was the personal selfish incentive to do it, but also that it would be something that would benefit the community in a sort of, in a positive way, not something that we would be giving them for free as it were, but something that we would be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5185.421,
    "end": 5191.682,
    "text": " creating for everybody to draw on and use and just improving how the community approaches this question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5192.302,
    "end": 5209.766,
    "text": "So in the same sense in which, you know, in the best case, academia is a wonderful collection of people who are all helping each other to, you know, find those shortcuts, do the finding out without going through however long it takes to sift out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5211.047,
    "end": 5212.488,
    "text": " the stuff that is not necessary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5212.808,
    "end": 5214.05,
    "text": "We're all helping each other to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5214.07,
    "end": 5217.593,
    "text": "You know, I can read somebody else's paper who is working for two years on something completely different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5218.014,
    "end": 5224.421,
    "text": "And having split up that labor, divided that labor up, we can both sort of benefit from it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5226.311,
    "end": 5227.933,
    "text": " Sorry, I'm going on far too long now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5228.233,
    "end": 5228.673,
    "text": "No, no, no.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5228.753,
    "end": 5230.195,
    "text": "I'm only answering one question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5230.475,
    "end": 5232.537,
    "text": "One last thing about the minimum of two thing, though.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5232.858,
    "end": 5239.484,
    "text": "If we could get you and Connor Hines into a live stream, I think my mind would be blown.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5239.884,
    "end": 5249.034,
    "text": "Just because that math and this philosophy in one proximal location, because that to triangulate off that would be...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5250.174,
    "end": 5253.157,
    "text": " amazing because that's essentially what you have to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5253.177,
    "end": 5255.319,
    "text": "You have to put the finding out and the figuring out together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5256.32,
    "end": 5258.622,
    "text": "I don't think, again, I don't think it's one or the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5258.642,
    "end": 5265.608,
    "text": "I think it's our ability to sort of be able to hold up both at once and appreciate how each of those things fills in the picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5269.229,
    "end": 5273.992,
    "text": " Yeah, and I do want to, Daniel, you should tell me when I should stop or, you know, please just jump in and interrupt me anytime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5274.392,
    "end": 5277.574,
    "text": "But, you know, I just wanted to sort of respond to your points as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5278.695,
    "end": 5289.181,
    "text": "The other good thing, since I'm in an optimistic mood about academia, like you say, the kind of pre-publication, pre-print, sending it out and enabling people to give us comments back on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5290.201,
    "end": 5305.548,
    "text": " If you think about it like is that metaphor with going to a classroom and teaching before you go in and teach, you have to pare away all of the nonsense, the stuff that's too complex, get it down to the level that's simple enough so they can understand, but has enough information so they can actually learn something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5307.037,
    "end": 5311.0,
    "text": " In the really good case of getting a kind of course evaluation, you do a whole course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5311.42,
    "end": 5316.384,
    "text": "You get a bunch of students tell you what was right, what was wrong, what went too fast, what went too slow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5316.404,
    "end": 5319.186,
    "text": "And hopefully there's a kind of average where it averages out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5319.526,
    "end": 5321.688,
    "text": "And you improve it sort of next time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5322.448,
    "end": 5328.312,
    "text": "You make it easier for the learners because the learners have told you what was right and what was wrong about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5328.452,
    "end": 5330.034,
    "text": "It's always that kind of feedback process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5330.434,
    "end": 5334.877,
    "text": "Obviously, in real life situations, it doesn't always work that well getting that kind of feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5336.277,
    "end": 5343.561,
    "text": " But if you're sort of lucky enough to start off from a decent point, as I think we have at this paper, you can...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5346.983,
    "end": 5359.693,
    "text": " you can get to a kind of point which, once it is snapshotted, because that's the other important thing, I think that this kind of pre-publication peer review is really useful, but there shouldn't be constantly evolving documents all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5359.713,
    "end": 5361.015,
    "text": "There should be some kind of snapshots.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5361.635,
    "end": 5370.562,
    "text": "Once it's snapshotted, it's as good as it can be at that time, even if it becomes redundant eventually, even if it uses language which won't be used in 10, 20 years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5372.176,
    "end": 5380.101,
    "text": " Once it becomes something that people can refer to valuably for a certain amount of time afterwards, that's really the best that you can hope for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5381.322,
    "end": 5382.643,
    "text": "Certainly, just a paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5382.703,
    "end": 5383.723,
    "text": "This is just a paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5383.964,
    "end": 5386.505,
    "text": "It's nothing more than that, really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5388.006,
    "end": 5392.869,
    "text": "Just one thought on that, on the finding out and figuring out, connecting that to the peer review.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5393.31,
    "end": 5393.81,
    "text": "It's almost like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5395.148,
    "end": 5399.553,
    "text": " We're all co-learners in participatory engaging education.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5400.595,
    "end": 5403.077,
    "text": "So we want to make it easier for the learners, which is us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5404.239,
    "end": 5405.4,
    "text": "And we're all co-learners.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5405.721,
    "end": 5410.346,
    "text": "So sometimes we find out that would be somebody with more domain expertise",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5411.477,
    "end": 5440.131,
    "text": " giving us the feedback on the paper and then in the side channel maybe there's another time and place where it's a different roles not relationship but like and then there's the figuring out and then maybe there's other things here too that's actually um not like feedback from the bottom up but beginners questions abductive logic applications adversarial or contrarian even questions that is always like what is active inference why does f matter um what",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5441.11,
    "end": 5459.823,
    "text": " the fvp have to do with active inference what does evolution have to do with natural selection what does natural selection have to do with drift if those were not resolved then they're going to be some open ones in this area as well and i think there is also another analogy with sort of like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5462.011,
    "end": 5477.862,
    "text": " in a concordance with evolutionary theory and like Darwin's Dangerous Idea, Dennett in 95, that type of book perhaps has already or soon will be written for something like FEP because it has that same ability to like spawn an adjective",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5478.502,
    "end": 5481.704,
    "text": " and then reintegrate the adjective back into the corpus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5482.265,
    "end": 5484.526,
    "text": "So it was like, there was like evolution of this type.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5484.546,
    "end": 5488.529,
    "text": "And then people add like a modality or a subdomain or a new word.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5488.609,
    "end": 5491.211,
    "text": "And then it rejoins the main thread.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5491.631,
    "end": 5496.734,
    "text": "So we had like deep, affective, sophisticated, contrastive, dot, dot, dot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5496.755,
    "end": 5500.817,
    "text": "But it's going to reintegrate because it will be versioning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5501.278,
    "end": 5506.641,
    "text": "And that returns to like Blue's point about what is core, what isn't, and how will that change?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5506.681,
    "end": 5506.941,
    "text": "And so...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5509.708,
    "end": 5530.251,
    "text": " and then you just kind of close the loop with the snapshotting but the recognition of the process but we have to make the static modification in the niche but of course it's a process so it's really um interesting where we've gone today yes stephen m and then s",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5533.208,
    "end": 5534.369,
    "text": " Oh, yeah, just very quickly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5534.389,
    "end": 5538.892,
    "text": "I think the point about contrarian questions is a very good one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5539.852,
    "end": 5551.98,
    "text": "It's often philosophers' main method of figuring something out, beginning with the contrarian question that is uppermost in their mind, going out and trying to find the answer to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5552.741,
    "end": 5559.265,
    "text": "And certainly in this case, on my side, when I was doing my part of writing the paper,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5561.626,
    "end": 5569.846,
    "text": " I was starting with what on earth is this maths and what is the interpretation of these different components of it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5570.786,
    "end": 5592.076,
    "text": " um and that was just for the for the maths when you get onto the sort of philosophy side the interpretation the dialectic i mean one thing i haven't said is that there are some quite skeptical portions of this paper you probably you know noticed when you read it and we tried to you know pull back a little bit but what we wanted to do was provide you all for figuring out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5593.144,
    "end": 5595.627,
    "text": " And you always want to try and do that in good faith.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5595.827,
    "end": 5599.55,
    "text": "You know, you always want to do it in a way that's not combative or dismissive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5600.271,
    "end": 5610.681,
    "text": "You want to do it in a way that is designed to help you and the person that you're asking come to a consensus about the answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5613.373,
    "end": 5614.414,
    "text": " Thanks, Stephen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5614.534,
    "end": 5624.262,
    "text": "Okay, Stephen S. Yeah, I really find this helpful, this gratuitous use of the term guide, because you chose that title, which may be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5625.433,
    "end": 5633.899,
    "text": " If you weren't doing a preprint, maybe people, I noticed people a bit more creative with the titles, which then that's maybe also a nice benefit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5633.959,
    "end": 5637.161,
    "text": "But by going there, this discussion has been really helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5637.781,
    "end": 5643.885,
    "text": "I often hear people when they talk about the findings from research that, oh, we're going to roll out a toolkit, we'll do a toolkit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5644.346,
    "end": 5649.309,
    "text": "And then when they talk about a guide, it's really a sort of a guide to teach the toolkit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5650.55,
    "end": 5654.933,
    "text": "But here, what in a way you're looking at, especially if you're getting into the more,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5657.674,
    "end": 5674.945,
    "text": " deeper tacit knowledge is what's the guiding principles to being a modeler what's it about being a modeler and that's where well these kind of conversations are useful but i think that the the type of stuff that's been brought up here are things where you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5675.805,
    "end": 5683.292,
    "text": " they're not resolved down to a toolkit level, but it opens a question for someone to have a conversation about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5683.312,
    "end": 5697.124,
    "text": "So I just thought I'd mention that and what your thoughts are about that challenge of someone becoming a practitioner rather than necessarily an academic disseminator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5703.683,
    "end": 5707.585,
    "text": " Yeah, it's tough because I'm really not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5708.986,
    "end": 5718.392,
    "text": "In part because all that I'm sort of trying to be right now is an academic disseminator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5719.332,
    "end": 5724.435,
    "text": "So I would have to shift into a sort of different gear to think about what it would mean to be a practitioner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5726.755,
    "end": 5737.704,
    "text": " I mean, I would start by asking you what you take being a practitioner to be and then see if I can resonate with something in that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5740.077,
    "end": 5762.473,
    "text": " Well for me it's more contextual and it's more about being able to adapt and evolve based on a situation and often you find the practitioner work is when you're in a face-to-face performative context in a way where you have to perform",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5763.641,
    "end": 5767.864,
    "text": " either the dialogue, I suppose, in science, when you're in the field of practice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5768.885,
    "end": 5785.057,
    "text": "In other areas, it could be the performance of giving a performance, be it a performance as a teacher, it could be a performer, being an actor, being a workshop facilitator, being a therapist, being whatever that might be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5785.077,
    "end": 5792.103,
    "text": "And I suppose that question about how something being a guide",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5794.065,
    "end": 5818.884,
    "text": " toolkit or some way to access the sort of heuristics and ways of knowing which aren't even representational in the kind of the way that we can easily externalize so I suppose there's some of that there's the stuff that we can't take a perspective on directly because we can't necessarily encode it into artifacts and place them in our environment in words however",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5820.523,
    "end": 5825.927,
    "text": " that knowing is a skillful practice that has been sort of cultivated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5826.267,
    "end": 5829.31,
    "text": "So I kind of feel there's a need for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5829.35,
    "end": 5847.123,
    "text": "And there's a big move towards that now with the world trying to embrace transdisciplinarity, participation, complexity, where you have no way to make any sort of movement forward without the ability to find other ways to hold the meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5850.606,
    "end": 5850.846,
    "text": " Dean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5852.627,
    "end": 5866.577,
    "text": "Just to sort of piggyback on Stephen, I think if you want to try to draw a comparison, if you're a disseminator, the result can often be something like a desire line, a wearing in, a following.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5866.597,
    "end": 5870.58,
    "text": "And if you're looking at the generative model, you're looking at a densifying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5871.38,
    "end": 5874.804,
    "text": " Out of foraging and then an accumulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5875.505,
    "end": 5887.019,
    "text": "And in that respect, it's quite clear what, from a practical sense, one's not better than the other, but one results in quite a different result than the other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5887.52,
    "end": 5888.501,
    "text": "It's something to think about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5890.253,
    "end": 5913.607,
    "text": " And then one other thought on this practitioner and scientist, though I hope we see a hundred times more and more different ways to learn and apply active inference, just total first thought, would be like when Stephen was describing a practitioner contextual and adapting on situations with really lower levels of control.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5914.267,
    "end": 5918.91,
    "text": "It's on a continuum, but like a crisis or a transition moment or an adversarial scenario,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5919.795,
    "end": 5936.371,
    "text": " has a lot of an implicit factor and it's not always as focused on like the coolest calmest most collected stigmergic artifact modification it's more like the firefighting was done appropriately in that scenario given what it was",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5937.472,
    "end": 5948.578,
    "text": " And then the scientist generates niches like epistemic niche, laboratory niche, computer niche that allows them to generate scenarios where they can apply distributions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5949.058,
    "end": 5966.447,
    "text": "And then when they apply the distributional methods where there shouldn't be a distributional method, it's going to be unfortunately a silent error most of the time because of how little paid attention to all these differences are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5967.972,
    "end": 5977.104,
    "text": " So Stephen M. Yeah, this is really tricky to think about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5977.184,
    "end": 5980.929,
    "text": "I mean, I think I agree that knowing...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5982.108,
    "end": 5985.129,
    "text": " ought to be considered a kind of skillful practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5985.769,
    "end": 6000.195,
    "text": "That was one thing that you said, Stephen, that I really sort of jumped out at me, in part as being not sufficiently emphasized elsewhere, certainly not sufficiently emphasized in the tradition of philosophy that I come from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6000.275,
    "end": 6007.018,
    "text": "There tends to be a fairly clear distinction between knowing in terms of representational knowledge and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6007.941,
    "end": 6024.859,
    "text": " knowing how in terms of skill and there's not that often the consideration of the kinds of things we would usually consider representational knowledge as underpinning a kind of skillful practice but when i think about the way that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6026.212,
    "end": 6031.28,
    "text": " I'm thinking about philosophy conferences and the kinds of conversations that go on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6031.881,
    "end": 6041.255,
    "text": "It's pretty clear to me that having a conversation with somebody else about a topic that is so sort of steeped in law and intellectual...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6042.416,
    "end": 6061.724,
    "text": " recognition and texts as having a philosophy conversation is, what it requires is a kind of skill, a kind of a smooth, a kind of automatically picking out the topics as you go along, not sort of sitting back and thinking very hard on your own before coming back 30 minutes later and responding to the things that your interlocutor has just said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6063.037,
    "end": 6066.258,
    "text": " It has all the hallmarks of a skill as far as I can see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6067.138,
    "end": 6076.479,
    "text": "And what happens is, well, the way that I have been brought up to view it is you do all your thinking at home or you do all your thinking in the armchair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6076.799,
    "end": 6079.96,
    "text": "And then when you come out to have the conversation, you're ready with that skill.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6080.8,
    "end": 6088.921,
    "text": "Because you've done all of that slow, solitary work first, the kind of propositional or representational kind of work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6089.482,
    "end": 6092.062,
    "text": "Then when you're ready, you come out and you practice everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6092.322,
    "end": 6092.888,
    "text": " discussing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6096.991,
    "end": 6126.092,
    "text": " thanks great point it's a lot like the uh representational dimension is kind of the non-linear knowledge model which is it cannot be conveyed in a linear sequence linear presentation in video and in writing is rhetoric and that was one of the most interesting areas um in the paper was like the claims justification the whole second part and i'm happy that we spent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6127.071,
    "end": 6147.274,
    "text": " almost all the dot zero in our conversation leading up to it because there's a whole paper and it sounds like it there's so much more to explore um but like the part about the rhetoric and the way that people not just have an edge in their knowledge graph their armchair knowledge graph or their",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6148.188,
    "end": 6159.242,
    "text": " relational database, not just an edge between concepts, but actually when a question is raised to move to that answer first or the first topic that's mentioned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6160.103,
    "end": 6162.146,
    "text": "Like if somebody asks, what is a Markov blanket?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6162.727,
    "end": 6166.331,
    "text": "The first noun, what is it going to be?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6167.509,
    "end": 6189.383,
    "text": " well for a cell or is it because of bayesian or what is the actual first rhetorical node that somebody gives and those kinds of knowledge like representations are really interesting too it's not even just that it's the most important thing because that's not how people always structure their speech so like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6190.515,
    "end": 6218.486,
    "text": " there's both sides we need the non-linear part so that we can actually build a bigger structure than just an oral script but then it has to be in that like run time that you kind of described at the philosophy conference it has to be presented in a linear way and if there weren't disagreements or um like contrasts in people's perspective then they would just be reading off the same book",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6222.27,
    "end": 6244.413,
    "text": " so maybe we'd love to hear your thoughts on any of these ladder sections in four like which one of these areas of claims we won't stay long but just what of the areas of claims or the relationships between areas was interesting to you or like you learned while reading about it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6245.851,
    "end": 6252.617,
    "text": " because you had the justificatory links between dialectical categories with mathematical, empirical, and general.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6253.698,
    "end": 6256.04,
    "text": "So maybe just one edge or one section of those.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6256.081,
    "end": 6257.121,
    "text": "What did you find interesting?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6266.53,
    "end": 6268.092,
    "text": "Oh, was that an open question or were you asking me?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6268.132,
    "end": 6268.632,
    "text": "I wasn't sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6269.233,
    "end": 6269.813,
    "text": "I guess to you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6273.553,
    "end": 6280.836,
    "text": " I mean, I can definitely start with the first section, which was the mathematical to empirical direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6282.377,
    "end": 6289.6,
    "text": "And as you said, for each edge of the triangle, we were only sort of considering one direction, mainly for considerations of space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6291.724,
    "end": 6310.904,
    "text": " What's most interesting to me about this is just that it is an established research field called computational cognitive science, when the specific maths that is being looked at is certain kinds of neural networks or other kinds of computational systems, and the specific empirical system that is being looked at is the brain, especially the human brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6311.625,
    "end": 6337.706,
    "text": " and what we really wanted to emphasize in this section was that the kinds of tools that have already been developed by computational cognitive science so that includes the models and the explanatory tools and the justificatory or inferential tools could be applied to active inference models as well so this was our attempt to say to the philosophers we already have some equipment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6338.516,
    "end": 6343.24,
    "text": " we can use when what we're trying to do is evaluate active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6348.685,
    "end": 6361.336,
    "text": "So whether we call it deflationary or not, there's a lot of relevance in emphasizing which parts are specific to active inference and which ones aren't, like bringing action into the loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6362.347,
    "end": 6389.885,
    "text": " is not a novelty in the last 15 years doing bayesian statistics doing variational inference and so that work helps us really highlight the parts that do have unique and different interpretations like this is definitely one of um my favorite paragraphs i think that we've come across and gotten the highlight on the discussions like and then you even brought it up that it's actually in the distillation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6394.078,
    "end": 6401.01,
    "text": " not just implicit knowledge or notational connection, but a rhetorical element that arises.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6401.571,
    "end": 6404.555,
    "text": "And then also one with like educational and didactic implications.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6404.656,
    "end": 6405.537,
    "text": "So that's really interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6405.797,
    "end": 6405.938,
    "text": "Dean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6407.796,
    "end": 6422.321,
    "text": " Yeah, and I think when I was reading your paper, Steven, I noticed the number of times you had the word evaluate, evaluate, evaluate, which again is another one of those, does this pass, pass muster, pass a standard, pass what goes on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6423.942,
    "end": 6430.103,
    "text": " and what gets held back, what gets continued attention, and what do we now ignore?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6430.383,
    "end": 6444.586,
    "text": "And that's why I like when you were talking earlier about, well, when we put a guide together, we just want to basically walk into the bar and make sure that the 98 things that we really can't pay attention to first, that doesn't pass.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6445.346,
    "end": 6450.988,
    "text": "What does pass are maybe these two first nascent ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6451.828,
    "end": 6452.628,
    "text": "And so again,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6454.502,
    "end": 6476.037,
    "text": " You don't need to even hear this, but if you want a just a factory link, that is one right there in real time in terms of what carries on, what can we build off of and what falls away because it doesn't seem to pass whatever evaluative methods we've implied.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6476.497,
    "end": 6480.1,
    "text": "But then again, that goes to when do we start evaluating?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6480.6,
    "end": 6502.118,
    "text": " from the from the moment we started we want it to be something a little bit more creative and hold that thing open a little long before we jump to assessment okay so in the last just few minutes yeah stephen you want to give a response there or would you like to have a little bit of a closing statement",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6504.703,
    "end": 6528.04,
    "text": " uh let me give a quick response which is just that i agree exactly with what you said dean and um yeah we wanted to show that some things could be evaluated very directly just by working through the numbers and that gives some directions for how other things could be evaluated and you're right it's like passing it's sort of how a philosopher evaluates a scientific theory as being sort of in a sense",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6529.745,
    "end": 6533.388,
    "text": " first level plausibility or first level acceptability, how it passes that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6533.488,
    "end": 6535.189,
    "text": "It's kind of a philosopher's technical term.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6536.57,
    "end": 6546.957,
    "text": "But I can sort of give a kind of closing statement that calls back to what you just mentioned, Daniel, that paragraph, which is just that the thing that I'm thinking about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6548.755,
    "end": 6560.056,
    "text": " most often when I think about active inference right now is the interpretation of P in the expected free energy function and the sense in which it can have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6561.232,
    "end": 6565.475,
    "text": " probabilistic interpretation as well as an interpretation of a kind of preference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6566.076,
    "end": 6578.125,
    "text": "That is the thing which I really want to try and get to the bottom of, again, just by working with very, very simple models, try and throw some numbers around, try and intuitively grasp what that model can represent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6578.706,
    "end": 6583.95,
    "text": "We have one in there with the example of the cat, but I want to try and expand it a little bit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6583.97,
    "end": 6587.733,
    "text": "Yeah, I'm glad that you like that paragraph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6588.618,
    "end": 6595.044,
    "text": " because it's the thing that is causing me the most, it's the thing that's itching the most that I'm attempting to scratch right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6597.927,
    "end": 6601.05,
    "text": "All right, so we'll each give a closing thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6601.09,
    "end": 6603.732,
    "text": "So just what did people enjoy?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6603.752,
    "end": 6606.515,
    "text": "What would they look forward to talking about next week?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6607.175,
    "end": 6608.336,
    "text": "So Stephen, select first.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6609.878,
    "end": 6613.461,
    "text": "Well, just thank you a lot for a really great, engaging conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6615.074,
    "end": 6635.381,
    "text": " lots of insights um i i'm really interested in that idea of the the peas um so i think that's very interesting and i'd be interested in how that maybe applies both on the um on the sensory side and the action side so how much is the probabilities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6636.616,
    "end": 6647.783,
    "text": " and preferences for sensing as much as, or is it that one is more for sensing one's more for action, but, uh, very interested in all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6647.823,
    "end": 6652.286,
    "text": "So thank you very much and, uh, look forward to more conversations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6652.306,
    "end": 6655.047,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6655.367,
    "end": 6656.208,
    "text": "Dean or blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6658.737,
    "end": 6659.157,
    "text": " I'll go ahead.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6660.098,
    "end": 6663.521,
    "text": "Um, so thanks for entertaining all my interrogations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6663.801,
    "end": 6664.542,
    "text": "I appreciate it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6664.882,
    "end": 6678.294,
    "text": "Um, if you're going to come back next week, I would encourage you to check out, um, a tale of two densities because like on the tale of Steven with the P's and the Q's, I'd be curious to, to think about or to hear what your interpretation of that is.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6678.394,
    "end": 6680.076,
    "text": "And if you would, um,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6680.785,
    "end": 6689.827,
    "text": " maybe change or maybe you will, I mean, it's just a preprint, so maybe you have a burgeoning affordance to kind of consider that in your explanation in the beginning.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6689.887,
    "end": 6705.57,
    "text": "I'm curious, or if you think it's one of these superfluous extra components that is for the handbook for the recently deceased, not necessarily, you know, like the 13 steps of dying or whatever.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6707.01,
    "end": 6709.511,
    "text": "So I'd be curious to hear what you have to say about that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 6712.691,
    "end": 6713.511,
    "text": " Dean, anything?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6715.172,
    "end": 6734.223,
    "text": "Yeah, it's just that I don't want this to drop down to the sort of quantum level, but I think that when you're doing a guide, it's hard not to sort of try and juggle both the dynamic aspects of what you're trying to share and the stable aspects of what you're trying to share.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6735.044,
    "end": 6739.987,
    "text": "You want the screwdriver to remain robust and constant, and then you want it to also be able to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6741.124,
    "end": 6743.787,
    "text": " be manipulated in such a way that it drives the screw.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6743.847,
    "end": 6750.613,
    "text": "And there's a dynamic and a stability piece to this guiding that's really, really hard to, as you say, square.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6750.633,
    "end": 6752.215,
    "text": "I don't know that it can be squared.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6752.295,
    "end": 6754.337,
    "text": "I think they both have to be maintained.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6754.377,
    "end": 6756.359,
    "text": "And so my sense is that I...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6757.87,
    "end": 6769.817,
    "text": " I didn't know what you were going to do in terms of the guiding, but I think the way that you laid it out did slow things down, did allow the teeth of the screwdriver to get set.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6770.537,
    "end": 6773.219,
    "text": "And then you could actually do something dynamic with it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6774.079,
    "end": 6775.74,
    "text": "So really appreciate that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6775.76,
    "end": 6782.644,
    "text": "And maybe, maybe next week we can talk about when the screwdriver is used for creative purposes, other than driving screws.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6782.684,
    "end": 6784.345,
    "text": "Cause I think what the math says,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6785.632,
    "end": 6799.136,
    "text": " if we use the geometry and the statistics and the philosophy all in one concoction, I think that's the basis or the minimum that we have then to be able to do creative things and not just recombinatorial things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6799.216,
    "end": 6800.677,
    "text": "So maybe we can touch on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6800.717,
    "end": 6810.72,
    "text": "I would be really curious to hear how you see this going off in creative ways without going, because the big fear people have is that just means destabilization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6811.479,
    "end": 6816.827,
    "text": " where I'm saying it has to start from both stable and the potential to move.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6819.491,
    "end": 6820.031,
    "text": "Thanks, Dean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6820.532,
    "end": 6821.634,
    "text": "Stephen, any last thoughts?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6825.458,
    "end": 6835.321,
    "text": " Just to thank you all very much for engaging with our paper, for inviting me on the stream, for asking me really great questions and raising great points that just had never crossed my mind.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6835.361,
    "end": 6838.242,
    "text": "This is exactly the reason why I was hoping to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6838.762,
    "end": 6840.683,
    "text": "I am going to try and come back next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6840.703,
    "end": 6843.844,
    "text": "I can't make any promises right now, though, because next week is a bit of a heavy week for us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6843.884,
    "end": 6845.685,
    "text": "But just, yeah, the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6846.445,
    "end": 6853.471,
    "text": " The prospect of going and reading that paper and then being able to respond in a more intelligent way to Blue's question is making me really want to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6854.051,
    "end": 6858.995,
    "text": "Not to mention all of the other topics, which, you know, we haven't talked about yet for the rest of you as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6859.075,
    "end": 6864.719,
    "text": "So I will let you know during the week, but fingers crossed we'll be back again next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6865.42,
    "end": 6866.061,
    "text": "But thank you all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6866.121,
    "end": 6866.541,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6866.701,
    "end": 6870.544,
    "text": "Yeah, really appreciated everybody sharing their perspective and you're welcome back anytime.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6870.824,
    "end": 6872.385,
    "text": "So see you everybody.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6872.646,
    "end": 6872.846,
    "text": "Peace.",
    "speaker": "SPEAKER_03"
  }
]