[
  {
    "start": 13.066,
    "end": 19.499,
    "text": " all right hello everyone welcome to act in flab live stream number 37.2 it's february 9th 2022.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 24.81,
    "end": 26.451,
    "text": " Welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 27.151,
    "end": 32.954,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.674,
    "end": 35.875,
    "text": "You can find us at the links here on this slide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 36.996,
    "end": 42.579,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 43.618,
    "end": 50.321,
    "text": " All backgrounds and perspectives are welcome here and we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 50.782,
    "end": 56.644,
    "text": "Feel free to visually raise your physical hand if you'd like or use any of our emoji affordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 58.945,
    "end": 72.112,
    "text": "Check out ActiveInference.org to get updates on what the lab is up to and also get more information on how to participate or check out this CODA link if you'd like to see our past and upcoming streams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.602,
    "end": 77.145,
    "text": " We're here today in stream number 37.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 77.266,
    "end": 83.234,
    "text": "It's our third stream after the .0 background video and the .1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 84.892,
    "end": 114.532,
    "text": " group discussion we had on the paper free energy a user's guide by man Payne and kirchoff from 2021 and today we have a few things written there's a couple sections of the paper that we didn't get to last time and I'm sure everyone has brought some interesting thoughts and of course if you're watching live please feel free to add any questions or comments into the live chat because we'll definitely have time to address anything there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 116.054,
    "end": 118.237,
    "text": " We'll start with an introduction and warm-up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.617,
    "end": 128.311,
    "text": "So we'll say hi, mention anything that we're excited to talk about today, something that we liked or remembered or reviewed about the paper this past week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 129.437,
    "end": 130.738,
    "text": " anything that we're wondering about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 131.398,
    "end": 139.062,
    "text": "And as we just mentioned before we began, like what does a dot two for a guide look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 139.762,
    "end": 152.348,
    "text": "So I'm Daniel, I'm a researcher in California and I'm gonna think while others are speaking and then return to what the dot two can be and I'll pass it to Steven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 154.161,
    "end": 155.082,
    "text": " Hello, I'm Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 155.102,
    "end": 156.183,
    "text": "I'm in Toronto.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 157.103,
    "end": 157.804,
    "text": "Stephen Sillett.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 157.964,
    "end": 166.83,
    "text": "I'm doing a practice-based PhD around social topographies and how they can be used in community development and theatre for development.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 167.271,
    "end": 175.677,
    "text": "And, yeah, I'm looking forward to looking at some of the implications of how this might be rolled out in different types of contexts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 176.798,
    "end": 178.339,
    "text": "I'll pass this over to Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 181.965,
    "end": 182.366,
    "text": " I'm Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 182.466,
    "end": 184.608,
    "text": "I'm in British Columbia at the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 185.128,
    "end": 206.047,
    "text": "And as with all things guide related, I'm always interested in how we translate from the word to the deed, getting from a place of information that's curated to actions that are also maybe curated based on that bit of information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.107,
    "end": 207.068,
    "text": "And I'll pass it to Luke.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 213.143,
    "end": 214.323,
    "text": " I lost my mute button.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 214.343,
    "end": 215.404,
    "text": "I'm blue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 215.524,
    "end": 222.486,
    "text": "I'm a research assistant or research consultant in New Mexico, transported back to my grad school days.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 222.506,
    "end": 225.006,
    "text": "I had like a mute button loss, a time warp all at the same time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 226.847,
    "end": 233.849,
    "text": "I'm excited to get into the sections of the paper that we didn't really discuss, like in particular, like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 234.409,
    "end": 238.992,
    "text": " using mathematics to validate empirical claims or justify empirical claims.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 239.312,
    "end": 246.336,
    "text": "And also kind of zooming out and evaluating this work from the perspective of a guide.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 246.356,
    "end": 250.138,
    "text": "And like, I think about the Hitchhiker's Guide and like, don't panic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 250.178,
    "end": 253.1,
    "text": "And like, what are the things that we really like need?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 253.12,
    "end": 259.904,
    "text": "What are the essential components of the FEP and active inference that we need to communicate to others?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 260.504,
    "end": 263.506,
    "text": "And I'll pass it back to Daniel, who's going to tell us what a dot to really is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 266.049,
    "end": 274.493,
    "text": " Well, what it really has been is the far side of the bathtub.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 275.694,
    "end": 278.736,
    "text": "The .0, we're kind of dropping into the skating rink.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 279.536,
    "end": 284.779,
    "text": "And then in the .1, there's an opening and we explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 284.839,
    "end": 286.7,
    "text": "And last week was an awesome discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 286.74,
    "end": 288.421,
    "text": "We got to speak with the first author.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 289.602,
    "end": 294.124,
    "text": "And now we continue, but also explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 295.754,
    "end": 300.495,
    "text": " recollect some of the threads that we opened and build inertia towards where we take it next.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 300.756,
    "end": 307.918,
    "text": "And I think there's almost no genre more appropriate for a .2 than the guidebook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 307.978,
    "end": 314.9,
    "text": "Like you put down in Dean's car manual metaphor, like you don't hold that up when you're driving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 315.6,
    "end": 320.982,
    "text": "And so papers, similarly, they engage our regime of attention transiently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 321.882,
    "end": 324.823,
    "text": "You're not supposed to only be looking at the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 325.481,
    "end": 336.133,
    "text": " so we're going to put this paper down we're going to end this video eventually and then what will be left with us how will our generative model have been updated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 337.392,
    "end": 349.254,
    "text": " so that our policy selections are different, whether they're mental action policies related to attention or metacognition, or whether they're physical action policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 350.135,
    "end": 363.297,
    "text": "So I guess it relates to that quintessential dot two question of moving from the word of the paper that we're engaging in in our discussions to the deeds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 363.618,
    "end": 365.618,
    "text": "And what are those deeds?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 366.929,
    "end": 376.846,
    "text": " And then it's almost like this is an action-oriented framing of a dot 2 or of just what we're up to today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 376.866,
    "end": 378.689,
    "text": "And then there's this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 380.689,
    "end": 409.295,
    "text": " asynchronous or not temporally binding elements of, which is raised by the paper though, of what are the essential components of FEP and ACT-INF and also the differentiation perhaps between the conceptual and the pedagogical, like are the pieces that are the minimal kernel of FEP and ACT-INF, is that where we, is that page one?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.296,
    "end": 410.856,
    "text": " on the guide?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 412.016,
    "end": 428.3,
    "text": "How does education, which is going to be the trajectory of a learner, relate to the theoretical apparatus, which is kind of like a building or some sort of structure that doesn't necessarily have a trajectory-like format?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 431.361,
    "end": 434.342,
    "text": "So maybe just to return to this question of the word and the deed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 437.014,
    "end": 456.519,
    "text": " In the dot one, we heard about what the target audience was from the author's perspective for this paper, which was, it's a special issue, it's a topical collection called the Free Energy Principle from Biology to Cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 457.259,
    "end": 464.701,
    "text": "And we heard a little bit about how the editor made a request of the authors to write this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 466.147,
    "end": 488.839,
    "text": " special piece and they also summarized it in their last aim we aim to increase philosophical understanding of active inference so that it may be more readily evaluated so within the philosophical domain so that it can be evaluated but what other domains or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 491.9,
    "end": 520.782,
    "text": " ideas are important here and then what are these actions so philosophers might be interested in reading this so that they can better philosophically evaluate but what are the idea to deed pipelines that we're interested in or opening up here steven and then anyone else one of the aspects that this this paper talks about is how much things can be screened off how much",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 521.916,
    "end": 531.162,
    "text": " It gives us latitude to separate out realistic empirical interpretations from the modeling of.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 532.663,
    "end": 534.684,
    "text": "And I think that's the feature.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 534.704,
    "end": 547.572,
    "text": "They also talk about, and I'd be interested in what others think about this, but they talk about the Markov blanket as giving this opportunity to screen or screen out what's inside and outside.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 547.872,
    "end": 550.174,
    "text": "And I wonder how...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 551.343,
    "end": 554.786,
    "text": " this idea of screening, because screens are not the same as a wall.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 555.066,
    "end": 556.628,
    "text": "It's not walling off.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 557.668,
    "end": 573.482,
    "text": "But as come up on the Twitter conversation with Kasper Hesp this week, this idea of leakage, like if I have a screen, I've got a blind here, as I described earlier, and there's some leakage through the blind, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 573.862,
    "end": 578.145,
    "text": "But is even that idea of screening off a little bit passive?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 579.042,
    "end": 602.579,
    "text": " curious about that a little bit dead anyway yeah if there weren't statistical dependencies between internal and external states like if there were two states that were just not even there was no path from here to there there wouldn't even be able to be blanket states partitioned out",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 604.54,
    "end": 614.763,
    "text": " So internal and external states are conditionally independent upon the blanket states using the narrow Pearl 1988 sense of Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 616.984,
    "end": 622.285,
    "text": "But there is a channel, there is a path from the internal to the external states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 622.385,
    "end": 627.787,
    "text": "Again, otherwise they wouldn't even be part of the same click in that part of the Bayesian graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 630.067,
    "end": 631.548,
    "text": "And then also, yes, Steven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 632.748,
    "end": 647.866,
    "text": " Yeah, so this click, this question of how much we need to find purchase through that blanket and the screening off and how much we can get away with",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 648.996,
    "end": 661.682,
    "text": " more broadly thinking about the free energy principle and inference and how that can be stepped up and down depending on where we are in terms of empiricism and trying to make claims.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 663.342,
    "end": 665.003,
    "text": "Themes that feature a lot in this paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 666.043,
    "end": 677.048,
    "text": "And I'm sensing that because they're sort of arguing in a way that as long as you can get functional correlations",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 680.211,
    "end": 695.666,
    "text": " then how you get at them be that approximate isn't necessarily about it being the real world that gives you it there may be different ways to arrive at something",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 696.786,
    "end": 699.687,
    "text": " that's approximately useful.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 699.867,
    "end": 715.153,
    "text": "And I think that speaks to dynamical systems over traditional systems in the sense that I can have a system which isn't the real system, but if my system flips or the regime shifts in similar ways to the target,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 716.658,
    "end": 731.024,
    "text": " as opposed to it actually being it and having the right types of values in it, in itself, it's more about what's the way that I start to see my uncertainties flip from one belief to another.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 731.044,
    "end": 742.149,
    "text": "If the way the belief updating happens is still approximately useful enough for something to happen that's viable,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 743.37,
    "end": 745.893,
    "text": " then that is still okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 746.474,
    "end": 751.82,
    "text": "And I'm wondering if that isn't possible in normal systems work, which isn't dynamical systems work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 757.907,
    "end": 780.471,
    "text": " look at the order and kind of trace the trails of the authors so in the early example we had just the case of perceptual inference which was first introduced in the exact base context and then we moved into the variational base caference and we had w world states unobserved",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 781.664,
    "end": 783.425,
    "text": " That's the actual temperature in the room.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 784.225,
    "end": 785.265,
    "text": "X, observe data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 785.565,
    "end": 787.226,
    "text": "That's the reading on the thermometer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 787.986,
    "end": 794.788,
    "text": "So this is the simplest Bayesian latent or hidden state model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 795.668,
    "end": 797.889,
    "text": "So is there a Markov blanket here?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 801.35,
    "end": 802.05,
    "text": "Asking for a friend.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 806.149,
    "end": 808.15,
    "text": " No, because there's only two notes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 808.591,
    "end": 814.855,
    "text": "So there cannot be a partitioning between internal and external states conditioned on a third note.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 814.875,
    "end": 819.818,
    "text": "It's kind of like the minimum two, but now we're taking it to minimum three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 820.299,
    "end": 830.346,
    "text": "You can't have a blanket, an intervening or an intermediating, or a state which makes two others conditionally independent unless you have three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 830.706,
    "end": 831.266,
    "text": "Three's a crowd.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 831.286,
    "end": 831.827,
    "text": "Three's a party.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.967,
    "end": 834.568,
    "text": "Now, in figure three...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 835.54,
    "end": 837.361,
    "text": " there's the basic model of action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 837.882,
    "end": 844.967,
    "text": "So we still have the same definitions and meanings of W, unobserved world states, and X, observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 845.587,
    "end": 848.83,
    "text": "Those observations are now being passed to the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 849.59,
    "end": 853.553,
    "text": "And indeed they were implicitly being passed to the agent above.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 854.474,
    "end": 862.82,
    "text": "If there would have been a third node agent there, it could have been said that the X was a Markov blanket, but as it's exactly written, there isn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.454,
    "end": 869.02,
    "text": " Now, here, what are the blanketing states?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 873.405,
    "end": 881.555,
    "text": "X and Z. If you are conditioning upon X and Z, it makes W and the agents conditionally independent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 882.397,
    "end": 883.057,
    "text": "And this is sort of,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.144,
    "end": 902.263,
    "text": " presaging the fristen partition on the markov blanket which is to split up the notion of the total set of intermediating or conditionally independentizing states you know markov to pearl epoch",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.237,
    "end": 920.764,
    "text": " and showing them in a way that's partitioned into incoming, from the Asian's perspective, statistical dependencies, which can be interpreted as sensory states or the observation of model data, and then outgoing statistical dependencies, Z, Z action you select.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 921.444,
    "end": 925.626,
    "text": "And then those can have some influence on world states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 926.947,
    "end": 927.707,
    "text": "Yes, Steven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 928.874,
    "end": 945.358,
    "text": " You know when you say outgoing statistical dependencies, and that's also interesting because at some point the outgoing cannot be statistical alone because you don't have the same kind of information availability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 945.418,
    "end": 953.16,
    "text": "So it tends to be more using energy and sort of least action type approaches.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 953.62,
    "end": 954.26,
    "text": "So that would be...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 955.663,
    "end": 962.089,
    "text": " I'm sort of preempting that, but that's where it starts to split out later, but they don't get bogged down in that at this stage.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 962.53,
    "end": 966.653,
    "text": "They keep it all in the sort of Bayesian environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 971.658,
    "end": 980.687,
    "text": "Not exactly sure what you mean, since these arrows represent not mechanistic or causal influence, but just statistical dependencies in the graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 982.654,
    "end": 1009.574,
    "text": " yeah i was thinking more when that becomes action uh when it's then translated to be action so then um rather than sensory which has much more sort of informational content action could be seen as being more about what is more energy efficient or starts to look at more the shape of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1011.189,
    "end": 1012.87,
    "text": " the way that action happens.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1015.853,
    "end": 1023.059,
    "text": "I'm wondering whether that is needed to be concerned about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1025.498,
    "end": 1031.363,
    "text": " If it were a software agent, then these are both informational, really.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1032.664,
    "end": 1037.268,
    "text": "And no matter what type of agent we're modeling, it still is just a statistical dependence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1037.949,
    "end": 1038.149,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1038.529,
    "end": 1043.954,
    "text": "Then you brought up questions about energy expenditure during action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1044.454,
    "end": 1050.7,
    "text": "And that's one of the pieces that is sometimes challenging to parse out, which is like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1052.761,
    "end": 1056.625,
    "text": " First, looking at variational free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.345,
    "end": 1059.447,
    "text": "So this is on the perceptual side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1060.048,
    "end": 1067.856,
    "text": "We're looking at the instantaneous fitting of a variational model of ongoing sensory information given the priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1069.033,
    "end": 1077.975,
    "text": " That doesn't mean that for, for example, an organism, it's the lowest energy possible interpretation of the sensory data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1078.715,
    "end": 1088.358,
    "text": "And then when we bring action into the picture and look at expected free energy, neither does this mean that the Z that is selected is the laziest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1089.758,
    "end": 1093.219,
    "text": "It just means that this G is being minimized and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1094.989,
    "end": 1100.738,
    "text": " So it's not the Gibbs free energy or the calories that are being minimized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1100.939,
    "end": 1104.564,
    "text": "It's something informational that has to do with model fitting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1106.502,
    "end": 1107.583,
    "text": " Yes, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1108.143,
    "end": 1110.405,
    "text": "Yeah, no, that definitely makes sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1111.025,
    "end": 1117.27,
    "text": "And one thing Carl Friston mentioned in the symposium we did is there's kind of two boundaries.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1117.67,
    "end": 1121.312,
    "text": "There is kind of two boundaries happening in terms of Markovian boundaries.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1121.333,
    "end": 1123.894,
    "text": "There's one coming in and there's one going out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1124.575,
    "end": 1128.618,
    "text": "And the blanket's kind of got both of those boundaries happening.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1129.038,
    "end": 1135.402,
    "text": "So like you said, yeah, it's the way that inference happens to know what actions to take",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1136.924,
    "end": 1141.628,
    "text": " is different, but the way that information is established",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1144.013,
    "end": 1146.755,
    "text": " is for sure different going through each of those.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1146.775,
    "end": 1155.823,
    "text": "I mean, as it is with every mode of sensory data that comes in, because it could be vision, it could be hearing, it could be kinesthetic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1156.483,
    "end": 1161.448,
    "text": "So you've got different types of input and you've got different types of output.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1162.428,
    "end": 1164.35,
    "text": "And this diagram at the moment is keeping both of those.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1164.37,
    "end": 1166.252,
    "text": "There's no idea of leakage or...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1167.735,
    "end": 1178.18,
    "text": " are those questions about how things leak across between it's like there's, there's two distinct blows going on, but that, and it simplifies it in that sense.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1178.2,
    "end": 1184.122,
    "text": "Um, yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1185.223,
    "end": 1185.323,
    "text": "Um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1187.287,
    "end": 1200.215,
    "text": " we've seen other topologies of perception, cognition, and action, like an edge connecting sense and action states, or an arrow that's having a statistical dependency the other way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1200.636,
    "end": 1203.898,
    "text": "Okay, but just to return here, yes, Dean, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1205.623,
    "end": 1207.205,
    "text": " This is a question for everybody here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.445,
    "end": 1219.877,
    "text": "So, Stephen, the first author talked about the fact that sort of the backstory of this whole guide thing was to, and I'm putting words into it, but I want to keep it reasonably short.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1219.897,
    "end": 1221.018,
    "text": "I talked too much last week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.042,
    "end": 1233.887,
    "text": " he basically wanted to be able to remove some of the impediments and he pointed directly at some of the math that acted as a, maybe a kind of a, a bridge too far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1234.927,
    "end": 1245.911,
    "text": "And so he wanted to make that a simpler, um, maybe something that's more user friendly and therefore something that people will take up or adopt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1246.492,
    "end": 1250.213,
    "text": "And when you're putting on this, um, when you're putting up this slide here now, Daniel,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1251.403,
    "end": 1263.204,
    "text": " I don't know whether, I know it eventually will be translated into the math formalisms you just pointed, you had them up a minute ago, but I'm not really sure whether the evaluation aspect that philosophers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.781,
    "end": 1270.524,
    "text": " are going to then decide whether something is worthy of their continued attention or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1270.864,
    "end": 1282.69,
    "text": "I'm not sure if that, how does this critical path, critical and evaluation being related in this context, how does this minimize or reduce",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1283.59,
    "end": 1305.869,
    "text": " the impediment nature of what the math is like if we're gonna we're gonna guide somebody through this and their and their one of their hopes is to be able to say okay well i'm not just making this stuff up there's actually some some way of being able to formalize this how does that through this kind of first step become",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1307.782,
    "end": 1315.656,
    "text": " become easier I guess in terms of what the actual formula says because I know that when I first actually touched on the formulas myself",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.347,
    "end": 1319.488,
    "text": " it didn't go back to a critical path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1320.148,
    "end": 1324.109,
    "text": "Like there was no real physical example I could find in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1324.529,
    "end": 1340.853,
    "text": "And I think maybe that's what helped me understand that maybe this thinking or this ability to think statistically, sorry, to think statistically, maybe that requires, as Carl also said, our ability to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1342.046,
    "end": 1369.767,
    "text": " do the math we have to be able to do the math and the math doesn't get simple so i'm wondering what people think about that okay steven if you have a direct response yeah yeah well i think that um in some ways this goes back to a little bit before where the math was it helps us see why the math was put in at certain points by going to even a stage earlier so i think there is some use in that because i think like you say um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1372.293,
    "end": 1396.708,
    "text": " there is a slight inflation in the way that the process theory then gets interpreted and if it's already locked in too much in what's given to us with all the math like well where did that math come from and and then that starts to get us involved in some of these earlier questions because what's interesting here is the the blanket i think of the blanket often as as a method for transfer",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1398.399,
    "end": 1409.529,
    "text": " It's a mode for transfer, just a bit like lithographic blankets transfer from an analog roller to a blanket roller to a printed image and to the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1410.049,
    "end": 1411.09,
    "text": "It's transferring.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1411.25,
    "end": 1416.815,
    "text": "Now, it also does mean that there's no direct contact between paper and...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1421.335,
    "end": 1422.996,
    "text": " paper and printing plate, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1423.776,
    "end": 1427.979,
    "text": "So it's screened off as well, but it depends which way it's gone at, you know?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1427.999,
    "end": 1446.889,
    "text": "And in this case here with these red circles, it's useful to think about, okay, well, there's something that's been inferred from the world, but that inference isn't directly accessible.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1446.909,
    "end": 1450.411,
    "text": "It's not, that observed data,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1451.75,
    "end": 1480.339,
    "text": " isn't coming in as data it's coming in as um what's inferred to be about what's out there which isn't the same as a signal so it's like how much is the agent able to have the environment transfer something onto them and transfer something onto the environment and how much are they screened off from",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1482.378,
    "end": 1501.449,
    "text": " environment how much is the environment screened off from them i suppose that's that's something that relates to that hey thanks so dean you asked how does the yes you want to go for it first no go ahead and then i'll just follow up both you and stephen",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1501.934,
    "end": 1529.458,
    "text": " okay so you asked how does the critical path the linear pedagogical path that is traced by this version of this guide reduce the actual perceived impediments in an audience specific or in a general sense so it definitely helps us see where math could or should or does or will enter the picture i think it sets up an aboutness of the math like what is perception about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1530.768,
    "end": 1538.213,
    "text": " This is a graphical interpretation, graphical meaning visual, but also like a network, Bayesian graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1539.234,
    "end": 1547.82,
    "text": "And so if you're concerned with a different connectedness of terms, this is not the math you're looking for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1548.741,
    "end": 1558.388,
    "text": "But on the perception side, if this is kind of how you're setting up the template for what you're wondering about, like what's out there, that's what this first image shows with WNX.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1559.594,
    "end": 1574.506,
    "text": " what's out there and how do i act or how does an agent act that's the aboutness which is not unique to active inference that's control theory cybernetics etc um the stepwise guide element",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1575.803,
    "end": 1604.107,
    "text": " reminds me i hope it's not unrelated in high school cross country the coach would say something like well the race is going to start and you got to get out there fast and then it's the middle is the part where you need to be running and going hard then at the end you got to push it and finish and run hard and everything and i was like you could have just said run the whole time was it not the same thing as saying run at the beginning middle and end and so but run really hard during the whole race i don't know coach",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1605.439,
    "end": 1627.748,
    "text": " whole race is a long time to run here by breaking it into really specific stepwise changes to the math like a piecewise defined function there's an opportunity to pace and lead a learner and then to accumulate or pause for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.335,
    "end": 1637.641,
    "text": " divergence or prediction error that they're experiencing, like maybe before this first train stop, someone has a question about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1638.241,
    "end": 1643.185,
    "text": "Or maybe just graphically, when action enters the picture, somebody has a question about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.119,
    "end": 1653.728,
    "text": " Now we could be talking about equations, symbolic equations that describe the W to X relationship or the agent to Z to W relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.288,
    "end": 1660.494,
    "text": "And then this paper is going to propose just one symbolic expression or several symbolic expressions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1662.162,
    "end": 1667.586,
    "text": " that today we call active inference approach to addressing that question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1667.646,
    "end": 1680.815,
    "text": "But it builds up the aboutness in a stepwise way that even though it is conceptually no different than just saying, here's the action perception loop and the equations, which is pretty much what every FEP paper does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1682.128,
    "end": 1694.795,
    "text": " But by starting somewhere a lot more atomic, it allows the stepwise addition of the math in a way that's incremental rather than like, here's the apparatus and that leaves much of it implied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1695.295,
    "end": 1695.435,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.744,
    "end": 1724.86,
    "text": " Yeah, and I wouldn't disagree with anything you're saying there, but I do think that there's a not-too-subtle difference between stepwise and then the kind of step function, the leaving of the critical path, and now seeing a set of mathematical formalisms around a statistical distribution, and I'm just wondering how that transition occurs, because it doesn't seem like there's a natural ramp from following...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.067,
    "end": 1752.539,
    "text": " something clockwise or counterclockwise to being able to change things into um alpha numeric um ratios which is essentially what the statistic when when it's written out statistically what that does right the sum and the and the and the ratio so if if if the impediment was some of the um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1754.213,
    "end": 1755.495,
    "text": " non-frequent math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.656,
    "end": 1768.37,
    "text": "And I'm not critiquing in any way what Stephen's written out here in his guide, but it seems like there's still some assumption on the author's plural part that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.096,
    "end": 1779.339,
    "text": " you will be able to take enough from this critical path representation to see what it looks like when you're overfitting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.679,
    "end": 1783.04,
    "text": "I like that there was a lot of explanation of what overfitting is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1783.5,
    "end": 1784.741,
    "text": "And then there was Plunk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1785.221,
    "end": 1788.742,
    "text": "And here's the formula that that overfitting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1793.104,
    "end": 1816.552,
    "text": " looks like in in mathematical form so it's kind of a big assumption that the person who's reading this is going to be able to make that leap go from this level of walking clockwise or counterclockwise to now suddenly being able to understand what all of those different symbols in that formula means i'm not i'm not saying it can't be done but i'm just wondering how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1817.532,
    "end": 1831.343,
    "text": " how as people who are trying to lay out something in a kind of step progression, how they assume that they can just sort of put holds into that big wall and people still don't have a fear of heights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1832.563,
    "end": 1841.645,
    "text": " It's still better than not having a ladder, but it doesn't mean I want to go up 40 feet without safety, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1842.005,
    "end": 1842.925,
    "text": "Just because it's there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1843.485,
    "end": 1855.787,
    "text": "And I kind of see that in terms of how the transition works between this form of representation and then what the representation looks like in the math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.987,
    "end": 1858.227,
    "text": "That's a big leap, I think, for a lot of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1860.528,
    "end": 1860.968,
    "text": "Thanks, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1860.988,
    "end": 1861.228,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1863.857,
    "end": 1877.321,
    "text": " And one, I suppose one danger that's always present when naming things is they then move into this with the predictive processing discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1877.921,
    "end": 1883.423,
    "text": "You know, how much can you name things as being data in these contexts?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1883.963,
    "end": 1892.846,
    "text": "So it becomes statistical, but like you say, there is effectively information coming in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1894.062,
    "end": 1901.612,
    "text": " But data in some ways may be a bit of a tricky word to use because data kind of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1902.802,
    "end": 1928.754,
    "text": " implies an inherent um representational nature and they talk about this in the paper a little bit of that tension between something that's in is coherent enough and can be represented and something where you can't ever quite get at that the inference the predictive processing has to then leverage something like generative models using the body etc to even get at the uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1930.123,
    "end": 1951.956,
    "text": " that that that that that um to allow that arrow to be something in a much more fuzzy way you know um and uh so there was always that risk of leading people astray even at this early stage so a few comments there",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1953.766,
    "end": 1973.784,
    "text": " Dean you asked like how do we get from this graphical layout so we've taken the first bite which is this is roughly the correct topology for thinking about problems of perceptual inference and action inference that is if someone re imagines this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1974.867,
    "end": 1997.368,
    "text": " amazing but this is just the approach to perception cognition and action and impact that is a common kernel of a phrasing now let's just think about it as an example rather than just the um abstraction let's just say that we're interested in listening to a cat",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1998.499,
    "end": 2019.503,
    "text": " then inferring what its location is so we're only talking about this simpler w and x connection first so here's what the empirical data are four two one and three you could have a model of decision making on x that just says the cat is always in the kitchen",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2020.407,
    "end": 2021.408,
    "text": " Just, I don't care.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2021.548,
    "end": 2022.449,
    "text": "I'm okay with being wrong.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.729,
    "end": 2023.41,
    "text": "The cat's in the kitchen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2024.671,
    "end": 2026.152,
    "text": "Or someone could say, the cat's always in the bedroom.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2026.513,
    "end": 2027.814,
    "text": "Or I flip a coin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2028.695,
    "end": 2031.458,
    "text": "Or I go with what some other person told me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2032.378,
    "end": 2036.923,
    "text": "There's many ways to make a decision about world states conditioned on data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2037.804,
    "end": 2041.127,
    "text": "One principled approach, which they write here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2042.048,
    "end": 2045.231,
    "text": "One famous method for solving this problem, Bayesian conditionalization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2046.297,
    "end": 2061.78,
    "text": " So that's the question which is framed normatively here about what one ought to do is integrate their beliefs, which can be empirically grounded, that's parametric empirical Bayes, upon incoming data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2062.54,
    "end": 2073.582,
    "text": "So first, in this case, the next little tiny step is we can use Bayes' theorem to look at inference on external states given incoming data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2074.673,
    "end": 2081.276,
    "text": " Again, if someone disagrees with using a Bayesian approach, an exact Bayesian approach, that's the time to speak their piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2083.197,
    "end": 2089.88,
    "text": "This is a very simple example with like kind of the minimum two by two matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2090.181,
    "end": 2098.264,
    "text": "If it was any thinner of a model on any dimension, like if there was only a kitchen, then the question of location inference would be trivial.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2098.745,
    "end": 2099.265,
    "text": "It's in the kitchen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.64,
    "end": 2112.954,
    "text": " If there was only one sound equally, it would be a trivial problem because the sound would then be uninformative from an information theory perspective, which they're not bringing up here yet about location.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2113.996,
    "end": 2119.202,
    "text": "Then the next tiny step and then Dean is to go from the exact Bayesian approach",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2120.489,
    "end": 2134.477,
    "text": " parametric Bayesian approach to variational catference, which is imagine that this was not just two by two table, but there was a higher dimensional state space of observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2135.337,
    "end": 2144.082,
    "text": "And so it's not going to be possible to just look at this in a spreadsheet or on a piece of paper, but it's actually a large model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2144.862,
    "end": 2147.684,
    "text": "And so we need tractable heuristics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2148.686,
    "end": 2165.159,
    "text": " And so that is the next tiny step from now we're going to take not just a principled approach to treating the W to X relationship, Bayesian perceptual inference, but we're going to go beyond that and ask what's a tractable and reasonable approximation, variational inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2165.94,
    "end": 2171.424,
    "text": "There's other situations where maybe there's another tractable approach like MCMC.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2172.912,
    "end": 2174.033,
    "text": " Markov chain Monte Carlo.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2174.613,
    "end": 2178.115,
    "text": "That's another approach, which we've talked about in other cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2178.135,
    "end": 2180.016,
    "text": "That's the pointillism sampling-based approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2180.297,
    "end": 2181.858,
    "text": "It works really well for certain problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2182.318,
    "end": 2183.819,
    "text": "It doesn't work as well for other problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2184.299,
    "end": 2185.94,
    "text": "And so that's the next little tiny step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2186.16,
    "end": 2190.803,
    "text": "We're going to go from this setup of perception to using Bayes' theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2191.403,
    "end": 2192.264,
    "text": "You could do otherwise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2192.784,
    "end": 2197.447,
    "text": "And then from using exact or parametric empirical Bayes to using variational Bayesian approaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2197.867,
    "end": 2199.188,
    "text": "And again, you could do otherwise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2199.689,
    "end": 2200.369,
    "text": "Dean and then Steven.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2201.96,
    "end": 2208.606,
    "text": " Yeah, and again, all I think I'm pointing out is that for some, it is a tiny little step.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2210.148,
    "end": 2220.977,
    "text": " But I don't think it's a ramp going from one version of representation to four square version of representation to formulaic version of representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2221.017,
    "end": 2236.129,
    "text": "I think for people who see the math maybe as an impediment to their further continuation of using the potential of the free energy principle, maybe they aren't such small steps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.169,
    "end": 2237.51,
    "text": "There certainly aren't ramps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2238.371,
    "end": 2244.757,
    "text": " in terms of how we interpret each of those three particular ways of representing information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2244.977,
    "end": 2245.678,
    "text": "There's no ramp.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.479,
    "end": 2261.313,
    "text": "There's an actual transition moving from what you've got on the screen now to the 60-40, 50-50 way of being able to interpret that way of representing the information to the one that has an equal sign.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.131,
    "end": 2265.452,
    "text": " They're very, very different, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2265.872,
    "end": 2271.875,
    "text": "I mean, I understand the relativity piece, and I see that carrying throughout.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.215,
    "end": 2277.677,
    "text": "This is what relativity looks like this way, and then this way, and then this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.957,
    "end": 2286.381,
    "text": "But I think the struggle for people who are putting guides together is the assumption that what's little for you is little for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2286.961,
    "end": 2287.901,
    "text": "It isn't always that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2287.921,
    "end": 2291.943,
    "text": "I don't know if we can fix that here in these labs, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2292.583,
    "end": 2300.266,
    "text": " I don't think it's something that we should assume is necessarily one small step for humankind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2301.046,
    "end": 2306.848,
    "text": "Because I think the reason why the authors were asked to put two years worth of work in this in the first place",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2307.708,
    "end": 2310.77,
    "text": " was because the math is acting as an impediment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2311.45,
    "end": 2312.851,
    "text": "Now, do you start with the math?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2313.031,
    "end": 2317.374,
    "text": "Because I agreed with Stephen last week when he said, this is the direction we took.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2317.414,
    "end": 2323.458,
    "text": "We decided to slow things down, not simplify, but slow things down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.718,
    "end": 2326.299,
    "text": "So I really appreciate why they've done what they've done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2326.319,
    "end": 2330.022,
    "text": "But if they knew going in that they're going to have to go slow,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2330.95,
    "end": 2345.816,
    "text": " then they're probably going to see whether or not that bump, as we change representations, is actually relatable to the previous version or form that the relationship was presented as.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2346.516,
    "end": 2348.657,
    "text": "And I don't know that people necessarily do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2348.857,
    "end": 2356.06,
    "text": "Like, Blue's going to have a say on this too, but she mentioned the arbitrariness of something that doesn't update.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2357.831,
    "end": 2359.913,
    "text": " And so it doesn't retain its form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2360.413,
    "end": 2367.779,
    "text": "And should we just assume that we all saw the morphology in the same way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2369.281,
    "end": 2369.801,
    "text": "It's tricky.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.381,
    "end": 2379.989,
    "text": "I'm just going to leave it at tricky because I'm not sure anybody that's putting a guide together necessarily has the perfect way of being able to deliver it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2380.009,
    "end": 2383.092,
    "text": "Okay, thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2383.292,
    "end": 2384.573,
    "text": "Blue, and then Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2387.788,
    "end": 2401.361,
    "text": " So something that I think is interesting is the mathematical interpretations have like philosophical underpinnings almost, or maybe it's the other way around.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2401.881,
    "end": 2410.469,
    "text": "So when you're looking at like, for example, this difference between a probability distribution and a preference distribution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2411.038,
    "end": 2423.869,
    "text": " Like if the cat is in the kitchen 75% of the time, you can just assume there's like the underlying assumption that it prefers to be in the kitchen most of the time, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2424.129,
    "end": 2427.312,
    "text": "Like, so because that's where the food is or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2427.732,
    "end": 2434.999,
    "text": "So, and similarly, like in homeostasis, if I'm at 37 degrees Celsius, that's my temperature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2436.078,
    "end": 2443.641,
    "text": " If I'm there 95% of the time, you can assume that I have a preference to have a body temperature of 37 degrees Celsius.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2443.681,
    "end": 2450.504,
    "text": "I think that there's that underlying connection, but it gets really complicated when you try to extrapolate to something like cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2451.223,
    "end": 2455.186,
    "text": " there's like, I prefer to be rich.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2455.346,
    "end": 2457.848,
    "text": "I prefer to have 90% of the money in the world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2457.928,
    "end": 2460.129,
    "text": "For example, like you can say like, I want all the money.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2460.429,
    "end": 2465.893,
    "text": "Like you think about something like that, but then there's so many complicated, like do I really want all the money?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2465.953,
    "end": 2469.596,
    "text": "No, because then everyone else would be homeless and impoverished would be horrible, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2469.636,
    "end": 2471.317,
    "text": "Like, so you don't really want all the money.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2471.717,
    "end": 2480.944,
    "text": "Like there's, and then if I say, if I prefer to be rich, but I'm stuck in an impoverished situation, you can assume that there's like a learning gap",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2481.533,
    "end": 2482.98,
    "text": " between how do I earn money and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2484.577,
    "end": 2486.357,
    "text": " being in the space where I don't have any money.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2486.397,
    "end": 2488.078,
    "text": "Like I don't know how to have money.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2488.158,
    "end": 2489.498,
    "text": "Like there's a knowledge level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2489.518,
    "end": 2497.5,
    "text": "So when you bring cognition into it and like you ask people like what their preferences are, like I prefer to live by the beach, but I live in New Mexico.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2497.52,
    "end": 2498.98,
    "text": "I mean, we have lots of beach, but no water.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2499.42,
    "end": 2509.562,
    "text": "So there's like, you know, there's, I don't know, there's the preferences and then the probability, but is there some kind of like cognitive dissonance?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2509.582,
    "end": 2511.863,
    "text": "Like you think we think what our preferences are,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2512.768,
    "end": 2515.45,
    "text": " or maybe not where our probability distributions are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2515.55,
    "end": 2525.558,
    "text": "Like I prefer to be by the beach, but 90% of the time, I prefer to be by the ocean, but 90% of the time you find me in the desert, that there's like, there's some cognitive dissonance going on there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2526.258,
    "end": 2537.567,
    "text": "And so I think that the mathematical interpretations have a lot of philosophical implications that maybe, you know, we need to think about more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2538.028,
    "end": 2542.291,
    "text": "Like when is a preference distribution and a probability difference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2543.12,
    "end": 2545.461,
    "text": " distribution different, and why are they different?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2546.101,
    "end": 2548.901,
    "text": "What is going on when the preferences are not the probabilities?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2553.802,
    "end": 2554.603,
    "text": "Thanks, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2556.023,
    "end": 2558.543,
    "text": "Yes, this will take us soon to the tale of three-piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2558.764,
    "end": 2559.384,
    "text": "Stephen, first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2562.004,
    "end": 2563.104,
    "text": "Yeah, very good points there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2564.845,
    "end": 2568.466,
    "text": "When you said, Daniel, there about the exact base on the world,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2570.45,
    "end": 2582.045,
    "text": " It goes into the variational base, which in some ways is it starts to hit the Markov blanket and start to give time steps as it starts to go through into the generative model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2583.007,
    "end": 2606.855,
    "text": " you then got and as was useful from our um again the symposium with carl kristen he talked about you know the starting point often for active interest is the generative model you know how do you get at the generative model so the general route is that in some ways this exact base is almost needed in the modeling sense to give you what we think we know the world is when we're setting up our",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2607.819,
    "end": 2627.208,
    "text": " model or our experiment of people doing something where we're going to see what the results are so it's like the agent can't know what w is they can't know what the exact base is but like with the cat experiment sorry the cat matrix there okay we we could arbitrarily put one in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2628.348,
    "end": 2632.009,
    "text": " that we can say we know as objective observers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2632.47,
    "end": 2637.912,
    "text": "It's going through, goes to the agent, and then the agent does something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2638.432,
    "end": 2649.096,
    "text": "And as Blue said, sometimes that what they do isn't only in response to what's coming in, which is quite often not.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2649.136,
    "end": 2652.277,
    "text": "It's not just, I've seen food, can I eat food?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2653.573,
    "end": 2680.556,
    "text": " much food as possible there's this well what's the consequence of my actions going forward maybe a lot of times we then start to get into this higher dimensional stuff where the circle that you put in there going into w there's that red circle on the left which so it goes into the w is what is really of concern you know the humanities are around what's what's that about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2681.198,
    "end": 2681.518,
    "text": " Right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2682.279,
    "end": 2689.445,
    "text": "And normally the generative model work that is done in active inference is the circle on the right-hand side.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2690.306,
    "end": 2693.189,
    "text": "How do we predict the way beliefs are being updated?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2693.769,
    "end": 2702.136,
    "text": "And what's the way the beliefs, because it's normally coming in that direction, because you can sort of control, you can do an exact base.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2702.216,
    "end": 2706.0,
    "text": "There's the one place you could theoretically set your experiment with an exact base is W.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2707.182,
    "end": 2711.784,
    "text": " It's kind of hard to put exact values on an agent unless, of course, it's a robot potentially.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2713.605,
    "end": 2719.829,
    "text": "So I think there's something quite interesting there about how much is this",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2722.578,
    "end": 2725.62,
    "text": " And it's a practical, instrumental tool, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2725.96,
    "end": 2729.743,
    "text": "How much is this about the way that modeling happens?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2730.804,
    "end": 2733.866,
    "text": "And how much and the maths to make that happen?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2734.306,
    "end": 2741.412,
    "text": "And the philosophy is made that and how much then is this broader, and it may be that it gets recapitulated, depending on which",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2742.674,
    "end": 2749.995,
    "text": " hearts we simplify or allow to be more complex or want to get a purchase on out of those circles.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2750.015,
    "end": 2756.516,
    "text": "And maybe you just explain why you put the circles where you put them just to see if I'm getting your rationale.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2756.556,
    "end": 2758.277,
    "text": "But I think that was kind of useful to put them in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2759.757,
    "end": 2763.798,
    "text": "I'm just highlighting the directedness of the statistical dependence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2766.778,
    "end": 2771.739,
    "text": "This circle of action policy influencing unobserved states",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2772.725,
    "end": 2777.288,
    "text": " We've seen it in the partially observable Markov decision process as where?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2780.611,
    "end": 2788.456,
    "text": "That's B. W changing through time is B. That's how hidden states change through time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2789.497,
    "end": 2792.459,
    "text": "State one, state at time one, state at time two.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2793.52,
    "end": 2796.442,
    "text": "Then Z influences B.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2797.614,
    "end": 2826.529,
    "text": " here in this simple only four nodes so if you only get four nodes you draw the dependency that way like my action to change the thermostat in the future will change the temperature when we can unpack it a little bit more and move it from this sort of minimal cybernetics or control framing into some of the little bit more built out models we've looked at that is where policy selection",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2827.924,
    "end": 2840.593,
    "text": " influences B. And so, yes, there's enormous concern over how our actions influence things that we can't directly observe, save for by proxy information incoming back to us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2841.714,
    "end": 2844.556,
    "text": "And that is not a unique problem to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2845.176,
    "end": 2845.417,
    "text": "Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2846.317,
    "end": 2851.481,
    "text": "I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2851.877,
    "end": 2856.122,
    "text": " I'm going to circle back to what Blue was saying, because I think she's hit on something really critical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2857.764,
    "end": 2868.555,
    "text": "The when-ness of this, I think, is what I won't say was the thing that Carl started on when he took his first nascent steps into trying to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2870.387,
    "end": 2877.032,
    "text": " put something that we can hold on to, something that we can look at philosophically and mathematically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.672,
    "end": 2888.08,
    "text": "I don't know if he was thinking about oneness at that point when he started down that path, but I think the more we talk about it, the more we realize that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.071,
    "end": 2899.878,
    "text": " As a, for example, in a guide use, I think a person who reads Stephen and the other author's work have two questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.519,
    "end": 2913.689,
    "text": "The first one is my use of time, the number of minutes I have to commit to reading the guide before I can then say whether or not certain impediments have been removed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.345,
    "end": 2931.076,
    "text": " Well, at the same time, and this is what I think active inference does, it also allows us to invert that first accounting of what we are doing with our time, invert it from use of time to time of use.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2931.756,
    "end": 2936.7,
    "text": "So if I do commit to reading this guide, what's the shelf life of that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2936.96,
    "end": 2943.445,
    "text": "How long am I going to be able to take my takeaways and actually be able to apply them to different concepts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2944.363,
    "end": 2955.211,
    "text": " And then there's a fleshing it out part, which I think Stephen's kind of talking to, which is, so when we take all of this information and we embody it, what does that feel like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.651,
    "end": 2962.116,
    "text": "What does that read out in terms of our behaviors, et cetera, our reactions, our responses?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2963.106,
    "end": 2969.831,
    "text": " So I think ultimately, if we're looking at the when-ness of this, we have to start talking about heuristics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2969.891,
    "end": 2971.932,
    "text": "And Stephen specifically spoke about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2972.393,
    "end": 2983.06,
    "text": "I think I'm paraphrasing him, but I think he said we were concerned about whether starting with simple doesn't also have a cost.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2983.24,
    "end": 2986.823,
    "text": "We know that it has a benefit because it doesn't overwhelm people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.605,
    "end": 2993.048,
    "text": " But if we are going to look at simple rules like heuristics, does that also have a cost?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2993.088,
    "end": 2994.009,
    "text": "Now, he didn't answer that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.069,
    "end": 2998.412,
    "text": "I was just rewatching the 37.1 before we came on today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2998.992,
    "end": 3004.275,
    "text": "But I think that's something here that Blue has now touched on, and I think Stephen is touching on as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3004.716,
    "end": 3006.157,
    "text": "If we're going to put a guide together,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3007.196,
    "end": 3009.197,
    "text": " When do the rules fall out?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3009.918,
    "end": 3013.22,
    "text": "Do we assume that they fall out just by picking the guide up?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3014.06,
    "end": 3020.545,
    "text": "Or are they something that the reader or the user manufactures after having the experience?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3021.185,
    "end": 3026.529,
    "text": "That when-ness, I think, is what this active inference stuff is touching on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.289,
    "end": 3031.051,
    "text": "And in some cases, it feels pretty ruddy arbitrary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3031.652,
    "end": 3034.313,
    "text": "It's hard to tell the when of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.194,
    "end": 3048.686,
    "text": " The heuristic, do I start with the rule as my priority, or am I really trying to update, and I'm trying to come up with something that really applies at some point in the future that I haven't arrived at yet?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3049.587,
    "end": 3060.297,
    "text": "And I know that sounds kind of not answering anything, but even with the statistics, it's hard to figure out what each agent is going to do",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3061.63,
    "end": 3063.33,
    "text": " depending upon what their bias is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3063.87,
    "end": 3067.431,
    "text": "Do they want to start with the rule or do they want to develop one as they go along?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.351,
    "end": 3078.293,
    "text": "And as the Bacillus Axillus in 34, Axillus bacterium, showed, exact base doesn't mean you get it exactly right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.093,
    "end": 3087.875,
    "text": "It means you're following a process and with maladaptive priors, even accurate information coming in can result in a maladaptive decision-making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.395,
    "end": 3089.335,
    "text": "So this is not...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3090.66,
    "end": 3096.282,
    "text": " Panglossian or Pollyannish, just because there's an approach doesn't mean that it succeeds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3097.202,
    "end": 3097.862,
    "text": "Perfect, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3098.323,
    "end": 3098.883,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3099.123,
    "end": 3100.103,
    "text": "So, Stephen, then Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3102.444,
    "end": 3105.445,
    "text": "Yeah, so two points that sort of speak to that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3107.426,
    "end": 3111.187,
    "text": "Well, I'll say the second one first, because it was in mind, is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3112.065,
    "end": 3134.703,
    "text": " When we see the modelling, we often see, say we talk about the bacillus or we see the way that modelling happens, high-order agents such as humans tend to find that the W is fixed as a, like the cat is either purring or it's meowing, it's in the kitchen, it's an exact, or it's in the bedroom, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3135.283,
    "end": 3137.445,
    "text": "So it's a kind of defined...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3139.051,
    "end": 3140.813,
    "text": " Exact Bayes kind of context.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3141.273,
    "end": 3150.202,
    "text": "And then that allows the other parts to kind of still find some very interesting and tractable useful trends, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3150.442,
    "end": 3152.404,
    "text": "So as it goes through.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3153.723,
    "end": 3177.754,
    "text": " now when it goes then the other way is okay how do you get into something which isn't exact base and you tend to see it turn into the swarming of voxels those small you know um lorenzo tractors or bacillus so very very very simple a gentle um scenarios with very little",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3178.789,
    "end": 3179.63,
    "text": " degrees of freedom.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3180.35,
    "end": 3191.7,
    "text": "Because, and this is in a way trying to address that challenge of, well, you know, what if you don't know if it's in the kitchen or the bedroom is in the doorway, and it's, it's wandering around.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3192.08,
    "end": 3197.485,
    "text": "And there's the time, the time in between getting sensory information.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3198.966,
    "end": 3200.988,
    "text": "And my the action",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3202.757,
    "end": 3205.139,
    "text": " is, you know, isn't in step.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3205.359,
    "end": 3207.12,
    "text": "There's a lot more bleed out, you know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3207.14,
    "end": 3215.325,
    "text": "And that becomes this kind of how much is the temporal, I saw this word from Casper Hess, leakage.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3217.226,
    "end": 3228.454,
    "text": "Because there's a leakage out of that sensory, I don't want to use the word input, but the statistical dependencies coming in and the statistical dependencies going out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3228.494,
    "end": 3229.935,
    "text": "There's a leakage going on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3232.195,
    "end": 3250.103,
    "text": " which makes the modelling kind of challenging though at some point it becomes okay well it's overwhelming right we might philosophically say somehow we're able to do something like that and our biology has enabled us to overcome that challenge but to actually put it into a",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3250.928,
    "end": 3263.705,
    "text": " model like the one on the right top right there it starts to become and in a way maybe that's where effect comes in as maybe okay that that may be also true for us that's why we need something like affect",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3264.818,
    "end": 3292.869,
    "text": " to hold together this sort of fuzzier kind of knowing which can't be resolved in that such a solid way so that's the first piece the second piece very quickly is you put the you know that these um that the the red circle that you put next the x there um so in some ways that that is what's like while it's sort of we're inferring w what we're really doing is we're inferring",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3294.158,
    "end": 3311.403,
    "text": " We're either inferring the circle there that comes in to the X, or maybe, and let's assume the arrow that's going into the agent is what's coming out of X, or is coming from X. So that's, in a way, the edge, isn't it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3311.443,
    "end": 3319.086,
    "text": "That's the kind of boundary that's being, the beliefs, when you say B, the B is about that, not strictly about W.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3321.493,
    "end": 3331.716,
    "text": " There's a belief distribution on W and X. W is latent, modeled, unobserved states, and X is modeled, empirical, observed states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3333.896,
    "end": 3334.216,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3336.857,
    "end": 3337.217,
    "text": "Okay, Blue?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3339.738,
    "end": 3347.26,
    "text": "So just to kind of riff off of what both of you guys were saying, maybe this is tangential, but when you talked about leakage, Stephen,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3348.742,
    "end": 3357.895,
    "text": " it reminds me of like the information partitioning that we discussed with Majeed Benny and how there kind of always has to be some kind of leakage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3358.295,
    "end": 3363.543,
    "text": "Like if you have a complete information partitioning, you're actually like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3364.378,
    "end": 3371.824,
    "text": " in a vacuum or a bubble, like you're existing, there has to be some kind of leakage across the partition all the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3373.105,
    "end": 3380.311,
    "text": "Like, and I've come to realize this, like we have to be sharing information with people that are, you know, how do we form a Markov blanket?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3380.351,
    "end": 3384.595,
    "text": "How do the four of us come together and form this live stream today, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3384.615,
    "end": 3388.858,
    "text": "Like we're sharing information, even though there's a Markov blanket that exists between us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3389.218,
    "end": 3391.08,
    "text": "And for some of us it's thicker and thinner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3391.48,
    "end": 3399.718,
    "text": " like Daniel and I will be often like doing the same thing at the same time like like even like you know separately um just because we we work together so much but um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3400.959,
    "end": 3402.559,
    "text": " this leakage is there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3402.66,
    "end": 3408.121,
    "text": "And then it also made me think about the maladaptive behavior that Daniel was mentioning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3408.261,
    "end": 3413.402,
    "text": "And so when you have this, like, we always wonder what is the cause of this maladaptive behavior?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3413.442,
    "end": 3420.364,
    "text": "And this is something that we were discussing maybe a couple of weeks ago with Jason, you know, what is the explanation for maladaptive behavior?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3420.624,
    "end": 3423.445,
    "text": "And it always makes me think about the scale, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3423.485,
    "end": 3429.647,
    "text": "Like in the situations that are utilitarian, like, you know, maybe someone sacrifices themselves",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3430.319,
    "end": 3434.842,
    "text": " for they jumped in front of a train to stop the train to save the 300 people that are on the train.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3435.242,
    "end": 3449.651,
    "text": "And so there's the maladaptive decisions do occur, but perhaps it's at like a societal scale or like in a body, one piece will die off to save another piece, like even in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3450.731,
    "end": 3462.757,
    "text": " like the formation of like the glial scar, I think of that, like which it's like essentially like it puts a hole in your brain, but it's to protect the rest of the brain from the cell death that's happening in that center hole.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3463.518,
    "end": 3474.903,
    "text": "And so, you know, there is this information leakage and even maladaptive behavior that I think are scale dependent, scale friendly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3477.739,
    "end": 3478.239,
    "text": " Thanks, Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.619,
    "end": 3480.621,
    "text": "Dean, and then we'll move to another section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3481.641,
    "end": 3481.881,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3484.303,
    "end": 3484.663,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3485.924,
    "end": 3489.846,
    "text": "I don't know if we're at an inflection point with this, but I do want to bring this up again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3489.866,
    "end": 3500.472,
    "text": "I think that the leakage speaks to another metaphor that I brought up way too many times last week, and in the point zero, which I think there is a filtering piece to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3501.272,
    "end": 3522.149,
    "text": " I mean this morning I put the raspberries in the sieve and I assumed the raspberries would stay and the water would pass through and there were parts that I didn't need like I wasn't trying to make raspberry water I just wanted to eat the raspberries and I think that if we understand that there's two a minimum of two aspects to when we're talking about active inference I think we do ourselves a favor",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3523.018,
    "end": 3527.823,
    "text": " And I think we do ourselves a favor for writing guidebooks about active inference and free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3528.404,
    "end": 3537.714,
    "text": "So I think the guidebook for the guidebook, if there were some pillars that we could put a guidebook on, here would be my suggestions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3538.735,
    "end": 3542.92,
    "text": "First of all, there is going to be, because we have a Markov blanket, we have a separation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3543.595,
    "end": 3552.125,
    "text": " that differentiation and that integration are going to be inherent in however we observe something and then respond to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3552.745,
    "end": 3557.371,
    "text": "Second thing that I would suggest is there's a certain blind spot removal piece to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.871,
    "end": 3582.158,
    "text": " And I mean that in the context of, say, something like change blindness because of over-attending or under-attending, where we talked about overfitting or failing to explain, that change blindness now becoming a greater awareness availability because we don't necessarily have to lock in prematurely or wait too long.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.498,
    "end": 3587.32,
    "text": "There's kind of a sweet spot that active inference is trying to say exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3587.46,
    "end": 3588.42,
    "text": "It's not perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3590.143,
    "end": 3592.664,
    "text": " but it's better than not having a sweet spot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3592.684,
    "end": 3604.949,
    "text": "The other thing I would say is if we're ignoring the foraging aspect of this, if we expect that the framework is going to be another frozen meal, then you're going to get the quality of a frozen meal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3605.59,
    "end": 3610.812,
    "text": "If you're willing to forge around the perimeter of the store, you're going to come away with a whole different experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3611.252,
    "end": 3614.994,
    "text": "It's more time consuming, but in the end, it's like learning to fish.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.575,
    "end": 3621.979,
    "text": " It's a whole different way of trying to process those uncertainties, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3622.76,
    "end": 3639.874,
    "text": "So I think at the end of the day, what pops out or when we decide that we can actually say somebody is using active inference, whereas before they weren't, I think what they do is they come up with a new sense of what rules are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.792,
    "end": 3656.761,
    "text": " which are being updated, which are being modified, which are being iterated and sometimes even being extrapolated, we have to really focus on what that means under particular circumstances as we move from place to place.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.062,
    "end": 3659.763,
    "text": "So again, I'm not sure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3661.338,
    "end": 3668.841,
    "text": " Maybe that's not being fair to the people who wrote a 60-page guide for philosophers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3669.382,
    "end": 3682.107,
    "text": "But I think if we're going to look at the foundational things that are going to be able to tell whether or not we're actually doing and using active inference, I would think that at a minimum, those four things are going to be present.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.468,
    "end": 3687.27,
    "text": "Starting with the filtering thing, because again, if it's not a minimum of two,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.223,
    "end": 3689.464,
    "text": " I think we over-reduce.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.104,
    "end": 3696.748,
    "text": "We put a frame around it, but we don't actually know what's actually a gradient descent and dynamically stable within that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3697.568,
    "end": 3701.71,
    "text": "So just something to think about if we're going to write guides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3704.052,
    "end": 3704.472,
    "text": "Thanks, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3704.552,
    "end": 3706.413,
    "text": "Okay, Stephen, specifically on that, and then we'll go on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3707.122,
    "end": 3734.669,
    "text": " Yeah, just referring to this idea of screens, and it comes back to the idea of screening off or filtering, I think that the X and the Z here, there's a question we often, in this particular context, they are talking a lot about screening it off, and it seems to be, whereas in other contexts, say Axel Constant's work, I feel like it's trying to extract as much as possible from",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3736.475,
    "end": 3739.34,
    "text": " the informational potential in an environment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3739.86,
    "end": 3741.223,
    "text": "I think that's important, isn't it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3741.363,
    "end": 3750.577,
    "text": "There's a very different... I've worked... I actually used to work as a print broker, so I actually fire up these...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3751.218,
    "end": 3780.532,
    "text": " big presses and it takes a hundred a thousand copies to get the magazine actually starting to print properly like the rollers and the blanket has to get inked up and everything you've got all this waste eventually you actually get something that looks good and now it's running so you've got a thousand wasted copies basically you're trying to extract as much as possible from the inked up prints print head print cylinder right this is on a big press now in that case then you're trying to get as much information basically across into the paper",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3781.212,
    "end": 3791.358,
    "text": " Now, there's other cases, though, you can imagine where it's, I don't know, someone's taking a video and there's bright lights going on and there's, you know, you're trying to filter out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3791.538,
    "end": 3795.901,
    "text": "Like we say, you've got bright light, you know, you're looking at the sun, you've got to filter out to see anything.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3796.621,
    "end": 3806.107,
    "text": "In that case, you're still trying to get your sensory data in, you're still trying to work on the action policies, but both X and Z, in a traditional blanket,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3807.289,
    "end": 3819.412,
    "text": " it's a dead thing, you know, but how much is X and Z, you know, how much is that a living kind of process at certain times that is moving?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3819.432,
    "end": 3831.816,
    "text": "I mean, you could say it's doing a bit of everything, but how much is it trying to screen out noise and bringing, and how much is it trying to extract, you know, from Shannon entropy and stuff like that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3831.956,
    "end": 3833.176,
    "text": "So, you know, I thought I'd mention that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3834.585,
    "end": 3846.407,
    "text": " Yeah, it makes me think of, like, being on the phone with somebody and it's like you're both trying to pull as much information out of that limited channel and put as much into a limited channel and so, um...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3848.715,
    "end": 3857.058,
    "text": " Let's go on to justificatory links between or among dialectical categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3857.558,
    "end": 3859.319,
    "text": "So we'll do some slide play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3860.179,
    "end": 3864.421,
    "text": "We have three types of claims.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3865.761,
    "end": 3869.443,
    "text": "Dave, I hope I'm using the word appropriately that there are domains of claims.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3870.523,
    "end": 3875.625,
    "text": "Mathematical, read, empirical,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3876.909,
    "end": 3899.27,
    "text": " blue general green okay so no um commitments but can somebody just like give a specific concise example of where we see one of these cross category statements",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3900.547,
    "end": 3917.937,
    "text": " can be in any direction amongst the three where's a case where somebody uses a mathematical the first part of their sentence is mathematical and then the second part is empirical or vice versa where's a situation where the first part of someone's sentence is mathematical and the second part is general so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3918.837,
    "end": 3930.569,
    "text": " I'm sure that many have been said even today, but let's try to get a few really specific examples so that people can just learn to identify these kinds of sentences, and then we'll be evaluating what they mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3930.85,
    "end": 3931.671,
    "text": "So Blue, go for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3933.533,
    "end": 3938.738,
    "text": "So nothing that's been mentioned today, but the p-value of 0.05,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3940.95,
    "end": 3946.635,
    "text": " you know, demonstrates that whatever my claim is and my experiment is significant, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3946.655,
    "end": 3956.963,
    "text": "So that's something that all the time you see the statistical, you know, justifying the empirical and less so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3956.983,
    "end": 3963.088,
    "text": "I think we're coming away from the significance of the p-value in scientific literature, but you see that a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3963.996,
    "end": 3966.161,
    "text": " So where would we put statistics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3966.181,
    "end": 3968.827,
    "text": "What domains does statistics jump among?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3973.052,
    "end": 3974.733,
    "text": " So statistics to me is math.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3975.053,
    "end": 3981.755,
    "text": "Like statistics is the sentence that bridges, that's the field that bridges mathematics and empirical claims.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3981.795,
    "end": 3990.757,
    "text": "Like, so when you make the sentence, my P value of 0.05, P less than 0.05 demonstrates that whatever my claim is, my empirical claim is significant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3990.777,
    "end": 3994.619,
    "text": "So for me, statistics is that bridge between math and empirical claims.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3995.219,
    "end": 3995.519,
    "text": "Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3996.482,
    "end": 4018.041,
    "text": " yes totally agreed we looked at these two categories of ant and we saw this one doing it six times this one did it two times we did some math on the numbers six and two you can't do math on ant you do math on the numbers six and two and from that mathematical claim",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4019.158,
    "end": 4022.379,
    "text": " We're going to say something about those two categories of ants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4022.999,
    "end": 4028.141,
    "text": "So yes, mathematics going to empirical is a lot like statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4029.281,
    "end": 4030.822,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4031.422,
    "end": 4035.683,
    "text": "What about empirical going back to mathematics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4036.543,
    "end": 4048.107,
    "text": "What is a specific natural language expression where somebody begins, where the warrant of the rhetoric is empirically driven,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4049.403,
    "end": 4056.626,
    "text": " meaning based upon observation, and then the consequence of the argument is mathematical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4066.809,
    "end": 4075.192,
    "text": "How about because the organism is maintaining body temperature homeostasis, empirical,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4076.761,
    "end": 4082.705,
    "text": " it is the case that it is doing predictive processing or active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4085.347,
    "end": 4098.516,
    "text": "So here, now, there's so many ways to even enter here, but this would be like from results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4099.602,
    "end": 4110.009,
    "text": " That's the hallmark of starting in empirical is you're starting with something that is almost either trivial or just simply a fact or observation about the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4110.829,
    "end": 4113.931,
    "text": "So from results to what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4116.073,
    "end": 4128.521,
    "text": "Some sort of statement about, now what's interesting about the way that the authors did it here is they have no, none of the three cases",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4129.639,
    "end": 4133.901,
    "text": " have mathematics in the second position.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4135.502,
    "end": 4143.085,
    "text": "And that's kind of like the XKCD comic where mathematics is like, oh, I'm way over here, I can't hear you, the fields arranged by purity meme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4144.166,
    "end": 4155.571,
    "text": "Because mathematics is almost framed as like internally coherent, and then information comes out of mathematics, but because it's theoretical or abstract,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4156.448,
    "end": 4173.016,
    "text": " There is an internal logic in mathematics called proof, and then there's very little need to have something enter mathematics, which is why we'll see as we start to flesh out this shape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4173.696,
    "end": 4173.936,
    "text": "Steven?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4176.175,
    "end": 4180.097,
    "text": " Yeah, as you're doing that, I'm curious what you think about something like gambling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4180.337,
    "end": 4183.799,
    "text": "Say someone is betting on horses.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4183.819,
    "end": 4191.163,
    "text": "There's statistics of the horse gambling, and then there's their motivation for gambling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4191.837,
    "end": 4201.044,
    "text": " So in terms of the empirical, you can see, okay, the behavior is fairly consistent, certainly over a type of gambler at horse race.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4201.604,
    "end": 4217.976,
    "text": "The math can be established, but then there's, I don't know whether it goes into the general, what's people's motivation for the teleology, but maybe I'm jumping the gun there, but am I on the right lines there in terms of how would you put that into this scenario?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4219.09,
    "end": 4221.711,
    "text": " Can you restate it with an antecedent and a postcedent?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4221.991,
    "end": 4224.132,
    "text": "Just a specific rhetorical nucleus?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4224.852,
    "end": 4247.16,
    "text": "Okay, so there's... Because X, then Y. Oh, because there is a group of people at a horse racing track, and because we know that these horses have performed...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4249.201,
    "end": 4271.849,
    "text": " in a certain way over previous races, we can predict the probability that the horse will win or be told to people to win as being X. The motivation for people to make that inference about and the behavioral choices is maybe more general.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4272.789,
    "end": 4278.011,
    "text": "But that seems to be more- Yes, we'll get to the general edge because it's very connected to math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4278.111,
    "end": 4278.691,
    "text": "Okay, Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4281.035,
    "end": 4295.137,
    "text": " No, I was just going to say, I like the word results there, but I think what it's implied is that there were a certain number of observations taken that then moved the formalism to something specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4296.198,
    "end": 4301.899,
    "text": "Am I just confirming something, or am I putting more in there than needs to be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.919,
    "end": 4305.299,
    "text": "I had a really similar question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4307.099,
    "end": 4310.46,
    "text": "So when you're talking about going from empirical to math,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4311.161,
    "end": 4320.824,
    "text": " To me, you brought up the idea of a probability density or a non-equilibrium steady state, and that's immediately what came to my mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4320.884,
    "end": 4324.305,
    "text": "So I don't know if that echoes what Dean just said.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4324.325,
    "end": 4325.325,
    "text": "Yeah, it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4328.226,
    "end": 4333.307,
    "text": "Let's get at the distinction between general claims and mathematical claims.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4334.587,
    "end": 4340.329,
    "text": "So math is sometimes seen as general, and when ideas are framed mathematically,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4341.064,
    "end": 4370.092,
    "text": " indeed there's a lot of overlap but the authors do separate it out it's in section 4.2.2 so what would be like an example of going from a mathematical to a general because math then general or because general claim then mathematics well you can you can talk about the rate of the rate of the rate of acceleration due to gravity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4371.107,
    "end": 4387.721,
    "text": " and then make the general claim that if I go from this height to this height, I can expect to hit the ground at a certain rate of speed or something, I would imagine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4390.283,
    "end": 4391.624,
    "text": "Okay, great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4391.844,
    "end": 4394.707,
    "text": "I'm going to also pull out just two examples from...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4395.652,
    "end": 4396.593,
    "text": " Yeah, from the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4397.154,
    "end": 4398.114,
    "text": "So here we go.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4398.155,
    "end": 4398.475,
    "text": "So we're in 4.2.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4398.535,
    "end": 4401.338,
    "text": "So there's gonna be two examples given.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4402.759,
    "end": 4408.224,
    "text": "So again, we're looking here at math going to general, and then we'll see if we can run it back.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4408.565,
    "end": 4410.787,
    "text": "So how can mathematical claims justify general claims?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4413.308,
    "end": 4414.488,
    "text": " Ramstad et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4415.548,
    "end": 4426.291,
    "text": "assert, the FEP is a mathematical formulation that explains, from first principles, the characteristics of biological systems that are able to resist decay and persist over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4427.631,
    "end": 4429.551,
    "text": "First part of the sentence, mathematical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4430.451,
    "end": 4431.832,
    "text": "Second part, general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4433.592,
    "end": 4438.233,
    "text": "It rests on the idea that all biological systems instantiate a hierarchy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4439.315,
    "end": 4444.777,
    "text": " a hierarchical generative model of the world that implicitly minimizes its entropy by minimizing free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4446.738,
    "end": 4463.804,
    "text": "I almost see the reflection in that sentence that because of the hierarchical generative model, which is a general claim, though a formal one, then there is a mathematical implication.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4464.964,
    "end": 4466.725,
    "text": "So maybe we can put this Ramstad 2018 here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4469.377,
    "end": 4473.139,
    "text": " Okay, and then here's the second or a second example that the author has raised in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4475.541,
    "end": 4481.784,
    "text": "Axel Constant's contribution to this topical collection uses a mathematical claim to make a general claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4483.065,
    "end": 4488.869,
    "text": "On the basis of a numerical example, he argues against the claim that minimizing free energy entails life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4489.949,
    "end": 4491.63,
    "text": "Rather, he believes the converse is true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4492.131,
    "end": 4493.872,
    "text": "Life entails minimizing free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4495.031,
    "end": 4496.792,
    "text": " We read and loved that paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4497.432,
    "end": 4507.797,
    "text": "And that's very much related to the quote, like one ugly fact destroys a beautiful theory or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4509.478,
    "end": 4514.22,
    "text": "Now, is an example mathematical or empirical?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4517.381,
    "end": 4523.244,
    "text": "If it were just on the basis of a family of equations, he argues against the general claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4526.001,
    "end": 4530.916,
    "text": " But then again, isn't even the family of an equations an empirical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4533.288,
    "end": 4556.445,
    "text": " observation from the domain of math but we'll put it in the section that they had it so in these cases we're using specific math examples and that was sort of the provocation of 34 and axel's paper which was like i did a math example so it's kind of resting on both the empirical and the mathematical i did a math example",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4557.731,
    "end": 4586.197,
    "text": " and now i'm going to make a claim about a general topic which is the relationship between free energy minimization and life so that is certainly moving in this direction whereas um so because math can be abstracted and generalized there's often similarity here because math rests upon specific examples",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4587.242,
    "end": 4594.267,
    "text": " Even if some examples are more general than other examples, it still can be said that they're empirical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4595.568,
    "end": 4603.113,
    "text": "Not exactly in the way that cat location measurement is, but still it is the case that math produces results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4603.153,
    "end": 4604.934,
    "text": "There can be a results section in a math paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4607.335,
    "end": 4608.736,
    "text": "What about this third edge?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4609.557,
    "end": 4612.058,
    "text": "What's the relationship between general and empirical?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4612.879,
    "end": 4614.34,
    "text": "And let's leave math out of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4617.571,
    "end": 4617.771,
    "text": " Blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4621.554,
    "end": 4623.456,
    "text": "So this is something like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4625.037,
    "end": 4633.183,
    "text": "I think about like what Dean was saying because acceleration to due to gravity is, you know, negative 9.8 meters per second squared.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4634.224,
    "end": 4639.288,
    "text": "When I drop this Apple, it will fall to the ground like that goes maybe empirical to general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4644.132,
    "end": 4646.174,
    "text": "When I when I drop the Apple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4648.573,
    "end": 4673.679,
    "text": " um because when i drop the apple it falls to the ground comma gravity exists in the whole universe that was quite a jump well because apples fell in not down that's flat earth because apples fell in gravity is everywhere",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4676.966,
    "end": 4679.427,
    "text": " Okay, that's one example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4680.487,
    "end": 4683.448,
    "text": "So then I was thinking of like a sort of ants evolution example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4683.528,
    "end": 4695.591,
    "text": "So the general to empirical would be like, because of the way that evolution by natural selection is, ants optimize task efficiency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4698.86,
    "end": 4711.026,
    "text": " And then the other direction would be like, because in my experiment, 30% of the time ants were observed to be doing this, selection has been acting on ants.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4714.028,
    "end": 4720.211,
    "text": "So these are very interesting because are there some edges that we rest upon more?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4720.931,
    "end": 4723.913,
    "text": "Like what if we could just number these edges, one, two, three, four, five, six.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4724.898,
    "end": 4733.302,
    "text": " and then annotate, and people could have different perspectives on it, but we could annotate papers in different areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4734.383,
    "end": 4743.508,
    "text": "And okay, if you're just doing one, one, one, one, one, one, one, one, one, it's like a one note paper from a structural rhetorical perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4746.129,
    "end": 4750.451,
    "text": "Under what situations is that preferable, not preferable?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4751.532,
    "end": 4753.233,
    "text": "Are there certain edges that are weak?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4754.286,
    "end": 4757.748,
    "text": " Are there pairs of edges, like a chord that we want to play together?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4758.509,
    "end": 4761.631,
    "text": "Just like the Ramstead, it was like sort of forwards and backwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4762.692,
    "end": 4764.413,
    "text": "Law of the jungle, law of the pack.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4765.394,
    "end": 4775.841,
    "text": "From the mathematics to the general, and then instantly a grammatical reflection from the empirical into the mathematical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4777.362,
    "end": 4779.083,
    "text": "Okay, Stephen, then Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4781.721,
    "end": 4788.705,
    "text": " So one question first, I just asked, empirical could be seen as is that exact base?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4790.106,
    "end": 4791.106,
    "text": "Empirical means observed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4792.047,
    "end": 4792.467,
    "text": "Observed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4792.827,
    "end": 4801.512,
    "text": "So the exact base, if you're just taking however you lay that out, if it hasn't been computed beyond observed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4801.652,
    "end": 4803.433,
    "text": "Okay, so effectively that's true.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4803.913,
    "end": 4804.934,
    "text": "Okay, that's the first thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4805.034,
    "end": 4806.675,
    "text": "And then general...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4808.146,
    "end": 4811.688,
    "text": " in most senses, is what we might call inflated or higher dimensional.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4812.649,
    "end": 4824.937,
    "text": "So we go, generally speaking, the models are empirical from observed observations into math, into generative model, into some general pattern of action selection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4825.577,
    "end": 4837.585,
    "text": "However, it could be possible, but generally it's intractable for complex situations to go from general to empirical observations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4838.171,
    "end": 4843.013,
    "text": " and then try and get the math out, which is kind of what Alex is saying.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4843.033,
    "end": 4852.536,
    "text": "It's like there's a general principle that empirically plays out, but good luck finding the math to show it outside of a bacteria.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4856.898,
    "end": 4857.618,
    "text": "Okay, Dean?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4859.879,
    "end": 4861.6,
    "text": "So I find it interesting, Daniel, that you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4863.344,
    "end": 4869.108,
    "text": " Just to keep the conversation sort of alive, you talked about the edges of those three circles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4870.368,
    "end": 4883.316,
    "text": "And I think that the task of being able to find examples of those bi-directionalities, again, goes back to that question of, so what are the rules?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4884.249,
    "end": 4885.349,
    "text": " And how fluid are they?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4885.749,
    "end": 4894.651,
    "text": "And as we're moving from one node, so there's a change, the moving from node to node, we're building that relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4895.111,
    "end": 4896.612,
    "text": "We're building out these rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4897.372,
    "end": 4911.055,
    "text": "Is that one of the great byproducts of being able to maneuver and manipulate, not getting stuck with only a sense of unidirectionality?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4912.392,
    "end": 4913.053,
    "text": " or oneness?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4913.913,
    "end": 4936.154,
    "text": "Does this reinforce the idea that if we're going to actually really be able to demonstrate the use of active inference, for example, as an instrument or a tool to be able to gain a greater awareness, are we really then talking about how we not just find examples of rules, but actually form them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4942.176,
    "end": 4946.28,
    "text": " Because that was the exercise that you just went, you just built a whole bunch of rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4946.741,
    "end": 4955.691,
    "text": "I know we've laid them down on the slide as examples, but those relationships now are, they're not even bridged, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4957.152,
    "end": 4961.217,
    "text": "They've now got some sort of a pairing effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4965.282,
    "end": 4975.045,
    "text": " So is that, I'm looking today back to the, and then what happens, what I'm looking today for is, so we guide our way, we guide our way to what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4975.586,
    "end": 4984.149,
    "text": "Is there now an awareness, a sense that we didn't have before we went through that effort?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.329,
    "end": 4989.971,
    "text": "And is the thing that kicks out rules or is it just examples?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4990.031,
    "end": 4990.551,
    "text": "What do you think?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4992.284,
    "end": 4996.065,
    "text": " I'm asking you, Daniel, because you did the most of this work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4996.425,
    "end": 4999.506,
    "text": "Do you see the rules or do we just see the examples?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5003.907,
    "end": 5012.349,
    "text": "I just think about how in a nested cognitive model, the outcome of one layer is like the inflow of another layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5012.709,
    "end": 5021.151,
    "text": "So even a rule can be a rule in one layer or application, but yet it's also an example of a rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5023.507,
    "end": 5030.272,
    "text": " mathematics and general claims tend to be more rule-like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5031.273,
    "end": 5033.215,
    "text": "But again, even rules are examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5033.975,
    "end": 5039.18,
    "text": "Whereas empirical, it's always the exception that proves the rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5039.24,
    "end": 5046.445,
    "text": "Like it's the exception is the observation which transcends rules because if it happened, it had to have occurred.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5047.546,
    "end": 5051.169,
    "text": "And so the empirical to me is like examples, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5052.298,
    "end": 5053.439,
    "text": " when you're in this domain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5054.821,
    "end": 5066.312,
    "text": "And then movement away from the examples in the scientific empirical sense pushes us into the rule world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5066.973,
    "end": 5074.24,
    "text": "So here, this red line is going to be more example-like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5077.028,
    "end": 5085.436,
    "text": " And so in that sense, with the caveat, again, that even rules and generalizations are examples of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5086.557,
    "end": 5092.222,
    "text": "But in the scientific empirical sense, this is more like an example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5094.364,
    "end": 5101.932,
    "text": "Can you hear in your own explanation the sort of justifactory link between example and rule?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5102.858,
    "end": 5111.889,
    "text": " Do you hear yourself justifying the difference between how we might look at math in general as being different than the empirical?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5112.549,
    "end": 5113.891,
    "text": "That's all I'm trying to bring out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5114.271,
    "end": 5120.819,
    "text": "And again, it's a not... It's not... There's nothing... I mean, it makes perfect sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5121.56,
    "end": 5122.861,
    "text": "But I think if we're going to find...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5124.013,
    "end": 5142.377,
    "text": " If we're going to find that somebody used a guide and what is the result of that, it's going to be that people have a better sense of what the rules are and what the examples are and what the relationship is between those two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5143.517,
    "end": 5145.717,
    "text": "That would be goodness gracious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5145.757,
    "end": 5150.138,
    "text": "I mean, if I'm talking to anybody between the ages of 22 and 62, if we could get there, holy mackerel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5156.189,
    "end": 5159.491,
    "text": " Thanks, Steven, in terms of, in terms of opening up our understanding of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5159.551,
    "end": 5159.751,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5162.633,
    "end": 5168.776,
    "text": "One thing I think with what you're saying that Dean is, um, which is because it does become interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5169.017,
    "end": 5183.025,
    "text": "And, uh, uh, something Daniel mentioned when we have multi-scale, the actual nature of the rule example actually can shift.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5184.107,
    "end": 5198.253,
    "text": " And as teleologies shift, that I think is kind of revolutionary in a way when we start to think about there's a variation in the nature of what rules are present.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5199.013,
    "end": 5208.497,
    "text": "So the sort of rules around what it means for me to do something in my environment, my cells individually, I can't play that game.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5209.485,
    "end": 5211.827,
    "text": " My organs can't play that game individually, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5212.307,
    "end": 5234.061,
    "text": "So there is this challenge, right, of integrating, or maybe this is the idea of, okay, well, as well as saying what's happening, where is something, or what temporal and spatial scale,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5240.745,
    "end": 5241.625,
    "text": " does it hold?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5242.725,
    "end": 5259.388,
    "text": "And I think that may be something that's kind of interesting is where, so generally speaking, people go to the racetrack and, you know, they behave in certain behaviors at the scale of their part in society.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5260.189,
    "end": 5264.309,
    "text": "But they, and we have empirical data to support that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5265.089,
    "end": 5268.31,
    "text": "However, at the biological level,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5270.116,
    "end": 5274.299,
    "text": " It may be something to do with adrenaline rush you could talk about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5274.319,
    "end": 5280.883,
    "text": "You could talk about the fact that they just happen to have a nice sandwich bar and someone enjoys getting the food, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5280.903,
    "end": 5283.705,
    "text": "They don't even like gambling that much.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5283.985,
    "end": 5286.266,
    "text": "Whatever it is, or wearing a funny hat at Ascot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5286.667,
    "end": 5290.069,
    "text": "So there's something there that could...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5290.885,
    "end": 5313.902,
    "text": " How do we, I wonder that multi-scale question, because I'm very caught with the idea that you've got Axel Constant taking very, very small, you have this incredibly small world being addressed with active inference, and then we have quite, sort of, you could say gross,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5315.046,
    "end": 5332.637,
    "text": " examples at scale which ends up revealing a lot you know at larger scale um but uh i wonder what you think daniel about how what what happens and that that reflects what daniel i think was saying about nested systems and",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5333.692,
    "end": 5335.974,
    "text": " they're sort of informing each other in a way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5336.074,
    "end": 5349.643,
    "text": "Like if I think I'm going to win some money on the races and I better get myself sorted, I might sustain my stomach a bit more so I've got a better glucose level to make a good choice, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5350.063,
    "end": 5354.526,
    "text": "So suddenly there's two different levels coming into play or just different scales.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5354.666,
    "end": 5361.131,
    "text": "So I don't think that's confusing things, but I think it does make the modelling question more",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5362.073,
    "end": 5386.504,
    "text": " Because active inference is ultimately a modeling process, which is trying to get at, I would say it's trying to either get at the general or to predict an empirical, if I'm looking at this diagram, but maybe I'm mistaken there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5387.864,
    "end": 5389.165,
    "text": "Right, where is active inference?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5390.965,
    "end": 5407.582,
    "text": " in this is this the trace of active inference is this the map but then we play on this territory what is the adjacent possible and so we can ask first where's active inference here and when is it here and then what next dean",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5408.516,
    "end": 5415.279,
    "text": " Yeah, this is where I think it's in the relationships and how we decide to parse those relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5415.659,
    "end": 5417.04,
    "text": "And it seems rather arbitrary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5417.54,
    "end": 5424.302,
    "text": "And I think it's one of the reasons why we can always disagree on when the rules are in effect and when they're not in effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5424.623,
    "end": 5426.203,
    "text": "I mean, it's happening up here in Canada.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5426.783,
    "end": 5435.027,
    "text": "We've got all these rules in place and then people just decide to pull up big trucks to the border and go, no, we don't like your rule.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5436.067,
    "end": 5436.267,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5436.327,
    "end": 5439.128,
    "text": "And so now there's being Canadian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5439.168,
    "end": 5442.849,
    "text": "Now we have to figure out how we're going to deal with that because we don't have any guns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5442.949,
    "end": 5446.73,
    "text": "So I guess we're going to have to disassemble all the trucks or something by hand.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5446.75,
    "end": 5453.252,
    "text": "But the thing is, is that if you actually look at this, active inference is in the relationship.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5453.932,
    "end": 5456.873,
    "text": "And I think it's and then and I think to Stephen's point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5458.59,
    "end": 5464.674,
    "text": " if we think that a rule applies without limits, that's the scale-free part of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5465.315,
    "end": 5469.457,
    "text": "From a mathematical standpoint, we can find cases where that's true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5470.057,
    "end": 5476.841,
    "text": "But then there's a very scale-friendly part of it, which says, this rule doesn't seem to make sense in this specific situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5477.342,
    "end": 5478.803,
    "text": "And that's where Axel came forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5481.024,
    "end": 5485.527,
    "text": "He essentially said, I'm sorry, but... And so did... I'm sorry, the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5487.798,
    "end": 5493.885,
    "text": " There was another author we had very recently who agreed and said, it was Majid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5494.306,
    "end": 5508.241,
    "text": "Majid said, look, there's a piece to this that says there's something that's local and proximal and specific, and why are we pretending like that fits the same context as scale-free?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5508.381,
    "end": 5508.521,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5509.73,
    "end": 5514.892,
    "text": " Again, I think I don't see that means that active inference is useless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5515.412,
    "end": 5520.133,
    "text": "I think what it means is it can tell us when we can differentiate and when we can integrate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5520.493,
    "end": 5521.454,
    "text": "That's relational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5525.495,
    "end": 5534.237,
    "text": "So one thing this made me think of is that reading a paper on free energy, free energy principle, active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5535.978,
    "end": 5536.838,
    "text": "Look at the roadmap.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5537.558,
    "end": 5539.279,
    "text": "There's no dialectic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5540.45,
    "end": 5560.431,
    "text": " within a domain the claims are listed but it goes immediately to the relationship so it's like minimum two domains okay now it makes me think about the structure of scientific communication so in the results section of the paper well so the introduction might have a lot of general and empirical claims",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5561.929,
    "end": 5582.109,
    "text": " selection acts on ants and look at their mandibles and we know this about niche construction and look at how they do it so that is like a very introductory piece there's not often formalisms in the introduction of the paper so that sort of blue arrow general and empirical is very introductory in its scope then the results section of the paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5583.05,
    "end": 5586.214,
    "text": " is like Blue mentioned, it's about like empirical and math.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5586.755,
    "end": 5588.898,
    "text": "We saw it do it 11 times and here's the p-value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5589.058,
    "end": 5590.84,
    "text": "And then we did this and we calculated the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5591.161,
    "end": 5594.605,
    "text": "And so it's like, it shouldn't generalize in some senses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5595.306,
    "end": 5596.628,
    "text": "And then in the discussion,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5597.742,
    "end": 5607.029,
    "text": " there's probably all edges in play, but especially math to general, because it's now been generalized beyond the mere empirical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5607.57,
    "end": 5623.802,
    "text": "Because we saw a p-value in the difference between the nest mates of this type and that type, it does say something about evolution, or because there's something happening at an evolutionary time scale, it's consistent or inconsistent with our mathematical summary statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5624.402,
    "end": 5627.465,
    "text": "Yes, that came from empirical, but that edge is more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5628.025,
    "end": 5654.942,
    "text": " in play dean and then in simple simple terms that's how and when we fit phit the rule and that almost it does return us to the third p um but i think it's um so we'll kind of close this section on the 2.4 whatever it was with the uh links amongst the dialectical categories",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5656.678,
    "end": 5662.239,
    "text": " active inference as a transdiscipline, all of these are often in play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5662.799,
    "end": 5673.142,
    "text": "And it's almost like if the paper would have just been lists of empirical observations, there'd be nothing contentious because it wouldn't make any general claims.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5673.642,
    "end": 5675.082,
    "text": "That would just be called a data set.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5676.283,
    "end": 5681.204,
    "text": "If it were just general claims, it would be just philosophy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5682.444,
    "end": 5682.564,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5684.025,
    "end": 5686.127,
    "text": " That's not to say philosophy is easier or simpler.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5686.267,
    "end": 5690.75,
    "text": "It's like it doesn't trigger anyone's domain crossing alarm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5692.191,
    "end": 5697.415,
    "text": "But like mathematical biology, that does raise people's alarms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5697.915,
    "end": 5705.1,
    "text": "Or generalizing from math, you're saying that because of the free energy minimizing that there's a general imperative for information foraging?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5705.881,
    "end": 5705.941,
    "text": "Or...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5706.812,
    "end": 5708.574,
    "text": " relationship between the general and the empirical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5709.174,
    "end": 5711.216,
    "text": "Of course, always fraught in empirical science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5711.756,
    "end": 5719.543,
    "text": "Okay, you measured in that laboratory study with those undergrads and that stimuli, and you're gonna say something about aggression?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5721.205,
    "end": 5733.596,
    "text": "So it's just very interesting because active inference does lay claim or at least lay play to all these areas that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5734.875,
    "end": 5738.118,
    "text": " it raises alarms on all sides.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5738.959,
    "end": 5755.316,
    "text": "But how do we take that alarm pheromone and attention and then just align it with something that's going to be a public good rather than just let it fizzle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5756.077,
    "end": 5756.317,
    "text": "Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5759.062,
    "end": 5759.743,
    "text": " That's very helpful.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5759.823,
    "end": 5769.011,
    "text": "And the nature of action and the idea of teleology, as soon as that comes in, I don't know if you can avoid being in the general.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5769.252,
    "end": 5776.518,
    "text": "Now, maybe active vision that's just doing a thousand-dimensional interpretation of a data set, you know,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5777.754,
    "end": 5803.535,
    "text": " stick with empirical math you know it's either recognizing a photo it's not recognizing a photo during some deep deep deep computational processes but action and particularly then action policy and then teleology and and would you say that would you say there's general claims or is where where would teleology fit in here",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5814.229,
    "end": 5831.989,
    "text": " teleology is never directly measured is that fair to say so it can it can always it can be it can be in green but it cannot be blue one can say i observed sorry blue but i chose the colors for a reason too",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5833.064,
    "end": 5840.55,
    "text": " One could observe the animal trying to swim to the surface, and you can say, well, the teleology is obviously not to drown or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5840.911,
    "end": 5848.457,
    "text": "But that's actually structured as, because I empirically observed the swimming behavior, I am going to make a claim about the teleology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5849.338,
    "end": 5854.962,
    "text": "So I would say teleology is in a general case...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5856.75,
    "end": 5866.335,
    "text": " Even another spin on this one would be empirical is like X. This is the data that we're actually observing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5867.416,
    "end": 5869.877,
    "text": "General is unobserved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5870.297,
    "end": 5873.559,
    "text": "You can't observe things that are general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5873.779,
    "end": 5881.103,
    "text": "You're only observing what Blake calls the minute particulars, W. What is math?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5885.706,
    "end": 5891.028,
    "text": " Math is, in the examples that we looked at, it's like the process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5892.368,
    "end": 5893.869,
    "text": "Oh wait, active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5893.969,
    "end": 5895.669,
    "text": "It's a mathematical process theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5897.97,
    "end": 5904.752,
    "text": "So math is a process of inference that yes, connects to generalities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5906.673,
    "end": 5908.293,
    "text": "And this is not hard and fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5908.333,
    "end": 5913.155,
    "text": "I hope it's not being interpreted in the most rigorous way, but it does generalize",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5914.724,
    "end": 5937.507,
    "text": " because it has to be like the intermediating blanket so let's pull this w and x back in here all right so here we have the empirical states here being observed that's our data okay and then here's the things that we would like to generalize on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5940.41,
    "end": 5945.252,
    "text": " And then this gets to Dean's question about how do you go from this to equations?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5947.893,
    "end": 5950.414,
    "text": "And here's math as our sort of blanket in the middle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5952.675,
    "end": 5964.04,
    "text": "That's when we actually do, whether it's variational base or whether it's exact or whether there's some other mathematical approach,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5965.362,
    "end": 5970.966,
    "text": " It's how we're going to go from these generalized or hypothesized things that we didn't observe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5970.986,
    "end": 5973.888,
    "text": "How are we going to connect that domain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5974.928,
    "end": 5977.01,
    "text": "And so it's almost like a little boomerang.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5978.131,
    "end": 5981.493,
    "text": "So there's probably a lot more to explore here too, Dean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5983.01,
    "end": 6001.096,
    "text": " I just like how this has come together because math, as we said, well, as I mentioned before, I think in the author's mind, the motivation moving forward on the paper was math could be a vehicle and it can move the process along because it is a process or it can be an impediment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6001.677,
    "end": 6007.099,
    "text": "The other thing that's really interesting here is because it's in the middle, isn't math got a lot of rules in it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6007.359,
    "end": 6008.339,
    "text": "I mean, come on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6009.935,
    "end": 6010.175,
    "text": " Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6010.596,
    "end": 6014.44,
    "text": "So, again, I don't think we're contradicting ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6014.82,
    "end": 6018.404,
    "text": "I just think we're asking, so again, what do we allow to pass through the sieve?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6019.205,
    "end": 6020.286,
    "text": "And what do we hold back?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6020.966,
    "end": 6024.19,
    "text": "And then what assumptions do we make about the sophistication?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6025.151,
    "end": 6030.016,
    "text": "What's the minimum amount of sophistication around the math process that one must have?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6030.276,
    "end": 6031.437,
    "text": "Dr. Carl Friston said...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6032.578,
    "end": 6039.401,
    "text": " You must have a good grounded sense of what the math is if you're going to go forward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6039.601,
    "end": 6041.341,
    "text": "He didn't couch his words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6042.722,
    "end": 6049.804,
    "text": "He said, if you want this to become a vehicle and not an impediment, you're going to have to get familiar with the math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6051.525,
    "end": 6053.566,
    "text": "And sometimes, oh, the math is not the territory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6054.186,
    "end": 6056.827,
    "text": "Important contribution in memes for sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6058.207,
    "end": 6059.528,
    "text": "If the debate were about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6060.31,
    "end": 6083.964,
    "text": " whether territories were maps it would be the silver bullet to simply claim that the math is not the territory but it's like right and we want the map so that we can take action and be on our road trip or whatever so it's the math is not the territory while it's the conclusion or the um second part of the rhetoric",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6085.814,
    "end": 6095.841,
    "text": " For some, especially philosophers, who might be interested in what is really out there, because the math is not the territory, comma, then what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6096.802,
    "end": 6107.11,
    "text": "That's like the dot two of act-inf, which is instead of just debating, well, yeah, well, because of homeostasis, what can you really say about teleology?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6107.17,
    "end": 6112.113,
    "text": "And because of allostasis, does that contribute to a new understanding of niche construction?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6112.574,
    "end": 6114.095,
    "text": "They're all important questions, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6116.411,
    "end": 6126.698,
    "text": " but then where do we go when we put the math is not the territory as our antecedent rather than our conclusion rhetorically, Stephen?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6126.718,
    "end": 6128.779,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6128.84,
    "end": 6130.1,
    "text": "And like when you put here, so,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6131.616,
    "end": 6133.177,
    "text": " First, the math, I totally agree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6133.197,
    "end": 6145.107,
    "text": "I was thinking that a vehicle, I was thinking it also takes a different, so for instance, say I have a million dollars, it gets picked up, it's counted, it's picked up in a car, taken somewhere, and then it's counted as a million dollars.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6145.748,
    "end": 6148.711,
    "text": "The bit in between, it's not math, it's just stuff, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6149.431,
    "end": 6151.253,
    "text": "But in this process theory,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6152.879,
    "end": 6165.846,
    "text": " In a way, the math is enabling, and it could be an entropic process, it could be math in maybe some sort of virtual numbers way or noise way, but the math is the vehicle for the data.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6167.167,
    "end": 6169.028,
    "text": "There is no data, there is no banknote.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6169.869,
    "end": 6179.814,
    "text": "There is only a process which enables the general to the empirical, and the empirical in this context is a modelled empirical.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6180.896,
    "end": 6184.158,
    "text": " In a way, what we're saying is we're going to take most of the models that we see.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6184.178,
    "end": 6202.432,
    "text": "There's a very simple general idea about behavior, say in Ryan Smith's idea about how the heart behaves, how the gut behaves, something about how access consciousness or access awareness is achieved, some general thing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6202.792,
    "end": 6205.754,
    "text": "And then we basically do what we might call a modeled empirical.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6206.355,
    "end": 6208.777,
    "text": "You could flip it around the other way and you could have...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6210.959,
    "end": 6218.303,
    "text": " Okay, well, in the real world, we could have a high dimensional empirical outside there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6219.324,
    "end": 6220.744,
    "text": "What's the general W?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6220.784,
    "end": 6223.666,
    "text": "What's the general X internally?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6223.686,
    "end": 6227.428,
    "text": "What's the general, which is what we use as our heuristics?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6229.11,
    "end": 6238.555,
    "text": " you know, which could be kind of interesting as well, which is maybe more in the action, because this is coming in on the sensory, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6239.055,
    "end": 6241.376,
    "text": "But I think this is quite helpful.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6241.416,
    "end": 6242.457,
    "text": "Would you say that's true?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6242.517,
    "end": 6249.5,
    "text": "It's a modeled empirical, what we get on the, in terms of how we work with it in the active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6253.202,
    "end": 6254.203,
    "text": "I mean, looking back,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6255.302,
    "end": 6280.252,
    "text": " on it is there anyone who disagrees that empirical is always as modeled like it's kind of funny like now i want to put a little red guy always intervening on this edge little blue guy always talking about specific examples of math and generality and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6281.357,
    "end": 6304.678,
    "text": " know the the generalization is we use the the um you know in equal variance t test so we generalized to connect the empirical and the math dean i i really didn't want to go there here but i have to i was way too excited last week when i had a little thought bubble and said wouldn't it be cool if my if michael",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6306.713,
    "end": 6322.945,
    "text": " or sorry, if Steven Mann and Connor Hines, if we could get them in a room and instead of them talking about what they know, get them to go through this process, because that's essentially what we want to do is we want to have that little guy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6323.826,
    "end": 6331.871,
    "text": " pop out as opposed to the one who knows so much in a dense way about their math or so much in a dense way about their philosophical guide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6332.532,
    "end": 6337.455,
    "text": "Because that's when the true grasp of what the potential is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6337.575,
    "end": 6340.957,
    "text": "And it's not about always having the right answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6341.477,
    "end": 6344.919,
    "text": "It's coming up with the best answer in that moment, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6345.36,
    "end": 6348.262,
    "text": "And if we could get more of those kind of situations,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6349.002,
    "end": 6356.203,
    "text": " I think people would actually, I think people will actually come away feeling even more confident because that's what this is about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6356.223,
    "end": 6358.524,
    "text": "It's about confidence developing, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6360.584,
    "end": 6369.806,
    "text": "One thought on that is like, it's possible to stay purely internal to math and that's the internal logic of proofs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6370.706,
    "end": 6377.627,
    "text": "It's also possible to stay internal to general claims and do philosophy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6379.824,
    "end": 6406.938,
    "text": " is it possible to stay purely within the realm of empiricism in the trivial case yes if you're just aggregating data sets and never interpreting them yes but empirical in application must either connect to a general question like you know again we observed the ants and now we're going to talk about evolution so that's still qualitative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6407.981,
    "end": 6409.421,
    "text": " but it's an edge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6409.521,
    "end": 6418.104,
    "text": "And then it rests on math when it's more statistical and on generalities when it's more conceptual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6418.984,
    "end": 6436.509,
    "text": "But it's just sort of interesting that the internal logic of empiricism is basically just data integrity, but it's like pre-interpretation, which is perfect for it being X. Whereas there's a whole guild structure and discipline",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6437.645,
    "end": 6461.427,
    "text": " around internal mathematics and internal generalizations and philosophy and so it's like i and i also really agree with that having them i thought you're gonna say just get them in the same room and then just talk about food or music or something like that no but i i know what you mean have them and just like we're all learning by doing in this space",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6462.532,
    "end": 6466.574,
    "text": " And to say that this is a lifelong journey would just be a total understatement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6466.654,
    "end": 6469.976,
    "text": "It's broader and deeper than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6470.697,
    "end": 6477.621,
    "text": "So how do we recognize the complexity of this arrangement as well as the adjacent possibles?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6477.701,
    "end": 6479.322,
    "text": "Are there ways that it could have been made?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6479.822,
    "end": 6481.583,
    "text": "Other end states that we could have reached?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6483.285,
    "end": 6490.81,
    "text": " bringing in any number of fourth points to make a tetrahedra, any other number of orders of paths that we could have done to reach this point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6490.87,
    "end": 6495.393,
    "text": "Like if we had started with these little dots and then later added the arrows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6496.053,
    "end": 6498.235,
    "text": "And how did we start this whole thing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6498.775,
    "end": 6500.396,
    "text": "With examples of each edge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6501.577,
    "end": 6510.623,
    "text": "So getting to the super like fractal multi-scale level where, and we didn't even add any formalisms or mathematics here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6511.496,
    "end": 6520.022,
    "text": " but we could have done some pseudo code or some pseudo equations to really start to link this and to lean more on our mathematical leg.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6520.602,
    "end": 6526.806,
    "text": "And that's the whole thing that you just said about confidence, Dean, which is like, this is the space that we're going to be bouncing around.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6527.266,
    "end": 6536.553,
    "text": "And you can ignore statistics and you can just have an emotional response to p-values and stuff like that, but you will need that as part of the journey.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6538.763,
    "end": 6541.785,
    "text": " We can't just be like the post office vehicles that don't make left turns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6542.385,
    "end": 6556.015,
    "text": "We have to make all of our tools available at the team level and then trust that with distributed cognition and with guides and wayfinders and peer facilitation that we can...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6558.661,
    "end": 6562.465,
    "text": " make it work, despite how vast this area is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6563.105,
    "end": 6568.27,
    "text": "So, yes, Stephen, as we go for our final commentary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6568.53,
    "end": 6569.951,
    "text": "Yeah, I think you made a good point there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6570.051,
    "end": 6573.615,
    "text": "I am with that green arrow, just one last thing with a green arrow you put there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6574.275,
    "end": 6578.299,
    "text": "Could that be more implemented implementable?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6579.814,
    "end": 6605.907,
    "text": " um like it becomes more implementable as you go that direction um away from the math uh with a mixture of general and empirical uh just curious so the arrows yeah the arrows i mean again it's open to interpretation in other ways it could have been done i was thinking what links up math and empirical they're both more numerical that's the bottom edge okay then then um what",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6607.136,
    "end": 6630.787,
    "text": " then what makes math and general similar they're less example-like and then what is the similarity between empirical and general so what is not just pointing what's the arrow that doesn't point to general but what's the arrow that points between general and empirical and what distinguishes mathematics from general empirical it might be its formalism but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6632.327,
    "end": 6661.274,
    "text": " general is it well i'm thinking implementation or maybe this does get into teleology like it shows you more but the empirical is what's actually happened so like like i always this is an example is the um the accountant said to us once it always stuck in my mind is you know i said this before what is an organization doing what's they about he said don't tell me your mission don't tell me your vision show me your budget show me what you're doing or show me where you spend your time",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6662.205,
    "end": 6688.033,
    "text": " So in a way it's like that, what's the empirical as well as the, that goes to the general to show me, well, that's, that gives an idea then of something that can be done as opposed to words or even a mathematical, well, words can be like a mathematical formula in many ways that help tell people what you want them to think, but maybe not what is going on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6688.053,
    "end": 6689.914,
    "text": "So anyway, I like those three arrows.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6689.934,
    "end": 6690.634,
    "text": "I think it's pretty useful.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6692.717,
    "end": 6711.697,
    "text": " any final comments in the last one minute dean and then blue so real quickly i think that a lot of times conferences people go and they want to talk about what they know but i think that this example today was an example of where you come in not necessarily knowing but discovering",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6712.426,
    "end": 6717.23,
    "text": " I think it's another fine example of what we're talking about when we're talking about active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6718.13,
    "end": 6724.855,
    "text": "If I caught Steven Mann and Connor in the same room, the place that I would want to begin is, what don't you know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6725.276,
    "end": 6736.684,
    "text": "How would you guys attack this from not your strength, preferences, probabilities, and fit, but from what you don't know but is still in the room?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6737.725,
    "end": 6762.883,
    "text": " and i think that's very complementary to the to the more traditional conference way of disseminating information there's my word for today and then even socially at the conference people connect with the people who they do know and that's the little click network instead of connecting with people who we don't know and so it also ties to hopefully some of our values too so blue any last thoughts",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6764.455,
    "end": 6779.082,
    "text": " Just I'm just thought of complexity science and the interdisciplinarity and the real value that goes into co-learning or working outside of your comfort zone, because really, like, that's where where the growth happens.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6779.622,
    "end": 6781.363,
    "text": "So I like those ideas a lot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6782.784,
    "end": 6782.984,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6783.464,
    "end": 6787.006,
    "text": "Working with people, you know, can have amazing pragmatic utility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6788.141,
    "end": 6807.346,
    "text": " and it must be balanced with the epistemic and with expanding our horizons and perspectives as well so yeah totally agreed well another fun one can't say we prepared too much but i think in the end it went just fine so thank you all for joining and for participating and we'll",
    "speaker": "SPEAKER_01"
  }
]