[
  {
    "start": 1.018,
    "end": 20.711,
    "text": " hello everyone it is meeting 13 of the active inference textbook group cohort one it is the final meeting of this section it's july 28 2022 and we are going to be uh especially thinking about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 26.479,
    "end": 46.505,
    "text": " feedback and structuring on this textbook group on how the first half of the first cohort went and also the ways that over quite literally the coming minutes and hours and days, we will be able to implement structures",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 47.867,
    "end": 57.451,
    "text": " to improve our experience for those of us who are continuing on to part two, cohort one, as well as those who are joining for a new cohort.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 59.472,
    "end": 64.294,
    "text": "In the onboarding page, there are two columns with checkboxes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 65.234,
    "end": 73.498,
    "text": "And clicking these checkboxes will sign you up to continue on in chapter six through 10 for cohort one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 74.525,
    "end": 102.141,
    "text": " as well as or alternatively to join in chapters one through five with cohort two so select one or both of these boxes if you'd like to be continuing on um that's the onboarding note and again other than that which i hope those who are here or watching live update according to how they want um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 102.961,
    "end": 108.209,
    "text": " Other than that, we're going to be talking about future textbook groups and other things like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 109.051,
    "end": 113.197,
    "text": "And then also just on the informational briefly on the future textbook group page,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 114.639,
    "end": 118.02,
    "text": " Here's the link to share with people to join future textbook cohorts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 118.581,
    "end": 122.742,
    "text": "So to join in, and then also please fill out this feedback form.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 123.163,
    "end": 135.108,
    "text": "It's really important that even if people think they have limited or non-valuable feedback that they provide it because whether it's on this page directly where everyone can edit,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 135.868,
    "end": 164.227,
    "text": " so every thought that somebody has like even if right now they can just edit this page or in this more anonymous and asynchronous mode or through direct communication but we're experiencing it and so we have the best insight at this point into how to improve it and the affordances that we're seeing today or the the state updates or however you want to use ontology terms to describe it but what we're seeing today we can do",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 166.434,
    "end": 185.539,
    "text": " So we should have a fun discussion today on some of those topics and then also look towards project ideas, many of which are related to the educational process and others which are building on education into research and application.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 186.0,
    "end": 187.74,
    "text": "And so there will be spaces for those as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 189.621,
    "end": 193.782,
    "text": "Let's begin though on this future textbook groups page and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 194.921,
    "end": 215.571,
    "text": " anywhere where people want to jump in writing or speaking how are we going to summarize and distill the experience of the last few months in this textbook group and bring it towards improvements in our coming cohorts",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 272.392,
    "end": 286.26,
    "text": " Yeah, I think having worked examples, as I've talked about and discussed with Brock, like in Jupyter Notebooks or like even like simple, like, did you understand the materials?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 286.34,
    "end": 290.163,
    "text": "Like question and answer, like quizzes at the end of each chapter or like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 291.721,
    "end": 296.484,
    "text": " something like that, I think would just would be useful, like to gauge your own understanding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 296.644,
    "end": 302.328,
    "text": "Like if there is like a definition or something that we can directly refer back to in the text, that'd be useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 302.348,
    "end": 312.994,
    "text": "Okay, worked examples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 313.974,
    "end": 314.935,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 316.616,
    "end": 316.896,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 317.476,
    "end": 320.258,
    "text": "And the questions could also include",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 321.789,
    "end": 322.89,
    "text": " Little tests of knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 322.97,
    "end": 328.495,
    "text": "Not every question needs to be throwing a baseball into the deep unknown.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 329.536,
    "end": 338.143,
    "text": "It can be literally clarifying for someone who believes that an answer is in the known unknown space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 339.004,
    "end": 340.105,
    "text": "I believe there's an answer for this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 340.145,
    "end": 341.886,
    "text": "I just want to clarify from my understanding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 342.667,
    "end": 349.473,
    "text": "But also once you've clarified that, and especially if you did just clarify it, then write that example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 350.919,
    "end": 354.901,
    "text": " Because many of these are opportunities for worked examples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 355.742,
    "end": 358.243,
    "text": "And worked examples work in certain situations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 359.604,
    "end": 365.388,
    "text": "For formalisms, for example, it might also work for formalisms that aren't mathematical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 366.649,
    "end": 369.65,
    "text": "Like, here's the system this way, or this phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 370.091,
    "end": 371.872,
    "text": "How do these ontology terms map?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 373.973,
    "end": 377.375,
    "text": "Or if this is the blank, then what is the other thing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 386.158,
    "end": 393.601,
    "text": " Okay, so we have Okay, anyone else just go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 393.661,
    "end": 401.705,
    "text": "Or let's just continue to edit and organize and add notes and just have more because many people are having many thoughts on directions to go.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 401.725,
    "end": 406.147,
    "text": "And just like what is the space of some improvements that we can explore?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 406.167,
    "end": 410.689,
    "text": "And then how will we be implementing some of these changes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 412.912,
    "end": 417.78,
    "text": " And then in cohort two, when someone's like, it could be this way, and they've thought of something that's new and not on this list, we add it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 417.921,
    "end": 419.523,
    "text": "If it's on this list, we say, awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 421.226,
    "end": 421.707,
    "text": "We agree.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 422.268,
    "end": 423.23,
    "text": "Join us and do it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 490.02,
    "end": 491.681,
    "text": " Anyone else with raised hands?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 491.821,
    "end": 496.105,
    "text": "Or we can look more at a few other sections before going to the projects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 518.342,
    "end": 533.93,
    "text": " Like when I see different regimes of attention, I think one way that we can structure that is by clarifying what practices we're explicating and where those practices can take place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 539.293,
    "end": 546.157,
    "text": "So then, because the reality is, and people who are here or listening in replay can give their input,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 547.958,
    "end": 569.754,
    "text": " many people may not have known what exactly to do to engage with the material there's a textbook there's some regular meetings there's an information resource and it's like an infinite game to structure",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 572.796,
    "end": 599.435,
    "text": " beneficial engagement and where the rubber hits the road is like being clear about what practices people can engage in so if we have math like not everything has to be fractaled out into sub sub sub groups just including many of the practices like if you want to do art about active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 600.745,
    "end": 624.965,
    "text": " here's a practice and then if people are engaging in that practice it does like create kind of like a group or a guild engaging in that performance so however people think like what are useful minutes and seconds that actually help learning active inference",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 626.926,
    "end": 648.326,
    "text": " and we'll be able to have a perspective on that question in years from now that's very different based upon better understandings of competencies and the fundamentals and the approachment to the area however I think the practices table and providing feedback and then",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 651.152,
    "end": 661.697,
    "text": " sharing and communicating how we're using practices to increase understanding could be very important for those who are learning and learning how to learn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 677.944,
    "end": 679.185,
    "text": "Jessica, and then anyone else?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 683.513,
    "end": 698.484,
    "text": " I think to build up on Blue's suggestion, I'm thinking that in some of the courses that I've taken, you have the other participants giving feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 699.084,
    "end": 705.209,
    "text": "As part of the learning process, you give feedback on the other participants' work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 705.489,
    "end": 710.833,
    "text": "So it could be that there's an exercise and everybody has to fill it up, etc.,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 712.159,
    "end": 716.482,
    "text": " And then the other participants, it could be two or three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 717.063,
    "end": 718.764,
    "text": "So not everybody has to read everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.784,
    "end": 727.751,
    "text": "So it's like two or three people, you read Jessica's answer and give a feedback and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 727.771,
    "end": 738.258,
    "text": "Because in that way, by having to critique or analyze other people's work, it helps you think through the material itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.422,
    "end": 744.283,
    "text": " And, yeah, so that's, like, another way of also, like, learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 744.483,
    "end": 765.972,
    "text": "Again, there's also missing, like, you could be probably, like, making a mistake or not applying it correctly, but it's, like, a tool to help you think through the material by analyzing somebody else's work while also, you know, initially also having to deal with yourself and then hearing also the feedback that other people are going to be giving you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 767.503,
    "end": 773.307,
    "text": " So I was kinda like an idea that came to mind, like making reference from like other experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 778.011,
    "end": 778.731,
    "text": "Thank you, Jessica.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 779.992,
    "end": 780.273,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 788.719,
    "end": 794.924,
    "text": "I think that's a great area to keep in mind and to balance",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 796.858,
    "end": 813.329,
    "text": " as our cohorts build and so on, like who's on the supply and who's on the demand side of that, so to speak, like who is actually offering the feedback and then who's the people who are wanting feedback.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 814.59,
    "end": 825.858,
    "text": "Like some of these projects are things where the person was able to be brought in to another project",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 827.751,
    "end": 856.306,
    "text": " like the like noah's and mike's work bringing them into synchronous and asynchronous resources that are already happening provided them with at least a first step or continuing on their journey others are um they're in different areas and so how to keep it open when people have ideas ranging from educational improvements",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 857.574,
    "end": 887.218,
    "text": " to robotic deployments what kind of feedback they need and then how to balance like the excitement around applying active inference with what it means to learn like there are biochemistry classes it's not all just biochemistry lab but who's to say that's even the best way or anything like that it's just we want to make sure that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 889.008,
    "end": 891.17,
    "text": " we keep it all in mind, Jessica?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 891.19,
    "end": 892.831,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 893.311,
    "end": 901.378,
    "text": "And I think this suggestion is not connected to someone's project or an existing project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 901.818,
    "end": 903.84,
    "text": "It's more like an exercise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.88,
    "end": 911.406,
    "text": "So there's like, you know, a short exercise that it's going to be testing, you know, variational inference or something like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.366,
    "end": 914.108,
    "text": "And, and then yeah,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.538,
    "end": 920.541,
    "text": " Yeah, like every participant in the class actually does the exercise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 921.162,
    "end": 930.908,
    "text": "And then it's assigned to other people in the cohort to analyze that person's submission.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.928,
    "end": 937.852,
    "text": "So it's like three people in the course analyze Jessica's submission and give feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.073,
    "end": 943.876,
    "text": "And it's going to be like for everybody, we'll be getting three...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 946.151,
    "end": 954.014,
    "text": " Three feedback on like how they applied the terms or like, you know, there are other ways that they could be done, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.634,
    "end": 964.018,
    "text": "And I mean, if some of the things are like math related, like I will have to see because then the answer is going to be more clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 964.038,
    "end": 965.258,
    "text": "It's not going to be as subjective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 967.399,
    "end": 969.56,
    "text": "But it's more like, you know, there's a short exercise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.024,
    "end": 980.052,
    "text": " everybody does the exercise and then some people then get to review that, you know, that answer of the person and give feedback on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 980.352,
    "end": 982.854,
    "text": "So it's like separate from an actual project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 982.874,
    "end": 985.156,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 985.396,
    "end": 985.836,
    "text": "Makes sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 985.876,
    "end": 992.342,
    "text": "It's kind of like a combination of having a good example questions with an organizational structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 992.362,
    "end": 998.507,
    "text": "And then, like you said, balancing like where there might be a clearer understanding",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1000.869,
    "end": 1021.457,
    "text": " a measuring stick like was this the right equation or the right calculation or not versus um how did this usage of affordances in a new context make sense to you and um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1026.321,
    "end": 1054.157,
    "text": " also it's not just about getting feedback on the person's idea it's like the practice of providing constructive ideally written comments is super important like the secret side of the questions is the discourse where the kinds of things that questions and ideas that send people on thought excursions and research rabbit holes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1058.092,
    "end": 1086.975,
    "text": " we can collaborate on that response together and it doesn't have to be the end-all be-all but sometimes by putting like a seed into the workspace by putting like a prompt or a question 10 people could write for five minutes and then there would be 50 minutes of writing on that topic from different perspectives whereas if there's 10 people also there could be five minutes of discussion",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1089.02,
    "end": 1110.85,
    "text": " which might add more seeds onto the table and it might continue to invoke whimsy or it might continue to instruct if there was a broad uncertainty that that five minutes of discourse resolved yeah yeah no i was gonna say like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1112.472,
    "end": 1128.583,
    "text": " I think for the questions, it's like somebody has a question that they're trying to understand and everybody's giving the crowdsource answer and helping sense make the meaning of how things are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.544,
    "end": 1139.651,
    "text": "With the other exercise, I think similar to I think what Blue wants to do with the short exercises to test whether people know the concept or not,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.656,
    "end": 1152.199,
    "text": " It's just like adding, by having people critique other people's work and having to critically think through the answer is another level of learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.879,
    "end": 1155.82,
    "text": "Because it's not just like, oh, I think this is the answer to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1155.88,
    "end": 1167.904,
    "text": "It's like, no, I actually have to understand, one, the concept that I'm using to evaluate an answer, and then also evaluate that person's answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.056,
    "end": 1171.178,
    "text": " And kind of compare and contrast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1171.979,
    "end": 1182.929,
    "text": "And that, like, having to make that exercise of critical thinking, I think, helps people learn, like, in a more in-depth way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1182.949,
    "end": 1190.837,
    "text": "Because you have to think through your own thinking process and, like, what things mean, what somebody else was saying, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1192.905,
    "end": 1195.988,
    "text": " And, yeah, and I've seen it applied to, like, writing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1196.268,
    "end": 1199.892,
    "text": "I mean, I guess it's maybe, like, easier to, like, write in courses and things like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1201.033,
    "end": 1207.919,
    "text": "But, yeah, it's, like, another way of, yeah, like, processing through the information.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1209.641,
    "end": 1210.722,
    "text": "And then also...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1213.083,
    "end": 1222.106,
    "text": " You know, so maybe like reduces the burden or maybe like a person having to like go through everybody's answer and making sure like, yeah, like I am the teacher correcting everybody's answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1222.146,
    "end": 1235.95,
    "text": "Like it's, you know, you're sharing the responsibility around everybody in the group of, you know, like kind of answering, you know, like, you know, evaluating people's like responses to an exercise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.97,
    "end": 1239.552,
    "text": "Thank you, Brock.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1239.632,
    "end": 1240.832,
    "text": "And then anyone else with a raise hand?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1246.591,
    "end": 1272.072,
    "text": " uh, just to agree with Jessica and the last part would, I was going to add that, but, um, yeah, but just systematically created, creating a systematic affordance for people to review or provide some validation that it's correct or on the right path or whatever, um, will reduce the burden there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1272.572,
    "end": 1275.855,
    "text": "And, uh, teaching,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1277.751,
    "end": 1303.0,
    "text": " probably the best way to learn it's learning how to learn is it's like difficult to do without teaching like learning self learning is about teaching yourself to get better at teaching you get better at teaching yourself",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1311.653,
    "end": 1316.198,
    "text": " Which... Just the circle back.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1316.298,
    "end": 1326.068,
    "text": "That does kind of require some metastructure to create examples or source them or whatever and then provide them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1326.088,
    "end": 1333.536,
    "text": "So I'm not sure outside of the...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1334.565,
    "end": 1335.726,
    "text": " project that I put on there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1336.327,
    "end": 1339.971,
    "text": "And maybe it's kind of related to Jacobs as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1340.011,
    "end": 1347.179,
    "text": "But outside of those two things, I'm not sure we have a clear affordance to do that yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1347.62,
    "end": 1351.344,
    "text": "So we're coming up with examples of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1352.915,
    "end": 1354.756,
    "text": " Yeah, like examples to work or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1354.776,
    "end": 1364.223,
    "text": "Yeah, like sort either sourcing them and then putting them in a structure that says, Oh, this is for section the chapter one, or whatever 1.1 or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1364.984,
    "end": 1372.309,
    "text": "This is so no questions that are related to specific parts of the textbook with people to work through, but what kind of table or structure?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1373.578,
    "end": 1390.286,
    "text": " could be I guess virtually the same but instead of a question a question somebody is asking it's an example for other people to answer maybe with an answer that they can see like if they want to reveal it or whatever but these does that make sense",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1391.109,
    "end": 1418.308,
    "text": " yes yes um that's that's what it could be an example to work through in this course it doesn't be in this exact table but just make sure that we have written it down and everyone can be contributing to like write it down and what the structure is because it's not like this is a um impossible affordance we can spin up the table right now and template it and just start to design it and over the coming weeks we have time to digest all these different inputs",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1419.583,
    "end": 1438.424,
    "text": " to to make it so you know in a few weeks it will fly by but we might be able to be implementing these things I wanted to ask what practices did people feel like they engaged in fruitfully",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1442.895,
    "end": 1452.602,
    "text": " whether it's on here or not, just when you were participating in the active textbook group, what did you feel like you were doing and how did it help equation translation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1452.803,
    "end": 1454.924,
    "text": "That was like the most helpful thing that I did.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.126,
    "end": 1460.488,
    "text": "Um, and I don't think it's there in the, well, I guess it's kind of there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1461.149,
    "end": 1471.657,
    "text": "It was like to copy the equations down, but like putting them into natural language was probably like the thing that I did that was maybe most useful for myself and others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1477.318,
    "end": 1504.609,
    "text": " yep it was a great practice and um it it leads to and scaffolds so many other why is it this way what does this mean what are the examples it's not like the prerequisite per se it's possible to ask questions without having the natural language description but whether it's a basic or a multi-line equation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1508.101,
    "end": 1536.184,
    "text": " it helps bring consilience to that discussion because there's a non-zero probability that then a term is going to be used loosely or it's going to be used one way and then it's going to be conversationally used slightly differently or people will not agree on which ontology terms are invoked or not which can then have every equation start to spiral off into every possible ontology term",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1537.679,
    "end": 1540.861,
    "text": " And they very well might actually connect that way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1541.842,
    "end": 1555.37,
    "text": "But being able to see what is variational free energy, and if there's some term that is being connected to variational free energy that's not being described in the equation, that's fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1556.03,
    "end": 1562.174,
    "text": "Like least squared error isn't in the linear regression y equals mx plus b.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1563.561,
    "end": 1571.666,
    "text": " So there can be formal and informal concepts that are super important for understanding that aren't with a symbol.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1573.086,
    "end": 1579.03,
    "text": "But this was a great way to be clear what the symbols actually are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1592.614,
    "end": 1600.842,
    "text": " What other practices did people feel like they benefited from?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1603.784,
    "end": 1608.389,
    "text": "What would they recommend for a daily schedule for somebody who wanted to learn a lot?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1637.935,
    "end": 1654.444,
    "text": " I think plus one there on Blue's writing the equations, which is maybe a super simple but open-ended almost kind of version of Jessica's suggestion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1656.505,
    "end": 1665.01,
    "text": "But also in general, just adding stuff to the coda, asking questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1667.045,
    "end": 1676.011,
    "text": " Like if you read and you don't ask a question, did you really grapple with it at all?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1676.251,
    "end": 1677.091,
    "text": "I don't know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1682.555,
    "end": 1691.14,
    "text": "How do we improve thinking by writing in the actual number of typed words that people add in as a proxy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1693.373,
    "end": 1722.511,
    "text": " during a discussion is one thing, but even just afterwards or on their own timeframe, how can we have 10 people who do read a chapter, just scaling numbers, each of them could think of several questions ranging from simple, I wasn't sure about, to simple again, like more like an example one, like what are the three kinds of this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1723.427,
    "end": 1736.551,
    "text": " And it's totally known and there's answers fully listed to researching questions, but how could we have many more inputs in terms of the questions that people are asking?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1737.471,
    "end": 1745.713,
    "text": "Do people feel like they wrote questions in their own notes, but didn't bring it into shared workspace?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1745.893,
    "end": 1752.075,
    "text": "Or do people feel like for themselves or others that they observed that the questions weren't actually phrased?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1755.835,
    "end": 1756.876,
    "text": " Jessica, then anyone else?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1759.758,
    "end": 1764.541,
    "text": "I mean, I was going to share more about the student practices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1765.482,
    "end": 1774.128,
    "text": "But I guess, like, first of all, like the last question you mentioned, there were things that I didn't put in the general question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.182,
    "end": 1792.315,
    "text": " textbook thing, which were more about parsing information, which was like helping me connect the dots and synthesize information, which Ali actually helped me a lot also with some of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.716,
    "end": 1798.881,
    "text": "But those things were sort of like personal for me to like try to make sense of the material.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.122,
    "end": 1802.544,
    "text": "In terms of the student practices, I...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.587,
    "end": 1820.488,
    "text": " like initially I was thinking to do like every day, uh, you know, like an hour each for like the reading and maybe like an hour for the math, uh, to kind of get, you know, um, foundational things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1820.869,
    "end": 1820.929,
    "text": "Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.554,
    "end": 1830.758,
    "text": " But then I found it was like better for me to maybe dedicate like a longer period of time on one day or two days for the reading.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1830.778,
    "end": 1837.041,
    "text": "So I'm supposed to like a little bit of the reading or like chunk more on, you know, two or three hours in one day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1837.281,
    "end": 1844.365,
    "text": "And then maybe like follow up another day with like a longer period of reading as well instead of daily reading a little bit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1845.926,
    "end": 1850.588,
    "text": " And I think that's more because, I guess, for memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1850.928,
    "end": 1863.592,
    "text": "I mean, they do say to do, like, repetition for memory, but I think, like, for me, it was, like, well, read longer and, you know, have, like, the material fresh in your mind as, like, reading as opposed to going every day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1864.713,
    "end": 1870.095,
    "text": "And then, like, for the math, because I guess there's less of the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1871.135,
    "end": 1873.376,
    "text": " you know, keeping the material first in your mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1873.797,
    "end": 1876.238,
    "text": "Like, yeah, like daily I was trying to do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.718,
    "end": 1880.0,
    "text": "So then it fell off a little bit on that part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1880.641,
    "end": 1887.165,
    "text": "But yeah, like kind of, at least, well, not every day, like, but four days a week, at least like an hour or so, like trying to focus on the math.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.465,
    "end": 1898.011,
    "text": "But yeah, that's kind of how my practice, you know, you know, got, you know, developed over time through the course.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1948.908,
    "end": 1974.078,
    "text": " so the textbook is for as the like the research people who want to apply it in their research if we remember like from the introduction provide readers with the ability to understand and use active inference in their own research we'll have a better sense after part two",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1975.233,
    "end": 1978.494,
    "text": " with a more applied side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1984.476,
    "end": 1990.899,
    "text": "Who might the next cohort of the textbook group be in and communicate to?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1994.18,
    "end": 2003.243,
    "text": "Yes, over many iterations and it can go many ways, but when people are thinking like in the next few weeks, who",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2007.708,
    "end": 2008.429,
    "text": " Blue row, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2020.905,
    "end": 2023.068,
    "text": "Can we review which questions and understand?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2025.239,
    "end": 2029.263,
    "text": " Because I don't quite understand how this could.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2030.404,
    "end": 2040.935,
    "text": "Like, so if we go to the, like, if you want to check out the questions, check out like chapter two, like, and a lot of the questions were, so if you scroll down, keep scrolling, keep scrolling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2041.215,
    "end": 2046.84,
    "text": "Like, I'm trying to think about which ones that were skipped.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2046.881,
    "end": 2047.261,
    "text": "Let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2049.113,
    "end": 2050.253,
    "text": " And also there's no skipping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2050.293,
    "end": 2053.475,
    "text": "There's what we can address in the one hour or two hours.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2054.435,
    "end": 2054.615,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2054.635,
    "end": 2057.996,
    "text": "But I mean, like we can raise our attention to all the important questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2059.017,
    "end": 2065.119,
    "text": "Yeah, it was just like and then I realized like most of my questions were like of a largely technical nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.799,
    "end": 2069.701,
    "text": "So let me scroll through the coda and see if I can find them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2069.761,
    "end": 2075.343,
    "text": "But it was like in chapter two, it was like, let's see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2078.908,
    "end": 2087.832,
    "text": " Like the general thing to me is how can we, among other things, prevent question, self-censorship, and filtering?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2087.852,
    "end": 2097.937,
    "text": "So that people know that question isn't just like this one like genius meets genius, perfectly framed specific answer that will be understood in one sentence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2098.497,
    "end": 2101.979,
    "text": "But that question is like a broader space of prompts and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2102.298,
    "end": 2109.585,
    "text": " that don't necessarily have any prior on whether it has to do with an application or it could be a technical question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2109.605,
    "end": 2112.467,
    "text": "Well, so it was reference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2112.487,
    "end": 2112.908,
    "text": "Yeah, good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2113.689,
    "end": 2116.19,
    "text": " It was early, it was like in chapter two and chapter three.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2116.23,
    "end": 2117.89,
    "text": "And there were like a lot of questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.21,
    "end": 2122.791,
    "text": "I'm trying to like look at the specific, I'll have to look at my own code instead of watching you beautiful people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2123.311,
    "end": 2129.052,
    "text": "But it was, and like it just happened early, like in those meetings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2130.092,
    "end": 2134.473,
    "text": "And it's not that there wasn't time, like we didn't address the questions in order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2134.493,
    "end": 2136.014,
    "text": "It was like, let's skip this cause it's technical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.074,
    "end": 2137.274,
    "text": "Let's skip this cause it's technical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2137.634,
    "end": 2138.914,
    "text": "Let's skip this cause it's technical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.974,
    "end": 2142.035,
    "text": "So I just stopped putting my questions in because I feel like they're technical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2142.815,
    "end": 2166.027,
    "text": " like what does this little squiggly symbol mean and and that's why like for me the translation of equations into um natural language was the most useful thing because i feel like all of my my questions are technical like related to the math so i stopped entering them into the coda because they were just skipped over okay thanks well yeah i appreciate it um again i",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2167.981,
    "end": 2190.337,
    "text": " Personally, hope that we can have structures that uncouple the perceived importance of real-time speech from the contributions that people make so that we can be really clear about like which questions we're going to be addressing in conversation, but, and use conversation for what it can bring, many things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2191.818,
    "end": 2196.842,
    "text": "And then have 200 questions in chapter two",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2199.286,
    "end": 2226.911,
    "text": " with many up voters or with whatever mechanism that brings different questions to the fore so there isn't even like the plausibility of being skipped it's just a question of like what will we raise up and focus on individually and as a group from the many many questions of different kinds that support a beginner with fundamentals",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2228.018,
    "end": 2233.821,
    "text": " and a pre-beginner with background and somebody who's asking research questions as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2244.187,
    "end": 2257.414,
    "text": "So I think one simple thing is if you go back to the questions table, like you have a interest column here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2259.222,
    "end": 2285.545,
    "text": " um interesting yes even better um maybe there is a uh what we will address in the net coming live stream or a session kind of table that is taken from the questions table but the questions table has no such like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2287.489,
    "end": 2295.573,
    "text": " projection of what is interesting or not in some, especially in some one dimensional kind of like yes or no thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2296.213,
    "end": 2314.222,
    "text": "Um, so it's just a separation of random things, prompts, questions, and then there is some process to get it to what will, what will be addressed in the live stream that, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2320.928,
    "end": 2334.394,
    "text": " Again, there's ways to try to do things like randomization or trying to ensure that we don't continuously ask focus from one person or things like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2335.454,
    "end": 2337.835,
    "text": "The popularity doesn't kind of win the day.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2341.296,
    "end": 2349.0,
    "text": "There's more complex ways to do this that are kind of almost like decision-making processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2352.505,
    "end": 2355.186,
    "text": " ephemeral group processes and things like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2355.486,
    "end": 2362.428,
    "text": "But yeah, I think just separating them would be helpful there at least.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2368.41,
    "end": 2371.17,
    "text": "Another thing might be like Zoom, you can do breakout rooms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2371.831,
    "end": 2379.793,
    "text": "Maybe that's not the format, but again, just that's kind of an ephemeral group process thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2382.244,
    "end": 2385.045,
    "text": " Perhaps everyone doesn't want to focus on the same questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2386.346,
    "end": 2395.11,
    "text": "Should there be a temporary split of bridging of attention for some short period of time and then recombine?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2395.13,
    "end": 2405.275,
    "text": "Don't know what that means for a live stream or recording precisely, but that's a possible solution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2407.576,
    "end": 2408.256,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2409.96,
    "end": 2430.232,
    "text": " gather is awesome for these things but it does require clarity around how it's going to be done like mass one-on-one breakouts mass smaller great breakouts and rearranging people using their spatial location to express different things and assemble into different ephemeral teams",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2445.484,
    "end": 2470.147,
    "text": " okay let's look at some project ideas okay so if for those who are here or not i hope i'm not misrepresenting anything um mike brought up some token economies that's something that we've been actively going towards in active block prints um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2473.792,
    "end": 2494.965,
    "text": " So I'll just add just a note column in active blockference, as well as, as mentioned earlier, working with Noah on some more, some related topics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2497.106,
    "end": 2497.346,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2499.107,
    "end": 2500.688,
    "text": "Audiobook recording of a textbook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2501.449,
    "end": 2502.99,
    "text": "Just as we go through these projects",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2504.652,
    "end": 2510.076,
    "text": " I've recorded the first chapter and the preface type materials.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2512.778,
    "end": 2519.863,
    "text": "Do people think that an audio recording has utility?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2524.906,
    "end": 2528.368,
    "text": "And if so, is anyone interested to pursue this avenue with Blue and I?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2529.389,
    "end": 2533.272,
    "text": "Because it's very defined and it involves...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2534.909,
    "end": 2560.204,
    "text": " primarily the equations having natural descriptions and then just reading and it can go many other directions too but this is like um kind of a clear accessibility affordance for different participants that might be interesting as well as just get out there on like YouTube and other channels as having that artifact blue",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2561.351,
    "end": 2565.096,
    "text": " I do think it's useful, obviously, if I've elected to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2566.117,
    "end": 2568.941,
    "text": "I didn't realize I signed up to be the participant lead, but I'm so happy to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2568.961,
    "end": 2570.203,
    "text": "Co-lead, co-lead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.959,
    "end": 2580.923,
    "text": " But I do think it's useful as someone who drives a considerable amount of time every day.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2580.943,
    "end": 2588.309,
    "text": "I'm not a very good auditory learner, but it does help to reinforce the concepts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2588.949,
    "end": 2600.678,
    "text": "And I just wanted to mention, even if you're not comfortable perhaps doing the math or reading the textbook, Daniel thinks he can read it until it's perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2601.439,
    "end": 2602.199,
    "text": "I would prefer to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.809,
    "end": 2606.132,
    "text": " Do some video or audio editing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.093,
    "end": 2613.199,
    "text": "So that's also an option is to do audio editing, like where he's like, you know, occasionally like stutter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.42,
    "end": 2622.61,
    "text": "Daniel does it very infrequently, but I think there's the occasional tripping over a word or like saying a word twice, like when you lose your place or something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2623.09,
    "end": 2629.851,
    "text": " So video or audio editing, I do it with Windows Video Editor, but audio editing is also another possible affordance there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.232,
    "end": 2646.275,
    "text": "And it just would involve reading along with the textbook to make sure that it's accurate, that no sentences are skipped, and then to just splice out any mishaps or just ask them to re-record the Markov blanket for precision just so you can splice it over the trip up if needed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.795,
    "end": 2648.175,
    "text": "Yeah, thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2648.475,
    "end": 2650.256,
    "text": "Definitely, we would do a multi-part",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2651.42,
    "end": 2680.026,
    "text": " i i just did one pass on the first chapter no equations etc draft but okay anyways just so people who are um interested here or re-watching can know about this okay resources for conducting research or developing active inference agents ways to facilitate the starting of that work for participants just a seed idea um a lot of this is going to be explored in part two because it's a recipe",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2681.394,
    "end": 2684.715,
    "text": " for designing the models and we'll have a lot of infrastructure around that as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2686.816,
    "end": 2702.563,
    "text": "So I hope whoever wrote this continues in that interest and builds that starting point for conducting research or developing agents based around what they learn and see in part two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2703.683,
    "end": 2703.923,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2710.266,
    "end": 2710.486,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2712.762,
    "end": 2721.49,
    "text": " Also, typing just directly in the coda is a little better than comments, because sometimes it's hard to understand what the comments are, like, referring to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2723.632,
    "end": 2724.072,
    "text": "Like, okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2724.273,
    "end": 2725.914,
    "text": "Complete mathematical overview of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2727.856,
    "end": 2729.077,
    "text": "Derivations of key results.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2729.497,
    "end": 2730.358,
    "text": "Maps of equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2731.76,
    "end": 2732.02,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2733.421,
    "end": 2734.022,
    "text": "All awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2734.102,
    "end": 2735.823,
    "text": "Thank you, Jakob, for suggesting this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2738.513,
    "end": 2747.238,
    "text": " I think the closest related works are in the Actim fontology and in knowledge engineering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2750.52,
    "end": 2751.461,
    "text": "And other areas too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2754.463,
    "end": 2757.464,
    "text": "And I hope that we're on this path.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2759.446,
    "end": 2761.927,
    "text": "So however, Jakob or anyone else wants to connect on that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2763.008,
    "end": 2763.228,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2764.149,
    "end": 2764.969,
    "text": "Actim Foundations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2766.51,
    "end": 2767.971,
    "text": "So here we added this page.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2772.185,
    "end": 2783.97,
    "text": " if Brock or anyone else wants to add any comments or describe how some of these comments can be integrated with textbook group.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2794.515,
    "end": 2800.258,
    "text": "Short answer is I'm not entirely sure the precise way to integrate it with the textbook group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2801.138,
    "end": 2814.985,
    "text": " But they're just, perhaps this is related to questions, making questions, removing the stigma or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2818.562,
    "end": 2832.91,
    "text": " It's just helpful, I think, to have some affordance or regime of attention or whatever thing that says, hey, if you don't understand this thing about active inference, that's a foundational thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2833.29,
    "end": 2846.157,
    "text": "Like, okay, I get entropy, but... And I get energy, like, the basic concepts of them, but, like, when you're subtracting them, what the hell are we talking about, you know?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2847.646,
    "end": 2855.831,
    "text": " And then maybe there's, you know, some follow-on questions about mathematically what entropy is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2856.751,
    "end": 2858.352,
    "text": "Mathematically, what is energy?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2858.472,
    "end": 2861.053,
    "text": "Or, you know, what is Shannon entropy, specifically?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2861.093,
    "end": 2862.054,
    "text": "What is the difference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2862.854,
    "end": 2863.815,
    "text": "These sorts of things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2864.295,
    "end": 2871.518,
    "text": "A, it's that, an affordance for that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2871.859,
    "end": 2875.761,
    "text": "But B, it's also just acknowledging, like...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2877.907,
    "end": 2879.568,
    "text": " there's a wealth of knowledge already here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2880.828,
    "end": 2901.815,
    "text": "It's not a complete mystery what those background foundational things are or what learners might want to get out of some relatively short course to like get up to speed and feel real confident reading the textbook.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2903.776,
    "end": 2905.997,
    "text": "And so there's a kind of top down",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2909.333,
    "end": 2929.65,
    "text": " affordance there too, I think, that needs to be made for people that can say, hey, there's a bunch of equations or examples over here that are, these are the most helpful ones I've found for understanding what Bayesian inference really is, how that really works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2932.256,
    "end": 2936.138,
    "text": " So I guess it would be those two things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2936.438,
    "end": 2954.244,
    "text": "But if you look into the project notes there on that project idea thing, there's a little more detail of just a couple of bullet points there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2955.565,
    "end": 2961.107,
    "text": "It's really hard for people, I think, to get into a new thing if there's not a model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2961.994,
    "end": 2965.16,
    "text": " If you do chemistry without Bohr's model, good luck.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2965.942,
    "end": 2972.334,
    "text": "If you have to jump, especially to something like electron probability clouds or something, it's just like, why would you do that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2973.168,
    "end": 2982.354,
    "text": " when you have a perfectly good periodic table and simple discrete, you know, and it's enough even to do basic physics, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2983.035,
    "end": 2984.976,
    "text": "Like Newtonian stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2984.996,
    "end": 2985.216,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2985.296,
    "end": 2988.378,
    "text": "And so, um, you need a model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2988.719,
    "end": 2992.761,
    "text": "Like I think a lot of people, history is helpful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2992.781,
    "end": 2996.504,
    "text": "They're very minimal amount, but just to, this is where this came from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2996.524,
    "end": 2997.345,
    "text": "This is why it's relevant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2998.365,
    "end": 3000.687,
    "text": "Um, it's really hard for people, I think,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3002.492,
    "end": 3006.693,
    "text": " to blindly calculate without that sort of simple context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3009.094,
    "end": 3018.957,
    "text": "So I just kind of made a very rudimentary, still kind of scaffolding it, coda.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3020.357,
    "end": 3026.699,
    "text": "It's already linked in that project row, but I'll put it in that subpage there too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3027.939,
    "end": 3029.52,
    "text": "Super work in progress.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3034.141,
    "end": 3039.702,
    "text": " Yeah, I mean, the idea is just, these questions are gonna be asked over and over and over again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3040.262,
    "end": 3047.084,
    "text": "There will be people coming from a more mathematical, more physics, a more neuroscience, a more from different backgrounds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3047.824,
    "end": 3059.606,
    "text": "And so why pretend like that's not happening or reinvent the wheel every time somebody asks a question, like just having a central resource where people can get a lot of value, but also maybe,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3061.829,
    "end": 3075.017,
    "text": " ask a question that's a little more they might not want to ask and seem like it's too simple or it's too whatever in the live stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3075.757,
    "end": 3075.938,
    "text": "So.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3078.739,
    "end": 3079.64,
    "text": "Okay, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3083.242,
    "end": 3084.923,
    "text": "Any other comments or thoughts on this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3084.963,
    "end": 3087.044,
    "text": "Otherwise, we'll just continue on for the final minutes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3089.646,
    "end": 3089.906,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3092.096,
    "end": 3092.957,
    "text": " Textbook enrichment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3094.157,
    "end": 3099.68,
    "text": "Yes, I hope everyone continues to annotate, figure out also things on their own and explore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3100.701,
    "end": 3106.004,
    "text": "And like, we're building something really powerful with annotation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3107.245,
    "end": 3116.21,
    "text": "So I hope that people can continue to be enriching with the structures that we're building.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3118.231,
    "end": 3118.512,
    "text": "But yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3119.562,
    "end": 3124.243,
    "text": " So much of what this group has been about has been about textbook enrichment and improvement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3129.025,
    "end": 3136.587,
    "text": "Robot modeling, unless anyone has other comments, I think learning from JF and staying in part two will help.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3138.368,
    "end": 3141.389,
    "text": "And yeah, Jessica and then anyone else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3146.31,
    "end": 3148.271,
    "text": "Sorry, I think I didn't raise my hand from before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3152.731,
    "end": 3177.146,
    "text": " yes well any general comments that people want to provide on the textbook group i think the live streams are super important for the lab and the whole space",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3178.815,
    "end": 3203.315,
    "text": " a maybe obvious reason the textbook group is equally important i think these are like the two most important things that can add value to this space and the lab participants so that's it indeed glad that those who have made it this far see that and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3206.687,
    "end": 3218.015,
    "text": " over the right time scales in the right way, we see more and more vistas to increase the accessibility and rigor of active inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3219.956,
    "end": 3231.084,
    "text": "So I hope we can hold that frame and focus our attention to provide these functionalities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3233.765,
    "end": 3235.827,
    "text": "Because if it's stateable, it's doable,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3237.958,
    "end": 3238.298,
    "text": " in a way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3240.881,
    "end": 3252.571,
    "text": "And if no one from the first cohort wants to be an active facilitator or steward for textbook group two, some of these changes will be integrated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3253.571,
    "end": 3263.44,
    "text": "The more people who want to step in to steward in our participatory context,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3265.086,
    "end": 3290.548,
    "text": " are going to be leverage points for so many more people who come through so there's like multiple levels of affordances for those who see them especially at the end of this section and um it's been quite a few months any last comments",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3297.128,
    "end": 3300.193,
    "text": " Okay, I'm going to stop the recording in three seconds unless somebody wants to say something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3308.005,
    "end": 3308.205,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  }
]