[
  {
    "start": 1.263,
    "end": 27.827,
    "text": " all right hello everyone it's February 1st 2023 and we're in cohort three of the part all textbook group meeting number two we're having our first discussion on chapter one so would anybody like to just give any opening thoughts or comments",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 29.309,
    "end": 52.667,
    "text": " anything that they expected preferred enjoyed remembered about chapter one like what was something they were expecting and got or didn't or something that stuck with them about the experience of chapter one you can raise your hand or just go for it",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 75.631,
    "end": 80.979,
    "text": " How about, oh yes, please go for it, someone, or chance favors the prepared mind.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 83.242,
    "end": 83.803,
    "text": "Go for it.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 83.823,
    "end": 102.651,
    "text": "My sense was that it gave a kind of overview, but I spent my time looking at chapter two because it kind of gives this broad overview, but you feel the meat is in the rest of the book.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 104.099,
    "end": 108.445,
    "text": " So I was bogged down in the maths of chapter two.",
    "speaker": "SPEAKER_10"
  },
  {
    "start": 111.81,
    "end": 112.191,
    "text": "Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 112.411,
    "end": 113.092,
    "text": "Yes, thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 115.456,
    "end": 118.22,
    "text": "And I'll copy your comment in, Jonathan.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 122.927,
    "end": 129.837,
    "text": "Yes, rereading, taking another look and just letting it play out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 130.525,
    "end": 134.652,
    "text": " The first read and then coming back again and again and seeing more each time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 136.655,
    "end": 140.461,
    "text": "And a lot of the formalisms are not in chapter one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 140.701,
    "end": 146.07,
    "text": "So there is meat slash nutrition elsewhere.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 146.708,
    "end": 154.361,
    "text": " but also there's interesting insights within the chapter, and I'm sure it sparked people to think about different things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 154.421,
    "end": 156.905,
    "text": "So anyone else, feel free to go for it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 156.985,
    "end": 166.561,
    "text": "Like just any sections of chapter one or any framings that you remembered or you highlighted or that stuck out to you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 166.601,
    "end": 173.192,
    "text": "I'm Jonathan Castle.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 173.212,
    "end": 173.492,
    "text": "Welcome again.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 174.502,
    "end": 193.708,
    "text": " In terms of what motivates or excites people about learning Act-Inf,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 195.393,
    "end": 223.189,
    "text": " um they situate the question that actin seeks to address as how do living organisms persist while engaging in adaptive exchanges with their environment pretty interesting um is that the question that people thought active inference was going to seek to address do they think actin may address another question as well",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 232.805,
    "end": 261.883,
    "text": " okay as always just like feel free to raise your hand or write something in the chat or we'll just keep exploring along so i've not come across the neat scruffies dichotomy so that was a nice perspective let's look at that does anybody want to um summarize the neats and scruffies or give like what did they think neat scruffies means",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 263.197,
    "end": 267.486,
    "text": " or what was it doing at this part of the book?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 271.111,
    "end": 293.909,
    "text": " I think my take on it, so I'm a physicist originally, and so looking at it from sort of building from the ground up, creating unified theories of things where everything is explainable within some framework versus those who try to look at the details and build from the details up to understand the phenomena.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 294.169,
    "end": 295.752,
    "text": "That was kind of my perspective on it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 303.022,
    "end": 319.343,
    "text": " right Ali and then anyone else yeah well actually I recommend this um essay each time because I really like it um before in the book Andy Clark and his critics",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 319.711,
    "end": 335.003,
    "text": " There's a beautiful essay by Carl Fristel, namely Beyond the Desert Landscape, in which he explains in a very beautiful prose the difference between the low road and the high road.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 334.983,
    "end": 361.497,
    "text": " and it goes into much further details about the significance of these two approaches and the pros and cons of which and also the importance of looking at the same phenomena call it intelligence, sentience or agency or whatever from these two perspectives and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 361.78,
    "end": 366.726,
    "text": " What can we glean from looking at it from those two perspectives?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 366.746,
    "end": 375.796,
    "text": "So I highly recommend reading this essay, which you can find a PDF for that essay on resources page as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 377.938,
    "end": 378.259,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 380.121,
    "end": 380.521,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 385.888,
    "end": 386.448,
    "text": "High road.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 387.569,
    "end": 389.932,
    "text": "Neat.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 389.952,
    "end": 391.534,
    "text": "Unified imperatives.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 392.257,
    "end": 413.404,
    "text": " scale free systems low road gets scruffy there's a lot of last miles in the low road because every generative model is different and they're complementary roads to meet in the middle with active kate or anyone else",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 414.532,
    "end": 419.119,
    "text": " This is still pertaining to the scruffies and needs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.481,
    "end": 432.258,
    "text": "It just occurred to me as I was both reading the introduction and now listening to this, how many of us here would be self-described needs and self-described scruffies?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 433.119,
    "end": 434.782,
    "text": "I'm personally definitely a need.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 434.962,
    "end": 438.227,
    "text": "I'm very much gravitating towards an underlying",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 438.663,
    "end": 451.93,
    "text": " common explanation for everything so which draws me to the active inference as such so i'm just wondering in the group of us where would we fall in that just out of curiosity awesome",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.416,
    "end": 478.744,
    "text": " very fun question yeah does anybody want to um dox themselves in terms of being a neat or a scruffy or some secret third thing and just share like why that resonates with them and how they might see learning active bolstering how they are or providing some other support blue and then anyone else",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 480.766,
    "end": 482.489,
    "text": " So definitely a scruffy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 482.53,
    "end": 489.143,
    "text": "And, you know, like, I mean, I strive towards neat, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.183,
    "end": 493.893,
    "text": "Because I realize that like order is sometimes preferable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 493.933,
    "end": 497.56,
    "text": "I'm drawn to active inference because I really feel like it's,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 497.54,
    "end": 522.13,
    "text": " a kind of a creative lens with which to view like everything so it's just another like set of rose-colored glasses that i put on um and like i also paint and do other things and so sometimes like i'll be staring at a person like i wonder how i would represent their nose in charcoal like so just it's like one of those things it's just a pair of glasses that i um put on but i do want to also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 522.11,
    "end": 542.953,
    "text": " draw the connection between um what we were talking about yesterday on the book stream so i don't know who's watching that but um we had like you know they're talking about leadership styles and there's like the antagonistic neural network perspective where there are two um like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 542.933,
    "end": 564.553,
    "text": " opposing not opposing maybe unifying neural networks one is called the task positive network and the other is the default mode network um with the task positive network being very like oriented at getting things done um it struck me as like a more orderly thing like maybe in in line with like the needs",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 564.533,
    "end": 572.384,
    "text": " And the direct or default mode network being more like, people centered and creativity focused.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.404,
    "end": 575.729,
    "text": "And like, it's also like the difference between like, right and left brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 575.789,
    "end": 577.431,
    "text": "I mean, we hear all these things all the time, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 578.052,
    "end": 579.795,
    "text": "There's like the logical versus emotional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 579.875,
    "end": 586.584,
    "text": "And so perhaps like, it's maybe not neat or scruffy, but maybe it's both, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 586.604,
    "end": 589.889,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 589.909,
    "end": 590.95,
    "text": "Thanks, Ali.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 591.131,
    "end": 592.853,
    "text": "And then anyone else?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 595.6,
    "end": 613.204,
    "text": " I also think that this distinction between needs and scruffies somehow relates to reductionism versus emergentism, which is pretty hot debate nowadays in the philosophy of science.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 614.112,
    "end": 628.247,
    "text": " Well, of course, we know that science, for the most part, was basically a reductive endeavor and most scientists by large are reductivists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 628.307,
    "end": 642.803,
    "text": "But nowadays, especially from the mid-90s and the advent of the complexity theories and dynamical systems and so on, another viewpoint called emergentism",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 643.12,
    "end": 645.363,
    "text": " is actually emerging, no pun intended.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 647.505,
    "end": 662.885,
    "text": "But there was always a debate between which one can provide the most insightful discussions in each particular situation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 662.985,
    "end": 668.031,
    "text": "But nowadays, some philosophers",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 668.011,
    "end": 681.237,
    "text": " kind of take the middle ground between those two, such as the contextual emergentism, which has been described in this recent book, Emergence in Context.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 682.139,
    "end": 685.986,
    "text": "And I think active inference kind of maps",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 685.966,
    "end": 691.273,
    "text": " in my view, perfectly to this point of view of contextual emergentism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 691.874,
    "end": 695.178,
    "text": "And it's the best of two worlds.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 696.059,
    "end": 699.904,
    "text": "In some sense, it's a purely reductive viewpoint.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 700.104,
    "end": 710.758,
    "text": "And in another sense, it can be described as an emergentist viewpoint, at least the branch of emergentism called weak emergentism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 714.974,
    "end": 733.827,
    "text": " great lot of threads there and fun comments in the chat so maria i fail to see how one can work with details without some theory behind is it possible with active just anyone can give a thought um but i totally agree",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 734.836,
    "end": 761.012,
    "text": " implicitly always and explicitly often we do need some sort of combination and also it kind of maps just like even a little bit more loosely like industrial versus farmer's market or boutique and i think in the book um they uh basically say like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 761.617,
    "end": 789.717,
    "text": " right before the neats and scruffies come okay here's the two perspectives one perspective is that just the incredible diversity of bio biological systems and neural processes each require a dedicated explanation so we're going to have a journal or a theory or an acronym or an undergraduate major for just serotonergic synapses",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 791.283,
    "end": 792.484,
    "text": " That's one option.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 793.045,
    "end": 799.072,
    "text": "Every single phenomena is gonna have its own farmer's market bespoke scruffy theory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 801.114,
    "end": 805.84,
    "text": "That would lead to the proliferation of fields with little hope for unification.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 807.121,
    "end": 813.088,
    "text": "The NEAT perspective is recognizing diverse manifestations",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 813.963,
    "end": 839.43,
    "text": " but asking whether those phenomena of broadly perception cognition and action from a lens of persistence and adaptation in life whether there might be some coherent explanations that again recognize the diversity of manifestations and then help us understand it Michael and then Jonathan",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 848.219,
    "end": 850.023,
    "text": " Maybe unmute or I can't see.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 853.59,
    "end": 854.652,
    "text": "Michael or Jonathan?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 856.656,
    "end": 857.438,
    "text": "I'm sorry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 860.965,
    "end": 862.228,
    "text": "Go ahead, Jonathan, I'll follow.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 864.082,
    "end": 881.181,
    "text": " Just to say that perhaps this sort of dichotomy between a high road and a low road is kind of a matter of perspective in the sense that active inference itself, you know, it's a description of certain types of systems, but there are other types of systems out there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 881.642,
    "end": 891.473,
    "text": "And so if one wants to look at a higher level view, then in some sense, you know, active inference and the free energy principle are themselves the low road of some higher level principle.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 891.453,
    "end": 903.133,
    "text": " um high level physics principle whatever it is you want very interesting roads all the way up slash down uh Michael",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 905.105,
    "end": 910.273,
    "text": " Yes, in this conversation, I may be saying that I thought I was neat and maybe I'm a scruffy.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 910.633,
    "end": 914.739,
    "text": "I want to jump back for just a second to what is the key question.",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 914.839,
    "end": 921.85,
    "text": "I was troubled by that particular phrasing and I was like, what would I have possibly said?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 921.87,
    "end": 928.8,
    "text": "And I'll put in the chat, but for me, the question is, how does life interrogate life?",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 928.882,
    "end": 948.865,
    "text": " There's this dance between poetry and plumbing, and that there's a lot of this conversation that is a plumbing conversation, and that part of the way consciousness makes sense and speaks is poetry, and that that's one of the things that",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 949.3,
    "end": 975.46,
    "text": " that is is the dance here of not not an either or which is a plumbing way of describing something but um opposites and paradoxes uh that are both um simultaneously considered and that um that uh consciousness supports um an active inference supports a way of both um",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 975.98,
    "end": 1000.553,
    "text": " problem solving and contemplating mystery both concurrently and that this is part of the kind of uh there's something about not just the problem solving but the the the the being related in a way that is not um agentic if you will uh that I think is is missing in in in some of this",
    "speaker": "SPEAKER_09"
  },
  {
    "start": 1001.663,
    "end": 1002.083,
    "text": " Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1002.724,
    "end": 1005.627,
    "text": "And that, that really ties in well with what blue brought up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1005.747,
    "end": 1009.07,
    "text": "Like the task positive network is like the getting things done.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1009.11,
    "end": 1014.615,
    "text": "And the default mode is like the mind wandering and the receptivity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1014.655,
    "end": 1019.7,
    "text": "And there's just an oscillation between those two modes in neural systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1021.402,
    "end": 1022.723,
    "text": "Nathan welcome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1023.443,
    "end": 1024.665,
    "text": "And yes, please.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1024.725,
    "end": 1025.505,
    "text": "Anything you want to add?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1027.027,
    "end": 1027.347,
    "text": "Oh yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1027.888,
    "end": 1031.451,
    "text": "So, I mean, you're talking about plumbing and poetry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1031.785,
    "end": 1037.713,
    "text": " and you just were talking about TPN DM, where we're switching between these two modes of thinking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1039.455,
    "end": 1047.745,
    "text": "And before that, we're talking about like higher and lower levels of, you know, thinking about this whole problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1048.086,
    "end": 1059.36,
    "text": "So are we making the claim that like active inference is like, are we making the claim that this is like the appropriate layer of abstraction to look at this problem?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1059.901,
    "end": 1061.623,
    "text": "Because when we usually look at,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1062.295,
    "end": 1088.269,
    "text": " big problems like this we have to pick a layer of abstraction where we're not losing like a lot of detail and resolution but um by going higher up in abstraction but obviously we don't want to get bogged down by the complexity of adding more detail and resolution very interesting question",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1094.493,
    "end": 1109.127,
    "text": " guess just one very logistical way to address it is we're reading chapter one that's giving us an overview of the book then we're gonna have like a month",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1110.608,
    "end": 1127.638,
    "text": " to talk about the low road to active inference and the high road to active inference and that's going to bring us to active inference itself so at least rhetorically or pedagogically",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1127.72,
    "end": 1157.22,
    "text": " in terms of how to lay out an argument and or lay out an educational approach, it seems like the authors do believe that thinking about neats and scruffies and the resolution or the unification of them, not through homogenization, but by recognizing those two perspectives, that that is an important construct",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1157.842,
    "end": 1177.133,
    "text": " in at the very least understanding and or learning actinf and then maybe that will bring us to the question of whether it's also the appropriate level of abstraction in application ali and then anyone else",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1180.133,
    "end": 1199.222,
    "text": " Actually, I don't think we can associate a single level of abstraction to active inference framework, because as far as I understand it, active inference can equally be applied to multiple levels of abstractions and it's somehow",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1200.4,
    "end": 1207.908,
    "text": " it's a scale-free framework or, in other words, a multiple-scale framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1207.928,
    "end": 1223.984,
    "text": "So even if we talk about temporal scales or even spatial scales, we can apply it to various scales and various levels of abstraction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1224.084,
    "end": 1228.669,
    "text": "So, yeah, it's not...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1228.649,
    "end": 1242.883,
    "text": " a much more broader framework than we can associate with some other theories which specifically are limited to a particular level of abstraction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1243.203,
    "end": 1254.994,
    "text": "We can see some of the examples for these different levels of abstractions, especially in the second part of the book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1257.252,
    "end": 1280.222,
    "text": " awesome thanks so um let us turn to some of the questions that people prepared so does anyone see a question that they wrote that they would like to ask and we can explore or we'll go with the ones that people have uploaded",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1283.054,
    "end": 1310.918,
    "text": " if anybody has like one that they wrote or just want to highlight let's go to it and also it's awesome like i saw a lot of people adding comments on the questions um all right let's just go to the most uploaded one bringing the question down into here so it's just a little more visible",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1314.357,
    "end": 1335.032,
    "text": " okay on page six it refers to active inference as a normative framework there's some evaluative standard against which behavior can be scored which is free energy specifically the minimization of variational version thereof so just to plant the seed but we're gonna come back to it later",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1335.282,
    "end": 1343.072,
    "text": " The two kinds of free energy that we're gonna be talking a lot about are variational and expected, but we're gonna come back to that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1343.272,
    "end": 1350.502,
    "text": "For now, let's just think about free energy as a unified imperative for perception, cognition, and action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1351.343,
    "end": 1356.089,
    "text": "Variational is in the present, and expected has to do with futures.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1357.751,
    "end": 1361.256,
    "text": "Then it refers to planning to achieve distal goals in humans.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1362.097,
    "end": 1370.63,
    "text": " Does this definition of normative mean that ACNF is agnostic about precisely what human's goal that might be?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1372.272,
    "end": 1373.894,
    "text": "One human may wish to save the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1374.055,
    "end": 1375.276,
    "text": "Another may wish to rule the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1375.737,
    "end": 1377.52,
    "text": "Both are essentially minimizing free energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1379.062,
    "end": 1385.071,
    "text": "I might be mixing up a few concepts here, but the gist is that ACNF models don't predict a socially normative course of action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1385.231,
    "end": 1386.193,
    "text": "Would that be correct to say?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1387.254,
    "end": 1387.515,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1388.436,
    "end": 1391.26,
    "text": "What would anybody like to add on normativity",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1392.033,
    "end": 1392.774,
    "text": " of Act-Inf.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1394.536,
    "end": 1399.302,
    "text": "What does it mean to say that Act-Inf is a normative framework?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1399.322,
    "end": 1417.885,
    "text": "Does that refer to social norms or what kind of normativity is being described?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1417.905,
    "end": 1418.766,
    "text": "Ali, go for it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1420.99,
    "end": 1429.324,
    "text": " I guess at the most fundamental level, the normativity admits the agent to be persist through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1430.246,
    "end": 1441.665,
    "text": "So one meaning of normativity can be seen from the most fundamental requirement of a system or",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1441.898,
    "end": 1446.923,
    "text": " quote-unquote thing to actually exist or persist through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1447.364,
    "end": 1457.054,
    "text": "But of course, we can apply this concept onto some higher levels of conceptions, such as social normativity and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1457.155,
    "end": 1462.34,
    "text": "But again, it applies to multiple levels of abstraction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1463.682,
    "end": 1464.042,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1464.482,
    "end": 1465.003,
    "text": "Jonathan?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1467.228,
    "end": 1473.796,
    "text": " Yeah, that sort of requirement for wanting to persist through time feels like an evolutionary imperative.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1474.416,
    "end": 1487.772,
    "text": "And there are other imperatives in terms of our sort of homeostatic set points and comfort and hunger and things like that, which then lead to the thing which has been evolutionarily sort of chosen through time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1488.333,
    "end": 1496.222,
    "text": "So it feels like the two kind of have a, there's a balance between the two in terms of hierarchies of scales of time, I guess.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1500.505,
    "end": 1520.455,
    "text": " thank you thank you Scott for bringing that quote so I I often compare Act-Inf with linear regression",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1522.375,
    "end": 1526.439,
    "text": " because they're both modeling frameworks that are quantitative.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1527.04,
    "end": 1531.825,
    "text": "And so sometimes it helps to be like, okay, is this statement true of linear regression?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1532.906,
    "end": 1535.869,
    "text": "And there's things that are true for both ACNF and linear regression.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1536.45,
    "end": 1539.853,
    "text": "Those like are just true of modeling or quantitative models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1540.494,
    "end": 1544.038,
    "text": "And then there's things that are different between ACNF and linear regression.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1544.718,
    "end": 1547.902,
    "text": "Those are like the features that differentiate ACNF and linear regression.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1548.582,
    "end": 1552.146,
    "text": "So we might say that a linear regression",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1552.548,
    "end": 1560.622,
    "text": " is normatively using this kind of imperative function, like to fit the least squares or the L2 norm.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1561.704,
    "end": 1569.117,
    "text": "And it's just saying this framework is gonna use this imperative to draw a straight line through points.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1570.359,
    "end": 1571.822,
    "text": "And kind of by analogy,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1572.747,
    "end": 1574.87,
    "text": " Ak-dimph is going to use an imperative.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1575.471,
    "end": 1580.099,
    "text": "Turns out it's a free energy functional that we're going to go into in the coming chapters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1581.261,
    "end": 1594.502,
    "text": "It uses that unified imperative not to draw a straight line through points like a linear regression does, but to describe Bayes' optimal perception, cognition, and actions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1597.385,
    "end": 1626.818,
    "text": " so it's doing something similar instead of having like one imperative for perception and then a different imperative for action it's a unified model of perception cognition and action that we can use this one imperative the free energy of a generative model and use that to guide the fine-tuning or the learning of that generative model",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1630.19,
    "end": 1657.378,
    "text": " to return to the social question as we move forward no it is not like uh an ought it's not the is ought this is not an ethical framework just because there's a normative way to fit a linear aggression doesn't mean that it tells you what any given culture is going to be happy or upset or benefit from or anything like that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1659.282,
    "end": 1682.809,
    "text": " there's probably a lot there's other ways to say it but just the short answer is this is correct active is not in the kernel of active is not describing social normativity in the sense of like peer pressure or like what people will look at you weirdly if you do okay",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1688.003,
    "end": 1711.024,
    "text": " next question living living organisms can only maintain their bodily Integrity by exerting adaptive control over the action perception Loop which they frame that adaptive control as the question that active seeks to address do generative models represent and thereby predict bodily Integrity",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1714.396,
    "end": 1728.619,
    "text": " Or do these models predict the causes of their sensory inputs and via minimizing the prediction error, they achieve maintaining their bodily integrity without explicitly predicting bodily integrity?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1730.241,
    "end": 1733.326,
    "text": "How to best talk about what a generative model is predicting?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1734.388,
    "end": 1735.29,
    "text": "Great questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1735.51,
    "end": 1737.433,
    "text": "What does anyone want to add?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1771.265,
    "end": 1777.174,
    "text": " Well, I think one short answer, and then Ali, is that generative models fit whatever parameters they have.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1778.275,
    "end": 1794.92,
    "text": "So you could imagine making a generative model where there's like a hidden state that is bodily integrity, and then there's observations that help reduce uncertainty about bodily integrity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1795.801,
    "end": 1801.069,
    "text": "So in that case, we'd say, yes, the generative model represents bodily integrity as a hidden state,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1802.855,
    "end": 1808.483,
    "text": " and therefore tries to do inference using that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1810.546,
    "end": 1817.276,
    "text": "Or do these models predict the causes of their sensory input and via minimizing prediction error, they achieve maintaining their bodily integrity?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1817.816,
    "end": 1828.812,
    "text": "That's actually like another way to say something similar, which is that the hidden states are the latent causes of sensory observations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1829.99,
    "end": 1851.182,
    "text": " And so by minimizing the prediction error with respect to observations, it is possible to achieve maintenance or homeostasis of those latent states, even though they are explicitly predicted or represented, but they're not observed.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1854.146,
    "end": 1855.508,
    "text": "Ali, anyone else?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1858.846,
    "end": 1881.809,
    "text": " Well, actually, in active inference, all the agents, or more technically, all the particular systems, all the particles, sorry, are kind of doing this kind of inference-making tasks in order to self-evidence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1881.829,
    "end": 1887.334,
    "text": "And actually, this task of self-evidencing is the fundamental...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1887.685,
    "end": 1916.055,
    "text": " task that an agent needs to undertake in order to keep its homeostasis into action or doing that kind of homeostasis through allostasis because both of those terms are obviously related, one of which needs more active and more active",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1916.322,
    "end": 1920.29,
    "text": " mediation to undertake the homeostasis task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1920.31,
    "end": 1931.952,
    "text": "But in any case, the concept of self-evidencing exactly refers to this kind of integrity, maintaining",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1931.932,
    "end": 1942.504,
    "text": " task that any inference-making agent needs to undertake to persist through time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1942.564,
    "end": 1951.775,
    "text": "So I think this is the fundamental requirement of any agent modeled in Active Inference Framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1951.795,
    "end": 1952.176,
    "text": "Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1952.276,
    "end": 1952.696,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1953.597,
    "end": 1960.285,
    "text": "And once we start into the subsequent chapters and we look at how preference",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1961.243,
    "end": 1989.31,
    "text": " is used in active inference we'll have some awesome discussions like do we expect homeostatic temperatures or do we prefer them it's like on one hand i prefer it's what i like on the other hand it's what i expect because i wouldn't be surprised to find myself there so how does that play out um everett yes did you hear me okay uh-huh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1990.218,
    "end": 1997.736,
    "text": " Okay, so a good answer also depends on which level of the hierarchy you are talking.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1998.438,
    "end": 2006.117,
    "text": "So at the lowest of hierarchy, there's sensory stimuli that are being predicted.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2006.097,
    "end": 2012.903,
    "text": " And the more you move up, the more abstract models or predictions are taking place.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2013.604,
    "end": 2025.074,
    "text": "So higher up the hierarchy, I could have predictions about bodily integrity or predictions about my continuing existence.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2026.535,
    "end": 2034.602,
    "text": "And then lower down the hierarchy, you could have some physiological variable that's predicted, like nociception in the case of pain.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2035.358,
    "end": 2036.942,
    "text": " And then you can add all.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2041.714,
    "end": 2042.054,
    "text": "Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2044.059,
    "end": 2045.443,
    "text": "Okay, is that all?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2047.488,
    "end": 2048.21,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2048.23,
    "end": 2050.836,
    "text": "Okay, yes, totally agree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2051.626,
    "end": 2056.972,
    "text": " Often people talk about like nested models or hierarchical models, multi-scale models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2057.793,
    "end": 2079.996,
    "text": "And that's one of the strengths of taking, of at least bringing some neatness into play is like by using a level of neatness that lets us generalize across different cognitive phenomena, like what we might just conversationally call low level or high level,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2080.263,
    "end": 2084.71,
    "text": " it allows those models to be composed in an integrated way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2085.611,
    "end": 2092.542,
    "text": "So in this textbook, there's not gonna be an emphasis on nested modeling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2092.562,
    "end": 2101.856,
    "text": "It's gonna focus on like the kernel of active inference, which is like the single agent at the single level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2103.098,
    "end": 2109.207,
    "text": "But then there's all of these elaborations, which are active areas of research and development",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2110.03,
    "end": 2112.393,
    "text": " outside of the textbook.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2112.593,
    "end": 2113.634,
    "text": "Yes, thank you, Jana.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2116.838,
    "end": 2118.439,
    "text": "Could you clarify low and high level?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2125.607,
    "end": 2133.115,
    "text": "If I think about the cortical hierarchy, there's, I think, six layers.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2135.959,
    "end": 2140.003,
    "text": "And if I read the literature correctly, they talk about",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2140.304,
    "end": 2146.833,
    "text": " different kind of predictions depending on which kind of cortical layer you are talking about.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2150.459,
    "end": 2161.935,
    "text": "And the active inference models are built in a way that also fits the anatomy of the brain.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2162.236,
    "end": 2168.505,
    "text": "So they talk about computational anatomy fitting the active inference models",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2172.265,
    "end": 2172.666,
    "text": " Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2173.026,
    "end": 2174.709,
    "text": "Jonathan, and then Gianluigi.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2176.954,
    "end": 2178.316,
    "text": "Yeah, I think that's right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2178.376,
    "end": 2185.71,
    "text": "I think another perspective is simply that low level is, for instance, the pure sensory inputs themselves.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2186.832,
    "end": 2191.661,
    "text": "We may be making predictions about a site that something that will come to our eyes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2192.101,
    "end": 2195.708,
    "text": "Higher level might be some sort of more abstract.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2195.688,
    "end": 2200.962,
    "text": " idea of the thing that it is outside in the world that is giving us the sensory input.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2201.403,
    "end": 2210.929,
    "text": "And so there's a sort of hierarchy of time scales and physical scales that we might take in moment to moment and build up a bigger and bigger picture.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2212.934,
    "end": 2241.574,
    "text": " awesome so just to restate that and then Gianluigi the low level this is just one spatial metaphor is that the pure sensory inputs themselves like the low level is where the rubber hits the road and then the higher levels are abstract or synthesized representations about what are giving rise to those sensory data and that is also called a cause in the statistical sense Gianluigi and then",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2242.702,
    "end": 2250.64,
    "text": " Yeah, I also believe that it really depends on how your generative model is set up.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2250.861,
    "end": 2261.385,
    "text": "I mean, a high level can also be a pretty straightforward sensory inference, so to say, between one observation and one hidden state.",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2261.365,
    "end": 2290.512,
    "text": " and not something absolutely abstract or at least that's what i saw like i i agree that classically it has been like those cortical layers or the the lower levels are the most most um low level sensory uh inputs so so so to say and the higher levels are the more abstract ones but i do believe that they also uh that the distinction might also not be that uh strict",
    "speaker": "SPEAKER_08"
  },
  {
    "start": 2293.934,
    "end": 2295.862,
    "text": " All right, and then effort.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2296.846,
    "end": 2298.111,
    "text": "Then there's a few more points to make.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2300.199,
    "end": 2304.838,
    "text": "Yeah, and this question about what is predicted also,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2305.628,
    "end": 2313.335,
    "text": " I think it also has to be seen from this instrumentalist and realist discussion.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2313.355,
    "end": 2325.107,
    "text": "Is it the modeler that is building an active influence model and tries to infer what the organism at whatever level is predicting?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2325.147,
    "end": 2331.433,
    "text": "And that's what I wonder.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2332.038,
    "end": 2344.536,
    "text": " You also read in the literature a lot of times that they talk with the terms as if, it looks as if the organism is minimizing this or that or predicting this or that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2345.117,
    "end": 2353.168,
    "text": "So this as if language also makes me wonder, how do we know what an organism is predicting?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2355.005,
    "end": 2382.092,
    "text": " awesome this instrumentalist and realist and map territory we're going to return to a lot um on i want to bring a few more points on the nested models and then we'll return to the questions since um like nested modeling it's kind of like the active kernel is like one lego brick with like a bottom and a top part and then like it is very amenable and as soon as we have the legos we want to stack and put them lateral and build them",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2383.253,
    "end": 2390.205,
    "text": " But the multi-level Lego structure is predicated on what that one is, at least understanding what it is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2390.265,
    "end": 2404.249,
    "text": "So in Livestream 28 on Sandved Smith's paper, this is just one example of a nested model with three layers where the quote low level is sensory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2404.87,
    "end": 2407.695,
    "text": " And then there's a level of attention and meta-awareness.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2408.035,
    "end": 2409.999,
    "text": "So there's not just one way to do nested models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2410.019,
    "end": 2422.66,
    "text": "There's many nested models that one can make, but it's an example of how something that is like raw and exteroceptive can be seen as a low-level model nested within",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2423.72,
    "end": 2448.748,
    "text": " other models that are quote higher but again that's just like a that's just like a cultural visual graphical layout there's no reason why it couldn't be from left to right or top to bottom or inside to out so it's like it's about what it is not just the spatial layout but that's what it is on the six levels of the brain so here's from um live stream 43 which was with maria um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2450.045,
    "end": 2479.663,
    "text": " yes there are six anatomical layers in parts of the mammal brain six layers that are defined like histologically like the tissues look different but it's really important to remember that is not the same thing as it's not six nested legos and we're gonna get to this more when we get to chapter five which is all about um the neuroscience",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2480.639,
    "end": 2502.175,
    "text": " but here are those six layers so this is not six full nested models like here's three full nested models that are truly nested whereas the six histological layers actually are part of an integrated inference scheme it's not six nested models",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2503.454,
    "end": 2515.367,
    "text": " But a lot of times people think, oh, multi-level models, hierarchical Bayesian modeling, hierarchical predictive coding architectures, six layers in the brain, six nested models.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2515.427,
    "end": 2520.312,
    "text": "That's not true, but that's a very common framing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2524.256,
    "end": 2525.878,
    "text": "So what is the generative model predicting?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2526.618,
    "end": 2528.841,
    "text": "Whatever it is set up to predict.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2529.221,
    "end": 2530.963,
    "text": "These are maps, not territories.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2536.816,
    "end": 2538.518,
    "text": " Okay, I think, okay, great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2539.338,
    "end": 2541.66,
    "text": "There was some awesome discourse here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2542.621,
    "end": 2547.325,
    "text": "So can someone explain to me why the inferential problem is intractable?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2547.706,
    "end": 2548.226,
    "text": "Page eight.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2549.027,
    "end": 2551.909,
    "text": "It has to do with the marginal likelihood P of Y in the Bayes theorem.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2552.47,
    "end": 2566.182,
    "text": "So does anyone here who is in this discussion like want to summarize it or what their understanding of what is the tractability issue and how are we going to approach that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2568.338,
    "end": 2582.22,
    "text": " Yeah, so the example I gave there was that if you see a flash of light, you want to know what's the probability that it is a particular thing, given that you've had some observation of the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2583.523,
    "end": 2588.17,
    "text": "But in order to do that, you need to sum up, in this case,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2588.15,
    "end": 2592.256,
    "text": " all of the different things that could have given rise to that particular flash of lights.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2592.796,
    "end": 2594.739,
    "text": "And that in itself is intractable.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2595.039,
    "end": 2605.393,
    "text": "So there are various terms within the Bayes equation, which in order to do it properly in a complex world would mean summing over an infinite number of things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2605.493,
    "end": 2607.056,
    "text": "That was my thought there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2609.058,
    "end": 2610.56,
    "text": "Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2610.58,
    "end": 2610.881,
    "text": "Great.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2615.207,
    "end": 2615.507,
    "text": "So",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2617.276,
    "end": 2635.403,
    "text": " There's a lot of ways to talk about this, but you pointed to that several pieces are required to go from a stimuli to inference about a causal state of the world, like whether it was truly a tiger giving rise to the stimuli or whether it's something different.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2636.463,
    "end": 2665.761,
    "text": " you'd want to know a few things you'd want to know the probability of given that it's a tiger what is the probability it would look like that flash you saw but then also you want to know how likely is that flash from other possible hidden causes and so that is like the probability of the flash given that it's a tiger or given it's a chipmunk given it's all these other things",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2665.96,
    "end": 2686.483,
    "text": " and that can be an open-ended sum so thanks for that great answer it is in essence an infinite sum of possible things and you'd have to know the probability to be able to say what you should really think",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2694.935,
    "end": 2697.679,
    "text": " There's many notes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2697.819,
    "end": 2701.344,
    "text": "Effort, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.784,
    "end": 2717.746,
    "text": "I also found in the book that they say for complex models, there may be many types of hidden states that all need marginalizing out, making the problem computationally intractable.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2717.766,
    "end": 2720.79,
    "text": "I thought you were saying that before.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2721.023,
    "end": 2731.1,
    "text": " But I also found that the marginalization operation might require analytically intractable integrals.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2731.862,
    "end": 2734.927,
    "text": "And I don't understand what that means.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2736.33,
    "end": 2738.914,
    "text": "Is it different than the answer you gave before?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2741.307,
    "end": 2742.729,
    "text": " It's very related.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2742.989,
    "end": 2749.539,
    "text": "So in a discrete setting, we are talking about sums.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2750.36,
    "end": 2752.503,
    "text": "Like sums, you know, 1, 2, 3, 4, 5.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2752.823,
    "end": 2754.646,
    "text": "Sum over 1, 2, 3, 4, 5.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2755.407,
    "end": 2759.873,
    "text": "In a continuous setting, we are talking about integrals.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2761.034,
    "end": 2770.063,
    "text": " So if something is being summed over a discrete range, that is analogous to it having an integral over a continuous range.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2770.684,
    "end": 2777.23,
    "text": "And so they're both beset with the same challenges of large and interacting spaces.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2778.252,
    "end": 2786.62,
    "text": "And then just one kind of note, because on a Bayesian and marginalization, this is like actually the margins of a piece of paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2786.903,
    "end": 2793.476,
    "text": " That's what it's referring to when there's kind of like actuarial tables back when statistics was done on spreadsheets.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2794.358,
    "end": 2799.428,
    "text": "So it's like if you have states of the world and then observations in a grid.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2800.791,
    "end": 2808.827,
    "text": "If each observation mapped onto one hidden state of the world, then you would just have like only on the diagonal would you have any numbers.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2809.988,
    "end": 2836.806,
    "text": " going to come back to these topics but then you can imagine that you might be interested in marginalizing a given row like summing across that row so saying okay how likely is this across all columns and that's called marginalization so why is it intractable",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2837.107,
    "end": 2864.042,
    "text": " because it might just be requiring computational resources that are unrealistic or implausible i think uh this there was actually the the reason the whole reason for a variational free energy quantity uh this this marginal likelihood thing is that correct",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2864.258,
    "end": 2890.924,
    "text": " yes it is it is free energy is going to help bound our surprise let's but let's come right to it so this one kind of goes in multiple different uh directions the central imperative is that organisms maintain their existence high road avoid surprising states",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2892.271,
    "end": 2898.477,
    "text": " How can one explain different self harms or perceived self harms?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2902.401,
    "end": 2919.257,
    "text": "This is kind of like the social norms question in that we're not always going to get a neat answer from a human scale complex nested system where the generative model hasn't been stated.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2919.743,
    "end": 2944.283,
    "text": " this if that makes sense so like given a generative model one could describe how driving off a cliff is the is the generative model's most likely course of action like if the generative model is I always drive straight I'm likely to find myself driving straight that generative model may drive off a cliff",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2945.292,
    "end": 2968.532,
    "text": " but to kind of not mention the generative model and just say well how is it possible that surprise is bounded by driving off cliffs is not a full um it's not fully making contact with what the surprise is because surprise is with respect to a generative model",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2969.39,
    "end": 2994.857,
    "text": " so whether it's the extremely complex cases of humans or whether we're talking about something different then surprise and the bounding of surprise through free energy is with respect to a generative model everything is always in respect to generative model",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2996.086,
    "end": 3000.494,
    "text": " There's no surprise minimization, free energy minimization outside of a generative model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3002.118,
    "end": 3009.892,
    "text": "So surprise minimization, free energy minimization, those are qualities of a generative model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3010.133,
    "end": 3018.128,
    "text": "Just like the least squares regression, the sum of squares is with respect to a linear regression model,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3018.53,
    "end": 3047.828,
    "text": " surprise bounding free energy is with respect to an active inference generative model and once the generative model is specified then one may find different actions as avoiding surprising states including addiction and different states that people have studied that we're going to come to but we need to fill out what generative model we're talking about before applying the imperative jonathan and then everett",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3049.428,
    "end": 3055.838,
    "text": " Within that generative model, there are also the different desired states that the organism might want to be in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3056.419,
    "end": 3061.968,
    "text": "And those desired states, they're not normative in the sociological sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3062.008,
    "end": 3063.931,
    "text": "We may have different desired states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3064.512,
    "end": 3071.683,
    "text": "And so for some people, that may be very different from what another person wants and may lead to one of these outcomes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3074.207,
    "end": 3074.588,
    "text": "Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3075.048,
    "end": 3075.469,
    "text": "An effort.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3077.862,
    "end": 3100.545,
    "text": " Yes, this example with suicide is also related to the high roads where the imperative is to maintain our existence, minimizing surprise necessary for survival.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3100.846,
    "end": 3130.836,
    "text": " so if I commit suicide then I would violate that core imperative but we do know that people commit suicide so how can we explain that through this framework and it also has to do with if I predict bodily integrity but for example I am someone who experiences chronic pain because that's the best explanation for my",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3131.356,
    "end": 3143.314,
    "text": " prediction error that I have, will there be an update of the model that says, okay, now I'm not predicting any bodily integrity anymore, but threats to my bodily integrity.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3144.375,
    "end": 3149.323,
    "text": "And would that also then lead to eventually committing suicide?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3149.783,
    "end": 3153.269,
    "text": "Or just some thoughts, but I can't make any sense of this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3155.652,
    "end": 3156.233,
    "text": "Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3157.394,
    "end": 3182.254,
    "text": " okay just in our final minutes to touch on one or two more all these discussions people can continue to engage and and develop add resources ask more questions like it doesn't stop here this is like the tip of the iceberg of us wanting to develop the state on these questions because they're things that we're all asking there's things that other people are going to be curious about and we can have",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3183.365,
    "end": 3190.404,
    "text": " great answers and complex discourse and multiple perspectives here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3192.65,
    "end": 3198.285,
    "text": "We're just going to do one more and then we'll end two minutes before the hour.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3199.514,
    "end": 3203.299,
    "text": " And again, these are also things we're going to return to in future weeks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3203.339,
    "end": 3206.243,
    "text": "This is just our first week on chapter one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3206.964,
    "end": 3217.017,
    "text": "Next week, we're going to do another chapter one session and we'll come through more questions, the second half of the questions on chapter one and anything else that people add and upvote.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3217.037,
    "end": 3219.48,
    "text": "So just in the last three minutes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3219.46,
    "end": 3244.185,
    "text": " can someone explain why exploration and exploitation are automatically balanced through policy selection in active inference page 10 what does it mean to say both exploration exploitation are balanced jana thank you i will save this chat",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3277.882,
    "end": 3287.657,
    "text": " Well, in my understanding, it would be that you only explore as much as necessary to exploit.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3287.677,
    "end": 3298.954,
    "text": "So exploration is an effort somehow, and you want to minimize this to get the maximum of exploitation.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3300.095,
    "end": 3302.539,
    "text": "That's my understanding, approximately.",
    "speaker": "SPEAKER_07"
  },
  {
    "start": 3304.409,
    "end": 3305.49,
    "text": " Thanks.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3306.452,
    "end": 3317.607,
    "text": "One very hands-on way to explore this question is in Model Stream 7.2 from just a few days ago.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3317.647,
    "end": 3323.295,
    "text": "In the video description of Model Stream 7.2, there is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3326.33,
    "end": 3351.628,
    "text": " notebook that can be run in your browser without any more tweaking and it is going to have an agent that has the choice to do a few different things they can play either of two different slot machines one of which is like better than the other or they can get a hint and so um to have an imbalanced strategy",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3351.946,
    "end": 3356.353,
    "text": " would be like to kind of zone into the first slot machine you go to and stay there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3357.695,
    "end": 3374.341,
    "text": "To have a overly imbalanced strategy towards exploration that might look like just getting the hint every time, or just kind of moving around really rapidly in the space, but not ever like latching onto ones that have high utility.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3375.602,
    "end": 3377.245,
    "text": "And then a balanced strategy",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3378.068,
    "end": 3385.16,
    "text": " which there's not just one single answer to this, but a balanced strategy in a given situation is an action policy selection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3385.22,
    "end": 3394.997,
    "text": "It's a strategy or tactics that navigate or manage the tensions of the requirements between exploration and exploitation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3395.399,
    "end": 3411.079,
    "text": " sometimes that's modeled what's called a multi-armed bandit where there's like a bunch of slot machines you want to win the most money but you don't know how good each of the slot machines are so you got to explore a little bit to find out like how good they are but then you want to spend most of your time on the best ones",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3411.802,
    "end": 3439.902,
    "text": " to spend time proportional to how good they are but of course if you only spend time on what you perceive as the best things might be changing and so you might end up not being on the best machine soon so thank you everybody for joining we'll come back next week for the second discussion on chapter one and um please add comments and questions and discourse in the time till then but thanks everybody for the awesome discussion",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3442.666,
    "end": 3443.057,
    "text": " Farewell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3443.118,
    "end": 3444.003,
    "text": "Thanks everyone.",
    "speaker": "SPEAKER_02"
  }
]