[
  {
    "start": 8.22,
    "end": 24.098,
    "text": " hello and welcome everyone to the active inference lab this is a special active inference live stream it is march 2nd 2021 and this is our first quarterly roundtable for the active inference lab so this should be a pretty fun and unique stream",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 25.236,
    "end": 27.199,
    "text": " Welcome to the Active Inference Lab, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.579,
    "end": 32.946,
    "text": "We're a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.627,
    "end": 41.157,
    "text": "You can find us on our website, Twitter, through email, our YouTube channel, our Keybase, or our Discord teams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.148,
    "end": 70.557,
    "text": " we're going to go into later in the stream so if you're curious about what each of these different platforms are for we're going to get there this is a recorded and an archived live stream so please provide us with feedback so that we can improve on our work all backgrounds and perspectives are welcome here and we will use video etiquette netiquette for live streams including muting and using respectful speech behavior let's just take a step back and look at where we're at on our calendar",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.385,
    "end": 74.407,
    "text": " It's March 2nd, and here we are with our first quarterly roundtable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 74.727,
    "end": 81.252,
    "text": "It's been a pretty interesting year with two months of weekly discussions and a couple other things we'll go into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.872,
    "end": 92.64,
    "text": "But to keep the papers two per month, and then to keep it nice and not have dot one and dot two that break across months, we inserted some quarterly roundtables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 92.96,
    "end": 94.02,
    "text": "And so here we are at the first one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 94.946,
    "end": 102.67,
    "text": " The goals of the quarterly roundtable, at least for today, are first to summarize the results of our quarterly activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.791,
    "end": 109.814,
    "text": "Secondly, to show for a broad audience what we're working on and doing and learning, and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 110.414,
    "end": 114.579,
    "text": " Third, continue and amplify our call for participation through deep time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.839,
    "end": 116.781,
    "text": "So if you're watching live, that's awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.802,
    "end": 119.244,
    "text": "We look forward to your comments and questions in the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.785,
    "end": 123.95,
    "text": "If you're watching it in replay, it's not too late to get involved because we'll still be around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.27,
    "end": 126.612,
    "text": "And so if you're still interested, then we'll still be there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.813,
    "end": 131.735,
    "text": " The sections of today, we're gonna go around and have introductions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.235,
    "end": 140.178,
    "text": "Then we're gonna take a strategic perspective on what the Active Inference Lab is and give a little narrative information for those who might be curious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 140.858,
    "end": 147.36,
    "text": "Then we're gonna go into updates from each of our three organizational units, which are .edu, .coms, and .tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 147.921,
    "end": 155.904,
    "text": "And then in hashtag future, we'll just recap some ideas on next steps and on the needs for each of the main units of the lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 156.784,
    "end": 160.547,
    "text": " So without further ado, we are on the introduction and the warm-ups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 161.168,
    "end": 174.639,
    "text": "We'll just go around and introduce ourselves, and we'll use our regular approach, which is just first we'll just say hello, however we want to give information about ourselves, and then pass it to somebody who hasn't spoken yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.799,
    "end": 180.604,
    "text": "And then after everybody has introduced themselves, using the raise hand feature in Jitsi, we'll",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 181.525,
    "end": 184.626,
    "text": " go through some of these warm up questions and it will be awesome to hear from everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 184.946,
    "end": 186.926,
    "text": "So my name is Daniel Friedman.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 187.226,
    "end": 195.028,
    "text": "I'm a postdoc in California and have been doing most of these live streams for Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.628,
    "end": 201.749,
    "text": "And I'm just looking forward to this first quarterly roundtable and I'll pass it to Sasha.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 204.25,
    "end": 206.13,
    "text": "Hello, my name is Sasha.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 206.33,
    "end": 208.871,
    "text": "I'm a neuroscience graduate student and",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 210.39,
    "end": 211.931,
    "text": " based out of Davis, California.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 212.492,
    "end": 220.217,
    "text": "And yeah, I'm just looking forward to reviewing what's happened in the last quarter and inviting people to join us.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 222.819,
    "end": 224.52,
    "text": "And I will pass it to Alex.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 227.342,
    "end": 227.642,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 228.223,
    "end": 228.983,
    "text": "Hi, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 230.365,
    "end": 231.525,
    "text": " I'm Alex Svyatkin.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 232.286,
    "end": 233.366,
    "text": "I'm in Moscow, Russia.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 234.166,
    "end": 247.469,
    "text": "I'm researching Systems Management School and also co-organizer for Active Inference Lab, where we try to join approach of Active Inference Framework and Systems Engineering Framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 248.45,
    "end": 250.09,
    "text": "And I pass it to Scott.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 252.09,
    "end": 252.71,
    "text": " Thank you, Alex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 253.511,
    "end": 254.631,
    "text": "My name is Scott David.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 254.851,
    "end": 261.754,
    "text": "I'm the director of the Information Risk Research Initiative at the University of Washington Applied Physics Lab.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 262.474,
    "end": 271.778,
    "text": "We're using active inference concepts and trying to learn active inference concepts to use in our work on information risk mitigation structures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 272.298,
    "end": 273.379,
    "text": "I'll pass it to Stephen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 273.399,
    "end": 273.839,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 276.052,
    "end": 276.992,
    "text": " Hello, I'm Stephen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 277.232,
    "end": 278.853,
    "text": "I'm based in Toronto.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 279.053,
    "end": 297.977,
    "text": "I'm doing a practice-based PhD through Canterbury Christ Church University which is sort of morphed more into a methodological PhD as I'm exploring spatial approaches to sense-making and how that can help theatre for development, disability arts and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 298.917,
    "end": 326.843,
    "text": " sort of multi-scale community development and active inference is actually a really powerful way to do that but this lab is really helping because it's a very new and complex area so i'm very grateful for the way that it's helping to really get into the weeds as we say and i will pass this over to ivan hello this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 328.857,
    "end": 330.278,
    "text": " This is Ivan.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 330.859,
    "end": 332.66,
    "text": "I'm in Russia, Moscow.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 332.681,
    "end": 335.543,
    "text": "I'm happy to be here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 335.563,
    "end": 347.394,
    "text": "I'm glad that we have the first round table and look forward to repeat again what we have done last year.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 349.926,
    "end": 350.186,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.207,
    "end": 351.728,
    "text": "Fun stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.748,
    "end": 354.251,
    "text": "I like how everyone has different context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 354.311,
    "end": 356.093,
    "text": "Some of us are on a little snow walk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 356.193,
    "end": 357.815,
    "text": "Others of us are in our cubicle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 358.395,
    "end": 361.959,
    "text": "So we can kind of go through some of these warm-up questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 362.119,
    "end": 366.244,
    "text": "Either the questions being, what's an interesting or memorable experience?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 366.744,
    "end": 380.829,
    "text": " that occurred through Active Inference Lab this quarter, and then the same question that we actually ask in the discussions on the papers, which is, what is something you're wondering about or you'd like to have resolved, reduce your uncertainty on by the end of today's discussion?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.43,
    "end": 392.314,
    "text": "So anyone can raise their hand, but I'd say one really interesting and memorable experience was the entire discussion about realism and instrumentalism",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 393.234,
    "end": 415.362,
    "text": " which was not on my radar it wasn't a dialectic or a dichotomy that i had heard of or been familiar with despite learning about science and philosophy and so for there to be a sequence of papers that we work through together including mel andrews's paper and then following with um vaness and hippolyta's paper for that sort of arc",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 416.602,
    "end": 441.526,
    "text": " in the literature to be influencing our practice as a lab by advancing our collective understanding about how realism and instrumentalism worked together and then the way that that discourse was happening live on streams and live not on streams and in text-based discussion was just like very multimodal and interesting to see how it kind of bent back around to actually changing our action not just how we think alex",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 444.851,
    "end": 445.831,
    "text": " Yeah, thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 446.452,
    "end": 465.297,
    "text": "For me, the most exciting thing is to meet a lot of people who joined to our communication channels and follow us and our activities and starting to participate in different kinds of work World Lab is organizing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 467.758,
    "end": 470.219,
    "text": "Stephen, and then anyone else who wants to say something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.284,
    "end": 484.288,
    "text": " Yeah, I think one of the things that I found really helpful, I'd been looking at the perspectival consciousness paper a bit before and definitely had got a lot out of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 484.368,
    "end": 486.909,
    "text": "But I had hit a kind of a wall on my own.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 487.289,
    "end": 498.233,
    "text": "And then when we got into that, and then start to also see that through our next sessions talking about the big five psychology traits and sort of, okay, we're starting to get",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 498.753,
    "end": 526.536,
    "text": " some patterns here um so that was really useful and particularly because i'm there's been a big struggle with how do i get into um work around psychological perspectives and then suddenly it was realizing well this whole idea of perspectives itself is loaded and it's kind of was sitting there as just a de facto thing that everything else is going to roll out from my psychological perspectives but suddenly well you need to think about what it means to have a perspective or what it means to take a pre-reflective",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 527.216,
    "end": 542.451,
    "text": " more phenomenological stance and my gut feeling having got interactive influences that it could cover with that and what i'm seeing through the the different papers in the series and discussions that actually is touching on these different areas and so that's really useful",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 543.882,
    "end": 544.122,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 544.382,
    "end": 544.922,
    "text": "Thanks, Steven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 545.202,
    "end": 547.903,
    "text": "And Yvonne or Scott, you'd be welcome too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 548.023,
    "end": 552.405,
    "text": "Another, I think, fun memory or experience was the model streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 553.025,
    "end": 571.892,
    "text": "So having the space to ask questions and having the very generous and attentive Christopher White and Ryan Smith spend four multi-hour sessions really walking us through this living document that had like 25 versions and there really were",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 572.572,
    "end": 576.655,
    "text": " implementing feedback and questions that people were having and not just, oh, hey, you were incorrect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.675,
    "end": 577.415,
    "text": "You made a typo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 577.796,
    "end": 583.8,
    "text": "But actually the feedback from the community was like, how could this be made more accessible and rigorous?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 584.0,
    "end": 590.584,
    "text": "And so we were navigating that all together, though it was the two authors on the paper, the ones who had the most expertise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 590.984,
    "end": 601.391,
    "text": "So that's sort of like a new kind of research coalition that felt a lot more participatory and inclusive than other kinds of research axes that align and then dissolve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 602.072,
    "end": 602.312,
    "text": "Scott?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 606.034,
    "end": 606.594,
    "text": " You're muted, Scott.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.256,
    "end": 609.816,
    "text": "And then Sasha.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 610.776,
    "end": 611.597,
    "text": "Oh, sorry, I was muted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 611.637,
    "end": 611.797,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 613.238,
    "end": 623.503,
    "text": "One of the things I found fascinating, I'm new, very new to the area is how each new thing that I learned about the model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 624.076,
    "end": 640.404,
    "text": " and the processes that are associated with active inference reveals certain new perspectives on existing problems and challenges, and how some of the problems I thought that were there dissipate, and then there's new sets of challenges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 640.925,
    "end": 641.885,
    "text": "And so it's really been a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 644.355,
    "end": 652.117,
    "text": " It's one of the few times in my life where I've been going into something knowing that there was going to be a paradigmatic shift and I've been experiencing one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 653.198,
    "end": 656.039,
    "text": "Paradigms I always think of as the sudden aha.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 656.559,
    "end": 661.58,
    "text": "This is like a slow motion paradigmatic shift because there's a series of ahas that happen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 662.121,
    "end": 663.321,
    "text": "So it's a fascinating shift.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 664.122,
    "end": 679.883,
    "text": " opportunity for discovering this entirely new framework that's out there that really helps with the work i'm doing and i think will help with the work that a lot of folks are doing so that it's kind of like discovering a whole new world quite frankly a whole new discipline",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 680.524,
    "end": 707.545,
    "text": " that is in the making and that's very very exciting just watching that be born it's like watching i mean it's springtime here daffodils are starting to grow and i and it sounds like i'm overreaching here but it really is like watching a blossoming of a of a living organism in in watching these processes and this community develop so i'm fascinated by the idea that the community is developing the ideas and becoming that idea at the same time and that's a that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 708.337,
    "end": 733.11,
    "text": " um intentionality and that awareness is very different than a lot of other organizations that the that they're both experiencing and exploring the experience simultaneously so that intentionality associated with it i think holds great things for not just this iteration of the of the work and the model but the model generally in terms of a lot of existing problems out there thanks cool thanks scott sasha",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 736.434,
    "end": 749.122,
    "text": " Yeah, similar to a lot of the comments that people have made, it's just been very exciting to see the new kind of energy and styles of participation that people are bringing in.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 750.063,
    "end": 755.306,
    "text": "Because when you send out the call for participation, you really don't know what you're going to get.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 755.586,
    "end": 760.49,
    "text": "And you can't be too specific about what you actually are asking for.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 760.83,
    "end": 764.492,
    "text": "And so that's been very exciting, especially in the comms team.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 766.519,
    "end": 779.919,
    "text": " and thinking about other ways to communicate other than the like weekly journal club to have a shorter perhaps kind of little bite-sized versions of the talks.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 780.64,
    "end": 781.141,
    "text": "So that's been,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 783.363,
    "end": 789.885,
    "text": " opening this conversation about who should be doing the communication and teaching.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 790.626,
    "end": 794.307,
    "text": "Should we wait to become an expert and then share what we've learned?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 794.907,
    "end": 803.65,
    "text": "Or should we kind of like foray out into the unknown and try to communicate to others what we are trying to learn ourselves?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 804.19,
    "end": 809.932,
    "text": "And I think it's the latter, as we've talked about many times in this space.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 810.472,
    "end": 811.593,
    "text": "And that's just a very",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 813.979,
    "end": 816.121,
    "text": " exciting and scary place to be in.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 816.281,
    "end": 825.11,
    "text": "So that's very exciting and something I'm looking forward to in the coming year of what the participants will produce.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 826.331,
    "end": 826.912,
    "text": "Thanks, Sasha.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 827.492,
    "end": 829.754,
    "text": "Stephen, and then we'll move into strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 831.576,
    "end": 835.039,
    "text": "Yeah, I suppose just one thing that sort of bounces on what Sasha was saying there is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 836.649,
    "end": 857.916,
    "text": " the foray into participation and that whole, that's a whole thing in itself, which is very vast, but has been really interesting because it starts to open up opportunities within some bounds at the moment, but it opens up opportunities to really engage with this knowledge in ways that maybe you can't do in a university.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 857.956,
    "end": 862.578,
    "text": "So I'm actually on the board of an organization called Interchange for Peace, which is community-based peace building.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 863.078,
    "end": 866.901,
    "text": " which was set up by Anne Goodman at the University of Toronto in the OISE.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 867.502,
    "end": 880.812,
    "text": "And she was working there, same department where Paolo Freire used to work, but she set up her own non-profit charity because there were certain things that even as a senior lecturer she couldn't do within...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 881.823,
    "end": 909.13,
    "text": " that role there needed to be some way to engage people that was a bit more freer from the constraints of the role and so she would work with that organization i think there's some parallels here and like by being able to work with active inference more broadly across papers across perspectives across disciplines may be hard to do that in a in a single university department so that's kind of interesting cool thank you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 910.143,
    "end": 922.109,
    "text": " so here we go into a little bit of recap little lab 101 um alex do you want to just go first on these next slides and just let me know if you want you know if anything else",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.191,
    "end": 927.412,
    "text": " Maybe on the next slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.812,
    "end": 929.273,
    "text": "All right, starting on the next slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.293,
    "end": 929.613,
    "text": "Sounds good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.633,
    "end": 941.519,
    "text": "So just as far as Lab 101 here, at the end of 2020, we started to apply ONFT and Active Inference, which we're going to get into more detail what ONFT is in a second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.58,
    "end": 947.323,
    "text": "But we started to apply ONFT and Active Inference to the organization of the Active Inference community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 948.243,
    "end": 951.468,
    "text": " as a new kind of participatory open and accessible lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.209,
    "end": 955.173,
    "text": "And ActiveInference.org is our reference point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 955.313,
    "end": 964.886,
    "text": "You'll see a lot more information there on various projects and units that we're involved in, as well as a link for the call to collaboration and then just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.407,
    "end": 966.208,
    "text": " That's how you get started.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.849,
    "end": 971.416,
    "text": "In December, 2020, we made the initial invitations for the lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 971.776,
    "end": 980.949,
    "text": "We sent out just an open call for participation and set out in broad strokes, the three organizational units that we are still working with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.894,
    "end": 995.286,
    "text": " And then at the beginning of January 2021 was when we began official lab activities, mostly entailing weekly drop-in meetings, as well as several other things that we're going to be talking about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 996.007,
    "end": 1000.371,
    "text": "So that's sort of how we got here, but there's also more to say on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.012,
    "end": 1007.638,
    "text": "So Alex, on the strategy side, just pick up with our paper and let's go from there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1011.121,
    "end": 1033.852,
    "text": " hey blue okay thanks yeah as you mentioned we started to apply onft framework as we proposed in our initial paper what was prepared in the last year where we tried to find a way to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1035.417,
    "end": 1054.645,
    "text": " find some kind of object in reality what will help us to organize work of our team and the broader community in a way of understanding of new ways of remote and online team working.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1056.045,
    "end": 1056.786,
    "text": "We believe that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1058.959,
    "end": 1086.059,
    "text": " reality is changed already and for now we consider any team as online team and new type of and new new types of behavior of team members of where communication styles should be organized in some way to be most efficient in this new reality and in accordance to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1087.634,
    "end": 1112.008,
    "text": " Active inference and systems engineering approaches we find with object as ontologies, narratives, formal documents, and tools, which could be kind of an informational niche for online team, which can structure and organize way of doing things in the team.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1113.575,
    "end": 1113.855,
    "text": " Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1114.855,
    "end": 1115.976,
    "text": "Thanks for the summary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1116.156,
    "end": 1117.296,
    "text": "First author, Alex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1118.096,
    "end": 1127.54,
    "text": "And ONFT was an acronym and sort of a thought pattern that we introduced in this paper just as an emergent combination of all the collaborators working together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1128.02,
    "end": 1135.002,
    "text": "And so for those who might not be familiar with each of the terms, ontology is just our structure of knowing things and describing things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.422,
    "end": 1137.283,
    "text": "We're going to go into more detail later today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.263,
    "end": 1140.945,
    "text": " Narratives are another broad topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.145,
    "end": 1144.347,
    "text": "And our first Active Inference live stream was on Active Inference and narratives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1144.427,
    "end": 1148.629,
    "text": "It's really what drives us is this narrative level of understanding and communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1149.33,
    "end": 1156.354,
    "text": "Formal documents are referring to, it could be a cloud document or a spreadsheet, but some document where someone says, yep, here's the link.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1156.934,
    "end": 1158.895,
    "text": " make your changes here, fill out this form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1159.235,
    "end": 1160.176,
    "text": "That's a formal document.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1160.616,
    "end": 1166.259,
    "text": "And then tools broadly are the software and the hardware and the wetware that we use to get it done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1166.599,
    "end": 1169.16,
    "text": "And there's some nuance to introduce with instrument and tool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.561,
    "end": 1171.281,
    "text": "Again, this is the top level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1171.702,
    "end": 1180.046,
    "text": "ONFT helps us remember that we're doing human centric systems design, and that entails making ONF and T work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1180.626,
    "end": 1183.408,
    "text": "If you have a group and ONF work and they don't have the tools,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1184.008,
    "end": 1184.608,
    "text": " there's nothing to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.249,
    "end": 1194.154,
    "text": "If they have NFT, not that NFT, but narratives, formal documents, and tools, but no ontology for sharing their communication, again, it won't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1194.214,
    "end": 1197.896,
    "text": "So we need all of these dimensions to be participatory and deep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.836,
    "end": 1211.524,
    "text": "And this paper was written with Alex as the first author, Yvonne on here, Sasha, Alexandra here, myself, and then RJ, who is not on the call, but is also...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.324,
    "end": 1234.282,
    "text": " around so this was really fun because we just put it up as a preprint and just started going for our next step into the organization so we combined complexity systems engineering and active inference with this goal directedness where did the systems engineering take us towards or what did you want to draw on systems engineering from alex because that was definitely an area that was new to me",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1238.656,
    "end": 1239.176,
    "text": " Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1240.357,
    "end": 1255.691,
    "text": "System engineering is a very developed domain of doing complex engineering systems and great community around the world for a few decades is working on",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1257.021,
    "end": 1272.247,
    "text": " developing approaches what help to create successful systems in different absolutely different directions of people's lives so there are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1273.227,
    "end": 1300.53,
    "text": " some set of standards what was developed by different communities here is presented three of them but actually there are much more different papers related to it but as for most applicable and more most useful and most important documents presented here its first is system engineering book of knowledge",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1301.665,
    "end": 1305.787,
    "text": " This is development of International Council of System Engineering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1307.208,
    "end": 1324.477,
    "text": "As for last year, last version of this document, it's about thousands of papers, but it's kind of big document, but it has borders of the domain and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1325.747,
    "end": 1348.223,
    "text": " if people interested just going through outline of this document we can understand what is it about and how it could be used in different directions so there are some set of ISO standards here is present in 15288 it's for mostly for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1354.386,
    "end": 1382.94,
    "text": " systems lifecycle processes and defines processes what happen in the system and in all type of system what also need to be created and developed to make to produce some system of interests and object management group has own standards as essence is initially was developed for software engineering",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1384.178,
    "end": 1398.637,
    "text": " But now we have understanding that concept and schemas from this standard are also useful to apply to works of the remote teams.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1401.377,
    "end": 1408.648,
    "text": " So a lot of resources that are professional and also modern and global from systems engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.73,
    "end": 1415.979,
    "text": "One piece that really bears upon our systems design is this concept of a system of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1417.406,
    "end": 1424.112,
    "text": " related to potential regimes from the ontology of active inference, but the system of interest is the engineering terminology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1424.853,
    "end": 1429.257,
    "text": "And our system of interest is the active lab participant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1429.918,
    "end": 1431.94,
    "text": "So that's what we're trying to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1433.261,
    "end": 1460.856,
    "text": " uh instigate change in here we call it a ness change non-equilibrium steady state which is another active inference term and that's just referring to this idea that the steady state operation even if it's far from equilibrium of the participant is going to undergo a systems change in an active inference there's two ways that a system can change to reduce its uncertainty to minimize its expected free energy the two ways it can change are by modifying its internal states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1461.806,
    "end": 1467.15,
    "text": " which is learning and development, or by modifying its external states through action and niche modification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.731,
    "end": 1471.093,
    "text": "So we're thinking about the system of interest as the participant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1471.654,
    "end": 1476.497,
    "text": "That's a person who's starting out indifferent, then something changes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1477.557,
    "end": 1491.007,
    "text": " That Ness change results in the next stage of this person's progression along this axis towards being an interested person, somebody who's following the Active Inference Lab towards somebody who's participating in the Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1491.808,
    "end": 1505.839,
    "text": "And where systems engineering and the idea of enabling architecture or enabling infrastructure, enabling systems comes into play is for this Ness change from somebody who's indifferent or unaware to someone who's interested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.539,
    "end": 1508.02,
    "text": " there has to be an enabling system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.681,
    "end": 1514.787,
    "text": "That enabling system, in this case, there's other roads to take, is an operational live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1515.267,
    "end": 1522.414,
    "text": "If it's just a conceived live stream, but it's not at a stage in its progression where it's actually producing, then this person is not going to hear about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1522.574,
    "end": 1525.917,
    "text": "So it can't be enabling infrastructure until it's operational.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1526.738,
    "end": 1555.88,
    "text": " and then how does an operational live stream occur well that's kind of the fun and that's what we've been experimenting with but it turns out that the dot coms unit is the group of people who with enabling architectures of their own are the ones who enable as well as fine-tune an operational live stream which is again what enables a certain type of change to occur in the system of interest that's the one that we're focused on that's the one that we care about changing and everything else is a means to that end",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1556.963,
    "end": 1561.224,
    "text": " Alex, what else would you add about that from the systems engineering perspective?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1564.944,
    "end": 1579.067,
    "text": "I just want to mention this is a small part of a big picture of this enabling chains that should be developed in a system engineering way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.007,
    "end": 1586.248,
    "text": "And here it's presented explicitly that for any",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1587.914,
    "end": 1601.415,
    "text": " enabling system there should be some kind of another enabling system and from on the bottom there is this one blue arrow it's from another",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1603.45,
    "end": 1632.031,
    "text": " enabling system in the chain which could be for example obs or youtube channel exact tools what are enabling work of dot com's unit which is producing operational last live streams but also dot com's unit is producing other types of enabling systems which can be used on different non-equilibrium steady state changes points",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1633.055,
    "end": 1653.963,
    "text": " So it's kind of a very complex structure of enabling systems, but without managing attention to create it, we can't achieve final needed results on changes in somebody's mind, as we propose here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1654.403,
    "end": 1657.745,
    "text": "And I should mention that initially this approach was",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1659.083,
    "end": 1663.366,
    "text": " developed in systems management school in Moscow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1663.446,
    "end": 1677.996,
    "text": "So we adopted for our lab, but it's also based again on WETS international standards which are developed by much more broader communities of engineers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1678.076,
    "end": 1687.022,
    "text": "So we are trying to use and apply state of the art in this domain for what we are doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1688.869,
    "end": 1691.11,
    "text": " Any thoughts or questions on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1691.19,
    "end": 1692.33,
    "text": "Yep, Stephen, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.35,
    "end": 1699.412,
    "text": "Yeah, I just thought I'd ask, you're using the non-equilibrium steady state change there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1699.432,
    "end": 1701.633,
    "text": "So you're introducing something into that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1701.893,
    "end": 1703.233,
    "text": "And how is that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1704.093,
    "end": 1705.314,
    "text": "Just maybe you could speak to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1705.414,
    "end": 1713.436,
    "text": "I mean, because it gives you some other options potentially than saying just behavior change, which may be used in, I don't know if that's what's used normally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1713.896,
    "end": 1716.277,
    "text": "So maybe just speak to that and how that might",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1717.077,
    "end": 1724.113,
    "text": " pose challenges for you as you're trying to work it out or opportunities and just where you are with that kind of thinking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1725.08,
    "end": 1726.281,
    "text": " Thanks for the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.521,
    "end": 1729.743,
    "text": "So there's gonna be many answers and in the end it's enacted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1729.903,
    "end": 1741.29,
    "text": "It's how it actually plays out, but opening the door to calling it non-equilibrium steady state change, let's just say you want someone to brush their teeth every day, but they're currently the kind of person who's not brushing their teeth every day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1741.691,
    "end": 1742.972,
    "text": "Yes, it is a behavior change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.052,
    "end": 1752.298,
    "text": "It's an action change, but it's going to be a complex non-linear dynamical system, the person and their environment, all of the richness of that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.118,
    "end": 1755.799,
    "text": " is what needs to be worked within.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.479,
    "end": 1765.302,
    "text": "So if it was a dial and you could say, make it louder and just turn the brushing per day from zero to one, well, yeah, then that is kind of like an equilibrium steady state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1765.342,
    "end": 1770.984,
    "text": "It's a knob that's just resting in a position and you just make some sort of perturbation and then it just stays where it's gonna stay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1771.384,
    "end": 1773.345,
    "text": "But for the systems that we care about,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1773.945,
    "end": 1800.833,
    "text": " which are also the systems that we hope are within the scope and the potential of active inference modeling, which are embedded in active complex agents, we want to make it clear that we're not just talking about environment change, we're not talking about behavior change, we're not talking about their mindset changing, it's about the total scenario developing in a non-equilibrium steady state fashion, just like an ecosystem would, towards",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1802.614,
    "end": 1816.449,
    "text": " And so then that helps us be really clear that we're bringing that richness to the table, but we're gonna be talking about it in a way that's human centric and progressive in terms of incremental changes to our system of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1817.19,
    "end": 1823.295,
    "text": " And then we can cope with how many bifurcating dependencies there are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1823.415,
    "end": 1826.357,
    "text": "And there are many, including some that aren't within our control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.158,
    "end": 1834.344,
    "text": "And it just helps us keep it organized and kill two birds with one stone by communicating better by using active inference ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.544,
    "end": 1836.285,
    "text": "Yeah, quick follow-up and then to Scott.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1838.086,
    "end": 1839.508,
    "text": "Yeah, just saying, yeah, I like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1839.608,
    "end": 1843.17,
    "text": "I think that also gives a nice segue between...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1844.833,
    "end": 1867.87,
    "text": " the system of interest that you're working with and the potential unknowable impacts without saying, without getting the Messiah complex, but the idea that there's the work in development work where there's something called outcome mapping and systems change, which is you can never know because it's beyond any ability to know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1867.89,
    "end": 1873.975,
    "text": "It might be interesting that use of non-equilibrium steady state as it seems to give a bridging point",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1874.235,
    "end": 1902.863,
    "text": " because at the moment they just use behavior change as well so just saying to know that could be interesting thanks well we certainly don't know the effects of our actions because the butterfly effect so just breathing you don't know so right outcome mapping is a summary statistic or it's a measurement within a non-equilibrium steady state or a change to a system of interest scott you know it's um does yield an interesting change in terms of consciousness and cognition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1904.244,
    "end": 1908.765,
    "text": " Because, you know, one of the problems in consciousness is the mind can't know itself, that whole challenge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1909.806,
    "end": 1920.629,
    "text": "And so you have this kind of feeling, I don't know if it's been stated this way, but kind of a Godelian incompleteness that you're going to ask questions within that system that won't be able to be answered from within the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1921.749,
    "end": 1928.051,
    "text": "In this case, one of the things that's really fascinating to me is it is a... It seems to be a...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.195,
    "end": 1938.18,
    "text": " comprehensively introspective mind, but not to mean it's not extrospective also, but outward looking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1938.721,
    "end": 1950.088,
    "text": "But I guess where I'm leading to is the thing that's interesting about active inference to me is that the system can know itself in a different way than a system that doesn't know that it's performing active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1950.989,
    "end": 1959.294,
    "text": "And so a self-awareness of active inference, both in human cognition, where you've had this perennial challenge of can the tool know itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1960.856,
    "end": 1967.781,
    "text": " And here you have the tool, and we're using the tool to deploy to understand knowing in different systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1968.561,
    "end": 1975.966,
    "text": "And it's kind of interesting because we can construct up systems that can know themselves to the extent of the active inference model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1976.807,
    "end": 1982.171,
    "text": "And so it feels to me like it's going to reveal a lot of other unique aspects of thought and consciousness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1984.136,
    "end": 1992.243,
    "text": " And again, maybe it's just a model, like different models of the mind is a robot, the mind is a computer, the mind is whatever is historically relevant then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1992.643,
    "end": 1993.824,
    "text": "Maybe it's just another model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1994.424,
    "end": 2011.118,
    "text": "But it feels like this one's going to reveal some process elements that will provide us as humans with the opportunity to understand connections to other things that also rely upon and display those same process elements.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2012.133,
    "end": 2031.139,
    "text": " So if and to the extent people can start to think of their minds as more like a beehive, their minds as more like a tree and its relationship to the fungus and forests, that feels like it will be of service to our resilience and sustainability, those new perspectives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2031.659,
    "end": 2031.899,
    "text": "Thanks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2032.559,
    "end": 2032.839,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.479,
    "end": 2039.441,
    "text": "So let's do last little two slides on strategy, thinking about Active Inference Lab,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2039.841,
    "end": 2044.943,
    "text": " in terms of internal structure and also its niche, its external interfaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.343,
    "end": 2055.247,
    "text": "And the idea of interfaces is central to Active Inference with everything about the Markov blankets, different kinds of blankets and interfaces, as well as computer science and engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2055.287,
    "end": 2058.569,
    "text": "So it's kind of something that is almost pre-adapted to work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2059.449,
    "end": 2069.419,
    "text": " As far as our current lab structure, as stated, we have three organizational units that we're about to spend time going into updates for .edu tools and comms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.18,
    "end": 2079.288,
    "text": "Then at the interface of internal and external are the deliverables that we're looking to make real change and progress on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2080.009,
    "end": 2103.926,
    "text": " so the body of knowledge is a deliverable and a project that's maintained by dot edu that we're going to get to next and it's of course a work in progress they all are dot coms is the unit that brings out the live stream and people can be on multiple units or be different roles across different areas and there's connections between the areas and um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2104.747,
    "end": 2108.829,
    "text": " comms is also the unit that interfaces out with broader communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2109.329,
    "end": 2113.491,
    "text": "So looking at the bottom here, there's sort of a tricolor scheme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2113.591,
    "end": 2116.112,
    "text": "So blue are the broader communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2116.652,
    "end": 2120.353,
    "text": "The broader communities of science, learning, and doing are everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2120.693,
    "end": 2126.356,
    "text": "So we could also call it just whoever is within the sphere of influence of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2127.176,
    "end": 2136.443,
    "text": " Then there are those who are learners and practitioners of active inference at any level of familiarity or of any background or career trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2136.943,
    "end": 2143.548,
    "text": "Just like we have complexity learners, complexity curious, and people who are just curious and know what the word is, you're already on the path.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2144.148,
    "end": 2154.435,
    "text": "Then there's the lab itself, which is just one organization in a bigger situation with other people who are studying all kinds of amazing stuff, active inference and not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2155.416,
    "end": 2162.719,
    "text": " And comms, we imagine, will have sort of several different ways to interface with different communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2163.979,
    "end": 2168.021,
    "text": "One is just by connecting with the active inference learners in that community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2168.721,
    "end": 2178.785,
    "text": "So here is the basket weaving community, and there's a special interest group of basket weavers who are interested in learning active inference, and that's how we interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2179.465,
    "end": 2182.627,
    "text": "And then one could also imagine that there are communities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2183.487,
    "end": 2202.517,
    "text": " perhaps that are more science oriented, but also as we're seeing potentially performance oriented, service oriented, social change, finance, all these areas where there is a conversation happening with dot coms as our interface, as well as a broader community uptake and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2203.337,
    "end": 2204.778,
    "text": " effort and interest in learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2205.478,
    "end": 2210.34,
    "text": "So this is sort of our internal, this is sort of internal structure in light of the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2211.08,
    "end": 2217.923,
    "text": "And then just to sort of zoom in on the internal structure, then anyone can give their last thoughts on this strategy before we go into the project areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.823,
    "end": 2237.289,
    "text": " um the initial stage is attention without attention to active inference and the lab there's nothing to latch on to nor follow after attention we think about accessibility and about onboarding because if it's not accessible and there isn't an onboarding there's no one on the ship just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2237.449,
    "end": 2239.951,
    "text": " You can't onboard onto the ship, there's no one on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2240.391,
    "end": 2241.431,
    "text": "So it has to be accessible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2242.052,
    "end": 2245.294,
    "text": "And in terms of onboarding for us, that's O-N-F-T.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2245.694,
    "end": 2253.239,
    "text": "That's starting to learn and use the ontology of Active Inference, learning and understanding and co-creating the narrative of the Active Inference Lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2253.739,
    "end": 2263.545,
    "text": "The formal documents like the forms and the documents that we use to organize everything, the calendars, if you're not on those, then you're not onboarded yet because that's actually how we work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2264.085,
    "end": 2274.571,
    "text": " And then there's the tools, which is similar with the formal documents, but the tools are the software and the hardware, as well as the wetware and the behavior and just the practices that allow one to be a participant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.192,
    "end": 2279.734,
    "text": "And then there's this continuum of participation where we just take a role-based approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2280.135,
    "end": 2287.499,
    "text": "So if someone is a beginner in learning something, we'll try to find a space where they're going to be able to learn by doing and assisting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2288.9,
    "end": 2292.242,
    "text": "And that's what participation will look like for that person at that time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2293.211,
    "end": 2297.153,
    "text": " So any thoughts on these sort of outlines?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2303.036,
    "end": 2303.776,
    "text": "Yeah, Steven, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2305.427,
    "end": 2323.325,
    "text": " Yeah, I think that once it's nice to think about the onboarding with the NFT to sort of gives you a way to break down ways to help understand what bits people are trying to relate to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2323.345,
    "end": 2325.247,
    "text": "And I think then once there's that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2325.968,
    "end": 2350.34,
    "text": " participation and wherever that can go you start to get into the realms of sense making and different forms of sense making that might be happening once you have started to gain that kind of um framework of understanding and interaction and seeing where people are taking it in different ways so i think that's quite interesting um scott",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2352.199,
    "end": 2359.182,
    "text": " Yeah, the other thing I think is interesting here is making the journey explicit and mapping it for people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.302,
    "end": 2360.822,
    "text": "Everyone is somewhere on the map.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2362.923,
    "end": 2367.244,
    "text": "Everyone who doesn't know anything about this is a pre-onboarding person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.304,
    "end": 2369.305,
    "text": "There's some location for folks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.005,
    "end": 2370.806,
    "text": "I think it's really important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2370.826,
    "end": 2376.868,
    "text": "The other part is one of the things that I've been hearing, it feels like what's going on now in the world,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2377.6,
    "end": 2382.602,
    "text": " is that people are moving from data integrity to meaning integrity questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2383.662,
    "end": 2388.084,
    "text": "So I could say data security to meaning security but I mean it more broadly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.884,
    "end": 2398.267,
    "text": "And so this process really falls well into that because the data is much more looking at the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.239,
    "end": 2403.942,
    "text": " nodes from a network theory, graph theory kind of perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2404.623,
    "end": 2407.685,
    "text": "And the meaning is looking at the relationships and the edges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2408.285,
    "end": 2421.735,
    "text": "And because this whole enterprise is relationship-based, even in terms of the current state of a node, I feel like it offers an introduction for folks to look at really the more dynamic elements of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.315,
    "end": 2426.878,
    "text": "And so complexity, you know, you don't have to talk about complexity for this to be useful, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2426.998,
    "end": 2428.139,
    "text": "People can go into this and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2428.972,
    "end": 2439.36,
    "text": " develop awarenesses and realizations that help them cultivate meaning integrity and meaning understanding in the world without knowing that they're doing complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2439.74,
    "end": 2457.954,
    "text": "And I think that the fact that this can be helpful to people to understand the dynamics of their relationships and the dynamics of internal dynamics of other entities with which they're relating feels to me like it's going to be very valuable in this next stage of security and privacy, liability,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2458.94,
    "end": 2479.345,
    "text": " um limitation all these things where people want greater integrity of their interactions it feels like this practice and this awareness can help result in that thanks thanks um okay then we're going to be talking about these projects in our progress so steven quick no oh okay okay sorry okay so nice up sasha go for it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2481.556,
    "end": 2483.357,
    "text": " I just wanted to say one thing.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2484.058,
    "end": 2485.399,
    "text": "So there's three teams.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2486.039,
    "end": 2496.087,
    "text": "And I think at the start, maybe there was a concern that the teams would be kind of siloed and maybe working on their own projects and not linked",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2496.767,
    "end": 2517.243,
    "text": " and so I think it's been surprising in a great way that the teams are actually very interconnected because of the people who are on them but also because the teams are dependent on each other for content and for development and so that's been a really I guess exciting and pleasant surprise that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2518.803,
    "end": 2530.65,
    "text": " the teams are gonna continue to work together and kind of bounce off of each other in a way that really isn't siloed or sequestered as I maybe wrongly expected.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2531.638,
    "end": 2531.938,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2532.679,
    "end": 2534.38,
    "text": "And welcome, Dave.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2534.42,
    "end": 2534.72,
    "text": "Hello.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2535.341,
    "end": 2535.581,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2535.701,
    "end": 2539.163,
    "text": "And tools doesn't have any links out at this point, but that's just a current snapshot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.243,
    "end": 2540.124,
    "text": "So we'll update things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2541.385,
    "end": 2546.408,
    "text": "Here we go with the update on the .edu organizational unit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2547.269,
    "end": 2553.193,
    "text": "So the .edu, the goal of this unit is pretty broad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2553.293,
    "end": 2557.555,
    "text": "It's to create a participatory and dynamic active inference body of knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2558.616,
    "end": 2567.462,
    "text": " And our primary areas of progress have been related to ontology development, specifically a terms list, which we're going to get to in just a second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2568.283,
    "end": 2576.168,
    "text": "And the next steps for this section, which again, we're going to go into more detail when Alex describes the ontology, we're still looking for feedback on the terms list.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2576.828,
    "end": 2588.096,
    "text": "And we're making progress on ontology development and the ontology lifecycle, but we're still looking for ontology experts, so people who have worked in an advanced capacity with ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2588.756,
    "end": 2593.317,
    "text": " So, Alex, maybe you want to take a first pass on the active inference body of knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.417,
    "end": 2597.178,
    "text": "What is this diagram on the right, and then what does it mean for active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2600.139,
    "end": 2600.839,
    "text": "Okay, thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2601.719,
    "end": 2616.143,
    "text": "Yeah, on the right is the diagram from... It's about ecosystem, I guess, which is grown around international",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2617.259,
    "end": 2634.374,
    "text": " console of system engineering and there are a lot of areas of people's activity and all of it we can see is based on system engineering body of knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2634.895,
    "end": 2636.976,
    "text": "So when you have such kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2638.049,
    "end": 2658.896,
    "text": " body of knowledge, you have the option to create different educational courses, maybe certification programs, maybe a lot of different stuff for people to work with, to learn, to develop themselves as a domain, to communicate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2659.737,
    "end": 2663.438,
    "text": "When you have some kind of knowledge artifact,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2665.141,
    "end": 2685.92,
    "text": " which you can refer and which have its own life cycle but it's kind of common agreement of domain understanding between the community and this is a cornerstone to develop",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2687.455,
    "end": 2689.856,
    "text": " different type of projects and activities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2690.576,
    "end": 2712.822,
    "text": "And our hypothesis was, could we use the same approach to develop active inference body of knowledge, which should also provide us much more to develop the domain, organize the work of people, and make progress in all possible meanings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2714.843,
    "end": 2715.063,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2716.107,
    "end": 2727.474,
    "text": " Yep, it was this idea of a body of knowledge, which is implicit in every developed and mature field, but the engineers take it to the next level and the systems thinkers working together, unsurprisingly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2727.934,
    "end": 2731.317,
    "text": "So it was very cool to see how there's really a specific",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.037,
    "end": 2733.818,
    "text": " relationships between different parts here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2734.279,
    "end": 2738.001,
    "text": "These are actually controlled vocabulary terms like informs and drives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2738.021,
    "end": 2740.543,
    "text": "These aren't just like sort of synergy type words.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2741.283,
    "end": 2749.148,
    "text": "And so by defining the interfaces and the progressions, it actually helps it be participatory and accessible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2749.549,
    "end": 2752.37,
    "text": "And so we just were motivated by Active Inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2753.431,
    "end": 2777.218,
    "text": " one day realizing a truly mature body of knowledge which isn't just a textbook it's not just an unpacking of a paper it's not just a journal club discussion live stream it's actually formal courses certification standards but also practices that unify our community so that will be really awesome and then it says what else because we just listed a few english words",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.918,
    "end": 2780.119,
    "text": " But this is something that we're going to be enacting together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.199,
    "end": 2782.96,
    "text": "So that's why one option is, you know, the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2782.98,
    "end": 2784.201,
    "text": "That's an affordance for feedback.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.521,
    "end": 2788.063,
    "text": "For those who are on the stream, yes, it's an affordance for feedback and for co-design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2788.183,
    "end": 2791.885,
    "text": "And then it's the actual doing that will decide how it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.545,
    "end": 2796.106,
    "text": "So this is going to be pretty cool to be working on with .edu.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2796.207,
    "end": 2798.548,
    "text": "And then we have a lot of other things to say on ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.568,
    "end": 2799.268,
    "text": "But Stephen, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2801.041,
    "end": 2806.082,
    "text": " Just like I say, I think it's quite interesting that bit in the middle, the boundary of systems engineering.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2806.102,
    "end": 2814.924,
    "text": "So I quite like the, you know, with the participatory nature and the sort of evolving nature of the sort of discussions you've got.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2815.464,
    "end": 2823.106,
    "text": "It's like the right hand side there is the more kind of structured, formalized way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2823.166,
    "end": 2828.787,
    "text": "And it's bridged by this boundary of system engineering with the system engineering community.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2829.067,
    "end": 2829.647,
    "text": "So it's kind of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2830.769,
    "end": 2850.189,
    "text": " be interesting to see how that nature of the boundary of system engineering relates back to the Ness non-equilibrium steady state and whether there's some interesting dynamics there which may be a similar or different to what's done in other areas of systems engineering.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2851.89,
    "end": 2866.918,
    "text": " So as far as progress on our journey, one of the key insights that many people don't expect, but then once they start understanding the sense of the word more broadly, they start to see is that ontology is the root and the backbone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2867.358,
    "end": 2870.26,
    "text": "Whatever metaphor you want to use, it's the structure, it's the clothes hanger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2870.76,
    "end": 2876.023,
    "text": "It's a formal and explicit specification of a shared conceptualization of a domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2876.663,
    "end": 2877.723,
    "text": "That doesn't mean it's fixed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.964,
    "end": 2880.125,
    "text": "In fact, it's dynamic and participatory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2880.985,
    "end": 2884.466,
    "text": " And then ontology is communicated between people as well as computers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2885.186,
    "end": 2888.767,
    "text": "And that's what allows us to have heterogeneous and distributed systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2889.527,
    "end": 2896.248,
    "text": "And this is a paper, I think by it's ontology learning from text by I think Yang at all, or I'm not sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.848,
    "end": 2898.529,
    "text": "And we can look, but it won't go right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.949,
    "end": 2902.729,
    "text": "And it's a continuum of formality of ontologies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2903.149,
    "end": 2910.531,
    "text": "So not every one of these terms, many people would associate all these things with ontology, but we're taking a broad perspective on ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2911.251,
    "end": 2915.274,
    "text": " And we're starting with the simplest, which is a terms list, which we're going to show in a second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.095,
    "end": 2927.383,
    "text": "Terms lists can be updated as well as new terms can be added, terms can be removed, but the richness of the ontology, which is like a sort of way that things are related to each other,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2928.513,
    "end": 2951.508,
    "text": " the richness can be developed to initially include definitions and synonyms like a glossary or a thesaurus, then looking more like a database, like a data approach, then all the way out to formal logics that allow almost computation in an analytical way on knowledge relationships, which is extremely powerful, but usually it's quite domain specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2951.809,
    "end": 2955.851,
    "text": "So we can't put the cart before the horse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2955.871,
    "end": 2958.013,
    "text": "I was thinking, put the inference before the active, but that's fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.813,
    "end": 2959.574,
    "text": " Both directions are fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.114,
    "end": 2962.836,
    "text": "So we're developing dynamic ontology lifecycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2963.636,
    "end": 2972.662,
    "text": "And the stage that we are at in this first quarterly update is that we did complete the first stable version, not the final version of the terms list.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2973.082,
    "end": 2976.004,
    "text": "That's the Active Inference Lab terms list V1.0 candidate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2977.985,
    "end": 2995.34,
    "text": " and we've been getting several weeks of feedback on the terms list improved it a lot also with very much appreciated feedback from carl friston and this terms list is not always going to be a spreadsheet it's not always going to look this way it will develop into richer computational resources that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2996.4,
    "end": 3008.003,
    "text": " allow us to do translation, allow us to make educational content at different levels, to connect formally to different fields, to think about how terms are being used across different spaces to provide points of contact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.503,
    "end": 3015.305,
    "text": "Because one thing that we noticed when we were making the terms list in the supplement, which is sort of words that we put in the B tier was,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3015.905,
    "end": 3023.01,
    "text": " The B tier words were like a lot of isms and theories and ideas and ways of doing a certain mathematical formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3023.53,
    "end": 3030.896,
    "text": "And then the terms for the actual core set that we will be focusing our language use and understanding on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3031.516,
    "end": 3038.161,
    "text": " They include really powerful words like accuracy, action, agency, ambiguity, attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3038.181,
    "end": 3039.382,
    "text": "That's just the A section.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.823,
    "end": 3042.324,
    "text": "And there's less than 90 terms right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3042.845,
    "end": 3043.605,
    "text": "So this was pretty fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.726,
    "end": 3050.01,
    "text": "And that's basically where we're at with the ontology project, which has been the main focus of the EDU unit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3050.891,
    "end": 3067.022,
    "text": " And the next steps are to continue up this progression to move towards better understandings of our ontology, as well as to use text analysis type approaches to understand how these terms are being used and provide a little bottom-up or a data-driven ontological approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3067.883,
    "end": 3074.327,
    "text": "Anyone have any thoughts or comments on ontology or EDU before we go to next section?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3074.347,
    "end": 3077.129,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3078.55,
    "end": 3078.99,
    "text": "Stephen, go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3081.087,
    "end": 3084.269,
    "text": " Yeah, I'd just like to say this is really very, very useful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3084.69,
    "end": 3093.856,
    "text": "Actually, I think even the process of people, you know, going through these terms, it could be an interesting educational piece.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3094.596,
    "end": 3107.866,
    "text": "And just like having people explore how these terms arise for themselves, you know, and actually, maybe even gamifying some of this, because in exploring and finding out the terms you actually",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3109.122,
    "end": 3113.977,
    "text": " understand an awful lot more about active inference so it's it's good on a number of levels actually",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3114.701,
    "end": 3114.901,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3115.521,
    "end": 3125.064,
    "text": "And also, Dave, thanks a lot for your really powerful insights into ontology and just language and helping us think about that in a structured way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.964,
    "end": 3132.326,
    "text": "So the second project is comms, second organizational unit, because there's teams and there's projects inside of a unit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3132.486,
    "end": 3135.147,
    "text": "So for now, it's sort of like the unit and the team are really similar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3135.587,
    "end": 3141.489,
    "text": "But when the organizational unit is larger, then there will be disjoint teams and projects inside of comms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3142.569,
    "end": 3145.152,
    "text": " So the goal of comms is sort of twofold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3145.973,
    "end": 3150.118,
    "text": "The first goal is to carry out all forms of communication with external entities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3150.238,
    "end": 3153.803,
    "text": "And the other goal is to organize the lab's internal projects and activities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.163,
    "end": 3156.947,
    "text": "So it's internal communication and external communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.476,
    "end": 3165.941,
    "text": " Because when we're thinking about systems design for online teams, for remote teams, which are all of them now, those are what we have access to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3166.661,
    "end": 3171.545,
    "text": "Internal communications design and then external communications interfacing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.726,
    "end": 3178.81,
    "text": "And towards that end, I think comms has been a fun experience for a lot of people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.41,
    "end": 3182.632,
    "text": "We had several projects within comms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.952,
    "end": 3188.156,
    "text": "So again, with overlapping personnel at this point, but not for always.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.076,
    "end": 3195.857,
    "text": " There are several series that we carried out, so just to sort of describe and distinguish them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3196.458,
    "end": 3202.099,
    "text": "The Active Inference Livestream is the main weekly discussion that we've been having.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.839,
    "end": 3205.619,
    "text": "It's publication-centric, other than the quarterly roundtables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.26,
    "end": 3212.781,
    "text": "It's like we discuss a paper, and that's why we have the calendar that references the paper, and we schedule things a lot in advance for this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.021,
    "end": 3222.43,
    "text": " And for each number of paper, like number 16 is going to be the same paper for 16.0, 1, 2, 3, 4, 5, however many sessions we need on that paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.45,
    "end": 3233.0,
    "text": "And the idea is that .0 is like a contextualizing video, blue as a amazing contextualizer, and we'll be doing 17.0 tomorrow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.623,
    "end": 3260.83,
    "text": " so probably pull an all-nighter or something on that one and then the dot one of the dot two videos are participatory group discussions ideally with the authors around also be cool if authors wanted to help us with dot zero but the idea is we can invite and really honor and respect the authors by having them show up to a discussion where there's going to be a group of people people sharing their perspectives at different stages in understanding and then you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.63,
    "end": 3269.616,
    "text": " it's all good for participants to have not read the paper or read the paper a little bit, just circled questions, highly added a ton of notes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.996,
    "end": 3273.219,
    "text": "It's like wherever people are at, the authors are the ones who put out the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3273.239,
    "end": 3277.202,
    "text": "And so that's been great to talk with the researchers in the active inference community.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.062,
    "end": 3283.043,
    "text": " Then that sort of led to a desire to go a little bit more technical at times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3283.784,
    "end": 3289.245,
    "text": "And Ryan Smith and Christopher White kicked off our model stream series with four model streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3289.745,
    "end": 3296.507,
    "text": "And the model stream is intended to be like a tutorial or a code walkthrough or more like a deep dive into modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3297.327,
    "end": 3312.839,
    "text": " because then we can be really clear where we're doing a how-to on modeling and then in a live stream regular format would be more about like when we had alex chance for active eight um that was talking about implications and asking some more qualitative questions about the project",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3313.991,
    "end": 3317.872,
    "text": " And then the newest series is the guest stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3317.892,
    "end": 3322.633,
    "text": "And Majeed Benny came on for the first guest stream on Feb 24th.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3323.373,
    "end": 3326.454,
    "text": "And the guest stream is just our grab bag, our wild card.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.634,
    "end": 3333.495,
    "text": "It's like, if a new paper comes out, we could have a discussion with the authors 48 hours later, if they're available.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3334.035,
    "end": 3341.237,
    "text": "So guest stream, the idea is on short time scales, or if someone says, yeah, I'm really busy, I could come on and visit in seven months.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3341.877,
    "end": 3343.978,
    "text": " then we can also account for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.198,
    "end": 3355.984,
    "text": "So any time of day or any availability that somebody has who wants to be leading a session or be a guest on a session, we'll just put it in the guest stream component and then there's Byte-sized.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3356.284,
    "end": 3362.808,
    "text": "So maybe Blue, would you want to say anything about Byte-sized or any other projects that you're thinking about on this front?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3363.9,
    "end": 3364.26,
    "text": " Sure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3364.42,
    "end": 3370.002,
    "text": "The bite size really, you know, I have a lot of people like where I'm like, I'm doing this live stream.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3370.022,
    "end": 3370.602,
    "text": "It's really cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3370.622,
    "end": 3371.903,
    "text": "You should come like participate.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3372.363,
    "end": 3378.985,
    "text": "And here's this big paper, like the paper that we're doing for the 17.0 is like, you know, 30 pages long.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3379.005,
    "end": 3381.346,
    "text": "Like, here, read this paper and join us on our live stream.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3381.406,
    "end": 3383.947,
    "text": "And people get a little intimidated by that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3384.027,
    "end": 3386.428,
    "text": "And so they don't really want to engage at that level.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3386.488,
    "end": 3392.59,
    "text": "But I've definitely had a lot of feedback from people saying like, oh, you're going to make it into like an audio podcast, like short, like short.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3393.37,
    "end": 3421.1,
    "text": " 15 minute little clips that we can listen to on the way to work or while I'm out for a walk or whatever and so I've had a lot of interest in that and I think I've got two episodes already clipped from like I'm starting at the earlier live streams and moving up and so I've got a couple episodes that are already clipped and ready and one more that's almost ready so I think we should be launching like as soon as I get them pushed into the RSS feed maker we should be launching maybe as early as next week probably",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3421.6,
    "end": 3439.797,
    "text": " So just, you know, short little episodes for people to listen to and, you know, that are maybe not, don't involve reading a 30-page paper and doing a bunch of math, but still people can engage at a level that's kind of thought-friendly and commute-friendly, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3440.996,
    "end": 3457.854,
    "text": " awesome yeah thanks a lot for taking the initiative and helping that project happen and we'll probably make another youtube channel like actamp clips or something and then we can figure out how to make it work and we'll keep everyone posted through our communications channels so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3458.695,
    "end": 3466.217,
    "text": " Also, the next steps for comms, we're going to continue working on our series that exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3466.737,
    "end": 3470.918,
    "text": "The live stream has a calendar that's in the info box for each video.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3471.399,
    "end": 3478.121,
    "text": "The model stream, we're in conversation with several people as well as for guest stream with future dates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3478.821,
    "end": 3480.001,
    "text": "That's how it is with live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3480.061,
    "end": 3486.623,
    "text": "You can schedule it, but then in the end, it's better to tell people when it goes live or after because you never know what's going to happen last moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3487.263,
    "end": 3494.725,
    "text": " So we just are looking to schedule and coordinate with new participants of any background or interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3494.765,
    "end": 3502.127,
    "text": "If somebody wants to give a model stream or be the one who's walking through their tutorial or their blog, that's awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.187,
    "end": 3505.248,
    "text": "And we have so many people who have written their own sort of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3507.415,
    "end": 3532.078,
    "text": " free energy or active inference manifestos or learning documents so how to surface that or who could we invite in an adjacent community to do a guest stream or like an interview or could we do a special other stream could we do a math stream or a kid stream or just joke stream who knows and then we're looking towards the kinds of communications that are enabled by the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3532.799,
    "end": 3534.16,
    "text": " Markov blanket of a remote team.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3534.64,
    "end": 3539.582,
    "text": "We can send data and that data can be text like a blog or a wiki or an article.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3540.122,
    "end": 3541.142,
    "text": "It could be audio only.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3541.883,
    "end": 3542.903,
    "text": "It could be video only.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.923,
    "end": 3544.284,
    "text": "It could be a still image.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3544.404,
    "end": 3545.464,
    "text": "It could be a physical object.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3546.104,
    "end": 3549.005,
    "text": "So what are our affordances as an organization?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3549.205,
    "end": 3555.048,
    "text": "And then there's some that we can't afford to do now, but maybe we'll afford them later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3556.536,
    "end": 3566.744,
    "text": " And then just the last note on comms is it's been pretty interesting to work on what basically amounts to a live stream organization and implementation checklist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3567.304,
    "end": 3572.008,
    "text": "It's just a sequence of commentable Google slides for now, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3572.748,
    "end": 3579.31,
    "text": " It partitions some of the roles of a live stream, just one perspective in a way that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3580.25,
    "end": 3585.571,
    "text": "It includes a couple of things that people might not expect about a live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3586.051,
    "end": 3592.693,
    "text": "For example, that what they see on their computer is what other people see or that noises might be not for them, but other people can hear it or vice versa.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3593.553,
    "end": 3609.342,
    "text": " And that helps us make sure that we have a high quality live stream experience for everybody, as well as an experience that is accessible because someone can reduce their anxiety, reduce their uncertainty about the who, what, why, where, when, and then there's a total",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3611.798,
    "end": 3636.866,
    "text": " direction to continue in with just how to communicate and dialogue so i know it's something that many people on this conversation and and in the lab think about a lot like whether it's in the context of transformative dialogue productive innovative whatever adjective is meaningful to you there's something about improvisation and coming together with the affordances that we have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3637.97,
    "end": 3641.273,
    "text": " to just hopefully do good and have fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3641.794,
    "end": 3648.62,
    "text": "So how do we make that possible has been what comms is about clarifying and communicating on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3649.782,
    "end": 3652.584,
    "text": "Any last thoughts on comms before we go to tools?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3655.067,
    "end": 3656.268,
    "text": "Yeah, Alex, then Steven.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3659.437,
    "end": 3659.837,
    "text": " Yeah, thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3659.937,
    "end": 3673.946,
    "text": "I just want to add in relation to checklist that it is checklist is one of the main concept of and approach from systems engineering.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3674.066,
    "end": 3684.933,
    "text": "So we are trying to apply system engineering approaches for actually all types of activities what we are doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3686.974,
    "end": 3687.795,
    "text": "Cool, Stephen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3689.824,
    "end": 3703.638,
    "text": " Yeah, I suppose the idea of the niche or creating an awareness of the niche and the affordances in the niche that we're giving people as well as their own sort of personal journey is kind of a nice way to think about this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3703.698,
    "end": 3711.966,
    "text": "So as the list is being ticked off, it's like connect with self and participants to bring the relevant energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3712.166,
    "end": 3713.067,
    "text": "So that's kind of a bigger...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3715.209,
    "end": 3732.761,
    "text": " then you might often get in an engineering context, but you know, that that's, but that is the sort of thing that often gets forgotten, you know, especially if you're so it's good to, to like have that as a, yeah, let's just check in, you know, and just get that chance to make sure that we're in the right head space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3732.801,
    "end": 3736.143,
    "text": "Cause this, it does take some time to, to reorientate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3736.183,
    "end": 3737.064,
    "text": "So that's quite good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3737.644,
    "end": 3737.864,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3738.184,
    "end": 3740.086,
    "text": "And the, the challenge and the opportunity is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3741.34,
    "end": 3746.267,
    "text": " are two sides of the same coin for the remote teams, we can have international conversations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3746.327,
    "end": 3756.481,
    "text": "And so yes, maybe, you know, Dave's video blips out once in a while or somebody gets kicked off, but it's like, we're having conversations that are very special.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3756.501,
    "end": 3756.541,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3758.163,
    "end": 3786.198,
    "text": " instead of relativizing it to some imagined reality where like tech is perfect and free and everyone has it we can reference to what's possible and then we work with what we have and make the best of it and some people their rate limiting step to live stream participation is psychological or internal whatever for some people it's um logistical they can't make the time work maybe they live in a different time zone for other people it's technical they have the time and they want to do it but they don't have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3786.878,
    "end": 3816.218,
    "text": " camera or a microphone or internet connectivity or something like that so when we have a role-based approach to participation not like live streamers not a title in our community it's like who's a participant in this live stream today in quarterly roundtable one which role is everybody playing and we actually have an answer for which people are playing each role and whether they did or didn't do the checklist exactly today probably few did um i know that the uh broadcaster didn't but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3817.158,
    "end": 3824.346,
    "text": " that's all good because it at least is there and then we can iterate on it and that will, I think, really be powerful and effective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3824.586,
    "end": 3824.786,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.347,
    "end": 3826.548,
    "text": "Any other thoughts on comps?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3826.628,
    "end": 3831.293,
    "text": "But yep, we're just looking forward to learning by doing and communicating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3831.814,
    "end": 3832.374,
    "text": "All right, tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.494,
    "end": 3834.516,
    "text": "So this is kind of a fun section, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3835.879,
    "end": 3858.968,
    "text": " goals of the dot tools unit are again sort of twofold an internal and an external view so the internal uh goal of toll tools is to enable effective tool and instrument use for all active inference lab processes so we need to figure out which tools will work best for onft for onboarding and participation otherwise we don't have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3860.12,
    "end": 3880.575,
    "text": " Anything, but especially as we build more scaffolding for our lab and stabilize some of the tool use inside of our lab and have more regimes of attention to spare on external views, we're interested in exploring and designing affordances within our niche, which is all we can ever have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3881.215,
    "end": 3887.378,
    "text": " resulting in effective action externally facing and also innovating in terms of tool development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3887.718,
    "end": 3903.185,
    "text": "So Tim and others who we had such great conversations with in the weekly discussions related to our progress and several others, Scott and Chinedu and many just awesome people who came through, there's like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3904.205,
    "end": 3929.88,
    "text": " us using tools to make the lab better at what it does and then there is the tantalizing and exciting question of what active inference driven tools look like whether there's an active inference computational or software element and so the tools look like slack or look like email or look like something that people are very familiar with but it's like a recommendation engine that changes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3930.78,
    "end": 3953.395,
    "text": " how things are done in some subtle way so whether we talk about implementing active inference on top of the tools that we know and see today or whether we're talking about truly novel and unexpected ways of active inference and systems engineering and systems design coming into play in the true imminent future of online work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3954.275,
    "end": 3963.004,
    "text": " That is where we want to go, but with a couple people and a lot to figure out internally, we haven't gotten there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3963.244,
    "end": 3969.23,
    "text": "But like people have been saying, all of the goals and units are intertwined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3970.271,
    "end": 3974.054,
    "text": "And to use a figure from our paper, the Vyatkin et al paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3975.222,
    "end": 3984.631,
    "text": " we're taking a function-driven approach to thinking about this internal and external team communication and the tooling for that using the Active Inference Framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3985.211,
    "end": 3996.481,
    "text": "Because designing the system for the physical office, you need the hammer to build the hallway so that you could have a certain connectivity of conversation or certain architectural suggestion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3997.202,
    "end": 4003.348,
    "text": " But the hammer, our tool, is actually the modification of communication pathways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4003.928,
    "end": 4013.197,
    "text": "Communication being included, data being shuttled back and forth between parts of a computer or across the internet, also a part of communication between non-human agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4014.878,
    "end": 4029.343,
    "text": " So we sort of, even from last year, wanted to use the idea of a Markov blanket and blankets, or however they end up being defined, with interfaces as sense incoming and actions outgoing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4029.743,
    "end": 4037.726,
    "text": "And so we have internal team communications and then external team communications, which are all important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4037.846,
    "end": 4041.748,
    "text": "Sense and action internally and externally, just like multi-scale nested active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4042.848,
    "end": 4059.388,
    "text": " and then tool development is about making that happen so we're gonna run now through the tools um including ones that i hope some people will be familiar with maybe some people will not be familiar with and anyone can just raise their hand um if they want to mention something about tool so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4060.609,
    "end": 4068.659,
    "text": " The single source of truth from a file sharing perspective for the lab is a Google Drive folder from ActiveInference at gmail.com.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4069.42,
    "end": 4071.523,
    "text": "And this is our ActiveLab folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4071.944,
    "end": 4075.789,
    "text": "We have the three organizational units, .edu, tools, and comms,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4076.109,
    "end": 4086.091,
    "text": " And then we have .admin, which is the minimal administration for the lab and just like the form responses that are not part of one of these other organizational units.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4086.151,
    "end": 4090.752,
    "text": "But by and large, everything related to these projects is totally viewable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4091.472,
    "end": 4095.813,
    "text": "And if people RSVP to participate, they're added as an editor to the folder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4096.473,
    "end": 4099.414,
    "text": "If they just want to see the link, then they can comment on everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4099.494,
    "end": 4103.015,
    "text": "So everything from the slides for all of the presentations to the feedback,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4103.635,
    "end": 4112.217,
    "text": " for the podcast are in each of these folders and it's participatory and hopefully an open way to organize.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4112.757,
    "end": 4131.56,
    "text": "So any project that people are hearing about that sounds cool or something that they think is an adjacency or a role that they'd like to play, even if just a very vague sense of what it could be, just get in touch with us because basically this is our current project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4133.527,
    "end": 4139.81,
    "text": " To go into a few specific areas, in our work on the ontology and terms, we used two different tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4140.07,
    "end": 4155.499,
    "text": "We used Google Documents, as we use with many project documents and sheets, but then also we use Protege, which is a online, the web Protege is an online ontology editor, lightweight, but pretty powerful, and there's also a desktop application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4156.199,
    "end": 4161.302,
    "text": "And this is for ontology construction and sharing, so that's pretty fun, just learning about ontologies",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4162.082,
    "end": 4164.404,
    "text": " different ways of viewing terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4165.985,
    "end": 4170.609,
    "text": "We use gather.town for spatial video chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4171.37,
    "end": 4174.932,
    "text": "And right now we're using Jitsi, which I actually didn't take a screenshot of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4174.952,
    "end": 4186.362,
    "text": "We could do a total during ad, but gather.town is allowing for interfaces and affordances like movement while I'm taking a screenshot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4186.482,
    "end": 4191.166,
    "text": "Steven, just maybe give one thought on gather and active inference of where that might...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4191.906,
    "end": 4209.617,
    "text": " come into play yeah well it could be interesting i think active inference and the nature of how we relate into our affordances it's kind of interesting when you start to be sitting at a table as an avatar and how that feels slightly different um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4210.558,
    "end": 4217.124,
    "text": " to how you are maybe when you're sort of in an open space discussing aspects of active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4217.144,
    "end": 4233.338,
    "text": "So it might be quite interesting as we start to explore how some of the active inference processes are ontologically and then how they are when we start to experience stepping into the dynamics of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4234.577,
    "end": 4245.265,
    "text": " active inference, because it is a process theory rather than a static sort of diagram telling us what the world is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4245.365,
    "end": 4247.466,
    "text": "So that opens up some possibilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4248.907,
    "end": 4251.469,
    "text": "And yeah, I quite enjoy meeting everyone that way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4251.489,
    "end": 4256.133,
    "text": "So I don't know how others find it, but I think there's possibilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4256.773,
    "end": 4257.294,
    "text": " Yep, fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.574,
    "end": 4273.15,
    "text": "And Jitsi is a little bit more standard, but it's an open-source video platform, and we have an AWS server, so it will cost a couple of cents or a little bit more per meeting, but then we know that we have the reliability, but also meet.jit.c is free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4274.051,
    "end": 4289.898,
    "text": " okay then for text and file sharing and the official organization of each of the lab the dot admin and the three units that we have as well as dot public on keybase this is um a platform just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4290.438,
    "end": 4293.08,
    "text": " It's not about the pros and cons of any of these specific platforms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4293.1,
    "end": 4295.102,
    "text": "We're just saying what it is that we're using.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4295.742,
    "end": 4305.13,
    "text": "But Keybase is a really great platform at the current moment for doing the kinds of things that we want to do in the backend for official organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4305.911,
    "end": 4307.793,
    "text": " This is like the internal communications of the lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4308.593,
    "end": 4310.775,
    "text": "Then there's the external communications of the lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4311.015,
    "end": 4321.905,
    "text": "Now, it being an open and a participatory lab, sometimes it's a little bit hard to say where is their internal and external communication because all of the documents are visible, all of our teams are joinable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4322.405,
    "end": 4325.288,
    "text": "So where is the line between internal and external communication?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4325.948,
    "end": 4346.25,
    "text": " Basically, there's communications that we address to participants and members of our lab, people who are actively somebody who would just directly solicit feedback to in a sort of off the cuff way, like somebody you might bump into in a co-working situation, ask for feedback, whereas external communications, we try to communicate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4347.754,
    "end": 4367.702,
    "text": " sporadically but regularly and uh well structuring our external communications like having professionalism with our newsletter and with our live streams whereas just popping on a video call with the same people it'd be an internal live discussion because it wasn't being performed externally but they're ultimately all open i guess",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4369.048,
    "end": 4386.382,
    "text": " So for external communication specifically, but also increasingly project collaborations, just ones that aren't the three organizational units of the lab, which is our focus as organizers is the actual organization of those lab units and incrementing those systems and including participation in a lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4387.103,
    "end": 4393.828,
    "text": "And then people are just so amazing and creative and have so many awesome project ideas and collaborations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4394.328,
    "end": 4396.89,
    "text": "So in the Discord, I know that we'll have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4397.847,
    "end": 4422.879,
    "text": " papers and research and projects together that are maybe even only constituting our lab participants but will not be part of the exact organizational unit just be people collaborating we have a discord and the join link is probably in the video description and live chat and here and then there's twitter inference active on twitter then um for live streaming",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4424.019,
    "end": 4441.291,
    "text": " if you're watching it it's on youtube and then if you're live streaming it then there's this dashboard for youtube live streaming and then currently as broadcaster i'm using the open broadcasting studio obsproject.com and then just that's what i'm using right now but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4442.071,
    "end": 4464.386,
    "text": " The fun part, and just to sort of call back to the roles of comms, is the facilitator and the event organizer and the broadcaster, the participant, can be one person all doing these roles for one person, or it could be many people with these roles and it could be split up across different expertises and skills.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4465.507,
    "end": 4469.851,
    "text": " And then lastly, Aweber is where we have our monthly newsletter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4470.011,
    "end": 4475.217,
    "text": "So there's been two of them, end of January, end of February so far, because now it's March 2nd.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4476.097,
    "end": 4484.305,
    "text": "And that's going to be just for updates on our projects and sort of sharing similar information to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4485.322,
    "end": 4489.225,
    "text": " live stream, but just in a bullet point project by project way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4490.025,
    "end": 4490.245,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4490.786,
    "end": 4492.527,
    "text": "Any tools, thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4493.107,
    "end": 4503.174,
    "text": "That's sort of the Act-Inf Lab stack or just where it is, but we know that some of these platforms are going to be closing or changing or new ones come onto the scene.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4503.234,
    "end": 4507.237,
    "text": "And so, yeah, we just are kind of at the spot we're at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4507.437,
    "end": 4512.14,
    "text": "And then as the affordance becomes salient and preferable,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4513.866,
    "end": 4518.511,
    "text": " while also being aware of switching costs, then we'll do what we have to do to scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4519.993,
    "end": 4521.294,
    "text": "Any other thoughts on tools, though?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4521.835,
    "end": 4522.415,
    "text": "Stephen, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4523.156,
    "end": 4530.544,
    "text": "Well, I was just wondering, are you actively looking for any tools to bridge any gaps at the moment, or you feel you've got enough at the moment?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4531.085,
    "end": 4535.409,
    "text": "I'm just curious if that's something that you're trying to look at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4537.546,
    "end": 4547.228,
    "text": " I would respond in terms of optimal experimentation and optimal foraging on a rapidly shifting affordance landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4547.368,
    "end": 4554.93,
    "text": "There's tools that are just at working quality today or in six months that a year ago we hadn't heard of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4555.47,
    "end": 4565.533,
    "text": "So by staying connected to people with various domain specific expertise and kind of use specific expertise, we wanna stay attuned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4566.857,
    "end": 4569.439,
    "text": " to trends on the tool landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.26,
    "end": 4587.236,
    "text": "And then .tools is the spot where the people who are the most interested in that will come together to look for internal opportunities for local and global improvement, like fine tuning the Discord channels or going to a different platform for that function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4588.359,
    "end": 4590.06,
    "text": " So it's a need-based engineering approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4590.7,
    "end": 4604.128,
    "text": "And then also once there's, again, a stable working version, or it seems like the global reorganization of the tools internally is off the table for some period of time or something, then there's more attentional capacity for external collaboration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4607.049,
    "end": 4608.91,
    "text": "Okay, hashtag future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4609.851,
    "end": 4613.193,
    "text": "All right, so to kind of recap the next steps for the lab,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4615.188,
    "end": 4618.689,
    "text": " The main next steps for the lab are the next steps within each unit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4619.83,
    "end": 4631.318,
    "text": " which we can talk about with, I guess we can just say the EDU is working on improving the terms list and on developing the terms list down the road of ontology formalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4632.139,
    "end": 4648.891,
    "text": "Dotcoms is interested in continuing and expanding the current series, which are the weekly live stream, the model stream, and the guest stream, and then also opening up new series or types of content like audio-only, bite-sized, or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4649.909,
    "end": 4650.209,
    "text": " Who knows?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4650.629,
    "end": 4652.75,
    "text": "Other media that are possible with tech.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4653.43,
    "end": 4668.576,
    "text": "And then in .tools with a twofold goal of internal and external tool use and development, they're currently assessing needs and seeing what can be done as evidenced by these discussions we're just having today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4670.313,
    "end": 4687.94,
    "text": " As we're heading, this is from the point of view of the admin, as we're heading into our second quarter of activity, we're looking to focus more on preparing detailed narratives of Active Inference Lab and for participants to help structure the N of ONFT.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4688.521,
    "end": 4695.243,
    "text": "Because we're starting on ontology with the terms list, formal documents are related to tools and we have what we have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4695.283,
    "end": 4698.305,
    "text": "And again, we'll locally and globally fine tune as we need to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4699.085,
    "end": 4704.327,
    "text": " And then the tools is, for now, the formal documents and communication channels.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4704.907,
    "end": 4722.853,
    "text": "But that was the whole point of our paper in 2020, which is for remote teams and communities, communities of practice, however you want to think about it, the affordances for design are the ontologies and the formal documents, because those are the tools that the team uses for communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4723.72,
    "end": 4726.821,
    "text": " And then what's being communicated is heterogeneous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4726.901,
    "end": 4732.563,
    "text": "It could be text, it could be a image meme, it could be an emoji, it could be a link to something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4732.583,
    "end": 4738.025,
    "text": "It can be very, very specific pieces of data that are getting interpreted in the context of what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4738.286,
    "end": 4739.946,
    "text": "The narrative, which is the end part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4740.486,
    "end": 4747.409,
    "text": "So O, F, and T are kind of like the observables and the systems that we can actually increment and focus our attention on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4748.189,
    "end": 4751.931,
    "text": "And narrative is something that you can get meta about and focus on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4752.85,
    "end": 4762.115,
    "text": " but really it has to be enacted and changed through non-equilibrium steady state type design, not equilibrium steady state type design.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4762.915,
    "end": 4778.223,
    "text": "So the reason for this narrative preparation, which also Alex really led the way on with laying out participant life cycle from experience with the system school, we want to structure the access and interpretability of lab materials",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4778.903,
    "end": 4802.945,
    "text": " so people can have their participation catalyzed so the rate limiting step is it that they didn't know where this spreadsheet was or they saw the spreadsheet but then didn't understand how to get in touch with something to schedule this time and then um the needs for the lab are in the edu project any participants who are interested in ontology and education",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4804.062,
    "end": 4807.804,
    "text": " making or taking coursework, formalisms, learning by doing, teaching.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4808.845,
    "end": 4819.491,
    "text": "Dot coms is always looking for participants looking in to areas like writing, teaching, connecting, audio visual production and events, co-organizing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4820.331,
    "end": 4831.158,
    "text": "Then tools, we are looking for participants who are interested in technical development, computer science, user experiences, toolkit use, practices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4833.364,
    "end": 4837.927,
    "text": " Also accessibility and how tools are used across different communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.848,
    "end": 4846.013,
    "text": "And then the .admin are participants who are interested in topics like logistics, education, communication, tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4846.653,
    "end": 4848.515,
    "text": "These are the projects, hint, hint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4849.301,
    "end": 4851.143,
    "text": " community mentoring and service.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4851.744,
    "end": 4866.158,
    "text": "So we're just looking to our diagram and to how we can increment people as our system of interest along this continuum here in the context of this evolving structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4867.079,
    "end": 4868.32,
    "text": "And that will be cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4869.061,
    "end": 4872.024,
    "text": "Any thoughts on next steps or needs for the lab?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4876.175,
    "end": 4884.817,
    "text": " The last questions are just kind of the questions from the regular papers, just on the inference side, what are we curious about learning more about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4884.897,
    "end": 4888.077,
    "text": "Which is kind of an action-oriented curiosity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4888.717,
    "end": 4892.798,
    "text": "And then how are we wanting to apply active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4894.339,
    "end": 4896.599,
    "text": "And then all the questions that we ask about papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4897.419,
    "end": 4898.699,
    "text": "But pretty fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4898.839,
    "end": 4901.68,
    "text": "Thanks everyone for the first quarterly round table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4903.746,
    "end": 4904.147,
    "text": " Pretty fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4904.627,
    "end": 4905.288,
    "text": "Any last thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4905.328,
    "end": 4906.951,
    "text": "Otherwise, that's good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4909.234,
    "end": 4909.474,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4910.896,
    "end": 4913.139,
    "text": "So thanks for participating and see you later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4913.219,
    "end": 4913.4,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]