[
  {
    "start": 0.25,
    "end": 0.67,
    "text": " Hi, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 0.79,
    "end": 1.431,
    "text": "I'm Jakub.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1.631,
    "end": 17.424,
    "text": "And today, I'm going to give a very brief overview of some projects that we've been developing at the Active Inference Institute and their relevance to decentralized AI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 17.844,
    "end": 24.169,
    "text": "Now, I think my talk and Alex's right after me is going to overlap slightly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 26.431,
    "end": 40.379,
    "text": " I'm going to try to keep the theory of active inference and one particular project to a minimum, although I'll try to give some brief introduction to what active inference is so that you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.08,
    "end": 43.782,
    "text": " have the relevant background.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 43.883,
    "end": 58.642,
    "text": "So since this is a mini conference on decentralized AI, I'm going to assume that most of you have at least heard of reinforcement learning, which on the computational side is quite similar to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 59.102,
    "end": 74.912,
    "text": " But we can think of active inference as being a kind of generalization of reinforcement learning where agents interact with their environment and try to solve a certain task or try to navigate in their environment, but instead of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 76.813,
    "end": 95.962,
    "text": " maximizing some utility function or instead of their goal being always maximizing for reward, active inference agents are perhaps more general where the kind of utility function or the general function of active inference agents is always uncertainty minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.102,
    "end": 106.307,
    "text": "So active inference agents form some kind of internal model of their environment and they can learn more about their environment by engaging with it through action and then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.424,
    "end": 116.447,
    "text": " observing what kind of sensory input goes from the environment to the agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.967,
    "end": 123.41,
    "text": "So there's a kind of duality between perception and action that's always mediated through uncertainty minimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.111,
    "end": 132.494,
    "text": "And because of its generality, this framework can be applied to pretty much any system that's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 134.443,
    "end": 163.219,
    "text": " salient enough to persist through time, which was kind of the motivation for the first project, which Alex will talk about a bit more, so I'm only going to mention it briefly, which is the Active Entity Ontology for Science, which really stands at the intersection of three fields, namely DeSci, systems engineering, and active inference, where our aim was to create an",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.079,
    "end": 179.028,
    "text": " ontology that individuals and communities within DeSci can use to collectively minimize their uncertainty about what kind of system they find themselves in and how that system might evolve through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 179.568,
    "end": 192.016,
    "text": "And I think this is the same can be done for decentralized AI, which has a lot of similar artifacts that have to do with Web3 and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 194.246,
    "end": 205.193,
    "text": " perhaps we can say that either DeSci is encapsulated within decentralized AI or the other way around, depending on which you think is the bigger set.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.833,
    "end": 211.637,
    "text": "But the core utility of having",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 212.475,
    "end": 235.423,
    "text": " a shared ontology that's kind of grounded in another formal framework, namely active inference, allows us to more specifically define what kind of entities and artifacts we can find in a system and how these entities interact with each other and minimize their uncertainty so we can kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.212,
    "end": 250.847,
    "text": " have a better understanding of the dynamics of our system and be able to better make decisions about what kind of protocols we should create or how should our community interact with other communities and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.274,
    "end": 253.734,
    "text": " and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.295,
    "end": 267.71,
    "text": "This also leads me to the Active Block Friends project, which is kind of on the computational side of EOS, where we aim to combine",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 269.193,
    "end": 273.015,
    "text": " the open source framework, CatCat, which was developed by Block Science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.195,
    "end": 293.265,
    "text": "And that's been used mainly for token engineering and also just generalized dynamical systems modeling, where you usually take a kind of structural top-down approach to modeling your system of interest, where you define your state space and then you perform giant parameter sweeps to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.165,
    "end": 321.198,
    "text": " try to figure out how your state space evolves through time and what kind of edge cases can you get to and combining that with active inference cognitive modeling where you have agents that have kind of emergent properties that through collective interaction form these communities that themselves can be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.67,
    "end": 327.132,
    "text": " can be cast as agents within some environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 327.192,
    "end": 346.565,
    "text": "So you have this bottom-up emergent behavior through agents interacting and trying to minimize their uncertainty, as well as a kind of top-down parameter sweep over all the possible states in your system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 348.306,
    "end": 351.869,
    "text": "This might sound a little abstract, but I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.806,
    "end": 360.048,
    "text": " it's quite relevant for decentralized AI and mainly for two different reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 360.128,
    "end": 372.293,
    "text": "One of them is we want to create different communities and protocols for both co-owning or creating AI models or interacting with AI models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 373.073,
    "end": 378.495,
    "text": "And that's already a quite large state space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 378.675,
    "end": 382.997,
    "text": "So it would definitely be about AI alignment, which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 383.999,
    "end": 389.62,
    "text": " also a very big question and a big problem in AI where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.155,
    "end": 412.089,
    "text": " you're basically trying to align uncertainty minimization across different types of agents, as well as different levels of your system where DAOs want to minimize their uncertainty with respect to other DAOs or with respect to some preset goal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 412.629,
    "end": 420.935,
    "text": "But individuals within those DAOs also need to minimize their uncertainty based on their own preferences, which may or may not align.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 421.495,
    "end": 425.64,
    "text": " with those of the higher level system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 426.661,
    "end": 441.637,
    "text": "And the same can be said of AI models and autonomous agents, which are definitely becoming more present in the digital space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.966,
    "end": 452.432,
    "text": " So that would be a very brief overview of some of the projects that we're developing at the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.552,
    "end": 463.3,
    "text": "And if you have any questions, then I'm not sure whether we have the time, but thanks a lot for your attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.221,
    "end": 472.266,
    "text": "Yeah, you have about a minute, so maybe we'll save them for a little bit later, unless they're quite quick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 483.007,
    "end": 492.834,
    "text": " Okay, I'm not seeing any text questions yet, so I'll definitely invite people to ask you any questions that they have about that, either in the 10-minute session or towards the end when we finish.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 492.854,
    "end": 496.756,
    "text": "We've got about a minute now, so I will thank you very much for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 496.996,
    "end": 497.917,
    "text": "Very cool to hear what you're doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.217,
    "end": 502.22,
    "text": "I'll bring up your colleague, Alex Vietkin, now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 505.582,
    "end": 506.363,
    "text": "Hi, Alex, how are you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 509.144,
    "end": 510.025,
    "text": "Yeah, fine, thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 510.726,
    "end": 511.386,
    "text": "Hi, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 511.966,
    "end": 512.667,
    "text": "Cool, take it away.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 514.207,
    "end": 515.688,
    "text": " Okay, let me share my screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 522.513,
    "end": 523.294,
    "text": "Can you see it right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 528.078,
    "end": 528.358,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 530.14,
    "end": 554.13,
    "text": " So I will add some information about Active Inference and EOS and continue to talk, but also will provide more information from Institute scale about our work and possible collaboration with our participants.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 556.011,
    "end": 562.698,
    "text": " So we are an institute which is working on the frontier of active inference as we consider it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 563.579,
    "end": 575.19,
    "text": "And it's a scale-free cognitive framework which is based on first principles that models decision-making processes and actions of agents in the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 576.304,
    "end": 588.008,
    "text": " And it's quite important about scale-free here, because it means that we can apply it for different types of agents and systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 588.428,
    "end": 600.512,
    "text": "And for me personally, very important that it's based on first principles, starting from physics, from thermodynamics through",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 601.661,
    "end": 604.503,
    "text": " information theory to quantum information theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 604.763,
    "end": 612.168,
    "text": "It's quite broad space for people who like math and physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 613.529,
    "end": 618.272,
    "text": "This framework combines perception, action and inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 619.092,
    "end": 623.355,
    "text": "So optimize information processing and handle uncertainty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 625.471,
    "end": 640.764,
    "text": " In relation to different kinds of agents, it can be light, which was mentioned for robotics, for artificial intelligence, but also a lot of our fields and domains like neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 641.584,
    "end": 646.848,
    "text": "And for now we see real world examples of application of the framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 651.713,
    "end": 673.287,
    "text": " Active inference agent acting to minimize his surprises in informational sense and maximize expected outcomes on different time scales, having his generative model in place and updating it or updating environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 675.948,
    "end": 688.702,
    "text": " This process always based on gathering information and based on it generating actions based on that generative probabilistic models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 691.038,
    "end": 718.608,
    "text": " As I mentioned, it could be applied for various fields and we as an institute are starting it from ourselves in the beginning from team communications and later we see paths to decision making, management, governance and a lot of other things related to organizations as entities and as agents.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 723.217,
    "end": 746.935,
    "text": " As for active entity ontology for science, first of all, in terms of active inference, we can consider it as a part of shared generative model of people as personalities or organizations or projects, which should have some common language in place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 748.875,
    "end": 768.843,
    "text": " And having it, there are some evolution happening and providing ways to structure, to represent different scientific knowledges in a common way to enable efficient collaborations and knowledge sharing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 773.251,
    "end": 781.893,
    "text": " It can facilitate interoperability across different scientific domains, standardized concepts and relationships.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 783.233,
    "end": 791.055,
    "text": "And finally, it could be a way to accelerate scientific discoveries and interdisciplinary collaborations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 792.515,
    "end": 801.557,
    "text": "You can find some additional information and actually paper by these links and the ontology itself you can find on CODA page.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 803.104,
    "end": 808.547,
    "text": " Maybe have a look and consider if it connects with you in some way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 808.807,
    "end": 832.601,
    "text": "And important here that how it could be developed both Active Inference as a framework, as a cornerstone and developments with Active Entity Ontology can improve decision making and collaboration of teams, of organizations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 837.274,
    "end": 860.704,
    "text": " There are possible ways and different ways to integrate it with blockchain standards, which enhanced digitalizations of such scientific artifacts, which later in evolutionary manner could be reproduced and evolved throughout different communities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 863.376,
    "end": 892.153,
    "text": " Finally, we consider Institute as a part of research ecosystem and our intentions here to provide as an agent to provide more interfaces and more structured ways to communicate in these frontier domains because it's quite hard science and we need to find ways to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 893.544,
    "end": 899.969,
    "text": " use common language in different projects and by that evolve research ecosystems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 903.251,
    "end": 906.774,
    "text": "So I think that's all from my side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 906.794,
    "end": 909.115,
    "text": "So if you have some questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 921.465,
    "end": 921.965,
    "text": "Can you hear me?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 923.769,
    "end": 924.249,
    "text": " By the way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.09,
    "end": 927.77,
    "text": "Yeah, we can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.911,
    "end": 929.291,
    "text": "We'll give it a few minutes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 929.371,
    "end": 931.332,
    "text": "Maybe people want to type some questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.052,
    "end": 932.412,
    "text": "OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 940.335,
    "end": 941.115,
    "text": "Really cool stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.335,
    "end": 944.116,
    "text": "It's incredible how complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 944.217,
    "end": 949.358,
    "text": "And I can see a lot of different ways that you could collaborate with people in many, many different fields.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 949.378,
    "end": 950.419,
    "text": "So that's very cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.74,
    "end": 952.94,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 952.96,
    "end": 953.28,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  }
]