[
  {
    "start": 8.899,
    "end": 10.24,
    "text": " Hi, I'm Blue Knight.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 10.4,
    "end": 11.961,
    "text": "I'm here with Daniel Friedman.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 12.101,
    "end": 18.845,
    "text": "Today is November 8th, 2021 for a guest stream with Adam Safran.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 19.085,
    "end": 20.206,
    "text": "Adam, please take it away.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 23.088,
    "end": 23.488,
    "text": "Hi, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 23.528,
    "end": 24.068,
    "text": "Hi, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 24.088,
    "end": 24.929,
    "text": "Hi, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 26.23,
    "end": 27.61,
    "text": "It's good to be talking with you today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 28.131,
    "end": 35.876,
    "text": "And I guess we're here to talk about psychedelics and the 5-HT2A and related systems and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.806,
    "end": 43.87,
    "text": " And so I'll describe some recent work on this and looking forward to talking about it with you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.61,
    "end": 48.452,
    "text": "So let me get my screen sharing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 50.813,
    "end": 54.935,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 56.796,
    "end": 57.296,
    "text": "Coming through?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.437,
    "end": 59.798,
    "text": "Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 61.639,
    "end": 65.28,
    "text": "So I'm using my",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 68.559,
    "end": 71.441,
    "text": " active inference workshop slides as a base.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.461,
    "end": 76.585,
    "text": "And I'll go over those with a little bit slower than I did in the 10 minutes I had there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.225,
    "end": 80.427,
    "text": "And then we'll take it from there and talk it out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.148,
    "end": 83.009,
    "text": "So this is...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 84.13,
    "end": 105.385,
    "text": " part of an ongoing project to both try to understand the mechanisms of psychedelics, but also the impacted neurotransmitter or neuromodulator systems and the roles they would have in active inference and their potential significances for their use as machine learning parameters potentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 106.306,
    "end": 111.07,
    "text": "And so when it comes to psychedelics, much of the attention has been on the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 112.421,
    "end": 118.083,
    "text": " 5-HT2A system, and that's a lot of evidence indicates that it mediates the effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.404,
    "end": 134.37,
    "text": "Barely any work has been done in machine learning on this, and there has been work done in active inference, and I'm going to introduce a compatible but slightly different take on the potential significances of these systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 136.098,
    "end": 151.786,
    "text": " So within machine learning, a good amount of work and within active inference has been done on the potential roles of dopamine as a parameter, encoding the confidence one might have with respect to policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.987,
    "end": 162.034,
    "text": " Diane and others have suggested that serotonin can act with an impotency to dopamine based on a variety of lines of evidence from neurophysiology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 162.514,
    "end": 168.739,
    "text": "And so some work has also been done in introducing a complementary uncertainty parameter in the form of serotonin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 170.24,
    "end": 188.233,
    "text": " This oponency can be thought of almost yin-yang-like with dopamine being more of the yang and serotonin being more of the yin, dopamine in general indicating in the neuroscience literature's incentive salience, confidence, and if excessive, potentially impulsivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.193,
    "end": 190.974,
    "text": "Serotonin would be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 192.068,
    "end": 207.86,
    "text": " An opponents or complementarity would indicate the satisfaction of desires, states of uncertainty, and potentially a factor helping to allow for patience rather than impulsivity with respect to policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 209.48,
    "end": 223.748,
    "text": " So very little work, though, has been done in machine learning on 5HG2A and also in terms of active inference, in terms of actually modeling the 5HG2A system as an active inference parameter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 224.648,
    "end": 229.991,
    "text": "Work is probably going to begin soon in this direction, largely informed by the Rebus paradigm, which we'll talk about soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 231.593,
    "end": 235.235,
    "text": " But go back to the fundamentals of these systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 237.297,
    "end": 243.54,
    "text": "The work that's been done so far with the serotonin system can be thought of more as relating to the 1A system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 244.541,
    "end": 249.124,
    "text": "This would be in contrast to the higher threshold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 249.364,
    "end": 252.045,
    "text": "I believe it's a five to one ratio of sensitivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.126,
    "end": 254.627,
    "text": " for the receptor of the two-way system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 254.667,
    "end": 266.613,
    "text": "So when serotonin, both of these, so 5-HT is serotonin, and you have some, I think, 14, maybe 17 classes of receptors, depending on how you count them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.313,
    "end": 269.635,
    "text": "So are we going to talk about all of them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 269.895,
    "end": 270.855,
    "text": "Well, maybe eventually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 273.143,
    "end": 298.862,
    "text": " it seems that we might be able to go a fair ways, focus in terms of understanding their significance, focusing on a few classes and sort of working our way forward with the additional receptors, maybe having a common significance to the other ones, but just because they're located at different parts of the brain, it's a common organism significance, but functionally you need them to do different things if located in different places.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 299.802,
    "end": 300.944,
    "text": " We'll get into more detail soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 301.384,
    "end": 313.639,
    "text": "But the 1A system is shown to, in general, have more inhibitory effects on the signaling of pyramidal neurons, while the 5HE2A system tends to be more excitatory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 315.621,
    "end": 341.363,
    "text": " Carhart-Harris and Nutt have suggested that these both in a face of challenge would be responses to challenge, but the 1A might be something more like an active or a passive coping response, being more still, patient, stop and think, as opposed to the 2A system, which might be more of an active coping response in the face of challenge, something more imaginative and potentially creative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 342.464,
    "end": 342.584,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 349.059,
    "end": 350.781,
    "text": " Let's keep going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.481,
    "end": 369.399,
    "text": "So going back to dopamine versus serotonin, though, serotonin in general, not focusing necessarily on 1A versus 2A, there seems to be some evidence suggesting that dopamine will push you, or actually a good amount, that dopamine tends to push",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 370.515,
    "end": 381.107,
    "text": " the organism towards more externally focused attention in terms of helping to increase the gain on more extericeptive and salience networks for externally focused attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 381.127,
    "end": 387.554,
    "text": "5-HT, in contrast, seems to be upregulating the default mode and more internally focused attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 387.574,
    "end": 389.596,
    "text": "So that's another interesting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 390.356,
    "end": 390.736,
    "text": " difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.557,
    "end": 401.766,
    "text": "But to come to the 2A, so these receptors, as I mentioned before, they tend to have high thresholds for activation by serotonin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 401.866,
    "end": 406.971,
    "text": "1A will be modulating mood as your serotonin levels are going up and down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 407.011,
    "end": 413.997,
    "text": "You might get this sort of gentle adjustment, but 2A, it's going to take more to really get those systems going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 414.357,
    "end": 414.617,
    "text": "In fact,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 415.738,
    "end": 418.839,
    "text": " some of their activity might be modulated by things other than serotonin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.879,
    "end": 431.703,
    "text": "So there's evidence that things like carbon dioxide, maybe blood acidity in general is changing their activity, and maybe the endogenous DMT system, which we could talk about later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 433.023,
    "end": 438.445,
    "text": "So psychedelics tend to come in about two classes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 441.827,
    "end": 443.067,
    "text": " One are classic psychedelics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.728,
    "end": 454.191,
    "text": "One would be based on the structure of tryptamine, the precursor of serotonin, and the other would be based on the structure of phenylethylamine, precursor of cachetolamines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.931,
    "end": 464.294,
    "text": "Both of these seem to be active at the 5-HG2A system, which a variety of lines of evidence have been shown to mediate the effects of psychedelics to a very substantial degree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.764,
    "end": 481.385,
    "text": " So in the machine learning type work, I've been collaborating with Jara Shikspahi to try to reverse engineer these different neuromodulators as machine learning parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.026,
    "end": 506.701,
    "text": " And so we've been using an architecture which has elements of Hans Schmidhuber's world models and Dhanujar's dreamer to interpret 5-HT signaling as potentially being as the different classes of receptors as parameters for imaginative planning, or in active inference terms, a sophisticated inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.122,
    "end": 511.804,
    "text": " So with respect to world models, you'll see, is this working?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 511.944,
    "end": 512.585,
    "text": "Yeah, it's working.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 513.165,
    "end": 518.828,
    "text": "So in Hahn-Schmidt-Huber's architecture, they'll use these autoencoders to take these different frames.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 518.848,
    "end": 520.289,
    "text": "This is in a Doom game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 520.75,
    "end": 525.592,
    "text": "They'll compress them into a lower dimensional latent space, and then they will unpack these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 526.753,
    "end": 533.197,
    "text": "And through this training of the autoencoder to learn how to reconstitute these frames,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 533.877,
    "end": 550.828,
    "text": " you get this low dimensional vectors in latent space, which can be used for training and with much better computational efficiency and some learning properties when you don't have to go all the way back to pixel space where things can get messy and you don't know what's causing what.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.488,
    "end": 558.353,
    "text": "If you work with this latent space, you can come out substantially ahead in terms of training.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 558.993,
    "end": 563.117,
    "text": " And so you have this variational autoencoder, which is learning how to compress scenes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.137,
    "end": 566.881,
    "text": "So this is one aspect or compress the observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 567.461,
    "end": 575.909,
    "text": "You then feed this latent space compressed vectors into this recurrent network, which learns to predict the state transitions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.63,
    "end": 591.842,
    "text": " You shove this into a much lower dimensional controller, which they trained with evolutionary strategies, and then use this for policy selection, generating new observation and the standard sort of reinforcement learning paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.764,
    "end": 597.447,
    "text": " The interesting thing about these is they could also be run offline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 597.467,
    "end": 605.334,
    "text": "So you're able to take these and take the outputs and feed it right back in and you can do imaginative rollouts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 605.534,
    "end": 611.339,
    "text": "So you could use this for planning or for having the agent train in its imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 612.16,
    "end": 613.581,
    "text": "And so this would be an example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 613.722,
    "end": 615.543,
    "text": "I believe the left would be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 617.145,
    "end": 630.049,
    "text": " But seen, the left would be the compressed latent space, and then the right would be the agent, actually, I think the left is what was actually seen, this is pixel space, and the right is the imaginative latent space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.929,
    "end": 646.734,
    "text": "So it tends to be, you're not really seeing it here, but it tends to, these imagined trainings, like imagination relative to perception or sensation, it's less fidelity, but you can still use it for the sake of planning and learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.428,
    "end": 657.773,
    "text": " But one issue is that these agents can do a kind of self-adversarial attack when they're training their imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 658.373,
    "end": 670.421,
    "text": "So if the temperature or the uncertainty isn't high enough, they can basically come up with these sort of fantasies of easy environments where they are just winning, but then this doesn't transfer to the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 671.221,
    "end": 681.412,
    "text": " And so by introducing a temperature parameter to increase the uncertainty of your imaginative rollouts, this allows for better training back to the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 681.492,
    "end": 687.699,
    "text": "And so this, I've been suggesting, is potentially one interpretation of the 5HT1A system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 688.96,
    "end": 705.084,
    "text": " As increasing the temperature, putting the organism… Basically, instead of dopamine would be, you're confident, go forth and act, serotonin acting on the 1A system would say, we're not so confident, stop and think or imagine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 706.144,
    "end": 710.165,
    "text": "Don't act right away, but let's think this out or let's imaginatively plan this out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 710.865,
    "end": 713.046,
    "text": "Look a little bit in our mind's eye before we leap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.906,
    "end": 726.35,
    "text": " The 2A, though, seems like it's almost like a hybrid of the 1A and dopamine, where it's like, okay, imagine more, but it's not necessarily doing so under a state of uncertainty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.95,
    "end": 736.453,
    "text": "Within these imaginative rollouts, things are appearing more vivid, where the gap between imagination and reality seems to be narrowing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 737.414,
    "end": 743.191,
    "text": " And the idea is if you're thinking back to passive versus active coping, so you're uncertain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 744.141,
    "end": 745.822,
    "text": " Let's say the 1A system is in the mix now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 746.243,
    "end": 747.944,
    "text": "You're, okay, I'm not going to overtly act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 748.024,
    "end": 748.905,
    "text": "I'm going to stop and think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 748.925,
    "end": 755.85,
    "text": "I'm going to reduce the gain on the expected free energy or the expected value of pursuing a policy right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.051,
    "end": 757.432,
    "text": "Patience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 758.212,
    "end": 761.895,
    "text": "But if the 2A gets in the mix, it's going to tend to be more active.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.156,
    "end": 771.163,
    "text": "You're going to be imagining, but you're going to be more likely to act on these imaginings because they're more compelling, more vivid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 772.688,
    "end": 775.529,
    "text": " So now we're coming back to psychedelics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 775.889,
    "end": 796.974,
    "text": "But I want to lay out this foundation, because the whole way through the method is basically a kind of Marian neurophenomenology, trying to understand the mind at computational, functional, algorithmic, and implementation levels of analysis, and then mapping this on to rich descriptions of experience, of subjective experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 796.994,
    "end": 801.775,
    "text": "So mapping standard, the cognitive science, multilevel stack to phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 802.635,
    "end": 809.138,
    "text": " And so the machine learning is part of pulling off this mapping, or active inference is part of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 809.919,
    "end": 816.842,
    "text": "So to rehearse the basics of Rebus, by the way, am I coming across all right or checking in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 817.303,
    "end": 817.383,
    "text": "OK.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 818.223,
    "end": 821.464,
    "text": " So the relaxed beliefs under psychedelics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 822.044,
    "end": 834.908,
    "text": "This, I'd say, might be the dominant paradigm for understanding the significance of the 5HG2A system in creating the effects of psychedelics under a predictive processing paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 835.668,
    "end": 838.509,
    "text": "So according to Rebus,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 839.693,
    "end": 860.952,
    "text": " you'll get, I don't think I have to rehearse predictive coding here, but very briefly, the idea is you have a hierarchy of predictions where you are passing your priors or your prediction errors down the hierarchy back towards the primary modalities where the observations are coming in, and then you're passing prediction errors upwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 861.853,
    "end": 870.663,
    "text": " And this coding scheme is efficient, especially if the events that you're tracking or trying to model are clocking slower to the internal state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 872.007,
    "end": 873.248,
    "text": " something like telecommunications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 874.008,
    "end": 883.113,
    "text": "If all you have to do is transmit what's different between the frames and I don't know, 24 Hertz used to be what TV was back in the day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 883.433,
    "end": 889.976,
    "text": "But if most of the pictures are largely the same frame to frame, and all you do is you show what's different, you get this energy savings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.036,
    "end": 899.201,
    "text": "And when you're dealing with an organ as hungry as a brain, two to 3% of your body mass, 20% of the budget that the savings could be substantial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 900.282,
    "end": 900.682,
    "text": "And, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 901.243,
    "end": 904.568,
    "text": " a world of the quick and the dead, natural selection might have picked such a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.61,
    "end": 907.994,
    "text": "So within predictive coding,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 909.38,
    "end": 912.183,
    "text": " the predictions are thought to be encoded by these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.843,
    "end": 923.792,
    "text": "So if you think of cortex, as Jeff Hawkins says, it's roughly a dinner napkin and thickness and extent that's been crumpled up and shoved into your head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 924.373,
    "end": 927.415,
    "text": "Cortex has these different layers, roughly six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 927.996,
    "end": 936.042,
    "text": "And so, and this is distinct from like levels of a hierarchy, but the cortex, the sheet, if you go like across the napkin, there's these layers, about six.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 936.963,
    "end": 939.304,
    "text": " And depending on where you are, they're more or less distinct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.424,
    "end": 950.607,
    "text": "But the L5, or the deep pyramidal neurons, these are the ones that will leave cortex, do things like form loops with thalamus, the striatum, cerebellum, spine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 951.548,
    "end": 958.23,
    "text": "And that's what is thought to encode your predictions, these L5 deep pyramidal neurons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.29,
    "end": 965.112,
    "text": "Not deep in terms of a deep leaf hierarchy, but deep in terms of relative to the cortical surface, more in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 966.734,
    "end": 967.395,
    "text": " within the napkin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 968.777,
    "end": 975.047,
    "text": "The prediction errors are thought to be encoded by the superficial pyramidal neurons on layers two, three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.527,
    "end": 980.054,
    "text": "So L5 is forming these big synchronous complexes with the thalamus,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.015,
    "end": 992.966,
    "text": " probably not the only way it does the predictions, but this will be aggregating information from multiple different places, giving you, and because you're able to get a lot of different causes brought together, it's gonna be a good source of priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.986,
    "end": 996.409,
    "text": "It's gonna be a good source of your expectation and your modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.651,
    "end": 999.612,
    "text": "And then you use this to try to suppress",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1000.839,
    "end": 1005.245,
    "text": " the ascending stream of prediction errors along this superficial layer 2-3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1005.366,
    "end": 1008.65,
    "text": "We can go into layer later if that's useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1009.472,
    "end": 1012.957,
    "text": "But the idea is that under psychedelics,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1015.134,
    "end": 1024.176,
    "text": " You take L5 pyramidal neurons, these excitatory neurons, and you excite them so much with 5-HT2A stimulation that they fall out of sync with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.896,
    "end": 1028.677,
    "text": "And it's a kind of paradoxical effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1029.137,
    "end": 1033.258,
    "text": "When they fire too readily, they don't coordinate anymore in establishing a synchronous rhythm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.758,
    "end": 1038.499,
    "text": "And because of this, they're actually paradoxically relaxing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1038.899,
    "end": 1040.219,
    "text": "The priors become less precise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.779,
    "end": 1045.383,
    "text": " the belief or free energy landscape becomes flatter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1046.024,
    "end": 1059.135,
    "text": "And so now the idea is with your expectations being less, more information from the periphery is capable of penetrating deeper into the cortical hierarchy, registering more in consciousness and impacting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.755,
    "end": 1061.516,
    "text": " learning and updating to a potentially greater degree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1061.996,
    "end": 1076.122,
    "text": "And so this is a model of the much of the phenomenology of psychedelics, as well as their mechanism of therapeutic action for helping people to, as Pollen would say, like how to change your mind, helping you to change and change your mind to update.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1077.363,
    "end": 1077.583,
    "text": "And so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1079.864,
    "end": 1093.055,
    "text": " I think rebus is largely correct, but I've been introducing a potential refinement of it in something I call albus, which includes, in addition to rebus effects, something I call cebus effects or strengthened beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1094.113,
    "end": 1109.836,
    "text": " And so the idea is that you might not get exactly this desynchronization effect along the whole dose response curve of 5-HE2A agonism or stimulation of the 5-HE2A receptor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1110.336,
    "end": 1117.378,
    "text": "Rather, this might be the case of what you would expect from very high levels of agonism, the really strong excitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1117.458,
    "end": 1121.459,
    "text": "But let's say we increase the gain just a little bit or a moderate amount.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1122.359,
    "end": 1126.06,
    "text": " I suggest it's not at all obvious that this would cause the energy landscape to flatten.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1126.14,
    "end": 1129.621,
    "text": "This would not cause them necessarily to fall out of sync with each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.641,
    "end": 1136.182,
    "text": "In fact, they might be able to sync up even more powerfully if you just increase it a little bit or moderately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.742,
    "end": 1137.542,
    "text": "We don't actually know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1137.582,
    "end": 1140.143,
    "text": "This might vary from organism to organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1140.883,
    "end": 1146.684,
    "text": "But the idea is we might need different regimes, different accounts, depending on where we are with what level of stimulation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.304,
    "end": 1154.695,
    "text": " before we would expect to see the kind of paradoxical desynchronization or potentially more straightforward enhanced synchronous ability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1154.715,
    "end": 1155.777,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1162.236,
    "end": 1163.717,
    "text": " So bring it back to predictive coding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.117,
    "end": 1173.8,
    "text": "So here, if you're going to try to illustrate this, the purple would be your deep pyramidal neurons supposedly encoding or that are thought to encode your beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1174.301,
    "end": 1176.922,
    "text": "And then up top, you have the white circles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1176.982,
    "end": 1180.623,
    "text": "This would be your superficial pyramidal neurons, the upper part of the layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1180.963,
    "end": 1183.524,
    "text": "And this would be encoding your prediction errors that you're passing upwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1183.924,
    "end": 1184.645,
    "text": "And so you're seeing these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1185.205,
    "end": 1187.846,
    "text": "I'm illustrating the synchronous complexes by these red swaths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1188.426,
    "end": 1190.447,
    "text": "The predictions going downwards are these red arrows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1191.167,
    "end": 1198.113,
    "text": " And then I'm depicting basically the prediction errors as these gray swaps and black arrows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1198.674,
    "end": 1211.384,
    "text": "So within predictive coding, there's been significance assigned to different EEG and MEG frequency bounds as potentially corresponding more or less to predictions or prediction errors, more specifically, the slower rhythms like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1212.285,
    "end": 1232.844,
    "text": " alpha and beta, where alpha is maybe roughly 8 to 12 times a second, beta is maybe 13 to 30 times a second, that these slower rhythms would be the ones encoding your predictions, passed downwards, but that your prediction errors might be more likely to be encoded by gamma frequencies, anywhere from 40 to 120, even higher.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.727,
    "end": 1237.728,
    "text": " oscillations per second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1238.728,
    "end": 1255.279,
    "text": "So within this, part of the reason that this might make some intuitive sense is if you're thinking of the formation of a synchronous complex of neural activity, that faster would be smaller and slower would be bigger or more inclusive, more integrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1255.86,
    "end": 1263.325,
    "text": "This might make some intuitive sense if you're thinking of, OK, so you're trying to get this agreement, this negotiation of a common rhythm of a bunch of signaling units.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.165,
    "end": 1272.327,
    "text": " If you're having more units spread over a bigger distance, you're trying to get them to come into agreement, this might necessarily have to be a slower process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.967,
    "end": 1283.79,
    "text": "But if you're, let's say, quantizing prediction error, generating a little packet of a local agreement that you're passing upwards, well, that you could potentially clock a lot quicker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1286.05,
    "end": 1286.951,
    "text": " That's the basic idea there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.611,
    "end": 1302.663,
    "text": "So if we were to look at Rebus, it would look something like you see the right bottom, the swath of red is more restricted in scope, and the arrows are a little bit smaller.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1302.703,
    "end": 1304.424,
    "text": "And so this is the idea of you've relaxed your beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.444,
    "end": 1308.607,
    "text": "This is if you get this paradoxical desynchronization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.229,
    "end": 1317.291,
    "text": " And so once you have this, you're seeing less of these prediction areas are being inhibited by this descending stream of predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1317.611,
    "end": 1321.672,
    "text": "And they're able to make their way in more deeper into the hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1322.293,
    "end": 1323.953,
    "text": "And this would be showing one modality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.973,
    "end": 1326.774,
    "text": "Obviously, the brain is not just one singular hierarchy, but it's a hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1327.274,
    "end": 1334.517,
    "text": "Multiple intersecting hierarchies corresponding to each of your modalities all brought together, stitched together into a hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.938,
    "end": 1350.055,
    "text": " Up top would be illustrating a CBUS effect, and so the swath is bigger, and the arrows are also darker and bigger, and more prediction errors are being inhibited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1350.795,
    "end": 1353.118,
    "text": "There's an additional factor, which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.899,
    "end": 1360.725,
    "text": " 5-HT2A receptors are also found on the inhibitory interneurons of layers 2, 3.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.825,
    "end": 1379.2,
    "text": "And so in theory, and there's some evidence, I believe, that suggests this, this would correspond to a default reduction in the gain on the ascending stream of prediction errors, or you would say, in active inference speak, less precision weighting of the prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.54,
    "end": 1381.482,
    "text": "And so they have less of a contribution",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.202,
    "end": 1385.466,
    "text": " of the Bayesian updating that's happening at each level of this belief hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1386.007,
    "end": 1390.613,
    "text": "And so that's illustrated by slightly, I don't know if this is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1391.997,
    "end": 1394.839,
    "text": " Yeah, on their own, the arrows are a little bit smaller.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1394.959,
    "end": 1404.967,
    "text": "So the idea here with a CBUS effect would be not only might you have stronger beliefs, but these beliefs might be further shielded from contradiction by inconsistent sense data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1406.128,
    "end": 1416.116,
    "text": "I think this potentially provides a fairly parsimonious account of some of the conditions under which you get certain perceptual alterations of a hallucinatory variety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1416.156,
    "end": 1419.599,
    "text": "So for instance, people will sometimes report hallucinations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1420.279,
    "end": 1421.641,
    "text": " in sensory deprivation tanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.542,
    "end": 1436.159,
    "text": "They'll sometimes, I think it's called a Charles Binet syndrome, where as you start to, let's say, go blind or deaf, you'll start to get like auditory or hallucinations within the modality as you lose input from the external world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.16,
    "end": 1439.402,
    "text": " This also you could think of at a higher level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1439.883,
    "end": 1453.454,
    "text": "I don't know if this works, but you could think of potentially delusions in a similar way, a belief which is overly strong and resistant to updating from potentially contradictory and potentially correct sense data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1453.534,
    "end": 1465.564,
    "text": "So in theory, if we're talking about CBUS effects, you might have a single parsimonious account for both hallucinations and delusions that's incorporating a little bit more of the neuroanatomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1466.496,
    "end": 1469.779,
    "text": " That being said, I'm not saying at all that Rebus is incorrect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1469.799,
    "end": 1482.208,
    "text": "I actually think it's probably very correct and maybe crucially important for explaining some of the really powerful changes that people observe with psychedelics as a therapeutic intervention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1483.469,
    "end": 1485.731,
    "text": "So get into a little more details here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1485.751,
    "end": 1487.452,
    "text": "And so, okay, y'all with me still or?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.472,
    "end": 1489.053,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1489.774,
    "end": 1489.874,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.557,
    "end": 1493.898,
    "text": " I mentioned a hierarchy earlier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1493.918,
    "end": 1499.343,
    "text": "So I've taken these predictive coding hierarchies here, and I'm just illustrating them as these triangles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.843,
    "end": 1517.158,
    "text": "And so here would be, let's say, your... So I think in this framework of Albus I'm suggesting, we need to even, in addition to including things like CBUS effects, I think we're going to need to take on things like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1518.772,
    "end": 1534.587,
    "text": " basically consciousness and higher order consciousness to actually really adequately explain what we mean by relaxed or strengthened beliefs and what actually is happening with these different neuromodulators and maybe attempts at creating analogs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1535.288,
    "end": 1535.388,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1536.749,
    "end": 1546.592,
    "text": " Here, you know, up top would be somatosensation, to the right would be your vision, and then your hearing, and we're going to try to bring all these things together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.172,
    "end": 1559.055,
    "text": "And so if you're thinking of some sort of hierarchy, like here, you might have like small beta complexes, you can think of each of these as like a small modeling effort, and a small belief over whatever is in the scope of this synchronous complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.815,
    "end": 1570.66,
    "text": " where the idea being that when you synchronize neurons, this allows them to be aligned in their activity and time such that their signals can sum and be integrated rather than decay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.26,
    "end": 1577.523,
    "text": "And so this would allow you to have potentially a joint belief over whatever is in the scope of a synchronous complex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1578.204,
    "end": 1580.625,
    "text": "Pascal Fries calls this communication through coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1581.525,
    "end": 1588.328,
    "text": " And for a reference for this idea of like an inverse hierarchy of size and speed, Buzsaki would be a good reference for that, I'd say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1589.008,
    "end": 1604.055,
    "text": "So here we are on the left, the beginnings of modeling of increased hierarchical depth with small fast beta complexes, the extraction of things like line segments and maybe basic contours and vision, basic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1605.683,
    "end": 1607.744,
    "text": " Patterns within sound, within touch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.525,
    "end": 1614.689,
    "text": "But then let's say we nest these within maybe slower, broader, more encompassing data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1615.069,
    "end": 1619.332,
    "text": "We could have more hierarchical structure for our modeling effort.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1620.313,
    "end": 1625.316,
    "text": "And so here you might start to get the beginnings of things like objects as you bring together these different features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1625.796,
    "end": 1631.84,
    "text": "The beginnings of things like objects with respect to touch, or rather your own body in relation to those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1632.961,
    "end": 1635.283,
    "text": "The beginnings of things like meaningful sounds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.123,
    "end": 1640.528,
    "text": " And so then let's say we bring all the modalities together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.588,
    "end": 1649.496,
    "text": "Now we let them cross talking about multimodal representation that you've organized according to a coherent perspectival reference frame.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.017,
    "end": 1654.041,
    "text": "Well, now you might get the beginning of something like phenomenality or experience, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.341,
    "end": 1683.296,
    "text": " And so here, there's a blue swath corresponding to alpha frequencies here, where at alpha frequencies, that would roughly be, it looks like, the size that you would need, so 8 to 12 times a second of frequency of updating or sampling or estimation, that this would be big enough to get you the entire sensorium all brought together, bringing together the different hierarchies into a hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1684.476,
    "end": 1692.478,
    "text": " Alpha has some additional significance in that it has particularly concentrated sources of alpha power from midline structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1693.238,
    "end": 1713.402,
    "text": "And I take this as being important because if you look at something like the posterior midline, you look at, let's say, the posterior cingulate cortex, which is heavily implicated in the psychedelic and also the meditation research literatures, as when alpha goes down, there seems to be some associated with phenomena such as ego dissolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.807,
    "end": 1714.928,
    "text": " But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1715.953,
    "end": 1739.4,
    "text": " The idea that alpha might be important for coherent, egocentric perspective, in addition to bringing together your sensorium for this mutual information, these midline structures, and particularly the posterior cingulate, there's this old idea of the Pepe's circuit, where it's this core circuit for emotional memory that would roughly go out of mammillary bodies around the brainstem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1739.9,
    "end": 1745.022,
    "text": "It goes up through the mammothalamic tract, I think anterior lateral thalamic nucleus,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1746.062,
    "end": 1751.547,
    "text": " goes through the cingulum bundle, posterior cingulate, into the hippocampus, out through the fornix, back to mammary bodies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1751.927,
    "end": 1752.848,
    "text": "Don't worry about those details.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1753.349,
    "end": 1768.442,
    "text": "The important thing about this is this was interpreted by, actually, I said papaz, I think it's papes, but it was interpreted by papes when he was etching out these sources of epileptiform discharge as his core circuit for emotional memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1769.062,
    "end": 1772.846,
    "text": "And part of the reason that, and so the importance of this,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1774.159,
    "end": 1778.661,
    "text": " is the mammary bodies are receiving stretch receptor information from the neck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1779.662,
    "end": 1798.212,
    "text": "And so this is gonna be potentially important for knowing where your head's pointing, especially if we're talking about like, which will be important for us and maybe even more so if we're talking about like our inner rodent or whatever, that where your head's pointing is gonna really help for bringing coherence to explaining your sensorium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1799.312,
    "end": 1804.375,
    "text": " Also at the salamic relay, you're also getting inputs from the vestibular apparatus of the inner ear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.735,
    "end": 1806.456,
    "text": "And so this is giving you like the yaw, pitch, and roll.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1807.056,
    "end": 1825.886,
    "text": "And so not only do you have your entire sensorium, all the information at these posterior midline structures before they funnel into the hippocampus as a source of new memory, not only do you have the entire sensorium brought together, you're on top of it all in network terms, but you have the information you would need to organize it by your egocentric perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1826.84,
    "end": 1830.47,
    "text": " And so this, yeah, so we've got predictive coding we covered.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1831.751,
    "end": 1833.572,
    "text": " See this effects, read this effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.632,
    "end": 1858.483,
    "text": "And now I'm introducing like a basic model of perceptual synthesis where we have something of a Cartesian theater here enabled by the ability of slow rhythms of a large enough extent to bring together the right kinds of information you would need to basically create a coherent world model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1860.362,
    "end": 1862.607,
    "text": " So you all with me still, or are we good?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1862.827,
    "end": 1863.088,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1863.749,
    "end": 1866.234,
    "text": "So in this preprint,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1869.52,
    "end": 1890.477,
    "text": " I describe how we can maybe think of, with respect to either sensation or imagination, different combinations of rebus and cebus effects happening, potentially corresponding to different levels of stimulation of these receptor classes of the 582A-R in particular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1891.178,
    "end": 1891.438,
    "text": "By the way,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1893.259,
    "end": 1899.965,
    "text": " I think 5HT2C, that's one to watch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1900.066,
    "end": 1905.51,
    "text": "Well, it might even be like almost more strictly rebus in its nature, but that's something to talk about later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1907.112,
    "end": 1908.753,
    "text": "So for sensation on the left here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1909.834,
    "end": 1915.057,
    "text": " This would be, there's a person out in nature, and they're having an interaction with a tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1915.778,
    "end": 1924.764,
    "text": "And then on the right here would be a similar thing, but this is imagination, maybe with your eyes closed, maybe not, but this is here, you're imagining yourself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1925.604,
    "end": 1927.405,
    "text": " and interacting with the tree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1927.826,
    "end": 1946.879,
    "text": "Now, you know, imagination, it doesn't need to be in a third person, but I'm just taking advantage of the fact that we're talking, like, if you are to think of yourself in a third person, if you're going to move from this, was it the, as James called it, like from the I to the me, to this objectified selfhood, that part is going to require imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1947.279,
    "end": 1954.063,
    "text": "You can imagine yourself in the first person, but the third person point of view, you're going to require imagination",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1954.904,
    "end": 1957.789,
    "text": " I guess that or a mirror or a good setup of mirrors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1957.829,
    "end": 1960.294,
    "text": "Maybe you could do it that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1960.314,
    "end": 1961.395,
    "text": "So that might be non-trivial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.856,
    "end": 1962.758,
    "text": "But on the left here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1963.857,
    "end": 1969.139,
    "text": " So the top we have, let's say unaltered, if such a thing ever exists, we're always altered in some ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1969.159,
    "end": 1974.821,
    "text": "We're always on some, you know, our brain stems from a copy is always dripping some combination of drugs to us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1975.301,
    "end": 1978.062,
    "text": "It's just sometimes it's a very different regime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1978.102,
    "end": 1981.703,
    "text": "And, you know, we say it's altered, but there is no like singular baseline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1981.723,
    "end": 1988.065,
    "text": "You know, we, who knows how much we both vary as individuals and across individuals along these lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1988.805,
    "end": 1990.466,
    "text": "But so as we move down,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1991.812,
    "end": 1996.496,
    "text": " Let's say we were talking about a rebus effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1997.997,
    "end": 2002.38,
    "text": "And let's say you were getting a rebus effect with sensation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2002.961,
    "end": 2012.649,
    "text": "So in theory, if your perception is entailed by the predictions, then it could be the case that things might seem less vivid to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2013.409,
    "end": 2016.532,
    "text": "It may not be the case that your perception is more vivid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.816,
    "end": 2023.723,
    "text": " I don't know if I would say this is strictly entailed by the Rebus model, but that's one thing you might think potentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2024.144,
    "end": 2035.818,
    "text": "If these slow rhythms, if some of these are actually entailing your conscious experience, if these are reduced in their coherence and their power, in theory, you might get a diminution of perceptual vividness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2037.383,
    "end": 2044.688,
    "text": " However, in a Cebus interpretation, things might appear more vivid, not necessarily more veridical, but more vivid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2045.388,
    "end": 2062.199,
    "text": "And so it seems like a Rebus interpretation would say that things might be more detailed, more accurate, more richly textured with more faithful correspondences to the external world when you're perceiving, but potentially less vivid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2063.342,
    "end": 2065.823,
    "text": " Not because this is a strict entailment, but that seems like one suggestion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2066.603,
    "end": 2074.186,
    "text": "Under a CBIS interpretation, this would be more vivid, but not necessarily more precise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2074.226,
    "end": 2082.429,
    "text": "It actually might be a little bit smoothed over, like an auto-tuning or a filtering, but also, though, more compelling, potentially.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2082.849,
    "end": 2088.651,
    "text": "And so this, in theory, though, would be the phenomenology of microdosing in theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2091.774,
    "end": 2097.157,
    "text": " And so I try to illustrate this with the brain, either bigger or smaller synchronous complexes here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2098.378,
    "end": 2100.819,
    "text": "So albus, the idea is, well, we could have an admixture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.039,
    "end": 2104.821,
    "text": "It's not just one set of beliefs, but we have a hierarchy of beliefs, and in fact, a hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2105.341,
    "end": 2110.424,
    "text": "So maybe alpha starts to get pulled back, and that loses coherence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.444,
    "end": 2120.529,
    "text": "And that seems to be one of the strongest associations in the psychedelic and meditation literatures is alpha is what people will emphasize as some of these ego de-centering or dissolving effects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2121.329,
    "end": 2125.03,
    "text": " But maybe beta stays the same or even increases in power.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2125.63,
    "end": 2139.535,
    "text": "And so under a rebus model, for instance, the idea would be that things like alpha go down in power, but things like the particular smaller beliefs, they can come together in different ways in different sort of creative combinations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.615,
    "end": 2145.137,
    "text": "And so you might get something like synesthesia with psychedelics is like a creative recombination of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2145.997,
    "end": 2153.422,
    "text": " under this more anarchic state, once you took the alpha self-ruler and you reduced its tyrannical grip over your perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2154.022,
    "end": 2159.626,
    "text": "And so this more free-flowing perception, you get all sorts of different creative combinations in consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2160.987,
    "end": 2176.254,
    "text": " And so, yeah, so that's one thing is trying to basically map different combinations of rebus or sebus effects that you might expect under different doses with respect to either sensation or imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.574,
    "end": 2187.859,
    "text": "So really digging into the phenomenology and using psychedelics as an opportunity, actually, in a way to indirectly test models of consciousness, but also if we're going to explain what",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.399,
    "end": 2195.202,
    "text": " these substances, powerful substances are doing, we really actually need to take some of these questions head on, maybe even the heart problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2196.483,
    "end": 2200.024,
    "text": "So some of the more, so in this preprint,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2201.553,
    "end": 2206.038,
    "text": " I also are getting into, okay, well, what do we mean by beliefs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2206.158,
    "end": 2207.379,
    "text": "What kind of beliefs are we talking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.08,
    "end": 2216.409,
    "text": "And so, so one kind of beliefs would be, so, you know, here you might have the beliefs with active inference and the free energy principle, it's beliefs the whole way through.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2216.429,
    "end": 2217.59,
    "text": "Well, which beliefs do we mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2217.63,
    "end": 2223.116,
    "text": "And so, you know, and Rebus is saying what's specifically being, is being relaxed is your deeper beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2223.596,
    "end": 2233.725,
    "text": " your internal working models, the higher level beliefs corresponding to things like selfhood and its relation to the world, things like autobiographical and narrative selfhood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.045,
    "end": 2235.627,
    "text": "These are the things that are losing their grip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2236.247,
    "end": 2245.576,
    "text": "And within Rebus, I don't want to like, there is room for Cephas effects and some of the ways it's discussed, where it's not just across the board, all the slow rhythms are going down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2245.636,
    "end": 2249.019,
    "text": "The idea might be that, I've heard it discussed differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.559,
    "end": 2249.819,
    "text": "And so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2250.74,
    "end": 2258.432,
    "text": " you might get an indirect strengthening as you remove these slower integrative and potentially suppressive processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.315,
    "end": 2272.518,
    "text": " But in terms of types of beliefs, if we're going to be talking about cognition or if we're talking about something that's highfalutin as the self, now we might want to say, well, what kind of self are we talking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2272.538,
    "end": 2275.178,
    "text": "Are we talking about a minimal embodied self?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2275.218,
    "end": 2276.759,
    "text": "Are we talking about an extended self?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2277.259,
    "end": 2279.619,
    "text": "And even those, there's all sorts of bad questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2280.239,
    "end": 2282.14,
    "text": "What goes into the minimal embodied self?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2282.22,
    "end": 2284.5,
    "text": "And how is it relating to the extended self?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.58,
    "end": 2286.441,
    "text": "And maybe there's different kinds of those.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2287.401,
    "end": 2302.091,
    "text": " And so if we're talking about the construction of self and its relation to the world and objectified selfhood, the ego, the self as construed over time and across circumstances, we're going to need a fairly rich account of cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2302.631,
    "end": 2316.741,
    "text": "And so here I'm basically providing an account of sophisticated affective inference or imaginative planning and policy selection as orchestrated by the hippocampal and entorhinal system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2317.321,
    "end": 2323.75,
    "text": " And so this is a drawing on some of the work I'm doing with Tim Verbalen and others, trying to decipher that system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2324.191,
    "end": 2328.818,
    "text": "But basically, you seem to have, so here,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2331.972,
    "end": 2335.833,
    "text": " hippocampus can be thought of in a way as at the top of the cortical heterarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.653,
    "end": 2348.556,
    "text": "As the prediction errors are percolating upwards, being contradicted or stopped by predictions, you stop them as low as you can, as close to the modalities as you can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2348.996,
    "end": 2354.057,
    "text": "That's the maximum savings and that's what you would expect with the maximally efficient prediction and learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2356.454,
    "end": 2368.524,
    "text": " But if you can't predict a pattern, if nothing, the genuinely novel, that makes its way all the way up the hierarchy into the hippocampus as this prediction error storage place of last resort.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2369.544,
    "end": 2375.069,
    "text": "And this then can be stitched together to create memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2375.829,
    "end": 2382.295,
    "text": "And specifically, what the hippocampal and entorhinal system seems to do is it encodes this sequence memory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2383.444,
    "end": 2392.976,
    "text": " It has multiple functions, but one of its core functions seems to be the encoding of trajectories of the overall organismic system through time and space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2393.756,
    "end": 2399.824,
    "text": "And so if you look at the work of people like Reddish, you'll actually see, for instance, as this rodent is in a maze,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2401.145,
    "end": 2411.054,
    "text": " figuring out where it's going to go, you'll see these sweeps of activity within the hippocampus kind of play out in different directions across these place fields or this mapping of space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2411.574,
    "end": 2417.76,
    "text": "And then the organism will take like one branch or another of these potential sweeps of predictive activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.34,
    "end": 2430.946,
    "text": " And so I probably don't want to get into this here, but I have an account of like the anterior versus the posterior hippocampus seem to be qualitatively different, where the anterior hippocampus seems to be the one that's more predictive, giving you these sweeps, giving you things like counterfactual processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2431.386,
    "end": 2442.312,
    "text": "The anterior seems to be more closely coupling with the posterior sensorium and will be more important for more specific episodic encodings and maybe more faithful episodic rememberings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2443.112,
    "end": 2448.456,
    "text": " And so the idea is you have these little hexagons, which are corresponding to the mapping of space of these hippocampal place fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2448.876,
    "end": 2451.178,
    "text": "Where is the organism within some sort of space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2452.019,
    "end": 2454.541,
    "text": "And then they're playing out in some trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2455.181,
    "end": 2467.57,
    "text": "And so now along this trajectory, the idea is you're having the prediction errors from the cortical generative model, which can basically, by pointing back to cortex, can unpack at every point in space",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.992,
    "end": 2472.875,
    "text": " the experience you would expect for that particular temporal spatial trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2473.315,
    "end": 2478.879,
    "text": "And this would be an account of episodic memory and episodic imagination, or the stream of consciousness, if you will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.42,
    "end": 2480.06,
    "text": "Okay, so here we are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2480.701,
    "end": 2490.388,
    "text": "And I think this is the last thing I'll... So here we are, with these trajectories being played out and different experiences being entailed at each point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.403,
    "end": 2491.944,
    "text": " as it plays out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2491.964,
    "end": 2493.125,
    "text": "And they have a given length.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2493.245,
    "end": 2510.044,
    "text": "It seems that there's a extent of this, I think James called it the specious present, where the idea is there's like a thickness of the moment we find ourselves in, or this might be a somewhat different idea, but there seems to be three seconds",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2510.999,
    "end": 2517.866,
    "text": " is seems to be roughly the upper bound of what we would call a given extended moment of experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2518.386,
    "end": 2527.995,
    "text": "Edelman I think called it like the remembered present where there's a little bit of like a prediction and a post-diction and you're moving back and forth in the sliding window frame of experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2529.076,
    "end": 2555.725,
    "text": " And so one interpretation, and so within here as you're doing these different episodic rememberings and imaginings, that one thing that the 5-HT2A system might do is both increase the vividness of what you're imagining or perceiving as you go, but also allowing you to have more extended rollouts before you have to reset, where it seems like a roughly three seconds might be the upper bound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2558.985,
    "end": 2570.632,
    "text": " Basically, I have within the preprint this comic description, this neurophenomenological comic, where as you're increasing the dose, imagination is getting closer to perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2571.512,
    "end": 2579.877,
    "text": "And you're getting a longer runway to work with for this extended present moment within which you are planning and learning and making sense of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2580.497,
    "end": 2582.659,
    "text": "And so it gets a little bit bigger with the microdose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.379,
    "end": 2586.863,
    "text": " a little bit bigger with this threshold dose, you know, things are even more vivid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.883,
    "end": 2590.707,
    "text": "You're, you know, when you started out, you're just like, eh, kind of moving through the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.408,
    "end": 2592.129,
    "text": "I'm kind of awake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.169,
    "end": 2593.25,
    "text": "I'm kind of conscious, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2593.851,
    "end": 2595.153,
    "text": "And then it's like, oh yeah, I'm like, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2597.01,
    "end": 2604.535,
    "text": " things are crisper and a little bit more creative, like not that much here, but a little crisper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2605.756,
    "end": 2611.32,
    "text": "This would be something like, I don't know, like someone dosing, like a programmer in Silicon Valley, like microdosing is very popular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.68,
    "end": 2620.226,
    "text": "It doesn't seem like they're trying to like trip, but they're almost using it like a little bit of a stimulant, trying to like increase absorption with whatever they're doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2621.636,
    "end": 2630.04,
    "text": " And so then, as we move through, you increase the dose some more, and now it's even more vivid and more creative, more different imaginings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2630.06,
    "end": 2632.302,
    "text": "You're having access to more and more is manifesting in mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2632.862,
    "end": 2641.807,
    "text": "But then after a certain dose, what I'm illustrating is that basically the coherence starts to go, and you start to get smaller rollouts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.127,
    "end": 2645.548,
    "text": "They're even more vivid and they're more creative, but they're becoming less...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2648.71,
    "end": 2653.796,
    "text": " clear in terms of the sequencing, they make less sense with respect to achieving particular goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2654.516,
    "end": 2660.563,
    "text": "And so I think something that I should explain, and we might have to talk it out, but the underlying this is okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2660.583,
    "end": 2665.548,
    "text": "So these hippocampal resetting events are occasioned by different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2666.409,
    "end": 2668.651,
    "text": "One is if I go from one room to a next,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2669.472,
    "end": 2679.799,
    "text": " If some sort of really surprising thing happens, that's going to trigger this sharp wave ripple activity and a retiling of space within which you're doing your sophisticated inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.761,
    "end": 2685.663,
    "text": "So there's some evidence that reward prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2685.723,
    "end": 2694.55,
    "text": "If something really, really good happens, that might cause you to basically ramp up the hippocampal activity, encode that, generate a phasic help",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.511,
    "end": 2699.258,
    "text": " generate a phasic burst of dopamine, learn it, and then keep going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2699.338,
    "end": 2702.183,
    "text": "Or if something really bad happens, this might be an opportunity to pivot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2702.223,
    "end": 2703.466,
    "text": "What you're doing is not working.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2703.926,
    "end": 2704.888,
    "text": "Let's retile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2704.928,
    "end": 2705.65,
    "text": "Let's try again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2708.243,
    "end": 2723.575,
    "text": " And so this will be a function of both things like what's the neuromodulatory tone, what are those like the circuit level conditions, like maybe directly what's your level of 582A simulation that might influence how long you get before you have to reset.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2724.096,
    "end": 2732.323,
    "text": "But it could also be explained at the level of experience itself, at the level of the expected free energy changing as this immersion cause.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2732.363,
    "end": 2737.247,
    "text": "So as I'm getting creative, if I get so creative that I'm no longer making sense of things,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.867,
    "end": 2742.87,
    "text": " My expected free energy, if that goes up, like that spikes up because what I just said is really surprising.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2743.87,
    "end": 2746.772,
    "text": "It's novel, it's experienced vividly, and it's not making a lot of sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.592,
    "end": 2750.574,
    "text": "That might be something that would occasion this resetting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2751.654,
    "end": 2764.341,
    "text": "And so the idea is a model of basically a stream of consciousness or episodic remembering and imagining, which becomes more evident",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.161,
    "end": 2771.105,
    "text": " coherent, more rich, more absorbed within this first regime.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2771.645,
    "end": 2784.116,
    "text": "And then a second regime that's more properly psychedelic, where it becomes extremely creative so much so that it becomes qualitatively different than normal experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.696,
    "end": 2789.577,
    "text": " And even so much so that, for instance, at a certain point, you're not going to be using this to enhance your job as a programmer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2789.997,
    "end": 2794.358,
    "text": "You will be doing this on vacation with trusted others or something like this, hopefully.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2794.758,
    "end": 2796.258,
    "text": "And this is not something to take to work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2796.918,
    "end": 2801.86,
    "text": "People are not megadosing at work, hopefully, or they will not be working there for very long at most workplaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2803.94,
    "end": 2808.141,
    "text": "And so, yeah, that's basically it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2809.381,
    "end": 2826.382,
    "text": " And so then looping back around to the beginning, the idea is with a deeper understanding of these systems that includes some Rebus aspects and some CBUS-type aspects, we might be able to use these as inspiration for novel active inference and machine learning parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.985,
    "end": 2832.048,
    "text": " Potentially, you can think of getting stuck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2832.168,
    "end": 2839.315,
    "text": "People, if they're living a life of quiet desperation or something, they've gotten stuck at some kind of local maxima, and they're looking to change things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.335,
    "end": 2840.917,
    "text": "They're looking to get to kick out of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2841.217,
    "end": 2846.782,
    "text": "They're not finding an elegant path to minimize their expected free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2847.283,
    "end": 2849.945,
    "text": "If you've found yourself trapped at this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.766,
    "end": 2860.929,
    "text": " local free energy minima, you can use psychedelics to turbocharge your sophisticated affective inference enough to maybe find a novel solution, see something that you wouldn't otherwise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.709,
    "end": 2871.752,
    "text": "And then I guess the final thing I would like to point to is in terms of using psychedelics as a probe on mind,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.156,
    "end": 2885.504,
    "text": " you might have different interpretations of what they reveal if you're thinking of either a strictly Sebus story, a strictly Rebus story, or some kind of combination of the both of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2886.085,
    "end": 2896.092,
    "text": "And so I'd suggest that, for instance, you can think of a good amount of psychedelic phenomenology as corresponding to the unmasking of your core priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2896.772,
    "end": 2901.556,
    "text": "And so things like, let's say, fractal phenomenology,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.616,
    "end": 2915.26,
    "text": " That maybe would be a core perceptual prior, maybe partially evolutionary, partially as a reliably learnable posterior or empirical prior for making sense of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.62,
    "end": 2918.521,
    "text": "And this would make some sense in that if you use fractals as your...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.441,
    "end": 2926.589,
    "text": " generating your predictions, that's a very efficient basis set because you can do a lot with different combinations of fractals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2926.989,
    "end": 2930.333,
    "text": "And this is especially going to be efficient if that's what nature itself is doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2930.653,
    "end": 2938.301,
    "text": "You're using different combinations of fractal processes to model a world which is largely structured by different combinations of fractal-type generative processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.322,
    "end": 2956.214,
    "text": " Further, things like entity perceptions associated with different psychedelic experiences, archetypal type experiences, those also could be thought of as the unmasking of core priors, potentially strengthened core priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.192,
    "end": 2975.229,
    "text": " Because you would expect from active inference that entities is the kind of thing you would expect as a very powerful empirical prior because that's how we survive, especially agents such as us who think through other minds and where our primary niche is largely each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2977.887,
    "end": 2993.773,
    "text": " whether we're, you know, so the details of psychedelics might actually reveal these foundational inductive biases or foundational lessons in the learning curriculum and the structure of learning whereby we come to be the kinds of beings we are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.614,
    "end": 2997.195,
    "text": "And that is it for now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2997.215,
    "end": 2999.596,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.676,
    "end": 3001.256,
    "text": "Thank you, Adam.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3001.296,
    "end": 3003.037,
    "text": "That was super awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3003.717,
    "end": 3007.039,
    "text": "I am like particularly overloaded right now on like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3008.248,
    "end": 3016.717,
    "text": " my 1A receptors, which is like, I just want to imagine and step back before I ask some questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3016.817,
    "end": 3023.984,
    "text": "I know Daniel asked a lot, so I'm going to let him like ground me a little bit in reality and have the first jab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3025.686,
    "end": 3028.308,
    "text": "I was just writing a bunch of stuff in the live chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3028.349,
    "end": 3030.25,
    "text": "So definitely anyone can ask because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3032.816,
    "end": 3034.977,
    "text": " you jumped through many areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3035.498,
    "end": 3044.683,
    "text": "So if anybody has a question, they can type it, but let's take a quick breath, collect our thoughts, and then Blue, you can ask the first question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3046.224,
    "end": 3048.445,
    "text": "Wait, I just passed to you to like ground me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3048.646,
    "end": 3052.708,
    "text": "All right, so I guess I'm already here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3054.611,
    "end": 3065.884,
    "text": " All right, since I'm already here, I'm going to like, unclearly ask a whole lot of questions at once and also like try not to fangirl out too much because this line of work is really super awesome and unifies a whole lot of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3066.474,
    "end": 3068.596,
    "text": " my particular interests.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3069.156,
    "end": 3079.725,
    "text": "So just really quickly, what do you think the relationship is, if any, between inference and memory?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3080.025,
    "end": 3086.871,
    "text": "And can we quantify that through the brain, the brain system, dopamine, serotonin?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3087.111,
    "end": 3090.574,
    "text": "Like, do you have thoughts on that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3091.769,
    "end": 3092.269,
    "text": " I'm sure you do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3092.969,
    "end": 3097.211,
    "text": "Or do you have thoughts that you can summarize in 10 minutes or less?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3100.892,
    "end": 3118.758,
    "text": "So in terms of memory, there's a sense in which within the free energy principle and active inference, all effective causation is inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3119.83,
    "end": 3124.652,
    "text": " And it's all inference based on different kinds of memories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3124.792,
    "end": 3130.313,
    "text": "So every belief is a memory, and everything that happens is a kind of action, is a kind of inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.454,
    "end": 3148.459,
    "text": "But there's another sense, though, of memory, the kind I'm trying to get to, like the focus on the hippocampal entorhinal system, this orchestration of the overall memory system and this encoding of the genuinely novel in these episodes and in these frames of sense-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3149.366,
    "end": 3174.406,
    "text": " that this would be a more complex kind of inference and a sophisticated one, specifically where you are inferring the most plausible, rather than... So there could be a sense, for instance, in which you might get a fairly...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3175.529,
    "end": 3183.99,
    "text": " under some circumstances, maybe for like recent things that aren't like, I don't know what the shelf life would be, but like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.209,
    "end": 3209.246,
    "text": " So some of the literature, a couple of weeks, a couple of months, I don't know, but like that actually the hippocampal system through just this chaining of attracting states along these trajectories could point back to cortex and play out something that's actually like a decently faithful, but still very biased account or a reconstruction, a remembering of what occurred.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.687,
    "end": 3213.789,
    "text": " But for things that are older, that's probably not the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.889,
    "end": 3216.891,
    "text": "Even for things that are newer, there's this constructive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3217.531,
    "end": 3218.832,
    "text": "So it's always constructive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3218.872,
    "end": 3221.834,
    "text": "And then it's always a kind of every moment perception is inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.874,
    "end": 3224.476,
    "text": "At every moment, there's a creative aspect of filling in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3225.336,
    "end": 3235.708,
    "text": " But actually situating yourself within some sort of causal unfolding, that's going to involve a lot of value-canalized policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.068,
    "end": 3241.534,
    "text": "That's going to involve you using constraints like, well, what kind of being do I think I am and what's plausible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.915,
    "end": 3246.7,
    "text": "And that's going to determine when you're going down this branching, forking paths of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.96,
    "end": 3248.121,
    "text": " of different possibilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3248.641,
    "end": 3252.043,
    "text": "You'll be moving between, well, what might I have done under this or that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3252.083,
    "end": 3256.505,
    "text": "And you'll be picking plausible accounts of you partially as you go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3256.586,
    "end": 3264.15,
    "text": "And so some remembering might be a little bit like the naive playback one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3264.53,
    "end": 3267.392,
    "text": "If you play back the trajectory, it's got pointers back to cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3268.092,
    "end": 3269.353,
    "text": " And then you have this belief hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.373,
    "end": 3271.936,
    "text": "And so you give the prediction errors back to where things were new.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3272.396,
    "end": 3279.603,
    "text": "And then it just unpacks itself as a good enough account of what happened at each point as you went through some trajectory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3279.823,
    "end": 3282.326,
    "text": "And it's a decent semi-faithful playoff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3282.346,
    "end": 3289.192,
    "text": "But there's also going to be this other kind of memory, though, that's not faithful at all and can really deviate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3290.353,
    "end": 3296.976,
    "text": " a substantial amount, and hard to distinguish from imagination and continuous with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3296.996,
    "end": 3299.557,
    "text": "It's like, how do you know if you're remembering something or imagining?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.577,
    "end": 3300.698,
    "text": "You use these different cues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3301.398,
    "end": 3304.559,
    "text": "One cue you might use is perceptual vividness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3304.619,
    "end": 3310.502,
    "text": "So you would assume if I remember something, it's going to be a little bit crisper than if I just totally made it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3311.402,
    "end": 3313.123,
    "text": "The other one might be just the plausibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3313.943,
    "end": 3316.407,
    "text": " Yeah, that's like the kind of thing someone like me would do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3316.427,
    "end": 3318.571,
    "text": "And but you can get it confused.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.611,
    "end": 3319.973,
    "text": "And that'd be a source monitoring error.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3320.534,
    "end": 3322.918,
    "text": "And I think that's actually in a way for psychedelics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3324.382,
    "end": 3332.99,
    "text": " Both in terms of this core process of figuring out who you are, where you've been, where you're likely to go, and where you ought to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3333.811,
    "end": 3345.542,
    "text": "Thinking of these pathways as potentially what it is to be an agent, as revealing ways that agency and different self-consciousness and selfhood can vary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3346.383,
    "end": 3358.807,
    "text": " But also in terms of this, I think, needs to be brought in in terms of what we might expect to be impacted and what we might want to prepare for and harness with things like psychedelics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.847,
    "end": 3363.089,
    "text": "So for instance, there might be a very real risk for phenomena such as false memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3363.609,
    "end": 3375.173,
    "text": "So if the gap between perception and imagination starts to narrow, if your imagination starts to seem more vivid, it might become more difficult to distinguish between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3376.013,
    "end": 3381.855,
    "text": " a remembering and an imagining or yeah, so things of that nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3381.975,
    "end": 3399.801,
    "text": "So that I think the issue of what is memory in its relation to inference is going to be key for what it is like we want to alter and what it is we maybe don't want to alter, but might accidentally alter when we do different types of interventions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3400.421,
    "end": 3404.683,
    "text": "So like you played so perfectly into my follow up question was",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3405.58,
    "end": 3407.881,
    "text": " Like, how does creativity play into that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3408.502,
    "end": 3408.722,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3409.042,
    "end": 3413.344,
    "text": "And like, what is maybe the function of creativity?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3413.464,
    "end": 3417.627,
    "text": "Like, I mean, personally, my autobiographical memory is awful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3418.087,
    "end": 3424.75,
    "text": "But like, I have a really stronghold, like good factual memory for like, all kinds of ridiculous things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3425.311,
    "end": 3425.451,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3426.281,
    "end": 3435.528,
    "text": " So where does creativity play into that memory, perception, inference paradigm?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3436.028,
    "end": 3442.493,
    "text": "And are the people that are more creative or that take more psychedelics, do they have a less accurate memory?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3443.133,
    "end": 3446.055,
    "text": " Or are they more likely to remember things inaccurately?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3446.195,
    "end": 3448.856,
    "text": "Or even, like, what is inaccuracy?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3448.936,
    "end": 3454.119,
    "text": "Sorry, like, let me just get super meta, because I really fundamentally believe that perception is different for all of us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3454.519,
    "end": 3458.101,
    "text": "But, like, what is written in my biochem textbook, less so, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3458.221,
    "end": 3464.484,
    "text": "So maybe that's why, like, I put less priority on my autobiographical memory, because it's, I believe it's functionally inaccurate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3464.864,
    "end": 3471.868,
    "text": "But, like, whatever, how many angstroms are between each subunit of DNA, like, that's way more, you know, important, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3472.448,
    "end": 3472.568,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3481.018,
    "end": 3484.101,
    "text": " I mean, that's one of the hardest questions I can think of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3485.362,
    "end": 3485.782,
    "text": "Sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3486.302,
    "end": 3488.084,
    "text": "One of the most important too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3489.024,
    "end": 3491.807,
    "text": "So there's this, I'm trying to, I forget the name of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3491.827,
    "end": 3499.973,
    "text": "It's this dual constraints model of creativity that does address like head on the issue of kinds of creativity and psychedelics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3500.374,
    "end": 3502.275,
    "text": "I'll post that later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.355,
    "end": 3510.502,
    "text": "But it does seem like, for instance, there are, I wouldn't say...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3512.623,
    "end": 3522.79,
    "text": " necessary trade-offs with respect to different processes as to whether they allow for realizing different types of value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3523.251,
    "end": 3530.716,
    "text": "So let's say, so with memory or with creativity, you might distinguish between divergent and convergent creativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3530.736,
    "end": 3540.803,
    "text": "So like convergent creativity, where like you want to hit a particular target and generate a novel solution for a particular challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3542.504,
    "end": 3559.289,
    "text": " Or divergent where, let's say, you just want to think of something new, maybe just a novelty generator from which you then might select later convergent solutions in a longer process or just as part of an open-ended exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3560.069,
    "end": 3562.829,
    "text": "And so there's different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.03,
    "end": 3564.49,
    "text": "For instance, you could...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.15,
    "end": 3581.975,
    "text": " get, if you just turn up the heat, the temperature, and you make things more imprecise, and unconstrained, you might be able to get all sorts of different combinations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3582.015,
    "end": 3584.576,
    "text": "And this might be a good like fountain of divergent creativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3585.816,
    "end": 3591.438,
    "text": "Some of the evidence suggests, I believe that even with the microdose regime, so I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3593.496,
    "end": 3599.618,
    "text": " People who are doing microdosing, usually they're looking for things like enhanced conversion creativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3600.039,
    "end": 3602.42,
    "text": "I don't think the evidence is great that that's actually being achieved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3603.0,
    "end": 3613.164,
    "text": "But diversion creativity might be more likely to be associated with psychedelic experience proper, combinations of things that just you never would have imagined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3613.244,
    "end": 3613.864,
    "text": "It's not clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3613.904,
    "end": 3615.745,
    "text": "It's not necessarily even useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.385,
    "end": 3617.486,
    "text": " for any particular thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3617.506,
    "end": 3619.487,
    "text": "It's not hitting any particular target necessarily.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3619.927,
    "end": 3620.788,
    "text": "It might be after the fact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3620.848,
    "end": 3624.43,
    "text": "It might reveal something to you that you never imagined that made all the difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3624.81,
    "end": 3629.893,
    "text": "Maybe like it juked your defense mechanisms in terms of like your policy selection was leading into garden paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3630.354,
    "end": 3631.715,
    "text": "You're seeing some things and not others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3631.755,
    "end": 3633.195,
    "text": "And then it took the blinders off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3633.215,
    "end": 3635.277,
    "text": "It revealed something to you that you might've missed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3637.293,
    "end": 3643.859,
    "text": " But I'd say that people definitely vary, partially maybe due to things like low-level parameter tunings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3644.339,
    "end": 3653.167,
    "text": "Different people will vary in terms of the natural level of the gain on these systems, the natural tendencies for occupying these different regimes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3654.108,
    "end": 3662.293,
    "text": " And so you'd expect that to vary either through some combination of things best explained at low levels, like different alleles of neuromodulators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3663.513,
    "end": 3666.115,
    "text": "And some of it would be not well explained at that level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3666.175,
    "end": 3669.637,
    "text": "It's more just, that's the way the structure learning happened.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3669.657,
    "end": 3674.24,
    "text": "That's the way the system bootstrapped itself, different kind of agent and everything in between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3674.84,
    "end": 3678.022,
    "text": "So one thing that I find to be like, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3679.546,
    "end": 3698.009,
    "text": " I want to go into is that humanness in general, us as a creative species, that these pathways might have been important for allowing us to be more creative and being able to combine things in a broader range of ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3698.63,
    "end": 3716.688,
    "text": " And that this potentially unlocked a more flexible type of cognition, maybe a greater capacity for analogical reasoning, the kinds of things that might have potentially precipitated this great leap forward in the birth of cognitive modernity, where we became a symbolic species in cultural context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3717.228,
    "end": 3718.41,
    "text": " evolution came off the ground.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3719.531,
    "end": 3732.589,
    "text": "There's an older idea by McKenna called the stoned ape theory, that there was actually a period where we were in this symbiosis with mushrooms, and we're eating psilocybin containing mushrooms, and this actually helped to get that going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3734.291,
    "end": 3735.391,
    "text": " I don't think we could rule that out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3736.112,
    "end": 3745.014,
    "text": "But you could also get something very similar with a couple high impactful mutations along these pathways that doesn't involve a mushroom eating phase.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3745.554,
    "end": 3759.118,
    "text": "And so there still might be a really interesting account of actually the secret of our success as a species is a particularly creative kind of hominid who's able to bring things together in more novel imaginative ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.058,
    "end": 3765.901,
    "text": " that could be involved and being continuous with the story of psychedelics and how they work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3766.661,
    "end": 3770.643,
    "text": "And in the present day, so that obviously, you know, I'm extremely interested in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3771.143,
    "end": 3777.607,
    "text": "And also as a source, you're saying individual difference, like, you know, you know, are there more like to this day, more shamanic personalities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3778.247,
    "end": 3779.968,
    "text": "Are there, you know, are there more, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3782.109,
    "end": 3789.596,
    "text": " And to what degree can this account be told at the level of genes or epigenetics, or is it not well told there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3790.577,
    "end": 3794.16,
    "text": "One, yeah, so those are some thoughts on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3794.77,
    "end": 3798.372,
    "text": " Okay, so wait, now you just like walked into this trap that I laid for you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3798.452,
    "end": 3802.215,
    "text": "So I've now got to ask this next question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3802.695,
    "end": 3808.439,
    "text": "So you talked a lot about psychedelics and sensory deprivation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3808.539,
    "end": 3811.781,
    "text": "And now you want to talk about like our symbiotic relationship with fungi.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3811.882,
    "end": 3812.042,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3812.842,
    "end": 3815.503,
    "text": " And I'm a huge Terrence McKenna fan.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3815.664,
    "end": 3818.305,
    "text": "So if you've read the Archaic Revival, which I'm sure you have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3818.885,
    "end": 3838.295,
    "text": "So where do sensory deprivation in conjunction with psychedelic use, where does that fall on this perceptual, perception action, mental action, alpha, beta, brainwave, serotonin, dopamine spectrum?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3838.415,
    "end": 3839.775,
    "text": "I just want to know your thoughts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3839.795,
    "end": 3840.376,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3841.276,
    "end": 3842.637,
    "text": " Sorry, not sorry, but I'm sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3842.657,
    "end": 3854.706,
    "text": "So I don't know if this exactly gets at it, but it's possible that, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.657,
    "end": 3870.541,
    "text": " this would be rather different, but like, okay, like this is this, we're really going to go into conjecture land here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3871.902,
    "end": 3875.184,
    "text": "But so I forgot what the book is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3875.204,
    "end": 3882.63,
    "text": "It's a recent one about us is so that there's like two domestication books recently about humanness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3885.633,
    "end": 3890.056,
    "text": "So one of them is the goodness paradox and us as a self domesticated species.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3890.076,
    "end": 3894.72,
    "text": "Then there's this other more recent one, but the idea is that this serotonin,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.673,
    "end": 3912.837,
    "text": " pathways, it depends which ones we're talking about, they'll be quite different, but if they are upregulated, let's say of a 1A variety, you could think of that as being more conducive to something like a domesticated phenotype.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.597,
    "end": 3921.339,
    "text": "So if your dopamine is higher and you're more confident in your policy selection, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3926.568,
    "end": 3929.631,
    "text": " that might also cause you to be somewhat impulsive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3930.231,
    "end": 3938.538,
    "text": "And that might make you not necessarily be able to discount utility enough, hold back, think things through a bit more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3939.138,
    "end": 3945.584,
    "text": "And if the dopamine is too high, you might get less cooperativity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.185,
    "end": 3951.929,
    "text": "And so you can think of the serotonin to the patients that it's the 1A in particular as being...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3953.67,
    "end": 3963.397,
    "text": " of a domesticated variety, and things might appear, for instance, less vivid perceptually and imaginatively, in theory, if we're just talking about those pathways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3965.238,
    "end": 3971.142,
    "text": "By the way, for all this, there's so much we don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3972.603,
    "end": 3973.703,
    "text": "So much of this is conjecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3974.204,
    "end": 3978.707,
    "text": "But the 2A does seem to have a little bit more of a dopaminergic character to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3979.637,
    "end": 3995.047,
    "text": " And actually, it seems like that pathway evolved roughly around the time of the Cambrian explosion, around with the advent of jaws in the context of predator-prey arms races.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3995.627,
    "end": 3997.208,
    "text": "And so that might be consistent with like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3998.189,
    "end": 3999.391,
    "text": " a dopaminergic significance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3999.411,
    "end": 4012.546,
    "text": "So this temporarily increasing your confidence, your policy selection, turbocharging your action selection a bit so you can go out and get the goal of either getting your lunch or avoiding becoming lunch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.907,
    "end": 4014.148,
    "text": "And so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4017.705,
    "end": 4024.209,
    "text": " Let's say you're moving into greater gain on imagination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4024.289,
    "end": 4027.171,
    "text": "Let's say we're thinking serotonin, either of the one or two is doing this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4027.671,
    "end": 4032.254,
    "text": "This then might compete with more externally focused perception sensation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4032.274,
    "end": 4040.7,
    "text": "And so you're imagining more, but because your mind's eye is occupied more with your imaginings, you might be attending to the details of the environment a little bit less.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4041.44,
    "end": 4064.244,
    "text": " And so a species or an individual who might have to gain, for whatever reason, higher on these pathways, you might call this a little bit more shamanic or maybe a little bit further on like a schizophrenia-type spectrum, might be perceiving the world slightly less faithfully, but their imagination is now freed up to be more freewheeling and more creative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4064.924,
    "end": 4065.785,
    "text": "And this is allowing for...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4067.885,
    "end": 4068.886,
    "text": " different things to come into being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4068.926,
    "end": 4080.811,
    "text": "So very speculatively, we might think of like Neanderthals as like less domesticated humans, maybe even a little bit more like autism spectrum, but like better able of perceiving the world precisely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4081.611,
    "end": 4088.394,
    "text": "And us, we might have been a little bit more shamanic, a little bit more, although we are the Neanderthals also, because we're all interbred.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4088.874,
    "end": 4094.297,
    "text": "And the variance within is probably bigger, is definitely bigger than the variance between.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4095.458,
    "end": 4109.656,
    "text": " But us, our ancestors and us, we might be somewhat less, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4109.696,
    "end": 4111.499,
    "text": "I don't know if I'd say less dopamine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4111.519,
    "end": 4112.56,
    "text": "I don't know if I'd say that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4112.58,
    "end": 4113.542,
    "text": "So that's what I got for now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4115.577,
    "end": 4116.097,
    "text": " Thanks, Adam.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4117.938,
    "end": 4119.219,
    "text": "Great presentation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4119.919,
    "end": 4123.681,
    "text": "Just wanted to make two quick notes and then ask some questions from the chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4123.721,
    "end": 4126.622,
    "text": "So the first is there's no free lunch with strategy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4127.183,
    "end": 4131.905,
    "text": "So there's niches that are just unwinnable where the phenotype cannot exist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4133.228,
    "end": 4138.212,
    "text": " And then there's other niches where potentially a broad range of phenotypes all can proliferate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4138.873,
    "end": 4148.44,
    "text": "So whether or not a given strategy is successful or under what cases a given kind of neuromodulatory state is good or bad by what metric.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4149.414,
    "end": 4153.195,
    "text": " There's just no single free lunch or preference for lunch food.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4153.795,
    "end": 4158.616,
    "text": "Then the second point was the complex gene family point was very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4159.316,
    "end": 4164.338,
    "text": "And you mentioned some other receptors in the serotonin receptor family.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4165.098,
    "end": 4172.54,
    "text": "And there are many receptors, including ones that don't have nice, clean names like number one and number two and number three.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4172.56,
    "end": 4172.6,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4174.0,
    "end": 4174.82,
    "text": " At least 14.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4175.2,
    "end": 4175.4,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4175.701,
    "end": 4188.384,
    "text": "So how to go about investigating function in these massively interacting and often redundant, like if seven does something, but only when eight is gone, what's the actual mechanism there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4188.905,
    "end": 4190.865,
    "text": "So here's some questions from the chat.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4190.925,
    "end": 4193.606,
    "text": "So first question from the chat, Stephen asked,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4195.003,
    "end": 4200.049,
    "text": " Interested in the approximately three second window of conscious awareness Adam mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4200.309,
    "end": 4206.055,
    "text": "Does that trace back to William James stream of consciousness, awareness and the temporal scale scales of experience?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4208.418,
    "end": 4208.959,
    "text": "I believe so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4208.979,
    "end": 4216.287,
    "text": "So it's kind of like a three second echo is our experience or what does the three seconds represent?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4217.802,
    "end": 4228.65,
    "text": " So the empirically established phenomenon is there seems to be stitching things together into one continuous unfolding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4229.05,
    "end": 4230.852,
    "text": "There seems to be a three-second upper bound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4231.874,
    "end": 4250.48,
    "text": " Within this continuous unfolding, I believe there is relevance to James's specious presence and Edelman's remembered presence, this idea of a kind of anticipatory prediction and looking ahead and a postdictive going back to, and you're moving back and forth of yourself in this unfolding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4251.4,
    "end": 4269.05,
    "text": " And the speculative part is I am suggesting that this might correspond to a hippocampal entorhinal tiling of space, either a physical space or a conceptual space within which you're doing this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.59,
    "end": 4277.835,
    "text": "And that the reason this upper bound would be the length of time you have before you need to refresh the attractors and retile.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.895,
    "end": 4279.456,
    "text": " speculative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4279.857,
    "end": 4285.003,
    "text": "And the idea would be that this would correspond to something like these sharp wave ripples that you observe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4286.786,
    "end": 4287.406,
    "text": "We don't know for sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4287.927,
    "end": 4289.868,
    "text": " It's a perfect lead into this second question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4290.088,
    "end": 4292.829,
    "text": "And then I have another comment from Cambridge Breaths.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4293.049,
    "end": 4295.17,
    "text": "So what you just said about ripples.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4295.83,
    "end": 4308.336,
    "text": "So they wrote, wonder if investigating cortical traveling waves via neural mass biophysical modeling approaches, in particular, the work of Wilson Callan can contribute to this work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4308.896,
    "end": 4309.656,
    "text": "If yes, how?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4310.196,
    "end": 4311.697,
    "text": "Many thanks for elaborations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4313.755,
    "end": 4321.905,
    "text": " Timmerman, in collaboration with Robin Carrad-Harris, has done some really interesting work along those lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4321.925,
    "end": 4331.376,
    "text": "I believe it was with DMT, looking at traveling waves, I believe in the alpha frequency, as evidence for the Rebus models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4332.057,
    "end": 4347.591,
    "text": " And so the idea would be that if you are actually relaxing your belief landscape, you might get a reduction of like traveling waves of predictions going down towards the periphery, and maybe greater inward going prediction error waves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4348.331,
    "end": 4350.013,
    "text": "And, and so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4351.761,
    "end": 4359.125,
    "text": " Some work has been done along those lines already by Timmerman and others that's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4359.985,
    "end": 4365.388,
    "text": "And as I was saying before, so although I'm like introducing additional factors, I do not think Rebus is wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4365.428,
    "end": 4375.813,
    "text": "I just want to add a couple additional details of like some of the contributions from modulations of cortical microcircuitry might be different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4375.833,
    "end": 4380.815,
    "text": "You might be able to get Rebus effects from a variety of ways, not just from this desynchronization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4382.199,
    "end": 4384.942,
    "text": " But before I forget, earlier you were saying about free lunches.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4385.843,
    "end": 4386.324,
    "text": "Absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4386.364,
    "end": 4392.111,
    "text": "And I think this is part of, for instance, let's say, why don't we just crank it all to the max?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4393.412,
    "end": 4399.319,
    "text": "If each one has its own function, it'll be depending on the niche you're in, both generally and locally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4400.691,
    "end": 4403.753,
    "text": " talking about dopamine, too much dopamine, you might be impulsive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4404.294,
    "end": 4407.636,
    "text": "Too little, you might not strike while the iron's hot and you might miss opportunities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.437,
    "end": 4413.36,
    "text": "Too little 1A, you might be irritable and impulsive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4413.46,
    "end": 4413.841,
    "text": "Too much,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4415.443,
    "end": 4424.81,
    "text": " opposite problems to a too much, it could generate over time, a kind of psychotic predisposition, that would be a loss of a free lunch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4425.671,
    "end": 4428.933,
    "text": "The one more thing that you're mentioning is, okay, yeah, it's not just these two receptor classes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4429.914,
    "end": 4431.675,
    "text": "There's actually, you know, 14 conservatively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4432.316,
    "end": 4439.661,
    "text": "And so one thing I'm wondering, though, is whether you get kind of like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4441.633,
    "end": 4444.156,
    "text": " this is potentially wishful thinking, but potentially not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4446.399,
    "end": 4456.151,
    "text": "You get the lion's share by considering a couple and that there might be like an order in which they evolved and a ubiquity of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4457.503,
    "end": 4463.207,
    "text": " where the ubiquity would be one sign for how important it is to figure these things out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4463.267,
    "end": 4471.372,
    "text": "So the broader the distribution, in theory, the more you get from explaining the ones with the broadest distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4471.392,
    "end": 4476.595,
    "text": "And so the 1A and 2A have this extremely extensive cortical and subcortical distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4477.736,
    "end": 4479.036,
    "text": "But that's not necessarily the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4479.457,
    "end": 4482.038,
    "text": "You could have, for instance, a pivotal areas of the brainstem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4482.078,
    "end": 4484.44,
    "text": "You're right on top of the core value signals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4485.14,
    "end": 4488.781,
    "text": " you know, one class of receptor there, that could be the difference that makes all the difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4490.781,
    "end": 4508.486,
    "text": "Another aspect of the hope that you can, you know, make progress incrementally, you know, with the goal, ultimately, you know, we're going to want to get every single last one of these receptor classes, is that the other, the additional ones might have a common",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4509.562,
    "end": 4517.307,
    "text": " organismic cybernetic significance, but they're different because of their different locations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4517.967,
    "end": 4533.017,
    "text": "And so that their functional account might still correspond to, let's say, overall levels of serotonin, overall levels of some neurohormone or blood acidity or some other homeostatic state or state of challenge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4533.777,
    "end": 4555.845,
    "text": " And so that the active inference significance might be the same, but you're tweaking differently in different neural systems so that the overall coordinated effect is coherent with respect to your expected free energy, with respect to realizing organismic value or minimizing prediction error with respect to the prediction of you doing the things you need to do as a successful being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4557.976,
    "end": 4571.246,
    "text": " And so one more thing though is, I'll throw off the 2C idea, is potentially with these gene, I don't know how far we can go with this, but with this idea of like, so with a gene duplication event,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4572.179,
    "end": 4587.473,
    "text": " Once you have two copies of the gene, this allows you to basically take one of the copies, because you've got a spare that's still doing the same thing, and now this other one can mutate and can separately be optimized by evolution to take on a different function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4588.054,
    "end": 4593.919,
    "text": "And so the idea is that there might have been a common ancestor that looked a little bit more 1A-like, but that at the extreme levels of it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4594.54,
    "end": 4598.083,
    "text": " during this gene duplication event, this became the 2A receptor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4598.603,
    "end": 4601.465,
    "text": "And maybe this goes one step further to the 2C.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4601.545,
    "end": 4602.006,
    "text": "I'm not sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4602.426,
    "end": 4607.77,
    "text": "But maybe we go a couple steps further with this kind of gene duplication story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4608.531,
    "end": 4618.339,
    "text": "And what we're corresponding to is peeling out in a modular fashion, optimizing for particular regimes of organismic significance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4619.244,
    "end": 4621.405,
    "text": " Are there going to be 14 to 17?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4622.265,
    "end": 4622.765,
    "text": "I'm skeptical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4622.785,
    "end": 4623.325,
    "text": "I don't think it's that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4623.365,
    "end": 4645.832,
    "text": "I suspect it's like maybe three or four top stories of this kind and that the other receptors, it's these core two to four stories, probably three, maybe, being achieved by having different functions locally, but in their coordinated activity, the same story globally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4647.435,
    "end": 4647.695,
    "text": " Nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4647.735,
    "end": 4656.32,
    "text": "There could be a lower dimensional manifold that gives a lot of resilience and also evolvability for the system and learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4657.06,
    "end": 4671.868,
    "text": "And one thing we've talked about before, but it's interesting to think about is in your presentation, you did a really awesome job of connecting the general kind of dynamical systems and inference questions to specific human regions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4672.668,
    "end": 4677.569,
    "text": " And then it's interesting to ask, okay, well, insects have a different brain layout.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4677.729,
    "end": 4678.99,
    "text": "They don't have the entorhinal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4679.53,
    "end": 4690.213,
    "text": "So we can juxtapose cognitive systems and learn a lot about which attributes of the computation are necessary and sufficient.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4690.273,
    "end": 4697.175,
    "text": "So I wanted to ask which cognitive systems you thought were interesting to study in that sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4700.812,
    "end": 4709.776,
    "text": " I have an intuition and a hope that may or may not pan out that the extent of convergence is fairly substantial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4710.356,
    "end": 4713.217,
    "text": "Now, things can, I think, flip in all sorts of ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4713.237,
    "end": 4715.438,
    "text": "I wouldn't just assume this is correct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4716.417,
    "end": 4719.598,
    "text": " But let's say we're talking about within an insect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4721.318,
    "end": 4728.159,
    "text": "We would potentially look to the central complex, which has a lot of hippocampal entorhinal functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4728.699,
    "end": 4738.521,
    "text": "And it might actually be an even better system to study in terms of you would have complete access, theoretically, to the whole.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4739.902,
    "end": 4743.222,
    "text": "You'd have a much richer access via something like calcium imaging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4748.305,
    "end": 4755.49,
    "text": " That could be looking at something like the attractor dynamics of… There's experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4755.51,
    "end": 4762.455,
    "text": "Let's say they take fruit flies, they put them on top of a little Styrofoam bowl and hook them up to virtual reality, and they have them doing different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4762.955,
    "end": 4772.202,
    "text": "You look at the central complex while it's doing that under different states of neuromodulation, and we might see common organismic significances",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4772.822,
    "end": 4779.267,
    "text": " and a common computational account in terms of the mapping space and policy selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4779.827,
    "end": 4781.368,
    "text": "Now, how far back does this go?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4782.129,
    "end": 4785.651,
    "text": "Some of this logic might even play out at the level of individual cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4786.331,
    "end": 4789.594,
    "text": "And either, for instance, 1a versus 2a,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4796.431,
    "end": 4801.695,
    "text": " So low levels of serotonin seem to have an effect of strengthening cytoskeleton dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4802.356,
    "end": 4809.642,
    "text": "And so that would promote like an organism kind of staying in place, but high levels actually destabilize the cytoskeleton.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4810.223,
    "end": 4817.089,
    "text": "And so they'll actually like literally create plasticity and fluidity of the morphology and allow the organism to move around more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4817.689,
    "end": 4824.094,
    "text": "And so some of these accounts might go all the way back to the, like near the origins of life and individual cells and metabolism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4825.135,
    "end": 4826.255,
    "text": " How far we can go, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4826.996,
    "end": 4832.457,
    "text": "And so some of these might have even been repurposed for the different social insects communicating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4833.097,
    "end": 4836.858,
    "text": "Although you could see these things flipping, because what goes in the individual doesn't have to be the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4836.898,
    "end": 4845.44,
    "text": "In fact, because you have things in one significance on the individual level, that might mean that has the opposite significance at the group interactive level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4846.66,
    "end": 4852.442,
    "text": "But I think it'd be extremely rich, my kingdom for that science to be done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4855.216,
    "end": 4856.537,
    "text": " Lou, do you want to ask a question?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4857.597,
    "end": 4859.098,
    "text": "I will jump in here, actually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4860.578,
    "end": 4873.704,
    "text": "You know, when we talk about the origin of life, you mentioned earlier in your talk that the third person perspective is related to imagination and creativity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4873.764,
    "end": 4876.205,
    "text": "And this goes back to kind of what I was asking earlier.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4877.866,
    "end": 4882.308,
    "text": "But is it so much that the third person perspective is related to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4883.069,
    "end": 4894.828,
    "text": " this kind of like coming outside of ego and looking at yourself, you know, from this kind of meta perspective, or is it just fundamentally the dissolution of the self?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4895.328,
    "end": 4896.731,
    "text": "Like how much does an ant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4897.352,
    "end": 4911.943,
    "text": " think about themselves or like a bacterial that's part of a micro or a biofilm, like how much of, of that is imagination, like looking at themselves as part of a whole, or that's just like myself doesn't matter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4911.963,
    "end": 4914.525,
    "text": "I'm part of this bigger unit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4917.467,
    "end": 4921.33,
    "text": "So like, if you're part of a well-coordinated collective,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4922.748,
    "end": 4934.299,
    "text": " there's a sense that within active inference, you will have converged on a shared generative model for your coherent inaction that you're taking part in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4934.899,
    "end": 4943.707,
    "text": "And so your role of what's being enacted, there's a sense in which it's not exactly like on some level,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4944.728,
    "end": 4950.113,
    "text": " in some way, there is information of some kind, which is not necessarily egocentric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4950.594,
    "end": 4962.044,
    "text": "In fact, it's like your role allocentrically within the thing, even if on some level, it's like what you as generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4962.992,
    "end": 4969.298,
    "text": " if you were to give the generative modeling process as a whole a perspective, it's not egoic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4969.418,
    "end": 4971.8,
    "text": "It's not necessarily from a first-person point of view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4971.82,
    "end": 4979.547,
    "text": "It's from the coordination manifold of the group that's doing this common thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4979.567,
    "end": 4981.609,
    "text": "Am I kind of getting it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4981.969,
    "end": 4983.23,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4985.172,
    "end": 4985.732,
    "text": "Yeah, that's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4988.945,
    "end": 4995.202,
    "text": " It's interesting like developmentally, if we were to kind of take when these different perspectives of different kinds",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4996.707,
    "end": 4998.467,
    "text": " come online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4998.727,
    "end": 5004.468,
    "text": "For instance, right out the gate, it's not clear to me that we have, for instance, coherent egos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5004.748,
    "end": 5007.469,
    "text": "It's not clear we attain to this right out the gate when we're born.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5008.249,
    "end": 5014.83,
    "text": "And so there's a sense, by default, the infant might be egoless.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5015.07,
    "end": 5020.971,
    "text": "And by default, it's doing this more inactive coupling with its caregivers and this sort of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5021.171,
    "end": 5025.472,
    "text": "And it's not yet actually being enslaved to an egocentric point of view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5027.333,
    "end": 5036.837,
    "text": " There's kind of an interesting thing with language where it's actually like the ego itself seems like when we use it like in like psychodynamic terms is actually, so we say ego is such a perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5036.877,
    "end": 5038.538,
    "text": "It's like the I and it's the first person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5038.978,
    "end": 5042.42,
    "text": "But when you say like ego as like a kind of like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5043.24,
    "end": 5051.486,
    "text": " extended unfolding of you that's in the world and all like your possessions and your sense of yourself within a social context, that actually is more third person-y.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5051.526,
    "end": 5064.615,
    "text": "So it's like ego in terms of perspective is more first person-y, but ego as like psychodynamic concept and the kind of thing you might want to modify with a psychedelic is actually more of a third, seems like a little bit more like a third person point kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5065.676,
    "end": 5072.341,
    "text": "And so now the question would be though, like maybe there's like an implicit allocentricity or non-egoicness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5074.651,
    "end": 5076.193,
    "text": " being enacted by any coupling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5076.634,
    "end": 5079.197,
    "text": "And maybe that's like the primal, like the primal, the primordial state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5080.579,
    "end": 5085.825,
    "text": "And then you attain to an egocentric perspective, but there seems like there's like another kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5089.119,
    "end": 5097.008,
    "text": " more psychodynamic ego or objectification of self, the third person, of taking an explicit perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5099.011,
    "end": 5107.08,
    "text": "It's actually first person and that you're perceiving it from a point of view, but it's fictitious and you're taking the view on yourself as if from without.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5108.061,
    "end": 5117.667,
    "text": " And that might come later in development at some point, maybe through enactments of mirroring between infants and caregivers or between conspecifics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5117.687,
    "end": 5124.652,
    "text": "But if you're mirroring with others, then you might be able to establish these cross-mappings between what you do and what someone else does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5125.252,
    "end": 5131.376,
    "text": "And this could potentially help you to create representations that you can then harness for viewing you as if from the outside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5133.43,
    "end": 5138.056,
    "text": " When we say self, when we say ego, what kind of ego, what kind of self?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5138.917,
    "end": 5140.699,
    "text": "But it seems like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5144.429,
    "end": 5151.572,
    "text": " There's a primordial, like minimal self-egocentricity of just seeing from behind your eyes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5152.113,
    "end": 5163.418,
    "text": "But then there's more like a psychodynamic ego slash me, which is involving the objectification of you, adopting a perspective on you imaginatively.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5164.458,
    "end": 5178.828,
    "text": " as if you were viewing yourself from without, and then contextualizing yourself across space and time and in different contexts, different social unfoldings, as what you would need for something like an autobiographical self, something of that nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5180.189,
    "end": 5182.47,
    "text": "So how does an ant see it, though?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5182.65,
    "end": 5185.712,
    "text": "Does an ant have, like, is the first person gone?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5185.732,
    "end": 5190.616,
    "text": "Or, like, is an ant entirely meta all the time or a bacterium?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5191.016,
    "end": 5194.098,
    "text": "Is that, like, a total meta perspective and they don't have to go through this, like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5194.577,
    "end": 5202.62,
    "text": " ridiculous like self like whatever creating and dissolving loop or dana would know better than i would",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5204.158,
    "end": 5205.279,
    "text": " You actually have to ask the ants.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5205.339,
    "end": 5206.36,
    "text": "That's kind of the hard part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5206.781,
    "end": 5208.823,
    "text": "But can I make one comment?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5208.943,
    "end": 5225.181,
    "text": "The difference between the egocentric and then the more impartial or autobiographical reminded me a lot of the projective consciousness model, projective geometry model, which was also integrated with higher order theories and global workspace and a lot of those other topics with...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5226.543,
    "end": 5241.179,
    "text": " Ryan Smith and Christopher White and also the more geometrical work with Rudroff and others because it's like we do need both those modes we need the one where the hands are bigger when they're closer to your face and we need the one where it's like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5241.86,
    "end": 5245.364,
    "text": " you're playing the video game with a third person view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5246.125,
    "end": 5260.761,
    "text": "And then it was really interesting when you point to a lot of the seen as deficits of memory or cognition, like false memory, but just seeing them as computational outcomes of stochastic, interoceptive,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5261.642,
    "end": 5283.077,
    "text": " lossy compression and generalization semantic encoding what's more likely who kind of person are you that's going to you know scale whether you think you did something or not so that's just such a interesting area that you kind of took it down thank you it's interesting bringing up like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5284.71,
    "end": 5291.434,
    "text": " Rudolph, because there's some things like I'd wonder, like, you know, when do you first get the capacity for projected geometric modeling of what kinds?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5292.375,
    "end": 5298.219,
    "text": "And so like, this, so with and what's the nature of the projected geometric model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5298.279,
    "end": 5300.8,
    "text": "Like, is this something that should I stop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5300.94,
    "end": 5301.581,
    "text": "I can stop the sharing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5302.421,
    "end": 5303.342,
    "text": "There we go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5303.742,
    "end": 5307.665,
    "text": "Is this something that you would expect at the level of like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5308.615,
    "end": 5312.997,
    "text": " cortical microcircuitry, like some interpretation of what cortical macro columns are doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5313.697,
    "end": 5321.801,
    "text": "Or is this something that's actually more complex and it's like a distributed algorithm, like Hinton has ideas like Glom that kind of get at something like this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5322.861,
    "end": 5331.065,
    "text": "Because what you have with this projected geometric model is the ability to flexibly move between egocentric and allocentric perspectives.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5331.085,
    "end": 5336.628,
    "text": "I can take your point of view or mine once I raise everything or boost it up into this...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5338.462,
    "end": 5346.188,
    "text": " I forget, is it hyperbolic or whatever the space is that he puts it in, from within there, you can embed either one and move between them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5347.269,
    "end": 5351.732,
    "text": "The thing I'm wondering is the nature of these, I just mentioned this ability to...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5356.024,
    "end": 5357.686,
    "text": " take fictitious points of view on you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5358.147,
    "end": 5372.386,
    "text": "I'm wondering whether like the way in which we do that is a lot more derived and a kind of skill of moving between things like the representations you might've acquired through mirroring with others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5373.496,
    "end": 5385.707,
    "text": " And to take another perspective, rather than it being something that the visual system can just do, of moving between, of automatically translating from points of view within this higher space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5385.767,
    "end": 5386.968,
    "text": "What is the nature of that model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5387.589,
    "end": 5391.973,
    "text": "I've even wondered, for instance, is perception actually always 2D?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5393.789,
    "end": 5396.55,
    "text": " And in a holographic way, it's always a 2D projection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5396.59,
    "end": 5409.896,
    "text": "And when we talk about something like depth, it's actually either some sort of sense of affordance, or intercept of cross mapping, or the likely transitions between 2D, or even 3D.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5409.917,
    "end": 5413.198,
    "text": "Like Mara said, it was like 2.5D vision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5413.538,
    "end": 5418.841,
    "text": "Is that just the ability to make sure that what's on the screen that's 2D is always",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5419.841,
    "end": 5422.943,
    "text": " coherent or that you move between as if you can move around the thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5423.424,
    "end": 5427.907,
    "text": "But we actually never perceive anything in 3D in terms of our visuospatial awareness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5428.628,
    "end": 5432.151,
    "text": "But to loop around to the ant, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5432.531,
    "end": 5443.659,
    "text": "But you might distinguish, for instance, if you consider the perspective of the ant itself as generative model, then that might be by default",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5444.56,
    "end": 5449.666,
    "text": " more allocentric, especially because of what it's specifically doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5454.512,
    "end": 5456.834,
    "text": "It's fundamentally part of the superorganism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5456.854,
    "end": 5461.359,
    "text": "It's not even a superorganism, like Daniel says.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5461.82,
    "end": 5464.923,
    "text": "The unit that makes sense that's being selected is the shared enactment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5465.834,
    "end": 5475.386,
    "text": " But then if you go maybe like the attractor dynamics of like the central complex, it's like quasi-hippocampal, quasi-thalamic thing, that might be more egocentric.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5476.628,
    "end": 5478.871,
    "text": "And I don't think you're going to get... Go on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5480.868,
    "end": 5481.969,
    "text": " Just totally agree with that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5482.089,
    "end": 5498.487,
    "text": "I think it's an established fact that the compass heading or the polarization of light is processed within one nestmate head and then there are collective decisions like the sex ratio of the larva that they're going to keep or the overall regulation of foraging that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5499.403,
    "end": 5508.647,
    "text": " wouldn't be expected to have even a correlate necessarily in the head capsule of any single nestmate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5509.307,
    "end": 5526.335,
    "text": "And so I think that's where the discussion comes to like multi-scale systems, which is kind of a fun topic because in multi-scale systems, we see sometimes a clean mechanistic difference between the lateral and the kind of vertical or the nesting of systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5526.735,
    "end": 5527.676,
    "text": "So like communication,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5528.536,
    "end": 5552.027,
    "text": " we can see the interface where you have the lateral layer of individuals and then where you have the layers that are inside of the individual it's a little harder to disentangle it if they're all like kind of cross wire but um what are you or blue do you want to ask a question otherwise",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5552.332,
    "end": 5561.336,
    "text": " Yeah, I mean, it just makes me think of how like, are we fundamentally broken with our like, self little egocentric loop, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5561.376,
    "end": 5561.856,
    "text": "Like that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5562.877,
    "end": 5567.499,
    "text": "Are we maybe like measuring forever the incorrect scale of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5568.199,
    "end": 5596.865,
    "text": " stuff like should we maybe be more concerned about like the scale of all of us together or the scale of all of the parts that make up us instead we like kind of falsify and create like our ego and our relationship we like project a lot about how we think we should be within the world or how we think things are within us that like we don't actually know anything about I don't know just related to that I mean",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5599.107,
    "end": 5603.992,
    "text": " It's definitely beyond neuroscience, but I'd say yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5604.973,
    "end": 5616.984,
    "text": "But also, I both think this is one of the most valuable and fraught parts of psychedelic and discourse around psychedelics and meditation also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5617.901,
    "end": 5625.403,
    "text": " where it's like, if you get this myopic egocentric perspective, that's going to be a real problem for multiple reasons.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5625.663,
    "end": 5635.425,
    "text": "It's even for you, it's going to be a problem because you see things from one way, you're going to get owned by yourself as a kind of like, you'll get trapped in all sorts of local, you see things in one way, you really barely see it anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5637.225,
    "end": 5640.666,
    "text": "But I do worry a little bit though about the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5642.466,
    "end": 5653.575,
    "text": " overly, you know, egos get themselves in trouble, but like the ability to stitch together, for instance, you know, there is like a unit over which you have potentially maximum purchase.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5654.315,
    "end": 5661.821,
    "text": "And then like in terms of influence, and there's a sense in which like you're the steward of that because like the causal closure is densest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5662.622,
    "end": 5667.325,
    "text": "And there's also a sense in which like, let's say I want to coordinate with others and,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5668.706,
    "end": 5687.962,
    "text": " um including myself across time like the ability to like have a narrative structure uh the ability that's going to be helpful for not like just jumping at whatever source of utility or or expected for energy comes along and so like to basically avoid being um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5690.083,
    "end": 5691.264,
    "text": " functionally psychopathic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5691.745,
    "end": 5700.194,
    "text": "Like you kind of need the ego, but you also need to have the ego not be too tight to avoid being functionally psychopathic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5701.075,
    "end": 5703.738,
    "text": "So it's like not too tight, not too loose.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5704.138,
    "end": 5706.301,
    "text": "Otherwise the whole thing's wrecked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5707.711,
    "end": 5723.724,
    "text": " That sounds like narrative stigmergy, like agent environment feedback loops, and also of the scripts research that we've talked about previously with Alderaan and others, where that's sort of the top-down prior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5725.285,
    "end": 5744.878,
    "text": " it's related to what you said about the hard problem as to if or why or why not there would be awareness of experience at for example the bodily level versus the you know tripartite zoom chat level um but at the very least instrumentally those top level scripts",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5745.718,
    "end": 5768.954,
    "text": " are the narratives that decide like are we going to put everybody you know through a tunnel where only this exact width is going to make it through or is that a phenotype that we have a lot of ambiguity around using the bayesian prior term so um it is interesting how it and i almost want to ask you whether you started with the more neuro side",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5769.71,
    "end": 5779.243,
    "text": " and found it broaching to these questions or whether you started maybe focused on other areas and then saw the brain's specifics as increasingly important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5799.261,
    "end": 5807.81,
    "text": " There's so little separation for me between the neuroscience obsession and the existential.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5808.25,
    "end": 5812.715,
    "text": "I'm constantly in a state of existential freakout and neuroscience obsession that I don't know which led which.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5813.335,
    "end": 5815.678,
    "text": "I don't know who's the dog, who's the tail, and who's wagging whom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5816.178,
    "end": 5819.641,
    "text": "It's just constant existential crisis and obsession.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5827.312,
    "end": 5842.289,
    "text": " What would be advice to somebody who's curious about the field or they want to be working in an interesting area of neuroscience and embodiment and everything that you kind of mentioned today?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5847.569,
    "end": 5864.416,
    "text": " it seems like if someone wants to focus on psychedelics, the best route is to cut your teeth or to like basically get a home outside of psychedelics, establish a competency there, and then try to bring that within the psychedelic domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5864.436,
    "end": 5869.278,
    "text": "That seems like the best path that most people who succeed in this space take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5872.66,
    "end": 5872.76,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5874.577,
    "end": 5890.764,
    "text": " Yeah, so it's the standard fraught thing of academia where it's like you're trying to not be an inch wide and a mile deep, and you're trying to not be a jack of all trades, master of none, and where the perverse incentives abound.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5891.404,
    "end": 5896.727,
    "text": "And good luck.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5896.987,
    "end": 5901.649,
    "text": "Like some combination of like, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5905.087,
    "end": 5913.256,
    "text": " both paying your dues and not optimizing yourself into a brittle straight jacket where you can't see anything past the next grant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5916.48,
    "end": 5916.76,
    "text": "Yikes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5919.283,
    "end": 5919.724,
    "text": "I feel you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5919.744,
    "end": 5919.824,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5924.431,
    "end": 5946.774,
    "text": " thanks for the answer so one small question from the chat and then if anyone else has any final questions so adam thanks for your time and the great presentation and cool work and hanging out with us so adam mentioned the dmt paper with respect to the cortical traveling waves the question was wonder if there's any other work on non-alpha waves and then just",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5947.847,
    "end": 5955.483,
    "text": " If you know about that, and then just a little more generally, why do these traveling waves matter or what matters if they are important or not?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5957.58,
    "end": 5967.928,
    "text": " So there's a sense in which, like I drew like those swaths, those like synchronous complexes, but those are necessarily a core screening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5968.388,
    "end": 5971.51,
    "text": "You zoom in on them and it's like, so what's the ontological status?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5971.89,
    "end": 5976.894,
    "text": "It has a certain relational realism and that the extent that makes sense, like draw that out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5976.954,
    "end": 5979.916,
    "text": "It's like active inference in general with Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5980.497,
    "end": 5983.359,
    "text": "It's like you can, it's relative to what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5983.999,
    "end": 5989.641,
    "text": " other system that's engaging in what types of inference they'll just decide like the scope of relevance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5990.221,
    "end": 6004.325,
    "text": "I mean, there's additional like auto poetic self organizing elements of like the internal but so like if you look though it like a synchronous like an alpha like beta alpha you zoom in, it's actually comprised of these traveling waves is more of a fine grained description.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6004.725,
    "end": 6008.946,
    "text": "Although you zoom in on that, that's actually a coarse graining of population level activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6010.226,
    "end": 6011.887,
    "text": "And so it'll depend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6012.227,
    "end": 6012.827,
    "text": "So there's going to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6014.723,
    "end": 6019.684,
    "text": " potentially, if you're looking at traveling and cortical waves, that might be useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6020.364,
    "end": 6026.346,
    "text": "So I focus on like the standing wave description as like a joint belief over whatever is in its scope.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6026.806,
    "end": 6040.729,
    "text": "But if you're talking about something like predictive processing within the model, you might want to zoom in on the standing wave or the standing of description for like the business end of passing on your predictions, then kicking up your prediction errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6041.229,
    "end": 6042.249,
    "text": "But depends like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6044.537,
    "end": 6049.98,
    "text": " It depends on the, within the multi-scale account, what's of interest for the modeler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6052.201,
    "end": 6053.642,
    "text": "One quick thing from the side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6054.703,
    "end": 6059.706,
    "text": "And on the alpha wave question, whether there's any non-alpha wave traveling wave papers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6060.888,
    "end": 6061.548,
    "text": " I don't think so.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6062.209,
    "end": 6065.431,
    "text": "I think the one, I think the Timmerman one was focusing on alpha.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6065.471,
    "end": 6070.234,
    "text": "If I'm remembering, I could be misremembering, I think, but there are four psychedelics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6073.796,
    "end": 6081.661,
    "text": "Terry Sanowski, I think would be the person to look at for some really good general biophysics of traveling waves in the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6081.681,
    "end": 6082.622,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6083.582,
    "end": 6085.483,
    "text": " Yeah, Sanowski, I think, would be the place to look.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6086.184,
    "end": 6087.485,
    "text": "Quick aside on DMT.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6088.105,
    "end": 6090.047,
    "text": "Like I mentioned, there might be endogenous DMT.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6090.907,
    "end": 6093.369,
    "text": "There's debate over how significant it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6093.449,
    "end": 6096.111,
    "text": "So some people say it's not significant at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6096.171,
    "end": 6097.932,
    "text": "Some people say it's very significant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6098.032,
    "end": 6102.635,
    "text": "So it's one place we know that it's produced is in the pineal body, the seat of the soul.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6103.456,
    "end": 6104.176,
    "text": "And it's...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6106.921,
    "end": 6116.371,
    "text": " another place, and there's some evidence, but some people have questioned it, that it might be almost akin to like a neurotransmitter system in its own right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6116.391,
    "end": 6117.652,
    "text": "We just didn't know how to look at it before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6117.672,
    "end": 6118.173,
    "text": "Jimbo,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6120.677,
    "end": 6125.62,
    "text": " Borgen at University of Michigan, if you're interested in that issue and that debate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6126.221,
    "end": 6140.23,
    "text": "But it's possible, though, one of the main endogenous ligands, we don't know, of the 5-HG2A system, one of the main stimulants might not actually be serotonin, but might be DMT.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6140.29,
    "end": 6142.752,
    "text": "So under, let's say, a limit experience,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6144.893,
    "end": 6151.715,
    "text": " you know, so one, like I mentioned, like carbon dioxide can do it, or maybe lactic acid, like you're, you're running for your life or for your, your lunch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6151.775,
    "end": 6154.115,
    "text": "And it's super high levels of blood acidity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6154.695,
    "end": 6157.636,
    "text": "And that might be activating these proto psychedelic pathways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6158.536,
    "end": 6167.218,
    "text": "But another one could be like potentially DMT mediated and things like sex birthing and near death experiences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6167.659,
    "end": 6169.499,
    "text": "So like you almost bled out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6170.799,
    "end": 6172.14,
    "text": "Maybe it's time to relax your beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6172.74,
    "end": 6173.02,
    "text": "You're,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6173.9,
    "end": 6176.744,
    "text": " about to bond with another creature for years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6177.305,
    "end": 6183.515,
    "text": "Maybe this is part of how you do it, whether bonding with a mate or your offspring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6186.223,
    "end": 6187.084,
    "text": " Very speculative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6187.124,
    "end": 6188.045,
    "text": "These are early days.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6188.385,
    "end": 6188.965,
    "text": "Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6189.226,
    "end": 6208.042,
    "text": "And also made me think about brain and body, dopamine and serotonin, other neurotransmitters in the blood, in the blood vessels, the immune system, and then neuropeptides, the whole continuum of short-acting neurotransmitters to slower-acting phenomena.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6208.322,
    "end": 6208.602,
    "text": "And then...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6209.543,
    "end": 6228.618,
    "text": " oh, we're thinking about it from a nested multi-scale systems perspective with this kind of more local faster and then slower, broader spatial scales, which just has a lot of analogy with everything from regional governance to the regulation of tissue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6229.098,
    "end": 6233.562,
    "text": "So it's kind of an interesting idea how a lot comes together there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6234.863,
    "end": 6238.946,
    "text": "It also made me think of how staring into someone else's eyes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6239.537,
    "end": 6251.228,
    "text": " for like a prolonged period of time, induces like violent, disturbing hallucinations, which is like reported in, I don't know, some paper, I can't remember, but I'll look it up and see if I can post it in the chat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6251.268,
    "end": 6264.481,
    "text": "But it's interesting how like thinking through others' minds or like looking through others' eyes is so violently incorrect to us that it's perceived as like an altered perception.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6266.932,
    "end": 6285.722,
    "text": " I wonder if this is speaking to the way in which we bootstrap objectified selfhood and me, but because we do it so much, this is a core axis of imagination and perception that you can create these weird feedback loops.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6286.543,
    "end": 6288.484,
    "text": "I also wonder how much it varies across people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6288.624,
    "end": 6292.666,
    "text": "If you're really far on the autism spectrum,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6294.286,
    "end": 6306.571,
    "text": " or far in a schizophrenia spectrum, like, would you like in a moment, like you look in someone's eyes and it's like, it takes you two seconds to enter like the psychedelic space or might it take like, you know, you got to sit there for like an hour.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6306.591,
    "end": 6307.412,
    "text": "Like, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6308.492,
    "end": 6310.233,
    "text": "This test was like, I think 10 minutes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6310.813,
    "end": 6312.994,
    "text": "So I'll find it right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6313.554,
    "end": 6314.335,
    "text": "Post it in the chat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6314.515,
    "end": 6315.455,
    "text": "Happening to me right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6317.356,
    "end": 6319.217,
    "text": "Well, Adam, not your first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6320.367,
    "end": 6326.515,
    "text": " active live stream, not your last, but thanks for joining and sharing this cool work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6327.296,
    "end": 6331.922,
    "text": "We hope to see you around the lab and just in the area.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6332.342,
    "end": 6334.645,
    "text": "So always a pleasure and an honor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6334.665,
    "end": 6335.747,
    "text": "Talk to you later.",
    "speaker": "SPEAKER_02"
  }
]