[
  {
    "start": 9.785,
    "end": 11.229,
    "text": " Hello, welcome everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.871,
    "end": 18.571,
    "text": "It's March 14th or 15th, 2025, and we're in Active Inference Guest Stream 100.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 18.892,
    "end": 20.858,
    "text": "So congrats on the triple digits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 21.766,
    "end": 29.759,
    "text": " We're here with Yu Kanazawa, and we'll be discussing the free energy principle, language learning, and education.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.36,
    "end": 35.349,
    "text": "So we are looking forward to a presentation followed by a Q&A.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 35.369,
    "end": 39.275,
    "text": "If you're watching live, please feel free to write any questions in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.057,
    "end": 44.745,
    "text": "And thank you, Yu, for coming on and looking forward to your presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.065,
    "end": 45.546,
    "text": "Thanks again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.028,
    "end": 64.682,
    "text": " Alright, thank you so much for inviting me to this opportunity and also I would say it is not without some trepidation that I'm here because basically I'm an applied linguist or foreign language education researcher and also I had a look at those",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 64.662,
    "end": 82.654,
    "text": " youtube page and usually there are some like mathematical views or you know some scientific views but what i usually do uh is of course some more pedagogy oriented or some psychology but i do my best and also yeah this is pretty much uh open interdisciplinary",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 82.634,
    "end": 107.359,
    "text": " framework so i try to use it or incorporate it or getting some insight or like a mixing insight from applied linguistics or second language acquisition especially the instructional kind and this new very influential and promising idea of active inference of free energy principle so i get to it okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 109.583,
    "end": 120.994,
    "text": " Maybe I need to acknowledge this first, so this work or my study project supported by some Japanese governmental Takenhi project, so I need to acknowledge that first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 122.358,
    "end": 151.808,
    "text": " and yeah so as i said i had a look at those free energy principle literatures or some youtube sites but usually people don't talk about education or like language education especially but here's my background so basically if i was asked what i'm doing what do i do well the research field of course is more about some second language education or applied linguistics that's my field but there are a lot of different approaches there this field is pretty interdisciplinary oriented",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 151.788,
    "end": 157.455,
    "text": " And one thing I have done for long is number two is like vocabulary for formulaic sequences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 157.575,
    "end": 164.603,
    "text": "That's more like learning foreign languages, learning vocabulary, like different aspects of vocabulary and stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 164.683,
    "end": 169.909,
    "text": "Then I published a book or a book chapter, mostly in Japanese, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 170.45,
    "end": 175.776,
    "text": "Another topic that I started when I was a doctoral student is emotion, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 175.936,
    "end": 177.778,
    "text": "Emotion is another pretty big",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 177.758,
    "end": 206.533,
    "text": " topic field in that I'm the research topic especially from psychological philosophical approaches and also including cognitive science actually the first opportunity that I came to know this free energy principle is from emotion literature actually so that's another thing and also the third thing is like pedagogy foreign language education especially something called like active learning or dialogic learning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 206.513,
    "end": 229.399,
    "text": " or some more like a learning method the student-centered learning method that is more engaging or that's triggering student motivation so these three things basically I have been doing it's kind of expanding more but basically this is it and next one",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 231.067,
    "end": 236.79,
    "text": " yeah also another thing here so today's presentation this is uh based on uh this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 237.192,
    "end": 245.601,
    "text": " paper, the free energy principle and its implication to language learning and education, a theoretical paper that I published last year, 2024.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 246.242,
    "end": 255.732,
    "text": "So it's, I talked about full e-cognition, prediction, accuracy, complexity, trade-off, interesting motivation by epistemic emotions, full skills, and other things there as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.833,
    "end": 258.015,
    "text": "So basically it will be there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 258.315,
    "end": 267.165,
    "text": "And also these QLs or this ULL there is basically where you can learn more about that in case if you are interested.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 267.145,
    "end": 291.398,
    "text": " more and yeah so i'm from japan based in japan or osaka the kansai the western area uh which is you know the second biggest part compared to like tokyo the eastern part though uh in japan there has been a lot of focus or publication study about free energy principle as well maybe it's nice to briefly mention these things there too",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 291.378,
    "end": 298.411,
    "text": " So especially like Professor Inui, he's based in Osaka, North Osaka, same place as mine as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 298.972,
    "end": 303.942,
    "text": "Also the applying it, some introduction to free energy principle published recently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 303.982,
    "end": 307.468,
    "text": "Also explaining applying it to emotion study.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 307.569,
    "end": 311.496,
    "text": "That's the second book on the left side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 311.476,
    "end": 329.974,
    "text": " also there's some translation there as well uh this is the how we predictive mind book that's also translated into japanese and also the right side the green one the active inference this is like r at all 2022 which is a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 329.954,
    "end": 357.531,
    "text": " awesome book and i think it's used as a textbook for this you know the reading group as well so this actually uh after reading this book or these books especially this part at all 2022 i had the idea that maybe i should use some insight somehow to language education so so this has been some direct motivator uh that does lead into my uh some ways of thinking and also ideas out here",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 359.333,
    "end": 368.957,
    "text": " And also, it's not directly about language education still, but there has been a lot of Japanese researchers investigating further into this free energy principle there as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 369.077,
    "end": 376.937,
    "text": "So, for example, on the left side up, making some... I should just look this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.609,
    "end": 382.053,
    "text": " So, forward a model of design process based on free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 382.614,
    "end": 405.054,
    "text": "So, combining it with Charles Sanders Peirce's theory, which is another favorite theory of mine actually though, and also emotion psychology or science, University of Tokyo, and Nagisawa Sensei's studies out there about free energy, applying it into emotion, valence emotion, or epistemic emotion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 405.074,
    "end": 407.616,
    "text": "That's another topic that I'll talk about later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 407.596,
    "end": 426.887,
    "text": " And also even in those second language education, on the right side up, some neuroscientific second language empirical study conducted, and briefly the idea about free energy principle or predictive processing is also mentioned and also integrated into analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 426.867,
    "end": 442.243,
    "text": " and something very recent just a few days ago the right side down like system zero one two three uh quad process theory of multi time scale embodied collective cognitive system this is very uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 442.223,
    "end": 465.801,
    "text": " pioneering interesting idea about some kahneman's system one two expanding it using some idea about time and also free energy principle-based predictive processing which is pre-print but authored and studied by leading researchers in Japan",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 466.878,
    "end": 475.551,
    "text": " Anyway, so briefly I talked about second language, so maybe I should talk more into my own theory or ideas, conceptual analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 477.153,
    "end": 485.425,
    "text": "F-L-L-E is the word which is like foreign language learning and education is kind of wordy, so let me just put it in the F-L-L-E.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.026,
    "end": 495.72,
    "text": "This is an interdisciplinary field where various theories and insights have been applied from various varied academic domains, such as cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 495.7,
    "end": 500.627,
    "text": " but also from psychology, philosophy, and even beyond.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 500.687,
    "end": 505.072,
    "text": "So it's like some intersection of different academic fields.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 505.273,
    "end": 508.617,
    "text": "So it's kind of an interesting and exciting field, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 509.398,
    "end": 517.549,
    "text": "And one noteworthy theoretical framework in the state-of-the-art cognitive science is, of course, the free energy principle or active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 517.689,
    "end": 520.493,
    "text": "Recently, it's also known as.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 520.473,
    "end": 542.97,
    "text": " was proposed by professor carl j princeton and i think if i'm correct it's mean in mid 2000 so in this century and has been elaborately and cross-disciplinarily developed ever since like very productive so each week or each day there are new free energy related publications somewhere",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 543.44,
    "end": 551.577,
    "text": " and making it a promising, groundbreaking, unifying theory of the brain or even further, the dynamics of living systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 552.468,
    "end": 566.569,
    "text": " In this lecture, the presenter, me, Yuka Nozawa, introduces some key concepts of this free energy principle FAP framework based mostly on this part at all 2022 understanding from it in a greatly simplified manner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 566.769,
    "end": 574.721,
    "text": "So this is one of the, I think, the rare attempt to explain it without using mathematical formula.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 574.741,
    "end": 581.631,
    "text": "So I don't go into mathematics or those mathematical aspects of the theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 581.611,
    "end": 593.95,
    "text": " but some what implication uh it can it can be derived from the theory and applying it to language education or like instructive signal language acquisition or like teaching",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 596.714,
    "end": 597.995,
    "text": " and power at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 598.195,
    "end": 599.297,
    "text": "So this is it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 599.697,
    "end": 602.86,
    "text": "And another great thing is it's open access.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 604.201,
    "end": 608.926,
    "text": "You can download the PDF from MIT Press website.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 609.847,
    "end": 625.202,
    "text": "And also, it's kind of off topic, but in my field, applied linguistics, there's more and more, I would say, some people's interest toward open science or the need of equality, kind of social justice for information,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 625.182,
    "end": 651.882,
    "text": " in that sense open access is highly valued and so this book is in a sense also leading it in that aspect as well very good introduction and it's all free for anyone in the world if they have internet connection and this is from the paper action perception loop so you have like the mark of blanket some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.862,
    "end": 676.806,
    "text": " uh usually for non-scientific people it's like exotic world there but you know the internal system external systems are divided uh like separated uh using this uh blanket and then uh the Asian side and the world side but there are some interaction there internal state through like sensory states or like perceptions uh of course there are some input based uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 677.528,
    "end": 684.889,
    "text": " interaction there and also through action, it's also still possible to go influence from internal state to external state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 685.612,
    "end": 705.021,
    "text": " A little bit of another kind of off-topic there, too, but this book, I think, Naive 2025, another recent MIT Press book about applying the energy principle to lives or a more broader perspective of biology, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.681,
    "end": 710.809,
    "text": "This idea of a mouthful blanket realism has been actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 711.346,
    "end": 734.805,
    "text": " question or maybe some better ideas proposed actually which the book I was reading yesterday maybe I was reading too much so maybe I should have prepared more for slides at the expense of my sleep a little bit but yeah well there is of course these theories are slightly changing or modified and stuff so maybe what I written here is based on what I understand last year at last year",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 736.507,
    "end": 744.924,
    "text": " So diving into the first aspect for e-cognition, foreign language learning education, and free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 745.565,
    "end": 747.209,
    "text": "Well, AI picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 748.171,
    "end": 752.64,
    "text": "Usually, you know, the generous and nice image, AIs are usually useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 752.74,
    "end": 757.129,
    "text": "So sometimes I do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 757.149,
    "end": 757.249,
    "text": "Yeah."
  },
  {
    "start": 757.786,
    "end": 759.608,
    "text": " So, four e-cognitions there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 759.728,
    "end": 769.02,
    "text": "So, when I first read free energy principle, I thought, oh, this is pretty much harmonious with or resonate those four cognition, four e-cognition idea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.06,
    "end": 772.665,
    "text": "Although it was not explicitly written down there as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 772.765,
    "end": 780.435,
    "text": "But, you know, it's famously, I think for cognitive psychologists or scientists, it's kind of obvious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 780.415,
    "end": 789.354,
    "text": " But there are four E's out there, embedded cognition, embodied cognition, inactive cognition, and extended cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 789.434,
    "end": 800.618,
    "text": "I don't talk too much into these things, but actually I'll just point out that these are related both to free energy principle and also to foreign language education as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 800.598,
    "end": 820.429,
    "text": " and for those free energy principle and for e-cognition like inactive and others those like naive that 2025 is a perfect another recent example of the book but you know just these things as are written they are implicit generalized so basically it's like embedded so we are in context of the environment so we not just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 820.409,
    "end": 847.007,
    "text": " the single being in vacuo just separated agency you know but we are the environment context having great impact on the cognition and also that's also in foreign language education literature too that was also pretty much recognized actually interaction learning context in the past it was more like input reading listening but now like interaction is more important or like what to do how to ensure",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 846.987,
    "end": 872.961,
    "text": " interaction or the factor of the environment these are also highly studied embodiedness the body or using the body traditional example in language education like tp earl total physical response but also recently there's some shadowing practice like actually you pronounce something uh there's some skill acquisition some drill but that can also be more social or like interactional",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.941,
    "end": 897.025,
    "text": " and also inactive approach there as well some task-based language teaching project-based these new pedagogical approaches are pretty much related to this inactive idea those like active agency or productiveness of the learners the basis of these ideas and even extended cognition there which is of course recently those ict tools there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 897.578,
    "end": 922.067,
    "text": " or chat GPT or generative AIs or even using some of those tools they will lead to how to instead of just whether to use it but like how wisely to incorporate it into language learning that's also highly highly studied topic like almost all conferences there are those like how to use AIs wisely topics in language education there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 924.258,
    "end": 930.233,
    "text": " Yeah, several books, like 4E Cognition, back in 2018, like Nguyen et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.594,
    "end": 934.623,
    "text": "Another great introduction, plus more explanation about 4Es.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 935.345,
    "end": 941.44,
    "text": "And Maeve 2025, that's another great book, just talking about free energy and 4E cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 941.42,
    "end": 956.847,
    "text": " And some examples from language education, like some shadowing book, Kadota 2019 is another one, introducing some more, I would say, embodied aspect of pronunciation or listening for a skill.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 956.827,
    "end": 986.783,
    "text": " fluency training and forthcoming next year some generative ai how to use it well for language education from like multiliteracies also these books and papers are published kind of every day i would say so well just talked about some relevance of foes free energies and also education so let's move on to some omnipresent prediction the idea of free energy itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 988.568,
    "end": 993.195,
    "text": " Well, example of reading in foreign language education.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 993.435,
    "end": 1002.048,
    "text": "Well, usually those foreign language education literatures or second language acquisition approaches, there are some four skills people often talk about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1002.068,
    "end": 1007.396,
    "text": "Four skills are listening, reading, speaking, and writing, basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1007.416,
    "end": 1016.77,
    "text": "And of course, reading is one of the most fundamental aspects, especially for English as a foreign language learners.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1016.75,
    "end": 1026.199,
    "text": " If they need to use it in their daily life, more speaking or listening is important, but especially if you're learning as a foreign language, reading is one of the most important skills.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.139,
    "end": 1034.106,
    "text": "A dominant view of reading in second language is that reading essentially concerns input-based, data-driven decoding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1034.686,
    "end": 1043.114,
    "text": "And that additional attention of cautiously making predictions and inferences will turn its passive nature toward more active and top-down processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1043.314,
    "end": 1046.757,
    "text": "There has been several models like bottom-up reading, top-down reading, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1046.737,
    "end": 1050.941,
    "text": " Top-down reading models, well, they are like guessing game model, all those things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.001,
    "end": 1060.969,
    "text": "But recently, a lot of theorists or practitioners or scholars agree that reading is basically based on the bottom-up process, the text first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1060.989,
    "end": 1064.993,
    "text": "And then you decode it, and that gets to your brain, basically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1065.013,
    "end": 1069.857,
    "text": "And then at that stage, there is also some prediction or thinking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1070.057,
    "end": 1072.68,
    "text": "Those top-down processing also comes into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1073.08,
    "end": 1075.562,
    "text": "But basically, it's input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1075.542,
    "end": 1077.167,
    "text": " like listening, reading, or input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1078.31,
    "end": 1080.837,
    "text": "Bottom-up processing is the basic mode of reading.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1081.519,
    "end": 1088.64,
    "text": "Those top-down, concept-driven perspectives can be added, but the basic nature is bottom-up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1091.506,
    "end": 1111.033,
    "text": " but is this true well kind of drawing some insight from free energy principles can we really say that those input is really perception input or like some input is first and then action understanding later maybe it doesn't have to be so latest cognitive science suggests otherwise",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1111.013,
    "end": 1113.236,
    "text": " the fundamentality of predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.336,
    "end": 1120.464,
    "text": "Prediction is kind of like top-down processing, your brain or cognition first, and then that's kind of influencing what you perceive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1121.004,
    "end": 1122.746,
    "text": "And that is even unconscious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1123.207,
    "end": 1129.594,
    "text": "Those ideas about unconscious prediction, that's pretty new in second language education, I would say, or acquisition theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1130.515,
    "end": 1131.897,
    "text": "And just several examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1132.177,
    "end": 1134.54,
    "text": "The first one,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1134.52,
    "end": 1143.518,
    "text": " you read this sentence right kind of stuff most readers will be able to understand what's written in the sentence with jumbo letters",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.527,
    "end": 1148.712,
    "text": " That's because and also even sometimes you may not realize that it's jumbo letters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1149.293,
    "end": 1151.855,
    "text": "There are a lot of similar examples in different languages there as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1151.876,
    "end": 1161.106,
    "text": "But so in other words, like we don't really look into those letter by letter and construct like letter to word, word to sentence in a bottom up manner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1161.987,
    "end": 1169.556,
    "text": "We rely greatly on those kind of system one based prediction kind of intuitive process, I would say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1169.924,
    "end": 1172.268,
    "text": " Another example is mask semantic priming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1172.528,
    "end": 1174.771,
    "text": "Mask priming is some psycholinguistic approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.973,
    "end": 1183.845,
    "text": "Priming is like you look at something first, you look at something next, and the first thing you look at somehow influences the second thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.867,
    "end": 1191.156,
    "text": "Like, for example, you see the color first and then you see some name of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1191.136,
    "end": 1211.541,
    "text": " fruit for example like red color and for example apple i would say maybe that if that's congruent maybe the processing is faster like faster reaction time shorter reaction time or something but usually so those things may happen with masked condition mask is like the first prime is presented only like a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1212.247,
    "end": 1213.73,
    "text": " 50 milliseconds or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1213.75,
    "end": 1214.871,
    "text": "So you are not aware of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1215.392,
    "end": 1217.836,
    "text": "You are not consciously aware that something was presented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.937,
    "end": 1231.74,
    "text": "But still, even at the meaning level, something that you unconsciously processed first may have an impact on something that you process next, the performance, the reaction time and stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1231.72,
    "end": 1235.388,
    "text": " So unconsciously, we are paying attention to many things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.729,
    "end": 1237.473,
    "text": "It's just that we are not aware of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.094,
    "end": 1244.027,
    "text": "So that may need some paradigm shift or different ways of thinking about just input processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1244.067,
    "end": 1245.23,
    "text": "Maybe it's not just input.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1245.711,
    "end": 1251.163,
    "text": "Behind input, there are a lot of active inference or active perception there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1251.835,
    "end": 1255.781,
    "text": " and those Helmholtzian idea of perception as unconscious inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1256.062,
    "end": 1258.065,
    "text": "I'm just citing that book though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1258.546,
    "end": 1267.08,
    "text": "Perception is not a passive outside-in process in which information is extracted from impressions on our sensory epithelia from out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1267.3,
    "end": 1276.155,
    "text": "It is a constructive inside-out process in which sensations are used to confirm or disconfirm hypotheses about how they were generated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1277.198,
    "end": 1284.508,
    "text": " So future foreign language education theories and practices may well recognize the active nature of perception and try to operationalize it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1285.957,
    "end": 1300.233,
    "text": " Some books, the Hovey book, of course, also in Japanese translation as well, also kind of related, which I use as the textbook in several of my university classes, Barrette, the seven and a half lessons about the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1300.493,
    "end": 1308.842,
    "text": "Also, the importance of prediction in our brain or cognition is pretty well documented or explained in this popular science book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.805,
    "end": 1342.423,
    "text": " right so now going further into free energy itself free energy minimization so what's it about so free energy minimization so what this is about the free energy principle is not the only model that theorizes the predictive nature of perception so there are a lot of predictive processing literature and like uh also attempts out there that's related but not necessarily free energy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1342.403,
    "end": 1359.737,
    "text": " What makes it outstanding is its extension from perceptional inference to active inference and resulting unifying theory of perception and action under the same underlying mechanism of free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1361.422,
    "end": 1368.797,
    "text": " So it's just kind of extending, kind of Bergsonian way of saying it, but extending perception into action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1369.338,
    "end": 1371.603,
    "text": "And these are actually under the same mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1372.184,
    "end": 1381.624,
    "text": "So they're off topic, but this idea is pretty much echoing Henri Bergson's idea about perception and memory, which is also now highly studied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1381.739,
    "end": 1394.787,
    "text": " The free energy principle posits that minimizing surprise or surprisal is the imperative of living organisms to maintain themselves in their interaction with the environment",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1395.188,
    "end": 1400.599,
    "text": " while avoiding global thermodynamic disequilibrium, which is like death or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1401.141,
    "end": 1404.628,
    "text": "So minimizing surprise, minimizing unexpectedness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1405.009,
    "end": 1409.518,
    "text": "And this is done by minimizing the proxy, the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1409.999,
    "end": 1412.725,
    "text": "And here, especially, it's a variation of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1412.705,
    "end": 1423.314,
    "text": " Free energy, which is an upper bound on surprise value given a generative model, is a function of the organism's internal dynamics and its sensory and active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1423.494,
    "end": 1425.6,
    "text": "It's not just either, but both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1427.943,
    "end": 1432.892,
    "text": " An example, more like an intuitive example here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1433.393,
    "end": 1435.136,
    "text": "Two ways of minimizing free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.278,
    "end": 1442.169,
    "text": "One is perception changing, perception or changing yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1442.189,
    "end": 1445.395,
    "text": "The other, action or changing the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1445.915,
    "end": 1456.678,
    "text": " And in my paper, I wrote about an example of a traveler going to a foreign country where people speak some completely unknown new language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.32,
    "end": 1465.678,
    "text": "You hear suddenly someone speaking in your mother tongue in a remote foreign country that you expect nobody will speak your language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1465.658,
    "end": 1466.5,
    "text": " What you should do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1467.162,
    "end": 1472.417,
    "text": "Well, one possible thing to do is update your belief based on your perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.717,
    "end": 1481.642,
    "text": "In other words, you can maybe think about, oh, some people here speak your language, or maybe there are other travelers from your country.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1481.622,
    "end": 1483.746,
    "text": " Another way to go for it is like taking action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1483.927,
    "end": 1488.175,
    "text": "For example, like walking closer, finding who was talking, who was speaking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1488.676,
    "end": 1494.768,
    "text": "And then like maybe even you can even talk to the person to make sure that, oh, surely there is someone who speak your language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.048,
    "end": 1503.445,
    "text": "Or it could also be some coincidence, maybe just one word you kind of misheard as your maritime phrase or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1504.285,
    "end": 1508.649,
    "text": " Actually, both are out of the same principle of minimizing surprise there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1509.01,
    "end": 1512.333,
    "text": "Both approaches can be taken, not just either, but kind of both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1514.595,
    "end": 1528.469,
    "text": "And free energy can also be formulated and defined as the difference between complexity and accuracy, where the goal of inference is minimizing complexity while maximizing accuracy there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1529.37,
    "end": 1533.634,
    "text": "So here, there is a trade-off between accuracy and complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1534.137,
    "end": 1538.284,
    "text": " And as Einstein noted, as simple as possible, but not too simpler.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1538.524,
    "end": 1544.855,
    "text": "So you should try to make it as simple as possible to make it tangible or manageable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1545.336,
    "end": 1547.8,
    "text": "But if you do that too much, it's no longer useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1548.561,
    "end": 1554.812,
    "text": "And they are in trade-off relation with each other, as this formation suggests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.408,
    "end": 1562.896,
    "text": " So what can foreign language education or learning can learn from these facts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.697,
    "end": 1564.858,
    "text": "Well, at least two things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1565.319,
    "end": 1583.764,
    "text": "One, similarly to the relation between perception and action in the free energy principle, those input processing, reading, listening, and output processing or production, writing, speaking, may also be conceptualized as inseparable and explained by the same underlying mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1584.085,
    "end": 1586.588,
    "text": "In the past, people used to usually just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1586.568,
    "end": 1588.81,
    "text": " divide these four things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1589.211,
    "end": 1596.398,
    "text": "I remember when I was undergrad or something, someone just asked me, like some graduate student talked to me, like, which are you interested in?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1596.718,
    "end": 1598.58,
    "text": "Listening, reading, speaking, writing?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1598.981,
    "end": 1602.204,
    "text": "Actually, my idea was like, oh, I shouldn't just pick one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1602.244,
    "end": 1613.976,
    "text": "And so in that sense, of course, maybe, of course, there are different theories for each, but just behind it, there must be something which is common, some underlying mechanism or even interaction",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1613.956,
    "end": 1639.288,
    "text": " that is like a mutually influencing with each other in very subtle manner so we should pay attention to those subtlety or i will say let me look for a better word those mutual uh permeation i would say maybe permission is a good word to go for interpenetration permeation of different things seemingly different categories",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1639.91,
    "end": 1648.965,
    "text": " Another trade-off of accuracy and complexity is pretty much echoing this idea of CAF, which is highly studied in second language acquisition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1649.125,
    "end": 1651.148,
    "text": "Complexity, accuracy, and fluency.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.629,
    "end": 1662.627,
    "text": "Well, these three kind of criteria are often used to measure second language production or estimation or assessment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1662.607,
    "end": 1683.703,
    "text": " and of course like higher these values or well which is good but how they are related actually and also sometimes their trade-off relation for example focusing too much on fluency maybe at the cost of accuracy or complexity all these things can happen for others there too and how to kind of scientifically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1683.683,
    "end": 1689.211,
    "text": " fundamentalize these ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1690.113,
    "end": 1698.946,
    "text": "Free energy principle literatures have a lot of scientific insights about the nature of complexity, the nature of accuracy, and even recently the nature of fluency as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1698.986,
    "end": 1709.742,
    "text": "So maybe these insights could be somehow incorporated or used for theory for these CEF aspects in second language acquisition as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1712.438,
    "end": 1718.715,
    "text": " So that was mostly about the first part of free energy, which is like a variation of free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1719.357,
    "end": 1721.121,
    "text": "But it's not just that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1722.244,
    "end": 1726.937,
    "text": "Something deeper into the temporal depth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1728.672,
    "end": 1737.262,
    "text": " Well, minimizing surprise of the present could end up in stubbornly persisting to its own echo niche.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.003,
    "end": 1744.752,
    "text": "So just minimizing surprise now, maybe it would just end up no exploration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.212,
    "end": 1748.296,
    "text": "Maybe you're just trying to keep your homeostasis only.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1749.157,
    "end": 1758.308,
    "text": "But like life or like a living organism, which is different, like there is some evolution or development, learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1758.625,
    "end": 1764.232,
    "text": " also pretty much well discussed in the recent NAIVE 2025 as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1765.074,
    "end": 1778.271,
    "text": "Such a strategy like just persisting to your homeostasis may be maladaptive in the long run because it essentially disfavors newness, trying to keep itself within the comfort zone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1778.251,
    "end": 1792.817,
    "text": " unable to cope with dynamically and unpredictably changing situations in the future so just trying to minimize surprise surprise all now maybe you will not adapt to the new situation in the future",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1793.033,
    "end": 1796.018,
    "text": " And this, for instance, et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1796.178,
    "end": 1800.585,
    "text": "and also active inference researchers, they incorporated into the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1801.266,
    "end": 1809.979,
    "text": "Generative models endowed with temporal depth, different time scale, like future-oriented thinking, and hierarchical temporal structures are called for.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1810.58,
    "end": 1819.294,
    "text": "And that resulted in extending the scope of the original variation of free energy to the expected free energy, EFE.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1821.333,
    "end": 1824.317,
    "text": " And again, if is also well explained in power at all 2022.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1824.678,
    "end": 1833.69,
    "text": "So not talking too deep into it, but two ways of minimizing those expected kind of future oriented free energy as well there as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1834.031,
    "end": 1845.327,
    "text": "One is kind of exploitation idea, which is somehow similar to the variational one, like maximizing utility based on the prior preferences or pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1845.507,
    "end": 1848.471,
    "text": "Something you can use, you keep on using.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1848.603,
    "end": 1868.957,
    "text": " or kind of exploiting on it but it could result in kind of using up the resource though but at the same time not just that you could also do it this new way exploration you maximize information gain by reducing uncertainty about the cause of valuable outcomes which has an epistemic value",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1868.937,
    "end": 1879.95,
    "text": " And when some environmental situation change, this exploration may end up really important because you're not just sticking to your old way of doing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1880.831,
    "end": 1885.277,
    "text": "And these two exploitation versus exploration, that's automatic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1885.297,
    "end": 1888.861,
    "text": "The balancing is automatic for exploitation and exploration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1889.682,
    "end": 1895.008,
    "text": "It's mediated and motivated by, well, this is my way of phrasing it, but epistemic emotions there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1895.249,
    "end": 1897.932,
    "text": "Of course, surprise, free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1897.912,
    "end": 1926.636,
    "text": " and like boredom result of exploitation maybe you may feel boredom which will result in some internal drive to look for newness and then the curiosity toward exploration and boredom curiosity these concepts are pretty well studied recently new handbooks more and more papers scales and these can be categorized into this category of epistemic emotions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1928.489,
    "end": 1932.398,
    "text": " Epistemic emotions and temporal depth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1933.781,
    "end": 1939.916,
    "text": "Monitoring free energy dynamics elicits emotional states at multiple levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.577,
    "end": 1945.148,
    "text": "These emotional states may play crucial roles in free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.444,
    "end": 1964.689,
    "text": " Like basic forms of hedonic emotions such as happiness and fear, these may help biological agents to adapt to changes in the world via variational free energy minimization, which is also pretty much true for any organism, like any evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.669,
    "end": 1991.875,
    "text": " level but in turn epistemic emotions which are related to kind of more higher cognitive processes of more higher more complex organisms even some consciousness involved probably conscious knowledge exploration exploration and acquisition this may provide a tangible interface between deliberate intellectual learning and expected free energy minimization in rich temporal depth",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1992.85,
    "end": 1995.182,
    "text": " in a more future-oriented manner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1997.812,
    "end": 2002.637,
    "text": " So what implications are there for foreign language education and learning?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2003.578,
    "end": 2015.852,
    "text": "One thing, well, since language learning is a deliberate and effortful higher cognitive process, of course, and, you know, it's usually it may start when you are older or second language processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2016.313,
    "end": 2023.06,
    "text": "So you need to exercise more of your some intentional, deliberate, some cognition to learn.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2023.04,
    "end": 2052.591,
    "text": " and here the temporal depth should be considered both in pedagogical planning and research like for example complex dynamic systems theory that's pretty big in applied linguistics now or approaches of quantifying depth in foreign language education for example like deep active learning so what constitutes deep so like uh providing some theoretical basis behind what does depth mean",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.702,
    "end": 2067.473,
    "text": " Also, intrinsic motivation is explainable by expected free energy minimization via epistemic value maximization, which is situating foreign language motivation theories in more scientific contexts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2067.493,
    "end": 2069.618,
    "text": "Motivation is another pretty big",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2069.598,
    "end": 2074.125,
    "text": " applied linguistics theory that many researchers and educators are interested.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2074.165,
    "end": 2081.115,
    "text": "And there are a lot of models, but there are some variational crisis of some several models and stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2081.135,
    "end": 2084.06,
    "text": "But maybe based on this, what is interesting motivation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2084.12,
    "end": 2087.725,
    "text": "Well, this is actually coming from those epistemic value maximization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.705,
    "end": 2104.617,
    "text": " from the minimization of expected free energy this may having some theoretical some scientific background of what is interesting motivation which is not just only from philosophical or observational findings",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2105.744,
    "end": 2120.007,
    "text": " Well, uh, just, just kind of like a, uh, off topic, but like, here's some example, like deep active learning, active learning is like learning, uh, not just teachers lecturing, but students doing discussion group work, but, uh, recently, uh, more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2120.729,
    "end": 2149.15,
    "text": " just active is not good enough maybe outside behavior active but internally learning is not deep that's the problem so there's deep active learning is proposed that's leading to deep learning understanding and engagement and also another pretty big field in my second language acquisition uh psychological language learning is like engagement how to foster student like authentic academic engagement like behavioral cognitive affective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2149.13,
    "end": 2153.284,
    "text": " And that's connecting motivation and effective active learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2153.585,
    "end": 2161.35,
    "text": "So maybe for these literatures, maybe some ideas from those free energy principles may somehow be applicable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2164.807,
    "end": 2175.551,
    "text": " Also, third, the free energy principle will provide valuable insights and methodologies that could be applied to elaborating the existing findings and hypotheses in foreign language studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2176.212,
    "end": 2182.967,
    "text": "Like just my example, the emotion-bore processing hypothesis, actually, in a more comprehensive and systematic manner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2183.453,
    "end": 2203.133,
    "text": " and maybe i'm talking a bit about that first again slightly off topic but just one theory because that's related to my own study like uh using some depth of processing model in psychology uh i several years ago proposed those emotional processing hypothesis which is basically about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2203.113,
    "end": 2226.724,
    "text": " processing is deeper when you're just looking at thinking about those perceptual aspects of the target stimuli or item maybe the learning is not very deep leading to weaker memory but if you think about the meaning that's stronger that's some established psychological finding though but if you make connection with those emotional aspects for example like learning the word like apple in a foreign language maybe if you for example think about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2226.704,
    "end": 2250.973,
    "text": " try to write about that using the favorite apple in your life for example or maybe something that's related to your emotional capacity maybe the learning will be more organically integrated in your cognition and you will be more likely to learn so this idea is out there but what is depth maybe it needs to be elaborated more maybe free energy principle can be of help there as well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2251.932,
    "end": 2256.782,
    "text": " And there's another theory that's based on the first one is like deep positivity hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2256.982,
    "end": 2260.91,
    "text": "Well, simply positive emotion is important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2261.532,
    "end": 2267.223,
    "text": "Higher cognition, academic learning, enjoyment or positive emotion is more important than negative emotion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2267.263,
    "end": 2269.047,
    "text": "That's the idea behind this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2269.415,
    "end": 2276.002,
    "text": " That actually kind of is like an off-top, off-related side way though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2276.022,
    "end": 2277.704,
    "text": "So I'm just talking very briefly though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2278.184,
    "end": 2280.827,
    "text": "Many previous studies talk about positive emotion is important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2280.887,
    "end": 2283.17,
    "text": "Negative emotion is to be avoided.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2283.35,
    "end": 2286.073,
    "text": "But it's not always the case actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2286.353,
    "end": 2291.979,
    "text": "Just trying to pursue the positive enjoyability, enjoyment is not always useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2292.36,
    "end": 2297.245,
    "text": "And there can even be some danger there as published in some recent articles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2298.507,
    "end": 2325.409,
    "text": " journal article like beyond positive psychology is the title actually there so maybe I don't talk too much here but just positive versus negative that's some dyadic idea of thinking about emotion is not very fruitful but for higher academic cognition more triadic type epistemic emotion intellectual activeness or creativity even",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2325.389,
    "end": 2340.057,
    "text": " like ultimately leading to morality or around the more education these needs to be pursued and that's going beyond positive or negative actually and for that maybe some importance is more about those epistemic emotion there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.138,
    "end": 2349.391,
    "text": " Since temporally, the deep, deliberate, higher cognitive processes are related more closely with epistemic emotions than basic emotions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2349.772,
    "end": 2359.446,
    "text": "Epistemic emotions may be more elaborate, deeper than basic emotions in the dynamic, multileveled cognitive-emotional continuum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.426,
    "end": 2366.413,
    "text": " And that led to the proposition of this deep epistemic emotion hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2366.453,
    "end": 2368.695,
    "text": "That's actually my paper though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2369.416,
    "end": 2388.015,
    "text": "Intellectual learning and acquisition would benefit greatly more by mindfully harnessing those epistemic emotions like surprise, curiosity, or even some temporary confusion, or maybe utilizing the... What was that word?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.535,
    "end": 2407.607,
    "text": " uh boredom a lot of people say like boredom is not good so boredom is a negative emotion which is not which is kind of true but even boredom could be used uh to to make it lead to to shift from exploitation to exploration using curiosity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.587,
    "end": 2414.378,
    "text": " So not just enjoying activity, but more about some activity that's making you surprised, making you curious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2415.02,
    "end": 2417.784,
    "text": "These will lead to even better learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2418.225,
    "end": 2424.195,
    "text": "So that's a theory based on those expected free energy ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2425.525,
    "end": 2428.389,
    "text": " And there is a couple of some papers there as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2428.549,
    "end": 2437.542,
    "text": "So 2023, like the mental lexicon paper, there's some empirical, experimental, psychological paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2437.642,
    "end": 2448.597,
    "text": "That's basically one of the conclusion is that some incongruence-based surprise may lead to better memory formation of foreign language words.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2448.577,
    "end": 2461.937,
    "text": " And also a forthcoming paper, I talk about these three different hypotheses, emotion, positive emotion, and beyond epistemic emotion, which will be published soon and in a few months, I guess, in second language.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2462.037,
    "end": 2465.202,
    "text": "So more on those things, those papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2465.536,
    "end": 2469.201,
    "text": " Okay, maybe I should wrap up or wrap up to the final point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2469.902,
    "end": 2482.878,
    "text": "Wrapping up the discussion so far, free energy principle is compatible with four e-cognition aspects, which is very important now for more overcoming the problems of the previous paradigms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2483.499,
    "end": 2489.907,
    "text": "And prediction is everywhere, including in input processing and even consciously and even unconsciously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2490.747,
    "end": 2497.758,
    "text": " Perception input and action output are inseparable, and so do listening, reading, speaking, and writing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2498.779,
    "end": 2512.3,
    "text": "There's a trade-off between accuracy and complexity, and potentially even fluency, so they need to be carefully theoretically formulated, and also the relation should also be mindfully harnessed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2512.853,
    "end": 2528.988,
    "text": " Free energy principle can integrate the temporal depth and future-oriented prediction, expected free energy, and exploitation from exploitation to exploration, and intrinsic motivation, exploration, emotional valence, like positive, negative, epistemic emotions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2529.068,
    "end": 2541.679,
    "text": "These are interconnectedly explainable in a unified manner in the free energy principle framework, which will have great theoretical insight in any other fields, including language education as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2544.308,
    "end": 2548.112,
    "text": " Au revoir, old student of initial theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2549.053,
    "end": 2552.756,
    "text": "Well, this is a bit more poetic or theoretical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2552.837,
    "end": 2574.298,
    "text": "Anyway, instead of constructing a map of cognition by assembling, building blocks of separate cognitive functions like perception, action, planning, emotion, and so on, the free energy principle elucidates the covert first principle that is not salient, difficult to see, or even that's impossible to see but something at work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.278,
    "end": 2581.251,
    "text": " that permeates cognition from which the distinctified cognitive functions can be explained from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2581.291,
    "end": 2591.41,
    "text": "Indeed, how you perceive and interpret the world depends on how you have learned to conceptually separate the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2591.474,
    "end": 2599.63,
    "text": " Like, for example, these perception, action, planning, emotion, these are famous William James category of psychological faculties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2600.312,
    "end": 2603.037,
    "text": "But, for example, perception is there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2603.398,
    "end": 2604.901,
    "text": "This chapter is talking about perception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2605.262,
    "end": 2606.584,
    "text": "This, action or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2606.765,
    "end": 2613.398,
    "text": "So a lot of psychologists just took it granted that these are completely separate mental faculties and then just study",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.378,
    "end": 2630.07,
    "text": " then separately and like talking about how they are related with each other but actually maybe something related with each other is at first and how we just cut how we just theoretically like divide the uh holistic world maybe that's more important aspect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.759,
    "end": 2633.323,
    "text": " Another free energy principles of initial approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2633.343,
    "end": 2636.387,
    "text": "Dominant existing classifications are revisited, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2637.328,
    "end": 2638.951,
    "text": "Like, for example, in perception action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2641.054,
    "end": 2649.305,
    "text": "Because seemingly distinct functions may in fact be just different sides of the same coin, filling the same underlying imperative and mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2649.906,
    "end": 2651.308,
    "text": "And another thing can be also said.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.348,
    "end": 2657.297,
    "text": "Suddenly that looks pretty similar, but actually the background mechanism is actually distant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2657.417,
    "end": 2658.859,
    "text": "That's also possible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2659.008,
    "end": 2671.927,
    "text": " The abstract first principle that permeates seemingly separate entities bears a striking resemblance to the multidimensional implicate order and its elusive hollow movement, dynamic wholeness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2672.588,
    "end": 2683.484,
    "text": "I'm using the word from David Bohmian quantum mechanics, but also I'm recently more and more aware that this is also pretty similar to those extended Henri Bergsonian approaches as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2683.664,
    "end": 2686.348,
    "text": "So there are a lot of hidden gems in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2686.328,
    "end": 2691.014,
    "text": " some classic physics or even classic philosophy there as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2691.435,
    "end": 2699.706,
    "text": "Recently I'm more into Henri Bergson, so maybe I should have included it here, but at least for the paper I talked about Bohm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2700.787,
    "end": 2708.758,
    "text": "Hollow is like hollow movements, organically interconnected, intertwined with each other, those order, I would say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2710.679,
    "end": 2721.634,
    "text": " Likewise, the conventional basic factors in foreign language education and learning may in fact be arbitrarily separated aspects in an inertial interpretive system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2722.036,
    "end": 2724.1,
    "text": " such as, for example, the fundamental four skills.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2724.681,
    "end": 2744.82,
    "text": "So again, as I talked about that before, like already like reading, listening, writing, speaking, like four skills, and then like how they are related with each other, for example, their score of speaking tests, score of reading tests, and then like how they're like correlating with each other or like how which one is predicting the other or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2744.8,
    "end": 2761.847,
    "text": " Well, of course, originally, maybe the theorists didn't talk about that, think about that, but usually it's easy to just think about we have different those skills and then we just mix them or we just pay attention to these distinct ones separately and then we just try to like integrate it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2762.097,
    "end": 2768.006,
    "text": " But estimating the proficiency, yeah, so we tend to think about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2768.026,
    "end": 2775.517,
    "text": "For example, language proficiency is that mixture of vocabulary, grammar, knowledge, all these four skills.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2776.218,
    "end": 2778.262,
    "text": "But is this view really true?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.302,
    "end": 2781.186,
    "text": "Maybe not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2781.166,
    "end": 2805.452,
    "text": " and maybe not in fact actually even those traditional like listening reading speaking writing skill view was criticized maybe revisited in europe for example like cephal cv european common framework and in that they divide like newly re-categorize it into reception production",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2805.432,
    "end": 2824.048,
    "text": " interaction which is paying more attention to this permeation of input and output and mediation as the basic elements which is a pretty great step forward but yet the increased complexity with further subdivisions seven skills or more with debatable issues out there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2824.028,
    "end": 2843.674,
    "text": " miscellaneous elements in the category of mediation well like here's some uh list of it but this uh console of european like uh 2020 uh cephal cv uh plus cv companion volume that like a new new edition there so like reception is like oral comprehension which is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2843.654,
    "end": 2856.706,
    "text": " listening, reading comprehension, which is reading, production, oral production, which is speaking, written production, like reading, and interaction, which is good, like oral interaction, speaking, but like online as a different thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.886,
    "end": 2857.667,
    "text": "And so mediation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2857.727,
    "end": 2861.57,
    "text": "Mediation is very important, but it's kind of like miseraneous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2861.65,
    "end": 2864.833,
    "text": "And there are a lot of some categorical overlapping there, unfortunately.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2865.013,
    "end": 2873.661,
    "text": "And of course, these things are pretty useful as some rubric or to think about different aspects for assessment and stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2873.641,
    "end": 2882.917,
    "text": " But actually, as the free energy principle suggests, simple and accurate hermeneutic frameworks and guidelines will have better pragmatic values there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2882.937,
    "end": 2898.163,
    "text": "Just subdividing it into many different things and trying to conceptualize proficiency or something using those as a mixture of different things may not always be a pretty sound ontology or epistemology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2898.548,
    "end": 2909.141,
    "text": " Indeed, supposing a fixed set of basic categories and classifying elements like sorting files inside folders approach cannot help being arbitrary to some extent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2909.762,
    "end": 2910.963,
    "text": "And it's changing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2911.464,
    "end": 2915.749,
    "text": "The new theories out there, the old category is no longer making very good sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2915.869,
    "end": 2918.332,
    "text": "So you need to constantly update those categories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2918.873,
    "end": 2922.177,
    "text": "And the old theory may be pretty obsolete actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2922.612,
    "end": 2930.48,
    "text": " In reality, however, these elements are organically interconnected with each other in varied qualitative and quantitative degrees.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2930.84,
    "end": 2939.93,
    "text": "Or more precisely, these categories and elements are conceptually carved out of the undivided, hollow-moving wholeness of the implicate order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2939.95,
    "end": 2941.251,
    "text": "So maybe this is more true.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2941.451,
    "end": 2944.014,
    "text": "Something is there, which is very difficult to approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2944.514,
    "end": 2950.02,
    "text": "And then how we epistemologically separate things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2950.0,
    "end": 2952.104,
    "text": " So that's what it's really happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2952.225,
    "end": 2952.565,
    "text": "It should be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2953.387,
    "end": 2956.674,
    "text": "Free energy principles have initial approach having some resemblance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2957.094,
    "end": 2963.267,
    "text": "It can work as a potentially more fruitful alternative to the sorting file inside folders approach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2964.935,
    "end": 2991.617,
    "text": " and also almost the end sorry i mean talking too much and an ab initio approach will start by trying to identify the underlying covert mechanism that permeates everything relevant in the target of the model by an inductive as well as abductive reasoning that is compensated by epistemic emotions there surprise curiosity these are related to some abductive reasoning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2991.597,
    "end": 3001.887,
    "text": " Charles Peirce, the father of American pragmatics and many other things, like Pauli Muth, one of my favorite philosophers, in addition to Bergson and Whitehead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3002.828,
    "end": 3018.583,
    "text": "And also, in turn, different functions will be deductively situated in a unifying model in an organic manner, which could then be tested and validated empirically in the community of inquiry of scientists and even educators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3018.783,
    "end": 3041.213,
    "text": " presupposition of a first principle also echoes this persian account of truth now a lot of people say like the post truth world or there's a lot of different truth every truth is true or stuff but perth's idea is like there's some ultimate truth unattainable but we can approach it so uh and that can be done scientifically through the cognitive inquiry",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3042.897,
    "end": 3055.372,
    "text": " And those truths may be something which is related to those not some covert first principle or of initial approach theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.273,
    "end": 3068.247,
    "text": "Because keeping those Persian fallibilistic and synecistic spirits, which is like we will, our understanding of something which is wrong, it must be wrong, so it must be updated in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3068.227,
    "end": 3080.342,
    "text": " Synecistic, everything is actually connected with each other so not to miss or not to forget about this interconnectedness of things which we need to simplify when we theorize stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3080.362,
    "end": 3095.601,
    "text": "Those in mind, starting an inquiry in an ab initio approach will provide a worthwhile alternative research program which will eventually lead to the discovery of the holistic unifying theory that has yet to come in foreign language education field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.581,
    "end": 3114.711,
    "text": " which will unfold the underlying implicate order in a creative manner that maximizes both epistemic and pragmatic values, like exploration and exploitation, and it will be accomplished without losing spirit of its ontologically enfolded dynamic wholeness and the permeating of the movement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3115.272,
    "end": 3119.479,
    "text": "I am being more voluminous here, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3119.459,
    "end": 3139.054,
    "text": " so just some schematic image here so based behind those reading listening mediation writing speaking everything there's some unifying principle out there which is very difficult to approach maybe theoretically only you can approach whether that's really real the realism of the approach maybe it could be debatable but still",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3139.034,
    "end": 3154.461,
    "text": " starting with trying to have a look at something hidden just some unifying principle and trying to figure out what that is and trying to update the theory that's also another pretty useful helpful approach or the research program for the future",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3154.728,
    "end": 3176.871,
    "text": " so that's basically it though well that that that's basically the end that was the my conclusion of the paper but adding a little bit of some new things so especially uh the audience for this video maybe now or later may include some language educators there as well maybe who have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3176.851,
    "end": 3180.696,
    "text": " no knowledge about free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3180.776,
    "end": 3196.378,
    "text": "So maybe for that maybe just one simple key take home could be just setting optimally challenging tasks that evoke those epistemic emotions like surprise, curiosity to foster some exploration and also increasing motivation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3196.358,
    "end": 3203.273,
    "text": " And that would like to appropriately induce prediction errors in learners and generating interesting curiosity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3203.995,
    "end": 3210.75,
    "text": "And that can be done by some interactive inquiry-based dialogic approaches and models there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3211.031,
    "end": 3216.122,
    "text": "And here are just my examples, the links are here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3216.102,
    "end": 3235.495,
    "text": " so like challenges reading circle like this is some group based reading active learning approach that you ask question with each other in a structured manner and then usually that leads to some surprise curiosity or like tip of the tongue effect and this usually lead to better memorability",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3235.475,
    "end": 3258.293,
    "text": " and learning P4ELT based on P4C philosophy for children college community approach so which is based more on the authentic dialogue something that you're really interested in you just you discuss with each other democratically so this idea applying it to english language teaching is a pretty useful maybe one way to operationalize it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.273,
    "end": 3276.568,
    "text": " case teaching ELT case teaching originally some business school thing but using some real scenario or like pseudo scenario and then you discuss as if you are in the situation and to invigorate intrinsic curiosity and authenticity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3276.548,
    "end": 3304.986,
    "text": " and just it's a bit some 10 minutes short activity stuff about ipa news just talking about some news article stories in some unique pronunciation symbol that's authentic so usually instead of just learning the symbol as it is just situating it in the real life events and then making it as a quiz is more interesting emotion interesting motivation inducing and curiosity inducing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3305.523,
    "end": 3307.767,
    "text": " Theoretically, too, it's quite recent, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3308.648,
    "end": 3309.75,
    "text": "I talked about it briefly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3309.89,
    "end": 3313.616,
    "text": "Complex dynamic system theory is language learning, which is highly studied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3314.097,
    "end": 3326.637,
    "text": "This idea about trying to look into those dynamic interplay of different factors, that's another very promising approach in foreign language education study.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3326.617,
    "end": 3347.528,
    "text": " this year also last year proactive language learning theory the new model in second language acquisition according to that like input seeking behavior so it's not just listening or reading but even behind listening and reading there is this agentic approaches for each learner so we actually",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3347.508,
    "end": 3374.764,
    "text": " uh seeking for those input and then so this is based on the idea that everything is actually kind of like a top-down manner so there are more and more models that's also trying to uh capture the spirit uh of this uh some insight echoing the insights of free energy principles and again uh further reading so most of the talk today is based on this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.098,
    "end": 3379.412,
    "text": " So here is the link and URLs there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3379.432,
    "end": 3382.442,
    "text": "And maybe I'm updating that research maps thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3382.462,
    "end": 3386.897,
    "text": "So maybe there may be some new information there from time to time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3388.632,
    "end": 3389.894,
    "text": " A little bit of promotion there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3391.156,
    "end": 3407.704,
    "text": "I'm also a leading coordinator of this Language Education Technology Fundamental Theory Special Interest Group, which is a Japanese Kansai-based small research group that's mostly talking about some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3407.684,
    "end": 3435.345,
    "text": " uh foreign language education related technology psychology theory practices so basically every two months we are having zoom or in-person meetings there so some x-link or website there and also we are having another meeting in Tokyo at the end of this month and stuff also that's also on zoom so if you're interested like don't hesitate to just follow these uh for more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3436.945,
    "end": 3440.41,
    "text": " Okay, I think this is basically what I prepared for today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3440.65,
    "end": 3453.307,
    "text": "As I have four more information also like KNZW783 on XOR Blue Sky, you will find several additional my resources and other things too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3453.347,
    "end": 3466.564,
    "text": "So hope I kind of like try to integrate or like incorporate make connection with different ideas and maybe the study application for the future is up to the future",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3466.544,
    "end": 3483.777,
    "text": " study and research and others so also good to keep discussion or interdisciplinary thinking and even potential collaboration stuff though okay that's about it thank you so much awesome thank you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3486.085,
    "end": 3496.737,
    "text": " okay for those watching live they can write any questions i i kind of wanted to pick up on the connection with david bohm there you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3498.353,
    "end": 3527.652,
    "text": " brought up communication and the underlying sort of pilot wave of proficiency in terms of the implicate order but boom also developed the dialogue style so it's it's it's interesting how did you come to that connection and what do you think that means that in in there's sort of like a physics of cognition that's reached through dialogue and also vice versa",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.42,
    "end": 3551.142,
    "text": " yeah yeah so basically that the idea that i the implicate order that's the word that i thought is the best fit to explain what i wanted to talk about but of course like late david bomb talked about that importance of dialogue and others too which is actually pretty much echoing those charles percy's community of inquiry",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3551.122,
    "end": 3557.731,
    "text": " And also that P4C that I talked about, P4ELT is another way I put it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3557.791,
    "end": 3576.538,
    "text": "So through dialogue, discussion, and then together you approach closer to that truth or that some true cosmos, I would say, something that's some hidden kind of like implicate order, I can also say, which is also dynamic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3576.518,
    "end": 3592.047,
    "text": " so we can if we just say okay this is it so we verbalize everything and this is the whole rule maybe this is not always true which is actually impossible to just reach it so it needs to be fallibilistic though so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3592.027,
    "end": 3618.388,
    "text": " uh so in that sense i didn't actually i read but i haven't read for long about those david for me and those um dialogue aspect but that's pretty much uh resonating with those persian idea and also this uh community of inquiry philosophy for uh college or english language education idea there so yeah that's kind of like some i kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3619.567,
    "end": 3622.995,
    "text": " mutual permeation there, theoretically as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3623.075,
    "end": 3625.48,
    "text": "So the direction is basically similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3626.583,
    "end": 3627.966,
    "text": "Yeah, that was awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3627.986,
    "end": 3629.81,
    "text": "You made many great connections there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3630.051,
    "end": 3632.817,
    "text": "So how do you think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3633.32,
    "end": 3660.07,
    "text": " first and second language learning differ and and uh how do you approach that or how is it studied how does fep help us look at that because it seems like that first one comes pretty easily but second languages can be quite a struggle and there's connections with developmental critical periods and all of that but how can we look at that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3661.366,
    "end": 3690.782,
    "text": " yeah thank you so yeah a lot of studies debate disagreeing point about those things out there in my field for example there's a critical period some people say we have critical peers so if you're older than this age maybe you can no longer acquire those like a native like fluency but some people also say that well this is just sensitive period only so there's no clear critical fear critical period out there and also there's even",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3690.948,
    "end": 3708.163,
    "text": " now especially in applied linguistics there are more some social justice terms some people even say first language second language division we need to stop so of course like you know native speakers right like you know so oh you speak like native like you know so you don't native speaker even those kind of lead to some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3708.143,
    "end": 3712.709,
    "text": " discrimination, or, you know, or, you know, so kind of overlooking that diversity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3712.729,
    "end": 3728.329,
    "text": "So, so, but you know, like going out too much will make it less scientific actually, especially like some, if you just go too far into, there's no first language, second language, but still cognitively speaking, there's differences out there like bilingual, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3728.663,
    "end": 3738.635,
    "text": " If you are grown up with two or three languages at the same time, maybe the second language, first language are kind of mutually affecting each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3738.675,
    "end": 3749.068,
    "text": "But if you have your own first language, only one, and then you just started to learn it at school, for example, at the age of 12 or something, maybe that needs to be different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3750.01,
    "end": 3776.389,
    "text": " yeah mechanism out there so in that sense i would not i'm not completely for the idea of uh completely uh making all languages equal or uh just not disregarding the first language second language but still so especially for that this idea of free energy principles based insights will be useful so first language acquisition if it's the first language like you are like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3776.369,
    "end": 3804.3,
    "text": " baby or like first year old second year old maybe you don't you don't think you just intuitively or like maybe without even uh aware of uh those like higher cognition whatever you just acquire like input flood and also your uh kind of is that echoing or that's kind of you simultaneously learn the world as well so that's more organic process so which will be part of you so maybe it's effortless process though",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3804.28,
    "end": 3810.412,
    "text": " But the second language, especially if you learned it at school, not in communication stuff there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.893,
    "end": 3815.322,
    "text": "So you need different approaches there, especially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.683,
    "end": 3821.935,
    "text": "So for that, maybe just one typical traditional way, just focusing on, OK, so let's learn input first.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3821.915,
    "end": 3839.265,
    "text": " lot of input and then you know you just move on to output or like okay so you have different skills set of skills so let's learn these skills separately and stuff which is very operationalizable understandable and easier to just conceptualize but you need to make be careful that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3839.836,
    "end": 3844.623,
    "text": " the how to operationalize it and how it really is should be different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.184,
    "end": 3857.682,
    "text": "So in that sense, they can be actually completely kind of very complex and mutually intertwined with each other, even at some counterintuitive way sometimes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3858.163,
    "end": 3862.249,
    "text": "So it's always good to just keep in mind about those dynamic interplay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3862.229,
    "end": 3890.228,
    "text": " and that's as I would say kind of ontologically speaking or epistemologically speaking and also for those learning activity as well so kind of like using the boost of emotion I would say especially relating to those expected free energy minimization exploration idea there so those surprise all surprise all is to be minimized",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3890.208,
    "end": 3900.964,
    "text": " or the variational level, but the expected level, even those surprises may lead to exploration, curiosity, and more engagement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3901.425,
    "end": 3902.907,
    "text": "And that's really useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3903.088,
    "end": 3911.06,
    "text": "Maybe that's also fitting well into how our brain works about the really authentic drive toward learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3911.581,
    "end": 3919.152,
    "text": "So maybe learning activity in second language, maybe somehow, maybe it can be artificial, but hopefully",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3920.279,
    "end": 3928.081,
    "text": " authentically, infusing some authentic curiosity or some surprise element.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3928.863,
    "end": 3932.473,
    "text": "Maybe you are surprised about something you read, for example, some reading passage, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3932.533,
    "end": 3935.301,
    "text": "So you are internally curious about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3935.281,
    "end": 3951.417,
    "text": " like there's some uh this uh cognitive dissonance or something like that so you want to know more you want to see what's happening here or something yeah so those are actually better than okay just read this and just answer this question something so those curious stories",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3951.397,
    "end": 3957.729,
    "text": " not necessarily happy story, may lead to some deeper thinking without just exercising will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3957.95,
    "end": 3967.008,
    "text": "I need to study language or just doing internally intrinsically motivated to learn something with surprise, curiosity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3967.048,
    "end": 3973.32,
    "text": "So maybe trying to prepare some activity tasks, materials,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3973.3,
    "end": 3984.98,
    "text": " figuring those epistemic emotions, I think will be especially useful as a second language term for a way some material developer or a teacher, they can think about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3987.043,
    "end": 3990.028,
    "text": "Yeah, sometimes it feels like a flood of surprises.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3991.41,
    "end": 3992.372,
    "text": "When it's just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3993.972,
    "end": 4014.225,
    "text": " It's like being with it and then losing the grasp, but I guess that's what the proficiency is, is being able to stay with the flow of the sights and the sounds until it becomes incorporated into a subliminal level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4015.893,
    "end": 4037.513,
    "text": " What kinds of empirical studies or works in your group or kind of data sets that shine a light on what kinds of language exercises or patterns we can analyze this way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4039.552,
    "end": 4041.356,
    "text": " Okay, so empirical studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4041.496,
    "end": 4045.844,
    "text": "Actually, my empirical studies are not very pedagogical studies, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4045.945,
    "end": 4052.137,
    "text": "My empirical studies has mostly, you know, one of my research areas is vocabulary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4052.157,
    "end": 4059.231,
    "text": "So I have usually done experimental studies about some vocabulary acquisition, like using computers and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4059.211,
    "end": 4080.679,
    "text": " different conditions of presenting sentences or words different tasks to like process put out and also like answer and there are different size of keyboard like yes no or choose the best one something and then after that like they are tested the like else about the memory of those study session items and actually which condition resulted in better memory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4080.659,
    "end": 4095.512,
    "text": " yeah and also for example this one on the right side this one's like take some negative sentence with positive word or positive word negative sentence so some condition that makes you somewhat surprised",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4095.56,
    "end": 4121.331,
    "text": " like what so so like some makes you feel curious actually these conditions led to better memory performance although it was incidental learning condition in other words students were not instructed to try to memorize everything so it was only when they are not just see saw it just once or twice only and naturally they remembered some sentences that had some surprise in it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4121.311,
    "end": 4128.503,
    "text": " So in that sense, this is another empirical side of the deep epistemic emotion hypothesis, actually, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4128.652,
    "end": 4153.748,
    "text": " and so empirical study this is it and of course something that's coming before is like this is like some shallow processing deep processing task so some condition that you need to think about the meaning carefully and that was facilitated more by some positive words or positive context so that's actually positive emotion task",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4153.728,
    "end": 4179.617,
    "text": " and this is another similar study one of the oldest one like some similar condition like apple or looking at some easy english word english is as a foreign language word for japanese student and just they look at the word they think about the emotion aspect they think about the meaning aspect or the perception aspect i mean emotional aspect resulted in deeper so these are there and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4179.597,
    "end": 4201.335,
    "text": " about pedagogy pedagogically speaking maybe several insights yeah maybe i need to do more empirical study about there they are they are still kind of like some practical ideas with some student responses i published some and also some links up information available here but uh usually that leads to students are kind of enjoying or engaged",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4201.315,
    "end": 4230.175,
    "text": " and also they learned they are more interested in what they learned or they're kind of a flow state sometimes so but it's kind of hard to experimentally test the memory of specific items especially because they may encounter the same item in different situations outside classes and stuff as well but but at least some psychologically speaking activity does leading to natural engagement natural interesting motivation surely",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4230.155,
    "end": 4234.024,
    "text": " known to affect better learning performance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4234.285,
    "end": 4248.838,
    "text": "And for that, maybe those epistemic emotions based on those expected free energy minimization and also the interconnectedness of different factors will provide a good insight about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4248.818,
    "end": 4250.121,
    "text": " which I'm still on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4251.042,
    "end": 4260.08,
    "text": "So I haven't grasped everything and still I'm just yesterday I was reading those naive 2020-2025 this year's new book and also others.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4260.1,
    "end": 4270.0,
    "text": "So maybe I may need to also myself be fallibilistic and try and update my way of thinking or putting it into hypothesis and stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4270.688,
    "end": 4273.932,
    "text": " Yeah, that feels really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4274.093,
    "end": 4300.408,
    "text": "I mean, if the examples or the test questions in language learning curriculum can be brought into something like a zone of optimal surprise, or there are some exercises or prompts that learners could be guided through,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.637,
    "end": 4328.168,
    "text": " like rather than just reading a vocabulary list like each term you know just like you had with the apple there each term do this sequence of events when the term when you see the term here's kind of the pattern of how you process it internally like that that could um bring a lot of cognitive neuroscience to bear",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4328.654,
    "end": 4332.657,
    "text": " on what otherwise is kind of this implicit skill",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4333.902,
    "end": 4363.842,
    "text": " that it's just like am i supposed to look at this list of words and just memorize it but even if i wanted to do that like definitely in school and even now in language learning sometimes i just stare at words i just think what am i supposed to do just look at this until what happens let's wait wait for lightning to strike or something but this gets really into the procedural and into even holistic and integrative ways to connect it with like with our embodiments",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4363.822,
    "end": 4383.248,
    "text": " that could ground language learning and bring something that can be really tedious and cognitively demanding into something that could and should connect with what's delightful and what's motivating with why we're learning this language.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4384.46,
    "end": 4405.742,
    "text": " and also you're having some better idea about cognition so instead of just separating scale trying to like improve each one by you know so there's some interconnectedness behind and also some ideas uh in free energy principle and which will provide some of the sound more i would say",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4405.722,
    "end": 4434.548,
    "text": " of course all theories may need to be revisited somehow but something which is more scientifically grounded and also more holistic I would say and also more taking into account those permeating nature of different things kind of like a Bergsonian sense and so that's so that's uh uh we will provide some maybe better even for example like language educator education for example that's also what I'm kind of involved into like so future language teachers",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4434.528,
    "end": 4463.843,
    "text": " like teaching them in graduate schools there for them to have of course the classic theories of language learning is nice and good to know as classics but maybe actually things are more complexly intertwined with each other or actually we are kind of unconsciously making predictions all time or so so those things uh it's good to for also future teachers to at least know and also try to see how they can operationalize it also like when they look at students they can also think about those dynamic things going on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4463.823,
    "end": 4487.89,
    "text": " or like they can assume maybe a better epistemology or better way of looking at human cognition and that will result in better so so why you can see how how to motivate students maybe looking at into these for example epistemic emotions and other stuff will provide maybe better insight or probably better approach about how to make students motivated and stuff",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4487.87,
    "end": 4492.941,
    "text": " Instead of just, okay, motivation factor here, learning factor here, how to combine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4493.021,
    "end": 4496.388,
    "text": "But maybe something behind is actually pretty much connected.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4496.408,
    "end": 4501.339,
    "text": "So maybe working on that, looking at that is really important for educators as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4504.458,
    "end": 4530.313,
    "text": " also i think you you very richly entered into these philosophical questions and um i also thought about the generative modeling of the student and also the language learning of language models and other kinds of artificial intelligence and how they have some similar dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4531.441,
    "end": 4561.38,
    "text": " and yet you know did they also have free energy principle grounded language learning or what what is human language learning is what we engage in but what what might we learn from other systems and their language learning and like would their with the generative models that describe their proficiency have a similar templating",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4562.542,
    "end": 4565.835,
    "text": " or perhaps different templating than ours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4568.617,
    "end": 4570.76,
    "text": " That's a very good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4570.82,
    "end": 4575.327,
    "text": "Maybe I cannot answer fully yet, I would say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4575.367,
    "end": 4576.729,
    "text": "Still kind of learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4576.749,
    "end": 4585.963,
    "text": "Of course, how kind of like a free energy principle itself is applicable or valid to apply, that's another question as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4585.983,
    "end": 4596.058,
    "text": "That's exactly written in the Drive to Survive, the NAVE 2025 book there as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4596.038,
    "end": 4624.324,
    "text": " so maybe I think maybe not completely digesting it myself but maybe some Markov blanket with some autonomy element is needed or energy information structure adaptation closure or constraint closure I think there's something there that's maybe better that that's that that we can I can incorporate more from it actually so some autonomousness intentionality so these needs to be more theoretically incorporated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4624.304,
    "end": 4650.413,
    "text": " so so in that sense maybe this is not negating free energy but kind of like more expanding or kind of maybe maybe sophisticating uh the free energy insights in what's the name like bio inactivistic ideas out there so i think that will especially for like education those may bio inactivistic idea will probably be pretty more like useful and so in that sense maybe there is something more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4650.393,
    "end": 4677.008,
    "text": " I need to learn as well so maybe I cannot make a pretty short comments but I think this free nature principle is onto something they're very good something I would say and also that's surprisingly echoing some old insight like I myself like some like Bergson white head purse I think you know like maybe people will know like oh you like those philosophers type of vision I have but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4676.988,
    "end": 4705.527,
    "text": " surprisingly those free energy principle having some shared view like the interconnectedness or like a perception action like extension or all like trying to avoid just fragmenting things but trying to grasp or that ungraspable wholeness and then like how to derive different mental faculties or functions out of it in a very dynamic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4705.507,
    "end": 4726.637,
    "text": " manner and just even languages itself can kind of fix it and stabilize concepts and again like they may become easily become some dead concepts and if you just use it apply differently maybe it's no longer very valid those validation crisis is a pretty big thing in my field",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4726.617,
    "end": 4747.731,
    "text": " some for example motivation theory a lot of people talk about that use that theory but actually maybe that's not very scientifically valid just you know so those claims are made but so especially for those theories models to propose that based not only on observations or some factor analysis and studies but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4747.711,
    "end": 4776.587,
    "text": " something based more on those philosophy, I would say, or even some deep neuroscientific, including free energy, but also even some Bergsonian, Persean, Whiteheadian ideas about, so like human nature, even some David Blumian idea, of course, in Canada as well, will maybe provide some more like long-lasting research framework, and that'll be pretty more useful than just something, here's a new category and stuff, so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4776.567,
    "end": 4805.832,
    "text": " It's a great point and language itself and the study of language revealing our ontologies for the world and these philosophical topics of nouns and verbs and adjectives and grammar and like using language to learn about language including what the reference of language is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4805.812,
    "end": 4832.494,
    "text": " and like that sort of inactivism meets semiosis and the self-awareness of that process and the science of that process yeah semiosis exactly that's first yeah like try is not just to uh what is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4832.795,
    "end": 4845.328,
    "text": " Sosirian, Sinifean, Sinifea, but he's an interpreter on the third kinds out there, which is kind of similar to dialectics there, but that's pretty also onto something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4845.969,
    "end": 4858.161,
    "text": "And also at the same time, it's kind of like a new project that I'm kind of starting to work on, but of course, looking into those universal Searle rule behind something is also important, but also at the same time, especially",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4858.141,
    "end": 4868.556,
    "text": " language there are a lot of some diversities for example i'm based in japan so like some japanese language or some japanese psychological background and also for example like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4868.873,
    "end": 4894.071,
    "text": " like Germany for example or British or even like Europe there are a lot of differences out there Africa different parts of Asia America Latin North so differences out there but in those differences how things are different but still how they are similar so those are also pretty much interesting to look into even like language teaching approaches like that's pretty those",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4894.051,
    "end": 4895.954,
    "text": " cultural variations are pretty big.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4896.535,
    "end": 4900.721,
    "text": "Japanese students tend to be shy and perfectionist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4901.723,
    "end": 4905.128,
    "text": "So these differences surely will make some difference out there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4905.488,
    "end": 4911.457,
    "text": "But still, some cultural concepts could also be applied from one culture to a different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4911.517,
    "end": 4915.924,
    "text": "Something that I'm just publishing on a paper soon is something called a Yari Gai.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4915.904,
    "end": 4938.233,
    "text": " which is based on like ikigai ikigai is kind of buzzword like the worth worthness of livings or something but that's situating it to activity is something called yarigai and that's actually a lot of several studies are published already in english about what constitutes yarigai which is japanese concept but that's kind of integrating like engagement motivation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4938.213,
    "end": 4943.538,
    "text": " Also, not just that, some value or like social contribution, a lot of different things inside there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4943.578,
    "end": 4950.824,
    "text": "So that's something I'm also kind of trying to do is like how to try to grasp those interconnectedness using some nice keywords.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4950.844,
    "end": 4954.027,
    "text": "So something that I'm starting is using Yari Guy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4954.608,
    "end": 4958.912,
    "text": "That's a paper I think soon to be published in May or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4958.972,
    "end": 4961.914,
    "text": "But yeah, so that's another way they're going to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4962.075,
    "end": 4963.756,
    "text": "Some are related, not completely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4963.796,
    "end": 4965.958,
    "text": "Hmm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4966.377,
    "end": 4969.36,
    "text": " That sounds very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4970.962,
    "end": 4971.162,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4971.182,
    "end": 4971.443,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4972.264,
    "end": 4980.593,
    "text": "Well, do you have any last comments or updates or what directions you're going to be taking things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4982.455,
    "end": 4982.816,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4982.836,
    "end": 4984.598,
    "text": "So basically, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4984.778,
    "end": 4991.085,
    "text": "So I think I'm still learning a lot and yeah,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4991.858,
    "end": 5021.713,
    "text": " metaphorically speaking it's it's always important not to like uh sit deep on the couch or something i would say so you know i was like okay so here's the theory i have so i just like live on it or something we shouldn't do that so like always looking at some new ways of like the latest psychological and neuroscientific ideas the actually deep philosophical ideas that's kind of forgotten but pretty making useful kind of like driven by intuition actually in a sense though",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5021.693,
    "end": 5037.812,
    "text": " but kind of keeping on learning and also keeping even collaboration as well so actually so my field is the second language education basically but so a lot of including free energy I draw inside outside",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5037.792,
    "end": 5055.025,
    "text": " second language education typical literature actually but that's also very important there i think and also even potentially you important for like from science there too for science to for example like language education is a field of really big",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5055.005,
    "end": 5077.57,
    "text": " applicability these like theory and practice are kind of mixing with each other since so actually in there those dynamisms maybe it can be used as a nice field to test or maybe observe some theoretical aspects there too so maybe trying to search for or maybe even deeper maybe even creative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5077.55,
    "end": 5104.063,
    "text": " disciplinary interdisciplinary collaboration or borrowing insight from the one the other so giving on thinking about that and also in revising it and trying to like approach that truth in a Persian sense maybe that's a pretty important thing to go for and also I'd like to keep on the journey so that's why also I started learning free energy little by little now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5104.482,
    "end": 5121.883,
    "text": " yeah so I'd like to continue the journey and also I hope uh that listeners or anybody is also trying to even if you are some like neuropsychologist and be trying to how it can it could be applied for example like education or if you're like teachers language teachers maybe how their",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5121.863,
    "end": 5146.656,
    "text": " observations actually can be linked to some philosophical insights or even these neuroscientific insights out there so trying to go interdisciplinary and go even creative will be something which I would like to maybe as a final comment and also some final like agenda manifest myself as well as a researcher I'd like to just keep on doing it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5147.851,
    "end": 5148.392,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5148.552,
    "end": 5176.693,
    "text": "I think where what you've presented takes me into sleep and beyond is that when we have dialogue across our agent boundary with another and when we have dialogue internally with multilingualism internally there's the juxtaposition of multiple",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5177.534,
    "end": 5206.562,
    "text": " syntaxes that allow for that triangulation of semantics and that can can open up a triangle or more whereas within one perspective and one language it's like looking only through a microscope or a telescope but in in external and internal dialogue and learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5207.386,
    "end": 5235.705,
    "text": " we can really get somewhere exciting exactly even in in your brain as well there's some I'm kind of like a frequent reader of things and if anybody here uh follow my like X or something I usually post a lot about some papers that I read but there are some multilingual theories suggesting that like you know like even your personality ways of thinking is influenced by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5235.685,
    "end": 5250.994,
    "text": " language that you're using so if you just use one language to think maybe of course that's fine but if you have several two or three languages maybe you have different insight even within you you for example you think about it in japanese language",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5250.974,
    "end": 5266.114,
    "text": " but the other day like you think in English language different syntax maybe and there's maybe no complete theory there I think that leads to some new ways of thinking even when you're just thinking yourself and maybe that's also good for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5266.094,
    "end": 5295.932,
    "text": " brain some people say you know so people with bilinguals trilinguals are you know even like they are having less dementia risk or something so even with yourself like internal dialogue there too maybe having a lot of those different languages second language foreign language and trying to use it in your brain looking at the same thing in different perspectives or different concepts and some concepts overlapping in one language with different others and things so these are also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5295.912,
    "end": 5299.56,
    "text": " pretty pretty good way to exercise your",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5299.996,
    "end": 5302.299,
    "text": " cognition and try to make it dynamic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5302.639,
    "end": 5305.202,
    "text": "That's a kind of key word there, complex and dynamic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5305.242,
    "end": 5310.188,
    "text": "So trying to capture those, keep up, not to fossilize your cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5310.248,
    "end": 5315.054,
    "text": "Maybe it's good to use, maybe shake yourself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5315.354,
    "end": 5326.948,
    "text": "Not to fossilize your brain or thinking yourself, maybe learn new languages and then new concepts, new ways of thinking and keeping on dialogue externally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5326.928,
    "end": 5350.945,
    "text": " also maybe internally will be a pretty good way a pretty powerful tool those foreign languages are that's a thing I also also experientially think myself too thank you again looking forward to hearing more updates from your research and learning with you yeah thank you thank you so much bye",
    "speaker": "SPEAKER_01"
  }
]