[
  {
    "start": 7.383,
    "end": 9.012,
    "text": " Hello, it is March 9th, 2022.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 11.684,
    "end": 16.727,
    "text": " We're here in ActInf Lab guest stream number 17.1 with Mau Aparassan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 17.527,
    "end": 28.953,
    "text": "And Mau is a product director at Game Addict, a researcher at Versus Computational Phenomenology Lab, and finishing a PhD in Cognitive Computing at UQAM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 29.253,
    "end": 31.594,
    "text": "So we'll have a fun discussion today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.934,
    "end": 36.857,
    "text": "Feel free to write any questions in the chat during the presentation, and we'll...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.617,
    "end": 38.718,
    "text": " have a great time learning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.758,
    "end": 43.9,
    "text": "So thanks a lot for joining this guest stream and really looking forward to what you have to share.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.381,
    "end": 46.541,
    "text": "Yeah, thanks for having me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 47.141,
    "end": 53.244,
    "text": "I'm really glad to be able to present this paper we've we've submitted it and we're in the process of reviewing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 53.284,
    "end": 57.846,
    "text": "So it's a really exciting paper that I'm hoping we can get out soon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 58.727,
    "end": 58.847,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 59.622,
    "end": 73.931,
    "text": " Today I'm going to try to go through a lot of big concepts and how they apply in active inference, and then I'm going to try to explain the nitty-gritty of a generative model, how to make a simulation, and then what are the takeaways and limitations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 74.631,
    "end": 75.852,
    "text": "I'm going to try to keep this quick.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 76.412,
    "end": 80.515,
    "text": "If you have any questions, feel free to ask them, and I'll take anything as it goes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 83.936,
    "end": 91.239,
    "text": " Let's begin with the main concept here, which is confirmation bias and conformity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 91.279,
    "end": 93.86,
    "text": "This was the starting point of our research.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 94.48,
    "end": 99.882,
    "text": "We were thinking with my co-authors, which are Connor Hines,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 100.652,
    "end": 114.177,
    "text": " and Daphne Damakis and Maxwell Ramstad, we were trying to think through what leads people to see the world in such a way that they have a hard time then reconciling their view of the world with other people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 115.214,
    "end": 124.098,
    "text": " And so it went back to the practice of exchanging ideas, sharing concepts and values between different minds, which is a fundamental process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 124.839,
    "end": 129.681,
    "text": "It really allows humans and other living agents to coordinate and basically operate socially.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 130.382,
    "end": 136.585,
    "text": "By sharing ideas, individuals, communities can really pursue their pragmatic goals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 137.065,
    "end": 142.728,
    "text": "So basically, you know, get food is one of the pragmatic goals you might want to optimize for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 144.169,
    "end": 145.851,
    "text": " They improve their understanding of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 146.531,
    "end": 151.475,
    "text": "And then we notice that humans are compulsory cooperators.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 153.857,
    "end": 165.166,
    "text": "Human individuals survive based on the predication that they have access and they can leverage the bodies of a community and cultural knowledge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 166.528,
    "end": 170.291,
    "text": "Over the course of evolutionary history, humans have developed and evolved",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 171.189,
    "end": 186.725,
    "text": " exquisitely sensitive capacity to discriminate between reliable sources of information from unreliable ones, which seems counterintuitive in the age that we're at, but you have to understand how far we've come before we got to the arms race towards misinformation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 188.727,
    "end": 188.847,
    "text": "So,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 190.714,
    "end": 194.558,
    "text": " The epistemic process, as I just said, it's really not real flaws.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 195.299,
    "end": 198.122,
    "text": "Humans are not computing machines.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 198.182,
    "end": 198.983,
    "text": "They're not perfect.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 199.043,
    "end": 200.345,
    "text": "They mostly use heuristics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 201.386,
    "end": 207.593,
    "text": "They process information by reasoning to limit the consumption of energy and facilitate rapid decision making.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 207.633,
    "end": 210.016,
    "text": "That's the basis of survival.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 211.032,
    "end": 220.258,
    "text": " For example, confirmation bias implies that all other things being equal, individuals will prefer sticking to their own beliefs over changing their minds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 220.438,
    "end": 232.966,
    "text": "It's easier for them to potentially change their model less than if they had to really all the time constantly deal with the volatile model of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 234.48,
    "end": 239.402,
    "text": " There's a lot of research about confirmation bias and its relation to cognitive dissonance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 239.482,
    "end": 241.323,
    "text": "We really don't like cognitive dissonance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 241.383,
    "end": 245.484,
    "text": "We don't like feeling like the world is not what we understand it to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 246.725,
    "end": 253.287,
    "text": "And when we're faced with information that conflicts with our core beliefs, we do in fact experience cognitive dissonance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 255.579,
    "end": 258.961,
    "text": " the tolerance for cognitive dissonance tends to vary across individuals.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 259.001,
    "end": 266.807,
    "text": "So there's people who can really tolerate a wildly volatile world and they accept that they don't know things and they accept that they could be wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 267.127,
    "end": 275.374,
    "text": "And then there's personality types who are much less likely to take this dissonance and are more likely to try to avoid this dissonance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 276.434,
    "end": 279.997,
    "text": "And so confirmation bias in this way has a social influence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 280.938,
    "end": 283.74,
    "text": "Individuals will prefer sampling data from their in-group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 284.022,
    "end": 289.545,
    "text": " and will seek to confirm their own ideas by forging for confirmatory information from their in-group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 291.146,
    "end": 301.071,
    "text": "This ensures that they have access to like-minded allies, and they choose to belong to communities where their deeply held beliefs are promoted and shared.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 301.551,
    "end": 305.353,
    "text": "This limits the cognitive effort that is already expended in the forging of information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 306.814,
    "end": 312.417,
    "text": "This in-group delivery also influences how strongly information is integrated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 312.892,
    "end": 323.318,
    "text": " So if a group membership is important for the individual, they'll tend to integrate way more information that comes from someone they believe believes the same things as them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 324.758,
    "end": 327.24,
    "text": "For instance, you can think of news sources and Fox News.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 327.64,
    "end": 333.263,
    "text": "So it's not like people from different aisles don't know what the others are saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 333.523,
    "end": 340.927,
    "text": "They just tend to take what their preferred channel says and completely ignore what other channels are saying, even if they've heard it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 343.157,
    "end": 351.605,
    "text": " So the confirmation bias is echoed by another heuristic, and we're talking about conformity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 351.905,
    "end": 354.868,
    "text": "So that's the need to cohere with the beliefs of one's in-group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 354.888,
    "end": 357.57,
    "text": "So it's kind of a push and pull, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 357.65,
    "end": 364.616,
    "text": "I want to be in a group of people who are like-minded, and I want to believe the same things that I believe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 364.716,
    "end": 368.32,
    "text": "Therefore, going in a group of people who are like-minded is the best way to do so.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 369.338,
    "end": 375.003,
    "text": " I also don't want to be kicked out from the group because the group has access to a lot of resources that is very good for me, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 376.625,
    "end": 380.889,
    "text": "It limits how much information any one agent has to gather to be part of a group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 382.23,
    "end": 385.173,
    "text": "It also increases how much each agent is trusted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 387.955,
    "end": 394.021,
    "text": "In-group agents can be way more precisely predicted by the other members of their group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 395.531,
    "end": 399.292,
    "text": " This is in part due by norms and behaviors, scripts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 399.532,
    "end": 401.112,
    "text": "We wrote another paper about this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 402.112,
    "end": 405.573,
    "text": "And generally, these scripts tend to benefit the members of the group, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 406.493,
    "end": 409.814,
    "text": "That's why they also want to uphold these scripts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 411.154,
    "end": 415.815,
    "text": "So being able to sample from the group entails a continued relationship to other members.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 416.655,
    "end": 423.756,
    "text": "If I lose access to this, I can lose access to information, food, shelter, and, you know, it leads to difficulties.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 426.377,
    "end": 429.338,
    "text": " If you want to read more, I can eventually give you all the resources.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 431.558,
    "end": 435.019,
    "text": "So this is a natural stopping point if you want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 435.099,
    "end": 438.079,
    "text": "If you have any questions, if you have any notes, you can share them now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 441.34,
    "end": 452.042,
    "text": "It was really powerful what you said about the losing access to the group benefits, especially from just the evolutionary and ecological point of view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 453.041,
    "end": 461.249,
    "text": " What are the scripts and how does this current work that you're sharing relate to the work that you had done with narrative and scripts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.371,
    "end": 462.651,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.312,
    "end": 466.295,
    "text": "So, I mean, the definition of scripts does not...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 467.483,
    "end": 469.224,
    "text": " perfectly shared across the board.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 469.264,
    "end": 471.366,
    "text": "There's a lot of fields that use it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 471.906,
    "end": 476.57,
    "text": "But the way that we've reviewed the literature and brought it together, we have weak scripts and strong scripts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 476.59,
    "end": 491.461,
    "text": "So weak scripts are like clusters of connected concepts that tend to exist with one another in a sort of, yeah, it's like the building of a context with naturally co-occurring concepts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 491.98,
    "end": 498.403,
    "text": " And then the strong scripts is how these concepts tend to sequence over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 498.443,
    "end": 509.227,
    "text": "So like for instance, there is going to be a natural entailment to certain events that they gather the concepts together, and then you're going to be able to exist in a space like this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 511.248,
    "end": 514.089,
    "text": "And that's how you norm",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 514.634,
    "end": 525.82,
    "text": " not only how people behave in a group, but how they coordinate that is how you norm, how the sample reality, because let's say, let's imagine my script in this place says that I must do this, this and that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 525.84,
    "end": 531.943,
    "text": "So I'm going to do this, this and that, which means I'm not going to have access to all the other things I might've done if my script had been a little different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 532.463,
    "end": 539.607,
    "text": "So that's one way that we, um, we force people to only look at a subset of the, of the available information in a given space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 542.517,
    "end": 542.777,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.997,
    "end": 544.899,
    "text": "And then how did it relate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 545.059,
    "end": 550.142,
    "text": "Or how does this research build upon what you had done those few months ago?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.403,
    "end": 551.583,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 551.623,
    "end": 556.287,
    "text": "So the previous paper had formalized what a script means in terms of active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 556.347,
    "end": 569.056,
    "text": "And basically, you with you as an agent with your niche, predict what you're what you're supposed to do next.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 569.156,
    "end": 570.597,
    "text": "So it puts us",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 570.879,
    "end": 575.823,
    "text": " strong emphasis on your available policies and the way that your policies are shaped.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 576.484,
    "end": 582.909,
    "text": "And then you're going to tailor your prediction error on the response of the nation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 582.949,
    "end": 590.115,
    "text": "So then you're going to get to this sort of sequenced patterns of synchronization that reinforce each other, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 590.135,
    "end": 593.077,
    "text": "So the more I get the right pattern,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 593.553,
    "end": 597.054,
    "text": " the more I'm likely to get good reinforcement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 597.114,
    "end": 601.175,
    "text": "And therefore I'm going to, you know, think that this is the right pattern for this group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 601.235,
    "end": 613.579,
    "text": "And this is going to shape the niche so much so that if anyone even wants to, or tries to enact something different, they may just get so much prediction error that, you know, people just will, will push back on it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.619,
    "end": 621.501,
    "text": "And you're going to stay within this sort of manifold that has, you know, the center points that, that gets all the States in, but,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 622.657,
    "end": 630.679,
    "text": " The way that we're using this research to build on the previous one is that we understand that a script takes many forms, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 630.719,
    "end": 635.94,
    "text": "The weak version of the script is really something you could call an ideology, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 635.98,
    "end": 646.142,
    "text": "So if you take all of my weak scripts, really what this is is how do I map my observations to my state?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 646.502,
    "end": 647.582,
    "text": "It's really what it is, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 648.322,
    "end": 650.903,
    "text": "And so this new research is saying, well,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 653.098,
    "end": 669.77,
    "text": " Agents are going to map things differently, and thus they're going to end up into different groups by simple virtue of mapping things so differently that eventually it makes no sense for them to try to interact with one another because they couldn't synchronize anyway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 670.39,
    "end": 674.753,
    "text": "So that's how this builds upon the previous research.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 676.735,
    "end": 676.975,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.415,
    "end": 677.976,
    "text": "Does that make sense?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 679.257,
    "end": 679.537,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 680.377,
    "end": 680.998,
    "text": "Please carry on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 684.13,
    "end": 690.753,
    "text": " Okay, so we've discussed confirmation bias and conformity, and we've discussed how they mutually reinforce each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 691.633,
    "end": 700.937,
    "text": "So to save energy, confirmation bias leads to agents being drawn to groups that validate their opinion and increase the probability of behavioral and epistemic conformity, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 700.957,
    "end": 701.897,
    "text": "So believe the same things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 703.117,
    "end": 705.238,
    "text": "And they form the basis of information spread.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 705.718,
    "end": 711.881,
    "text": "So agents spread information through media and through connections to one another, given a network structure, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 713.253,
    "end": 718.296,
    "text": " And the spread of ideas and behaviors serves local and larger scale coordination.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 718.316,
    "end": 732.705,
    "text": "This is very much based on the work of Maxwell, who has effectively discussed how active inference works across scale in nested Markov blankets that eventually build and become one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 733.706,
    "end": 740.59,
    "text": "So similar norms and coordination can be understood as synchronization, which lowers the cost of information flow.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 741.627,
    "end": 746.469,
    "text": " this increases the certainty of the message being spread as well as the quality of this reception.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 746.509,
    "end": 756.794,
    "text": "So just right there, this increased certainty, this capacity to spread messages, this quality of reception, you can see already how this might lead towards better synchronization, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 756.854,
    "end": 763.337,
    "text": "Because more certainty means you may have less attention to give to one thing in order for it to happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 763.377,
    "end": 769.7,
    "text": "And you can start thinking about other things and start specializing in other areas with this certainty staying up, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 771.255,
    "end": 780.042,
    "text": " The message will be more intelligible to group members who share the common set of codes and agents who are more likely to integrate new information if it fits better with their understanding of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 781.303,
    "end": 785.986,
    "text": " So one example of optimization of message passing includes hashtags.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 787.007,
    "end": 790.75,
    "text": "They have been known to be heavy carriers of information in echo chambers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 791.21,
    "end": 803.619,
    "text": "They're used in partisan ways to reach people of similar mindsets who understand what the hashtag means and understand that this is a signal for them to interpret what's being said in the light they want to interpret it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 804.94,
    "end": 810.444,
    "text": "So the spread of information is optimized through hashtags as pseudo-metalinguistic categorization markers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 811.104,
    "end": 812.125,
    "text": " That was a lot of words.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 813.287,
    "end": 818.413,
    "text": "But really what it means is just that we see a hashtag.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 819.073,
    "end": 819.814,
    "text": "We know what it means.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 819.854,
    "end": 826.723,
    "text": "We know it has a lot of meaning without having to have a whole text for it, which is great for Twitter, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 827.544,
    "end": 827.664,
    "text": "So..."
  },
  {
    "start": 829.031,
    "end": 837.139,
    "text": " We labeled our communities in this study formed in the process of belief sharing as epistemic communities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 837.179,
    "end": 838.42,
    "text": "Now this term already exists.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 838.56,
    "end": 850.391,
    "text": "It was already used by other fields, but we've tailored it a little bit to mean specifically that our communities that share and spread a worldview or a paradigm or normalized sampling behaviors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 851.897,
    "end": 861.005,
    "text": " Individuals in the community are tied together by these practices, which reinforce the social signals acting as evidence for the shared model of the world, so hashtags.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 861.926,
    "end": 866.53,
    "text": "The echo chamber formation is an extreme example of epistemic communities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 866.69,
    "end": 873.996,
    "text": "Echo chambers tie people with similar views together, and they tend to actively work against the engagement with external sources.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 874.877,
    "end": 879.521,
    "text": "They become very epistemically vulnerable when members can really no longer assess",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 879.983,
    "end": 881.805,
    "text": " when an information is true or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 883.206,
    "end": 903.202,
    "text": "Only having access to a few sources limits how much information can be gathered and relevant sources of evidence really fall through the gaps and error will be propagated because it goes really well really fast and is integrated really strongly and so if the people can no longer tell whether it's false or not then the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 904.543,
    "end": 909.146,
    "text": " the system is much likely to be more vulnerable to misinformation and errors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 909.767,
    "end": 912.249,
    "text": "They'll have a difficult time to check errors against anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 912.689,
    "end": 919.614,
    "text": "And most minds in the echo chambers will become more and more synchronized and thus poised to make the same mistakes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 921.375,
    "end": 923.337,
    "text": "So that's a pretty big chunk right there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 925.378,
    "end": 926.979,
    "text": "If you want, we can take a peek.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 927.72,
    "end": 927.96,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 928.739,
    "end": 929.379,
    "text": " I had a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.0,
    "end": 934.461,
    "text": "What is a healthy usage of hashtags look like?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 934.481,
    "end": 945.905,
    "text": "Or how do we compress information and context and perspective in a way that might not have some of these like threats or failures that you're talking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 945.925,
    "end": 946.725,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 948.527,
    "end": 959.473,
    "text": " For the first part, I have an idea, but I've never read anything that specifically said this is a healthy use, so I'll venture a guess, but I'll start with the second part of the question that will give you a good sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 959.934,
    "end": 975.283,
    "text": "The way to keep communities healthy is to force them to be exposed to viewpoints they may not agree with, sources that they're not necessarily familiar with, and that have...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 976.645,
    "end": 978.746,
    "text": " more nuanced takes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 978.826,
    "end": 990.63,
    "text": "So the more you expose people to different kinds of people, different kinds of beliefs, the more likely they are to depolarize and be more open to possibilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 992.321,
    "end": 993.702,
    "text": " That's just a fact.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 993.802,
    "end": 996.143,
    "text": "Like we may think through our experience, no, you know what?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 996.183,
    "end": 1006.187,
    "text": "When I see my conservative uncle, my racist homophobic conservative uncle, when he talks, my teeth grit and I stop listening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1006.807,
    "end": 1008.168,
    "text": "Yes, that's true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1008.868,
    "end": 1011.609,
    "text": "But you still are exposed to him.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1012.649,
    "end": 1015.951,
    "text": "You still have to engage with his thoughts to some degree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1016.531,
    "end": 1018.992,
    "text": "And so your reaction to push him away",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1020.08,
    "end": 1036.233,
    "text": " that's a natural reaction and you might actually do it, but if you're never ever exposed to his thoughts, you will never be able to actually, first of all, really know whether they're not true because you've never engaged with them, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1036.813,
    "end": 1038.715,
    "text": "So that's one thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1038.775,
    "end": 1044.059,
    "text": "So the guess about the hashtags is maybe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1044.58,
    "end": 1048.463,
    "text": "Try to research hashtags that are not part of your community",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1049.421,
    "end": 1058.785,
    "text": " Um, and try to reach people who may not normally listen to you in a language that is potentially less polarized.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1059.505,
    "end": 1066.208,
    "text": "So if you really want someone, the best example of this is, um, Oh, she's a YouTuber.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1066.268,
    "end": 1067.188,
    "text": "She's amazing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1068.409,
    "end": 1069.169,
    "text": "Natalie.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1070.17,
    "end": 1071.19,
    "text": "When do you know her?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1073.011,
    "end": 1074.051,
    "text": "Not familiar right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.392,
    "end": 1078.253,
    "text": "I just, the thing is just, I don't remember the name of her channel, but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1080.654,
    "end": 1097.023,
    "text": " She basically specialized in philosophically deconstructive conservative talking points in a way that steel manned them and didn't just destroy them on a sort of, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1098.732,
    "end": 1100.013,
    "text": " value-based basis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1100.153,
    "end": 1113.841,
    "text": "It was more like, let's take these points, let's remove everything that actually really isn't true and take the kernel of truth in there and understand it through their eyes and reinterpret why this might actually still be wrong, but not in a way that was demeaning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1114.162,
    "end": 1117.083,
    "text": "And she reached a lot of people this way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1117.163,
    "end": 1121.006,
    "text": "She reached a lot of conservatives who were like, wow, okay, no, you know what?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1121.066,
    "end": 1121.446,
    "text": "I get it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1121.646,
    "end": 1123.127,
    "text": "And it was very effective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1123.547,
    "end": 1126.129,
    "text": "So I think that's the answer to your question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1127.944,
    "end": 1128.804,
    "text": " Oh, carry on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.205,
    "end": 1133.226,
    "text": "I'm sure we'll be able to bring active inference in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1133.266,
    "end": 1140.67,
    "text": "But it's awesome to be just building the context and seeing how there was motivation, and a perspective on the work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1142.23,
    "end": 1142.49,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1143.211,
    "end": 1152.535,
    "text": "So yeah, so one of the elements that maybe will, in fact, give you a good sense of how we're bringing active inferences is the concept of volatility and habit formation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1152.555,
    "end": 1152.655,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1154.116,
    "end": 1155.757,
    "text": " Stability in the group is not guaranteed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1156.498,
    "end": 1164.303,
    "text": "Optimal inference in a changing world requires integrating sensory data with beliefs about the intrinsic volatility of the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1164.963,
    "end": 1174.549,
    "text": "So environments with higher volatility change more often and thus have shorter intrinsic time scales at which the agent has to keep updating their beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1175.23,
    "end": 1181.494,
    "text": "And conversely, environments with lower volatility require a longer time scale to start updating your beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1183.45,
    "end": 1202.949,
    "text": " On the other hand, having a better ability to track potentially important fluctuations in information requires to pay attention to smaller changes, but increased attention to environmental fluctuations will potentially lead to increased sensitivity to random, non-informative changes in the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1203.97,
    "end": 1206.312,
    "text": "That might be called a higher false positive rate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1207.771,
    "end": 1213.936,
    "text": " It's important for agents to have the right understanding of the volatility in their environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1215.217,
    "end": 1223.123,
    "text": "One way to cope with volatility is to use the coping mechanism to constrain the uncertainty related to their own behaviors via habit formation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1223.143,
    "end": 1232.151,
    "text": "So here we are going to model habit as a form of behavioral reinforcement where behaviors become more probable as a function of how often they are engaged.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1233.071,
    "end": 1236.254,
    "text": "So an agent has engaged in a given behavior enough",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1236.929,
    "end": 1240.131,
    "text": " a habit can then be formed and become hard to unlearn.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1240.211,
    "end": 1248.755,
    "text": "And this is important as we understand both how parameters are set in our generative model, but also how echo chambers can form by habit formation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1249.585,
    "end": 1263.088,
    "text": " So in our model, behavior is driven by information seeking, which drives, uh, it's, it's, it's a drive that leads agent to preferentially sample information from other agents with beliefs that they believe are similar to their own.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1263.548,
    "end": 1276.791,
    "text": "So this, um, the way that I'm saying this believe that they believe is important in active inference because the inactive inference we're, we're starting from the assumption that we don't ever really know things are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1277.639,
    "end": 1282.122,
    "text": " kind of hidden from us and we have to infer what things might be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1282.522,
    "end": 1285.264,
    "text": "So I never really have access to what the other person believes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1286.164,
    "end": 1293.288,
    "text": "I think they might think this and I'm going to try to infer their beliefs based on some observations they're putting out into the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1295.53,
    "end": 1298.432,
    "text": "Okay, now we've coined that down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1300.553,
    "end": 1303.294,
    "text": "Let's start with active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1304.48,
    "end": 1305.38,
    "text": " We're getting to the meat of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1305.421,
    "end": 1308.662,
    "text": "I'm going to do a very short intro to Active Inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1309.383,
    "end": 1310.583,
    "text": "If you already know, great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1310.703,
    "end": 1312.584,
    "text": "If you don't, then this is going to be very informative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1314.045,
    "end": 1322.67,
    "text": "It's a biologically motivated framework that rests on first principles of self-organization in complex adaptive systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1323.655,
    "end": 1334.72,
    "text": " So self-organization part is probably the most important part here because active inference is potentially less interesting for rocks, for instance, because they tend to self-organize a little less.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1335.68,
    "end": 1346.985,
    "text": "I'm pretty sure we could effectively use it for larger models of astronomy, but effectively what you really care here is for things that tend to fight entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1347.844,
    "end": 1357.652,
    "text": " So it's premised on the notion that internal states of any biological system are statistically insulated from the environment that generates sensory observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1358.172,
    "end": 1361.135,
    "text": "So basically they have an inside and they have an outside.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1363.557,
    "end": 1372.264,
    "text": "And so they engage in inference about the causes of what gives them sensory states to really behave optimally to keep fighting entropy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1373.186,
    "end": 1380.895,
    "text": " So biological systems entertain a generative model of the latent environmental causes of their sensory input.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1380.915,
    "end": 1384.88,
    "text": "So latent because I don't know really what causes it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1384.92,
    "end": 1385.821,
    "text": "I can only infer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1386.897,
    "end": 1398.286,
    "text": " So it's a little different from reinforcement learning or reflexive behavioral algorithms because actions taken under active inference are guided by these internal beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1399.207,
    "end": 1410.917,
    "text": "In themselves, they are optimized with respect of an internal world model or a representation of the world's causal and data-generative structure, what we call the generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1412.238,
    "end": 1413.279,
    "text": "Agents in active inference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1413.906,
    "end": 1417.149,
    "text": " represent their own actions in their generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1418.25,
    "end": 1433.084,
    "text": "By performing inference on both hidden environment states of the world and the consequences of their own actions, they can select behavior which first achieves their goal or fulfills preferences,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1434.468,
    "end": 1438.031,
    "text": " And second, reduces uncertainty in the agent world model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1438.051,
    "end": 1441.153,
    "text": "So this is where we get to the epistemic part, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1441.854,
    "end": 1444.395,
    "text": "I want the world to be a certain way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1445.396,
    "end": 1450.72,
    "text": "And I also want to be less uncertain about my uncertainty of the world being the certain way, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1451.821,
    "end": 1456.845,
    "text": "So an agent's main objective is to increase their model evidence and to reduce surprise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1457.925,
    "end": 1458.846,
    "text": "Surprise is bad.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1460.687,
    "end": 1462.409,
    "text": "Consider an agent which is in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1463.89,
    "end": 1463.93,
    "text": "If",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1464.64,
    "end": 1470.563,
    "text": " I want to predict myself surviving, I want to see things which are likely to make me survive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1471.443,
    "end": 1479.567,
    "text": "If I'm surprised by something, it's probably not likely to make me survive and therefore it's probably something I should avoid.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1479.887,
    "end": 1484.789,
    "text": "Like for right now, I'm in my room, I expect the room to stay where it is, as it is, this is good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1485.149,
    "end": 1490.151,
    "text": "If it were there, were to appear on my right, it would be very surprising and probably very bad for me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1492.165,
    "end": 1501.092,
    "text": " Processes like learning, perception, planning, and goal-directed behavior emerge from this single drive to increase evidence for the agent's generative model of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1502.794,
    "end": 1504.455,
    "text": "So far, so good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1506.316,
    "end": 1512.862,
    "text": "So, the agents never directly act on sensory data, but they change their belief about what causes that data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1513.973,
    "end": 1515.614,
    "text": " This is a core step in active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1516.515,
    "end": 1520.197,
    "text": "It consists in optimizing these beliefs using a generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1521.118,
    "end": 1523.94,
    "text": "It's also known as Bayesian inference or Bayesian model inversion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1525.201,
    "end": 1533.286,
    "text": "This inference answers the question, what is my best guess about the state of the world given my sensory data and my prior beliefs?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1533.847,
    "end": 1535.708,
    "text": "I don't come into the world not knowing anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1536.749,
    "end": 1537.249,
    "text": "I have some",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1538.024,
    "end": 1546.174,
    "text": " basic beliefs about what's going to happen and then I'm getting observations and I make predictions about what might happen and then I act on those predictions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1547.215,
    "end": 1556.266,
    "text": "This follows Bayes' rule, where the optimal belief about hidden or latent variable, given some sensory data, is called the posterior distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1557.247,
    "end": 1557.667,
    "text": "If you want,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1558.476,
    "end": 1561.919,
    "text": " and keep going into that, or I can skip that one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1562.64,
    "end": 1569.586,
    "text": "But basically, you basically calculate the probability of something given something else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1570.106,
    "end": 1582.457,
    "text": "The active inference perception, the generation of a best guess about the current hidden state of the world, is formalized as the computation of a posterior distribution over some hidden states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1583.598,
    "end": 1585.96,
    "text": "And action, so the active part of active inference,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1586.847,
    "end": 1591.109,
    "text": " is the computation of a posterior distribution over policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1591.469,
    "end": 1596.251,
    "text": "Policies are just a sequence of potential states of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1597.672,
    "end": 1603.034,
    "text": "OK, so now we introduce the actual model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1604.555,
    "end": 1605.816,
    "text": "Is it clear so far?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1606.076,
    "end": 1607.777,
    "text": "Is the active inference part pretty clear?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1609.117,
    "end": 1610.058,
    "text": "That's awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1610.078,
    "end": 1614.16,
    "text": "You hit on many great active pieces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1616.613,
    "end": 1628.326,
    "text": " The only piece that really I wanted to mention was the difference between the observations, like what was said, and then the hidden hypothesized cognitive states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.247,
    "end": 1635.033,
    "text": "It opens up a space between what happened and why somebody said that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1636.483,
    "end": 1640.345,
    "text": " And so that comes up all the time in epistemic communities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.825,
    "end": 1644.467,
    "text": "What did the author mean by those words or what did the person mean by saying that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.947,
    "end": 1651.21,
    "text": "And so that's where the context is so important and active gives a framework that might help us model that kind of a scenario.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.268,
    "end": 1652.788,
    "text": " Exactly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1652.888,
    "end": 1677.514,
    "text": "And I mean, this is, this is exactly where we're trying to go with this research is that right now we want to model how people tend to have different views of the world, but the underlying phenomenon here, and we're going to try to dig more into that is that, or the hypothesis anyway, is that there is a literal different mapping between an observation and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1678.132,
    "end": 1686.056,
    "text": " and a state, which means for the same thing being seen by two different people, we're going to infer two very different things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1687.257,
    "end": 1703.466,
    "text": "And the funny thing is, then you come into the world of values where it's a whole other scale and stuff where we may be interpreting the same thing, but we'll have a spin on it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1704.286,
    "end": 1705.527,
    "text": "And that spin being like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1706.516,
    "end": 1707.677,
    "text": " no, no, I know what he meant.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1708.077,
    "end": 1709.598,
    "text": "I just fundamentally disagree with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1709.638,
    "end": 1720.624,
    "text": "And this is how we get into the web, these scripted webs of conceptual spaces where you see these graphs of concepts being connected, but at some point there's a rift.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1721.365,
    "end": 1726.568,
    "text": "And that rift makes it so that I value this and you do not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1726.648,
    "end": 1729.369,
    "text": "And so we can converge towards understanding",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1730.71,
    "end": 1735.853,
    "text": " without necessarily being able to converge towards acceptance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1736.253,
    "end": 1739.555,
    "text": "So this is still very hypothetical though.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1742.397,
    "end": 1748.439,
    "text": " One other note on what you just said there, it's like the difference between an orthodoxy and orthopraxis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.399,
    "end": 1757.761,
    "text": "So what is the similarity between conformity of thought and latitude on action, vice versa?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1758.381,
    "end": 1765.163,
    "text": "And then in what way are the systems around us like aligned or not with our preference about those features of systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.423,
    "end": 1768.424,
    "text": " Yeah, absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1768.824,
    "end": 1769.384,
    "text": "Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1769.664,
    "end": 1773.126,
    "text": "I mean, I feel like this could all be encased in C, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1773.526,
    "end": 1777.988,
    "text": "Like, we can interpret the same thing, but my C is way over there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1779.909,
    "end": 1780.65,
    "text": "I'm over here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1782.39,
    "end": 1784.992,
    "text": "So I'll explain C later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1786.072,
    "end": 1789.354,
    "text": "This made very little sense to a lot of people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1790.554,
    "end": 1792.195,
    "text": "So let's introduce the model a little more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1794.983,
    "end": 1804.971,
    "text": " We have individuals, agents who share information with one another, and they come to form beliefs about their local environment and about the beliefs of other agents in their community.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1805.071,
    "end": 1808.994,
    "text": "So to understand this phenomenon, we leverage thus the active framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1809.955,
    "end": 1819.883,
    "text": "Here, the organisms tend to minimize a quantity called variational free energy, which quantifies the divergence between the expected and the sense data as explained before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1820.742,
    "end": 1827.743,
    "text": " From this point of view, to select an action is to infer what I must be doing given what I believe and what I sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1828.865,
    "end": 1832.906,
    "text": " So there's been a lot of work done in this field on active inference to study social systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1833.346,
    "end": 1836.927,
    "text": "I'm not going to go over all of it, but there's really cool studies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1837.487,
    "end": 1847.49,
    "text": "I've just highlighted a few here where basically systems minimize free energy, give rise to large scale behavioral coordination.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1848.47,
    "end": 1850.09,
    "text": "Much of the work though is still theoretical.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1850.471,
    "end": 1854.091,
    "text": "So it'll be interesting to see how experimental work can delve into this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1854.612,
    "end": 1855.592,
    "text": "I know Jonas Mago,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1857.408,
    "end": 1861.13,
    "text": " are doing a lot of work on this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1861.69,
    "end": 1869.594,
    "text": "I think Laura is doing some cool work on this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1870.355,
    "end": 1876.658,
    "text": "At first glance, it might appear difficult to model a phenomenon like confirmation bias using active inference formulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1876.859,
    "end": 1877.079,
    "text": "Why?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1878.649,
    "end": 1893.26,
    "text": " Because remember, our agents are supposed to be guided by the principle of maximizing Bayesian surprise or earth silence, which requires to constantly seek out information that is expected to challenge one's world, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1893.3,
    "end": 1898.704,
    "text": "Because the more surprise I consume now, the less likely I am to be surprised later, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1899.724,
    "end": 1903.207,
    "text": "But information gain is subjective.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1905.009,
    "end": 1914.496,
    "text": " epistemic value or the Bayesian surprise or information gain is always an expected surprise from the point of view of the agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1915.357,
    "end": 1918.639,
    "text": "It's in relation to the agent's set of beliefs or generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1919.52,
    "end": 1930.809,
    "text": "And because of this subjectivity, the informativeness of epistemic value or epistemic value of an action can be arbitrarily far from the agent's expectation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1931.775,
    "end": 1947.963,
    "text": " So taking advantage of this, we gave agents what we refer to as epistemic confirmation bias by building a prior belief into the degenerative model that agents are more likely to sample informative information from agents with whom they agree a priori.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1949.144,
    "end": 1950.965,
    "text": "And this a priori notion is important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1951.625,
    "end": 1959.869,
    "text": "So agents will sample agents with whom they agree under the belief that the agents are more likely to provide higher quality information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1962.643,
    "end": 1966.967,
    "text": " This has a key difference with some traditional opinion models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1967.007,
    "end": 1973.473,
    "text": "There's been a lot of opinion models out there, not a lot with active inference, but definitely a lot with traditional approaches.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1974.354,
    "end": 1984.284,
    "text": "And so the implementation of bounded confidence to motivate polarization is usually hard coded in the agent's ability to perceive and thus update their beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1985.342,
    "end": 1995.867,
    "text": " In our model, polarization is motivated by the positive effect of confirmation bias and is thus directly in the agent's model of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1996.887,
    "end": 2003.73,
    "text": "This allows agents to get more evidence about their environment if the information comes from another agent that shares the same worldview.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2004.351,
    "end": 2011.734,
    "text": "They're implicitly motivated in their generative models to gain more evidence about the world if it confirms their pre-existing beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2012.995,
    "end": 2019.239,
    "text": " Also agents normally in traditional models can directly perceive the belief state of other agents, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2019.419,
    "end": 2021.12,
    "text": "Directly perceive, that's the key here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2022.981,
    "end": 2034.987,
    "text": "But in our model, this is pretty, we believe this is unrealistic because we only infer the beliefs of others and thus agents do not have direct access to each other's belief states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2035.187,
    "end": 2039.63,
    "text": "They infer the belief states and change them through observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2042.981,
    "end": 2052.847,
    "text": " There's been a few recent papers that began to build Bayesian models of opinion dynamics, which are motivated by the Bayesian brain hypothesis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2054.608,
    "end": 2063.132,
    "text": "A crucial point that distinguishes approaches like active inference and planning as inference from the generative Bayesian approach is the notion that actions themselves are inferred.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2064.493,
    "end": 2071.757,
    "text": "Behavior is cast as the result of inference, specifically by sampling actions from a posterior distribution over actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2073.162,
    "end": 2081.986,
    "text": " So actions are selected in order to achieve goals that minimize future uncertainty and to maximize a lower bound on Bayesian model evidence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2083.226,
    "end": 2090.97,
    "text": "So we're using this to supplement the goal-directed aspect of policy inference, which is driven by the expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2092.489,
    "end": 2097.951,
    "text": " And this becomes habits when the prior over the actions becomes inflexible, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2098.091,
    "end": 2103.492,
    "text": "So if the prior over actions becomes so strong, it's just always gonna be that, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2105.053,
    "end": 2106.593,
    "text": "This prior is learned over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2107.633,
    "end": 2114.675,
    "text": "And in the context of opinion dynamics, it can lead to a propensity to continue sampling agents that have been sampled previously.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2115.155,
    "end": 2120.337,
    "text": "So it's this idea of choosing action through inference in accordance with the minimization of uncertainty",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2121.044,
    "end": 2131.566,
    "text": " It's a powerful modeling technique because through the choice of policy inference, one can encode various social behaviors like conformity, habit formation, hostility, and indifference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2131.986,
    "end": 2143.488,
    "text": "Here we really only did habit formation because we had to focus, but eventually this could lead to very, very powerful modeling tools for social inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2145.748,
    "end": 2149.089,
    "text": "So I can stop here before I launch into the hypothesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2152.734,
    "end": 2153.034,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2153.154,
    "end": 2155.016,
    "text": "With active inference, let's keep going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2158.019,
    "end": 2158.319,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2158.64,
    "end": 2159.721,
    "text": "So we have three hypotheses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2160.682,
    "end": 2170.611,
    "text": "The first one is that we cast confirmation bias and active inference as a form of bias curiosity in which agents selectively gather information from other agents with whom they agree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2172.082,
    "end": 2177.989,
    "text": " Epistemic confirmation can mediate the formation of echo chambers and polarization in social networks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2178.51,
    "end": 2188.804,
    "text": "But we also believe that confirmation bias, epistemic confirmation bias and network connectivity will modulate the formation of polarized epistemic communities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2190.509,
    "end": 2197.014,
    "text": " Hypothesis number two is we consider the effect of agents' beliefs about the volatility of their social environments.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2197.634,
    "end": 2205.9,
    "text": "So we try to see how beliefs about social volatility impact their sampling behaviors, and which itself may interact with epistemic confirmation bias.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2205.98,
    "end": 2212.024,
    "text": "So we hypothesize that beliefs about less quickly changing social environments will increase the likelihood of polarization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2213.197,
    "end": 2224.223,
    "text": " And hypothesis three, we hypothesize that we can model selective exposure effects and conformity through habit formation, which emerges through Bayes optimal learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2224.603,
    "end": 2229.626,
    "text": "So we show that agents will begin to sample only those who belong to a particular epistemic community.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2230.746,
    "end": 2237.41,
    "text": "A greater learning range for habit formation will lead to clusters within the network, amplifying and quickening the formation of echo chambers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2239.471,
    "end": 2241.432,
    "text": "So, the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2242.699,
    "end": 2245.02,
    "text": " This is a multi-agent active inference model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2246.48,
    "end": 2254.703,
    "text": "A group of agents update their beliefs about an abstract binary state that represent two conflicting ideas and the opinion states about these ideas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2256.344,
    "end": 2262.566,
    "text": "Each agent also generates an action that is observable to other agents in the context of digital social network.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2262.626,
    "end": 2269.909,
    "text": "We're using the Twitter linguistics, but this was, we basically tried to replicate distributions that were fine in previous studies on Twitter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2271.34,
    "end": 2277.743,
    "text": " Over time, each agent updates posterior distribution or beliefs about which idea is true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2279.403,
    "end": 2282.925,
    "text": "And as well as a belief about what a connected set of other agents in the network believe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2282.965,
    "end": 2284.786,
    "text": "So basically what do their neighbors believe?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2285.706,
    "end": 2290.348,
    "text": "And both of these inferences are achieved by observing the behavior of other agents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2291.809,
    "end": 2294.17,
    "text": "Agents can only observe the behavior of one agent at a time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2294.19,
    "end": 2299.652,
    "text": "So they have to pick who they want to look at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2300.632,
    "end": 2303.435,
    "text": " All right, the generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2306.178,
    "end": 2312.424,
    "text": "I can go into detail if you want, but this is pretty, I know it looks like a lot, but it's actually pretty simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2313.606,
    "end": 2316.068,
    "text": "These encapsulate observations, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2316.449,
    "end": 2322.795,
    "text": "So this is the observation about what I'm tweeting, who I'm looking at, and what they're tweeting, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2323.672,
    "end": 2330.795,
    "text": " And then the A matrix is mapping the probability of a state having caused this observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2330.855,
    "end": 2334.816,
    "text": "So we have states about like, what is, is the ID true or not?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2334.876,
    "end": 2335.557,
    "text": "Is it ID one?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2335.597,
    "end": 2336.237,
    "text": "Is it ID two?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2337.457,
    "end": 2345.32,
    "text": "This is a bit blurry, but basically like which neighbor am I looking at?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2345.46,
    "end": 2347.161,
    "text": "And this one is who am I looking at?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2347.181,
    "end": 2347.981,
    "text": "What do they believe, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2348.061,
    "end": 2349.882,
    "text": "So it's pretty simple mapping.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2351.104,
    "end": 2352.645,
    "text": " Here you have D, which is the priors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2353.946,
    "end": 2357.83,
    "text": "So what do I believe about the world before having any observation about the world?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2358.27,
    "end": 2359.952,
    "text": "Then B is the transitions, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2359.972,
    "end": 2363.975,
    "text": "So how are the states likely to succeed one another?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2363.995,
    "end": 2367.118,
    "text": "Here you have the policies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2367.238,
    "end": 2374.925,
    "text": "So what kinds of actions am I likely to take to bring about this succession of states?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2376.059,
    "end": 2377.199,
    "text": " And C are my preferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2378.0,
    "end": 2380.68,
    "text": "So then there are other terms, but they're a bit more complicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2380.7,
    "end": 2386.402,
    "text": "So I'm not going to go into them, but basically these are the main, these are the main things you have to know about a generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2387.602,
    "end": 2395.104,
    "text": "So I'm going to skip real fast because there were little arrows and we could explain more, but man, just, yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2396.284,
    "end": 2403.966,
    "text": "Here, each agent, each active inference agent in the multi-agent simulation is equipped with the same generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2405.066,
    "end": 2408.208,
    "text": " A single agent observes the action of other agents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2409.348,
    "end": 2412.87,
    "text": "They form beliefs about an abstract binary environmental state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2413.31,
    "end": 2416.892,
    "text": "And then they choose actions which themselves are observable to other actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2417.613,
    "end": 2423.296,
    "text": "The focal agent consists of two simultaneous choices, an expression and an observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2423.316,
    "end": 2427.178,
    "text": "So basically, who am I tweeting and who am I looking at?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2428.436,
    "end": 2430.677,
    "text": " An agent can only observe one neighbor at a time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2431.398,
    "end": 2437.481,
    "text": "So at each time step, a focal agent both tweets its own hashtag and chooses to read a hashtag tweeted by another single agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2437.501,
    "end": 2438.902,
    "text": "So here we're saying hashtag again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2439.282,
    "end": 2440.563,
    "text": "This is just linguistic, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2440.663,
    "end": 2441.523,
    "text": "We could have said anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2441.583,
    "end": 2443.784,
    "text": "Basically, these are numbers in a matrix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2444.865,
    "end": 2448.127,
    "text": "Effectively, in a much more complex model, we could have had them",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2448.827,
    "end": 2459.331,
    "text": " um read a hashtag and a sentence and then try to infer what the sentence really says like that we could have done something much more complex but for now the point was just to make them try to infer a belief based on",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2489.629,
    "end": 2502.419,
    "text": " i hope mal will rejoin and then we'll continue hey are you there yep i'm so sorry i don't know what happened",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.103,
    "end": 2505.184,
    "text": " Oh, we get all kinds of surprises.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2505.785,
    "end": 2507.226,
    "text": "We prefer surprises here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2507.606,
    "end": 2508.887,
    "text": "You can reshare and just continue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.907,
    "end": 2511.909,
    "text": "It was only a few seconds, but it was great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2512.169,
    "end": 2516.352,
    "text": "When you say the right keywords and then the internet short circuits, it happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2516.372,
    "end": 2518.593,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2519.274,
    "end": 2521.455,
    "text": "Well, I don't see you anymore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2522.256,
    "end": 2522.616,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2522.696,
    "end": 2522.956,
    "text": "I'm here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2523.176,
    "end": 2523.356,
    "text": "No, no.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2523.376,
    "end": 2523.737,
    "text": "I'm here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2523.757,
    "end": 2524.817,
    "text": "Don't worry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2524.837,
    "end": 2527.319,
    "text": "I'll share my screen again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2527.339,
    "end": 2528.46,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2530.174,
    "end": 2530.394,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2530.494,
    "end": 2532.676,
    "text": "Actually, can I not let's just go with this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2532.856,
    "end": 2533.116,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2533.516,
    "end": 2535.217,
    "text": "Can you see my screen again?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2535.858,
    "end": 2536.598,
    "text": "And I'm back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2536.758,
    "end": 2537.699,
    "text": "Is everything cool?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2537.759,
    "end": 2538.019,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.58,
    "end": 2538.8,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2538.98,
    "end": 2539.54,
    "text": "Wonderful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2540.041,
    "end": 2540.741,
    "text": "We're back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.781,
    "end": 2541.742,
    "text": "Where did you cut off?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2542.502,
    "end": 2543.923,
    "text": "Because I kept talking for a minute.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2544.704,
    "end": 2552.529,
    "text": "Um, we heard observing one neighbor at a time, like and then how you could have modeled more complex interaction effects with like multiple artifacts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2552.889,
    "end": 2553.089,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2553.99,
    "end": 2554.19,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2554.23,
    "end": 2554.61,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2555.911,
    "end": 2556.191,
    "text": "Awesome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2556.311,
    "end": 2556.792,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2557.152,
    "end": 2557.312,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2559.335,
    "end": 2562.937,
    "text": " So now let's explain the hidden states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2562.977,
    "end": 2564.417,
    "text": "So what are the states they're trying to infer?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2565.218,
    "end": 2569.34,
    "text": "S-idea, so it's basically a binary variable, ID1, ID2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2569.44,
    "end": 2570.18,
    "text": "Is ID1 true?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2570.24,
    "end": 2570.98,
    "text": "Is ID2 true?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2572.241,
    "end": 2577.423,
    "text": "Meta-belief, which is the particular neighbor's beliefs about which of the ideas is true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2577.484,
    "end": 2580.285,
    "text": "So does my neighbor believe this or that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2581.605,
    "end": 2583.626,
    "text": "The tweet, so what am I tweeting?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2584.567,
    "end": 2585.767,
    "text": "And who should I attend to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2585.907,
    "end": 2587.088,
    "text": "Which neighbor am I attending to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2587.469,
    "end": 2589.683,
    "text": " So this was actually very complex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2592.163,
    "end": 2597.867,
    "text": " Daphne and Connor did an amazing job here because we wanted to change the number of neighbors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2597.927,
    "end": 2603.03,
    "text": "And so the matrices had to grow in relation to how many neighbors there were.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2603.11,
    "end": 2606.392,
    "text": "And it was beautiful the way that they did this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2606.432,
    "end": 2610.075,
    "text": "So shout out to Connor, who's obviously a genius, and Daphne as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2610.995,
    "end": 2613.377,
    "text": "So now let's discuss control states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2613.417,
    "end": 2618.46,
    "text": "So control states are which of the states can my agents actually act upon?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2619.693,
    "end": 2622.075,
    "text": " So here it was the tweet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2622.115,
    "end": 2625.298,
    "text": "So I can decide to tweet, you know, hashtag one or hashtag two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2625.798,
    "end": 2632.605,
    "text": "And then I can decide to look at neighbor, you know, one through K. Now, observation modalities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2632.645,
    "end": 2633.525,
    "text": "What can they see?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2633.706,
    "end": 2634.987,
    "text": "They can see their own tweets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2635.558,
    "end": 2645.202,
    "text": " And this is important because the thing is, oftentimes, you have to have a sort of identity mapping between your observations and your states so that the states can be taken into consideration in the actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2645.983,
    "end": 2649.284,
    "text": "So here, you have to know what you're tweeting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2649.644,
    "end": 2651.305,
    "text": "You have to know what your neighbor is tweeting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2651.325,
    "end": 2654.206,
    "text": "And you have to know who you're attending to, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2654.426,
    "end": 2657.287,
    "text": "Pretty simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2657.908,
    "end": 2658.908,
    "text": "Now, the likelihoods.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2662.185,
    "end": 2670.507,
    "text": " In a POMDP, in a generative model, we have to describe the likelihoods that determine how hidden states relate to observations, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2672.167,
    "end": 2678.829,
    "text": "So the entire A array is a set of tensors with one subtensor per observation modality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2679.349,
    "end": 2689.871,
    "text": "Each modality-specific likelihood tensor is a potentially multidimensional array that encodes the conditional dependencies between each combination of hidden states and observations for that modality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2690.967,
    "end": 2693.088,
    "text": " So we also have a transition model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2693.609,
    "end": 2700.433,
    "text": "So the transition likelihood, the dynamical likelihood in B that I explained earlier, the environmental dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2700.513,
    "end": 2702.574,
    "text": "So how are things likely to change?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2702.614,
    "end": 2706.576,
    "text": "A higher value means the same idea remains valid over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2706.616,
    "end": 2710.859,
    "text": "A lower value means the same idea is less likely to be true over time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2710.879,
    "end": 2712.48,
    "text": "So more environmental volatility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2713.08,
    "end": 2719.564,
    "text": "And then the dynamics of whether my neighbors are likely to change their ideas of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2721.058,
    "end": 2729.263,
    "text": " Then the next component here is the generative model of the priors over the observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2729.964,
    "end": 2740.751,
    "text": "So in discrete active inference, we represent these as vectors C, D, and E. So goal-directed action is motivated by appealing to a baseline prior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2742.193,
    "end": 2745.435,
    "text": " over observations, so that specifies the agent's preferences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2745.495,
    "end": 2747.376,
    "text": "So that is the C I was talking about earlier.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2747.896,
    "end": 2749.777,
    "text": "What do I want to encounter in the world?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2749.797,
    "end": 2751.358,
    "text": "What are the outcomes I'd like to see?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2751.698,
    "end": 2753.999,
    "text": "And those usually act as kinds of rewards.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2754.86,
    "end": 2759.202,
    "text": "Then there's the prime over hidden states at the initial time step, which is the D vector.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2759.542,
    "end": 2764.965,
    "text": "It encodes the agent's beliefs about the initial state of the world before having made any observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2766.762,
    "end": 2774.828,
    "text": " In the current model, we make the prior over control states an empirical prior parametrized by the link function denoted by the ET vector.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2774.848,
    "end": 2783.636,
    "text": "So I'm not going to go too much into this, but basically this implies that the prior over those control states corresponding to tweet actions dependent on the posterior of the idea.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2783.676,
    "end": 2787.759,
    "text": "So basically your agents are always going to tweet exactly the same as they believe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2787.779,
    "end": 2789.761,
    "text": "They're not lying, but they could, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2789.801,
    "end": 2790.482,
    "text": "We could change that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2792.165,
    "end": 2792.886,
    "text": " So habit learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2793.266,
    "end": 2796.749,
    "text": "Under active inference, learning also emerges as a form of variational inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2796.809,
    "end": 2803.154,
    "text": "So it's not an inference over hidden states, but rather over model parameters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2803.814,
    "end": 2812.821,
    "text": "So the parameter inference is referred to as learning because it is often assumed to occur on a fundamentally way slower timescale than hidden state or policy inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2813.602,
    "end": 2817.925,
    "text": "In this model, we use habit learning to model the development of epistemic habits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2818.586,
    "end": 2821.148,
    "text": "So as I said, the tendency to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2821.681,
    "end": 2822.622,
    "text": " resample the same people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2823.363,
    "end": 2830.31,
    "text": "And so they simultaneously infer which neighbor to attend to based on the prerogative to minimize expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2831.771,
    "end": 2837.016,
    "text": "And they also continuously learn the habit based on the frequency with which they attend to a certain neighbor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2838.117,
    "end": 2839.719,
    "text": "All right, the actual simulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2841.07,
    "end": 2847.133,
    "text": " In a given simulation, we had several agents, but we didn't always use the same number of agents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2847.413,
    "end": 2849.974,
    "text": "We were very limited by computational constraints.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2850.515,
    "end": 2856.898,
    "text": "We would have wanted to make something much larger, much bigger to really model an actual social media, but this is very computational heavy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2857.478,
    "end": 2863.621,
    "text": "In the future studies, we may try to increase the number of agents, but for now, we tried to stay between 12 and 30 agents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2864.501,
    "end": 2866.462,
    "text": "Again, same model for each agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2866.582,
    "end": 2869.784,
    "text": "At each time step, agents simultaneously update their belief,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2870.714,
    "end": 2871.394,
    "text": " and take an action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2872.435,
    "end": 2879.538,
    "text": "Each agent's observation are a function of its own actions at the previous time step, as well as the actions of a selected set of neighbors at the previous time step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2879.558,
    "end": 2882.039,
    "text": "So not everyone is connected to everyone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2882.059,
    "end": 2884.059,
    "text": "So I don't need to see everyone all the time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2885.22,
    "end": 2890.842,
    "text": "Each agent has a fixed set of neighbors where the particular neighbors are determined by a randomly chosen network topology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2892.483,
    "end": 2892.763,
    "text": "Okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2893.763,
    "end": 2895.084,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2896.414,
    "end": 2904.08,
    "text": " So focal agents with a higher ECB believes that tweets are more reliable if they come from neighboring agents that believe to share the same opinion, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2904.481,
    "end": 2905.481,
    "text": "So like-minded people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2907.263,
    "end": 2913.508,
    "text": "The inverse social volatility is a parametrized focal agent's beliefs about the stochasticity of the social dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2914.569,
    "end": 2918.532,
    "text": "The learning rate is associated with updating the habit vector over neighbor attendance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2919.152,
    "end": 2923.996,
    "text": "And network connectivity is the way that individuals",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2926.072,
    "end": 2926.992,
    "text": " are connected to one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2927.032,
    "end": 2927.573,
    "text": "It's pretty simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2927.613,
    "end": 2932.275,
    "text": "So these are the parameters that we tweaked during the simulations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2933.095,
    "end": 2938.717,
    "text": "You'll see that they tend to interact with one another and they're related to the hypotheses we formed initially.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2940.838,
    "end": 2944.44,
    "text": "So this figure is really cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2945.976,
    "end": 2954.939,
    "text": " It visualizes opinion formation in a single active inference agent and shed light on the relationship between inverse volatility and epistemic confirmation bias.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2956.7,
    "end": 2960.581,
    "text": "We use a simplified three-agent setup here, so we just were trying to test something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2961.161,
    "end": 2969.244,
    "text": "At each time step, the focal agent chooses to read a hashtag from one of its two neighbors, and the two neighbors are not actually active inference agents here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2969.504,
    "end": 2972.065,
    "text": "They're just part of the generative process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2972.365,
    "end": 2974.926,
    "text": "They're sources of sequence of distinct hashtags",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2975.538,
    "end": 2978.682,
    "text": " and who tweet hashtag one or hashtag two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2979.523,
    "end": 2993.239,
    "text": "And as you can see, higher epistemic confirmation bias induces a positive feedback effect where the focal agent comes to agree with one of its two neighbors with a higher certainty as it tweets the thing that it believes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2995.658,
    "end": 3001.54,
    "text": " Even if it's exposed to a sequence of hashtag over 100 time steps, the agent receives the observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3001.94,
    "end": 3014.643,
    "text": "And here below each subplot, the heat map shows that the temporal evolution of the probability of sampling neighbor one versus neighbor two over time shows that it clearly goes towards the one he started it prior with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3016.795,
    "end": 3030.443,
    "text": " the beliefs in more meta-belief volatility lead to higher postures uncertainty about the idea, but it still eventually leads to, you know, believing in the same idea you initially started.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3032.064,
    "end": 3033.765,
    "text": "So, okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3034.465,
    "end": 3041.049,
    "text": "Now, this is much, much more informative as to the actual phenomenon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3041.509,
    "end": 3044.431,
    "text": "And you can see here that we have two very interesting phenomenons.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3045.114,
    "end": 3047.055,
    "text": " consensus and polarization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3049.156,
    "end": 3051.718,
    "text": "They emerge when simulating the network.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3052.578,
    "end": 3055.28,
    "text": "We can see that every agent is generated by the action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3056.741,
    "end": 3060.223,
    "text": "The observations of every agent is generated by the actions of other agents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3061.644,
    "end": 3073.871,
    "text": "And so collective belief dynamics here under different generative parameterization really show that the evolving beliefs of all agents about idea one or about idea two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3074.798,
    "end": 3084.042,
    "text": " In panel A and D, we see polarization, where two subset of agents end up believing in two different levels of the idea hidden states with a high certainty.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3084.082,
    "end": 3085.823,
    "text": "So you can really see, like, they go very far.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3085.923,
    "end": 3087.944,
    "text": "It goes one or zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3087.984,
    "end": 3089.064,
    "text": "It's not like 0.6.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3089.705,
    "end": 3091.505,
    "text": "No, it's really one or zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3091.525,
    "end": 3092.226,
    "text": "They're really certain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3093.246,
    "end": 3099.749,
    "text": "And panels B and C, on the other hand, shows consensus, where the whole network converges on the same opinion by the end of the simulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3100.68,
    "end": 3117.426,
    "text": " This really showcases the rich phenomenology displayed by collectives of active inference agents, which validates our model, really, alongside known opinion dynamics model, and that was really able to replicate distributions that we were trying to converge towards.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3119.507,
    "end": 3121.068,
    "text": "Do you have any questions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3121.789,
    "end": 3122.609,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3122.649,
    "end": 3124.57,
    "text": "Maybe go back to the slides.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3126.09,
    "end": 3141.615,
    "text": "What kind of dynamics might result in persistent diversity or not just the absolute consensus or absolute bifurcation, but like you did mention, you said you didn't see there to be a continuum of like people who aren't sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3142.415,
    "end": 3147.237,
    "text": "So what kind of parameters or what kind of cognitive mechanisms would facilitate that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3148.809,
    "end": 3152.297,
    "text": " So lower epistemic confirmation bias for sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3153.318,
    "end": 3156.24,
    "text": " would potentially lead to more variety.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3157.481,
    "end": 3160.083,
    "text": "We would look into network structure eventually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3160.864,
    "end": 3163.766,
    "text": "Lower habit formation would definitely help as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3163.846,
    "end": 3169.029,
    "text": "As you can see here, and also higher belief in volatility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3169.089,
    "end": 3176.975,
    "text": "So if you believe that volatility is high, you're going to keep sampling a lot of people because you do believe that uncertainty is going to continue arising, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3177.015,
    "end": 3182.539,
    "text": "So these are three parameters that really lead to more diverse and less polarized beliefs and some ideas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3185.168,
    "end": 3197.08,
    "text": " Because it's so interesting how you captured like the two things you can do on a classic social media platform, which is decide who to follow and then kind of at a finer scale who to pay attention to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.1,
    "end": 3206.449,
    "text": "Even though it's also partially like put in front of you with a feed and the algorithm, but also it's a little bit of agency in like what you pay attention to and who you follow at a slower time scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.889,
    "end": 3208.13,
    "text": "And then how you act, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.951,
    "end": 3237.2,
    "text": " and how that modifies the epistemic niche and some people follow a lot and act little and vice versa and different people's cognitive models get updated in a different way despite having access to similar platform affordances so these are really great points in future studies one you might want to see how the niche responds so right now that they're they're crafting their niches simply as a function of who they're talking to right but you could also model the algorithm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3238.211,
    "end": 3238.832,
    "text": " Screwing with you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3238.872,
    "end": 3239.052,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3239.352,
    "end": 3241.634,
    "text": "So the algorithm knows you're looking for this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3241.734,
    "end": 3244.776,
    "text": "So it's going to cut some things from you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3245.417,
    "end": 3252.763,
    "text": "And so you like, for instance, one way we could have done this is the niche could have determined, well, OK, well, you're listening less to this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3252.843,
    "end": 3256.166,
    "text": "So I'm not going to cut that connection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3256.266,
    "end": 3258.628,
    "text": "I'm just not going to let it be broadcasted to you right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3259.963,
    "end": 3261.984,
    "text": " So that's one way that the algorithm works, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3262.024,
    "end": 3267.046,
    "text": "It basically selects things, it puts in your feed, even though the people aren't gone, they're still there, you just see them less.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3267.606,
    "end": 3271.068,
    "text": "So that's one way we could have done like a relationship with the niche.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3271.488,
    "end": 3275.97,
    "text": "And as you said, yeah, we could have modeled different kinds of behaviors for people who are more lurkers, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3276.11,
    "end": 3278.491,
    "text": "How do their beliefs change if they're not showing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3278.871,
    "end": 3282.253,
    "text": "So that's one way that eventually we're gonna be able to model like influencers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3283.133,
    "end": 3289.317,
    "text": " There are people who potentially broadcast to a lot of people and a lot of the other people don't broadcast as much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3289.457,
    "end": 3295.82,
    "text": "So the beliefs of these people are going to be super influential as opposed to the beliefs of these smaller people who are much less influenced.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3296.121,
    "end": 3298.322,
    "text": "So that's, I mean, there's a lot that can be done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3298.582,
    "end": 3299.282,
    "text": "It's really cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3299.983,
    "end": 3301.864,
    "text": "But yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3301.904,
    "end": 3303.425,
    "text": "I'm excited about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3303.485,
    "end": 3305.786,
    "text": "The only problem in life is there's not enough time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3306.146,
    "end": 3307.487,
    "text": "But yeah, it's really cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3308.868,
    "end": 3310.989,
    "text": "So anyway, I'm going to keep going.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3311.305,
    "end": 3314.246,
    "text": " because we're going towards the full plot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3315.746,
    "end": 3321.268,
    "text": "So there's an interaction between epistemic confirmation bias and network connectivity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3322.268,
    "end": 3334.151,
    "text": "Here you can see a heat map of the mean polarization index across like 100 independent realizations of the multi-agent opinion dynamic simulations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3335.351,
    "end": 3337.692,
    "text": "For unique combinations of network connectivity,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3338.334,
    "end": 3339.754,
    "text": " and epistemic confirmation bias.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3340.295,
    "end": 3352.098,
    "text": "So in the bottom, the selected plot lines show extreme settings of P, so P02 and P08, and Y, which is, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3352.318,
    "end": 3359.18,
    "text": "So shaded areas around each line represent the standard deviation of the polarization index across independent realizations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3359.621,
    "end": 3360.861,
    "text": "So this is hypothesis one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3362.643,
    "end": 3371.008,
    "text": " We investigated hypothesis one or how epistemic confirmation bias, so Y, and network connectivity, P, determine collective formation of epistemic communities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3371.609,
    "end": 3385.196,
    "text": "We systematically varied both epistemic confirmation bias, so 15 values for epistemic confirmation bias tilling the range three and nine, and network connectivity, so 15 values for P tilling the range 0.2 to 0.8 in networks of 15 agents.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3388.433,
    "end": 3392.114,
    "text": " and over a hundred different realizations of each conditions for a hundred time steps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3392.134,
    "end": 3396.415,
    "text": "So it's really a lot, it's really a lot, but the results are beautiful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3397.195,
    "end": 3411.418,
    "text": "And so we were trying to see how higher epistemic confirmation bias in sparse network might drive the emergence of epistemic community through the formation of belief clusters that are both dense and far apart in belief space, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3411.458,
    "end": 3412.638,
    "text": "So they really believe different things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3414.356,
    "end": 3422.363,
    "text": " To assess the emergence of epistemic communities or clusters, we define the polarization index, which measures the degree of epistemic spread in a system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3423.304,
    "end": 3430.49,
    "text": "And so a high value of P, so close to one, indicates more spread out beliefs and implies clustering in echo chamber formation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3431.05,
    "end": 3436.575,
    "text": "Whereas a low P implies the network agents have similar beliefs about an idea or, you know, less beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3437.498,
    "end": 3439.219,
    "text": " less diversity, less polarization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3439.699,
    "end": 3445.703,
    "text": "So it shows the effects of varying epistemic confirmation bias and network connectivity on polarization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3446.603,
    "end": 3457.609,
    "text": "It is clear in the first column of the heat map that highly spread out beliefs can occur at all values of epistemic confirmation bias in the presence of a sparse connectivity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3458.85,
    "end": 3466.214,
    "text": "Denser networks in general reduce the risk of polarization as seen by the drop-off.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3467.15,
    "end": 3475.294,
    "text": " So how increased epistemic confirmation bias can still counteract this effect to some extent by marginally bumping up the risk of polarization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3475.794,
    "end": 3479.136,
    "text": "So this is a really interesting result, but it comes back to what we were saying earlier.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3479.156,
    "end": 3485.919,
    "text": "A dense network means there's a lot of people who you can see the opinion of and who may not agree with you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3485.979,
    "end": 3488.18,
    "text": "So you have more access to people's beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3489.116,
    "end": 3500.602,
    "text": " Sparser networks means you're very quickly going to fall into an echo chambers because you're going to cut off some people you don't want to listen to and then you have no more connection with these people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3502.563,
    "end": 3503.284,
    "text": "There we go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3504.884,
    "end": 3508.366,
    "text": "So in this one, you see another heat map.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3509.067,
    "end": 3510.727,
    "text": "So these are really noisy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3511.088,
    "end": 3511.768,
    "text": "We're sorry about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3512.468,
    "end": 3513.329,
    "text": "We redid them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3514.343,
    "end": 3516.705,
    "text": " for the reviewers, but they're not ready.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3517.446,
    "end": 3521.429,
    "text": "So they're pretty noisy, but I'm gonna help you make a little sense of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3522.37,
    "end": 3534.119,
    "text": "So here you have a heat map of the polarization index for 225 combinations of inverse belief volatility, so that's hypothesis two, and epistemic confirmation bias precision.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3534.319,
    "end": 3538.142,
    "text": "So the above right heat map, I don't know if I'm pointing to the right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3540.349,
    "end": 3541.15,
    "text": " Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3542.01,
    "end": 3551.717,
    "text": "It's a heat map of the re-attendance rate for 225 combinations of inverse belief volatility and epistemic confirmation bias.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3552.277,
    "end": 3557.7,
    "text": "And below left, it's a line plot of the most extreme rows of the polarization heat map.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3557.74,
    "end": 3563.464,
    "text": "So below right is a plot line of the most extreme columns of the re-attendance heat map.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3565.47,
    "end": 3574.376,
    "text": " So for hypothesis two, we modeled behavior under different values of inverse social volatility to see how it would interact with epistemic confirmation bias.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3575.316,
    "end": 3584.042,
    "text": "We swept over epistemic confirmation bias and social volatility, and we measured the re-attendance rates and polarization index for each configuration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3585.643,
    "end": 3591.187,
    "text": "It portrays a complex picture of the relationship between ECB and inverse social volatility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3592.378,
    "end": 3602.867,
    "text": " In the case of high volatility over meta beliefs, agents are driven to periodically re-attend to neighbors in order to resolve growing uncertainty about their beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3603.988,
    "end": 3606.289,
    "text": "You can see a higher average re-attendance rate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3607.05,
    "end": 3620.001,
    "text": "Interestingly, there seems to be an interaction between re-attendance rate and epistemic confirmation bias, such that in the presence of both high volatility and low epistemic confirmation bias, the re-attendance rate is maximized.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3621.408,
    "end": 3632.773,
    "text": " They'll re-attend the same people, even if they have low epistemic information bias, because, you know, they have high volatility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3632.994,
    "end": 3635.495,
    "text": "They constantly think that people are likely to change their mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3636.015,
    "end": 3644.219,
    "text": "So they're going to continue to keep attending these people with a little bit of a lower volatility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3644.759,
    "end": 3650.522,
    "text": "They're not the lowest, though, because if you have the lowest setting of volatility, you're just...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3650.848,
    "end": 3654.289,
    "text": " you know, not going to care so much what other people think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3654.309,
    "end": 3655.449,
    "text": "So you're just going to keep reattending.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3656.35,
    "end": 3663.532,
    "text": "So we speculate that the absence of ECB makes the epistemic value of attending to every neighbor pretty much equally high.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3664.452,
    "end": 3675.616,
    "text": "And thus agents are going to continue revisiting neighbors sequentially with the attendance preference for any given neighbor solely dependent on the time lapse between the last reading of their last hashtag.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3677.599,
    "end": 3679.46,
    "text": " So this is interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3679.861,
    "end": 3690.169,
    "text": "It will lead to diverse social attendance patterns such that agents will prefer to constantly sample either new neighbors with no particular neighbor left or uncertainty-driven resampling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3690.529,
    "end": 3698.256,
    "text": "So they can either sample everyone or sample the same people, but they'll try to attend to their neighbors a lot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3701.368,
    "end": 3706.932,
    "text": " Okay, so here we have the last hypothesis, hypothesis tree we got there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3707.832,
    "end": 3714.637,
    "text": "It's a heat map of the polarization index for all 225 combinations of learning rate and epistemic confirmation bias precision.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3715.458,
    "end": 3722.202,
    "text": "So above right, you have a heat map of the re-attendance rate for 225 combinations and epistemic confirmation bias.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3722.563,
    "end": 3728.547,
    "text": "So the parameters represent the centers of the normal distribution sampled from across trials for each configuration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3729.454,
    "end": 3735.601,
    "text": " Below left, the most extreme row of the polarization index heatmap, and below right, the most extreme column of the re-attendance heatmap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3737.623,
    "end": 3743.85,
    "text": "So here we're trying to see if the polarization of networks via habit formation follows hypothesis 3.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3744.892,
    "end": 3750.318,
    "text": "We swept over ECB, so 15 values, tiling the range 3 to 9, and learning rate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3751.582,
    "end": 3754.383,
    "text": " So 15 values tilling from 0 to 9.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3755.143,
    "end": 3761.985,
    "text": "And the networks were pretty small, 15 agents with a connection probability of 0.4 and an inverse social volatility of 6.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3764.425,
    "end": 3766.786,
    "text": "And as before, the same IDS of 9.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3767.206,
    "end": 3771.407,
    "text": "So ECB was again normally distributed with a fixed mean.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3772.76,
    "end": 3773.661,
    "text": " And a variance of one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3773.702,
    "end": 3784.695,
    "text": "So we sampled from a normal distribution and we eventually we lowered the variance and it gave us much better results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3784.735,
    "end": 3791.504,
    "text": "But the learning rate was fixed for the condition to really understand what the effect of it was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3793.274,
    "end": 3797.256,
    "text": " The learning rate incentivizes agents to re-attend the same neighbor by forming a habit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3797.997,
    "end": 3801.839,
    "text": "This competes with the epistemic value of attending to a new neighbor with unknown beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3802.459,
    "end": 3807.322,
    "text": "This tested the hypothesis that a higher learning rate, stronger habit formation, increased polarization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3807.502,
    "end": 3815.067,
    "text": "And here we can demonstrate that a higher learning rate and epistemic confirmation bias interact to influence outcomes at the collective level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3815.107,
    "end": 3820.79,
    "text": "So a higher learning rate induces more polarization, implying the formation of more stubborn epistemic communities in the network.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3823.45,
    "end": 3828.773,
    "text": " Okay, so do you want me to go into the takeaways?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3830.334,
    "end": 3831.014,
    "text": "That'd be awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.975,
    "end": 3842.38,
    "text": "Okay, so here we showed confirmation bias as an epistemic phenomenon that agents have biased beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3844.502,
    "end": 3852.146,
    "text": "We saw that ECB confers a higher weight to information that comes from peers and this can lead to a bad bootstrap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3854.56,
    "end": 3857.802,
    "text": " We find that opinion dynamics heavily depend on network density.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3858.362,
    "end": 3862.484,
    "text": "This was not counterintuitive, but the way that it happens was a little bit counterintuitive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3863.945,
    "end": 3867.808,
    "text": "The clustering phenomenon is exacerbated by adding the capacity to form habits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3868.308,
    "end": 3869.249,
    "text": "So this is important.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3870.549,
    "end": 3874.212,
    "text": "We found that ECB, the presence of habit formation,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3875.407,
    "end": 3883.812,
    "text": " Um, exacerbated polarization due to the formation of, um, echo chambers or tech communities of agents that only read each other's hashtag.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3884.872,
    "end": 3893.697,
    "text": "And, um, the contributing influence of beliefs about social volatility to exploratory social sampling leads us to consider the role of norms and social settings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3894.702,
    "end": 3907.631,
    "text": " If an agent is incentivized via epistemic value or curiosity to pay attention to neighbors whom they are uncertain about, their social group could be a source of constant surprise, as long as their beliefs about the neighbors are constantly fickle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3908.131,
    "end": 3913.835,
    "text": "So in other words, even in the presence of a group of like-minded peers, thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3915.796,
    "end": 3916.677,
    "text": "Good burritos, I guess.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3918.638,
    "end": 3922.601,
    "text": "Burrito, niche modification, the best kind of niche modification.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3923.121,
    "end": 3923.702,
    "text": "I know, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3925.989,
    "end": 3934.557,
    "text": " So we expect that increased beliefs about social volatility leads to repeated re-attendance of peers amongst one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3937.051,
    "end": 3939.153,
    "text": " Okay, we have limitations in this work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3939.433,
    "end": 3942.335,
    "text": "As I said, a very low number of people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3943.696,
    "end": 3947.679,
    "text": "We only modeled beliefs of two exclusive ideas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3947.899,
    "end": 3960.268,
    "text": "It would have been maybe more interesting to have more, and we would have wanted to notice the emergence of similar but distant sub-communities as well, even if they're not already connected.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3961.268,
    "end": 3963.59,
    "text": "So yeah, that was all of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3964.13,
    "end": 3964.711,
    "text": "That was all of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3967.073,
    "end": 3990.944,
    "text": " cool work really fun to hear about um nice well if anyone's watching live they can uh ask any questions otherwise what would you like to start off by talking like when you present that for what audience what do people often ask about um they ask",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3992.193,
    "end": 3993.534,
    "text": " The same questions you asked, really.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3993.554,
    "end": 3996.716,
    "text": "They ask, what can we do about social media?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3996.877,
    "end": 3998.818,
    "text": "How do we factor in the algorithm?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3998.838,
    "end": 4003.401,
    "text": "How this ties into misinformation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4003.421,
    "end": 4008.045,
    "text": "I guess this question we haven't really talked about, the notion of misinformation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4008.805,
    "end": 4009.806,
    "text": "So that's something you're interested in?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4010.327,
    "end": 4010.887,
    "text": "Let's hear about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4011.828,
    "end": 4012.068,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4013.049,
    "end": 4013.229,
    "text": "So...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4016.116,
    "end": 4018.378,
    "text": " Misinformation is kind of a tricky question, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4018.398,
    "end": 4030.326,
    "text": "Because you'd think that misinformation would be, if it doesn't agree with us, if it's about something we don't agree with, we cast it instantly as misinformation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4030.386,
    "end": 4037.51,
    "text": "And in fact, we tend to fall very heavily for most sources of misinformation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4037.971,
    "end": 4044.375,
    "text": "The only thing is, we fall for misinformation that tends to reinforce our view of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4044.415,
    "end": 4044.535,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4045.882,
    "end": 4069.218,
    "text": " Even if it's part of a sort of conservative, if you're more liberal, more, I forgot the word for not conservative in the US, but if you're more left, if you're seeing some piece that's been corrupted by the right, but it kind of confirms your view of the world, you're more likely to integrate it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4070.031,
    "end": 4091.38,
    "text": " And this is pretty important, especially when we're trying to think about the QAnon people and people whose views aren't necessarily completely polarized, but who want to view the world as something they can unfold, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4091.44,
    "end": 4096.682,
    "text": "Something they have control over the epistemic value that they can gather.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4098.621,
    "end": 4109.944,
    "text": " And so they're being fed information which feeds into that sort of meta view of the world that they can understand the hidden truth about the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4110.024,
    "end": 4123.308,
    "text": "And so this becomes a sort of pool, you know, where it doesn't really matter what I pitch at you so long as it gives you this sort of sensation that you have access to something that others really don't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4123.489,
    "end": 4127.09,
    "text": "And therefore you now understand the structure of the world a little better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4127.63,
    "end": 4128.05,
    "text": "Even if...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4129.249,
    "end": 4142.119,
    "text": " when you take the whole thing together, when you look at the entire structure of conspiracy beliefs, they're extremely unlikely, extremely complex.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4142.699,
    "end": 4155.189,
    "text": "And one way that we've noticed that we can identify these conspiracy theories compared to true facts, they tend to have a really interesting structure, which is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4155.809,
    "end": 4170.761,
    "text": " They're very sparsely connected to very large elements, but like normally in a true, in a true story and something that's real, even if there's a lot of elements or fields that are combined, there's a lot of connections amongst things, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4170.801,
    "end": 4172.202,
    "text": "Because, because it's real.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4172.563,
    "end": 4177.667,
    "text": "So you can really, you can see from a lot of directions, these real connections.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4178.007,
    "end": 4182.531,
    "text": "If you lose one connection, everything doesn't fall apart in conspiracy beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4183.396,
    "end": 4188.581,
    "text": " those connections are so sparse that if you lose one, the entire theory doesn't make sense anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4189.261,
    "end": 4192.464,
    "text": "So that's the kind of structure that we see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4193.245,
    "end": 4198.329,
    "text": "So it's kind of sort of, you can see how this would have epistemic value, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4198.63,
    "end": 4208.559,
    "text": "Because everything is so surprising and uncertain that people would like feel a lot of value from accruing all this information, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4208.699,
    "end": 4208.799,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4209.858,
    "end": 4213.86,
    "text": " I think that's where we fall into the bad bootstrap, but there are other kinds of bad bootstraps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4213.88,
    "end": 4231.07,
    "text": "Like let's say, so I don't want to make any community feel like they're being targeted or that I'm being negative towards it, but there are communities, like let's talk about a cult, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4231.651,
    "end": 4235.653,
    "text": "Let's think about a cult who started believing a very niche set of beliefs,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4236.684,
    "end": 4241.426,
    "text": " And the way that they do this is by cutting off contact to everybody else, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4241.826,
    "end": 4244.668,
    "text": "Because it's much easier for me to instill a belief in you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4244.748,
    "end": 4247.169,
    "text": "There's nobody else to tell you this is crazy, this is bullshit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4247.189,
    "end": 4247.989,
    "text": "Like, what are you doing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4248.769,
    "end": 4251.911,
    "text": "So one of the first things is they tell you to cut off contact with a lot of people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4252.871,
    "end": 4254.852,
    "text": "They reinforce the beliefs constantly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4255.152,
    "end": 4259.034,
    "text": "They punish anyone who dissents because that's how you reinforce a belief.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4260.194,
    "end": 4263.756,
    "text": "And then you find them in these sort of communities which are like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4265.06,
    "end": 4284.878,
    "text": " very only locally functional and if you take someone out of that community afterwards and you put them somewhere else they're like kind of lost because well that's not how the world works so like they they they're they need to relearn a lot of things they need to um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4286.122,
    "end": 4296.553,
    "text": " develop behaviors that are distinct from their previous belief systems that allow them to exist and be humans in an already pretty complex civilization system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4303.039,
    "end": 4307.063,
    "text": "That was very interesting about the resilience of the meta view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4307.283,
    "end": 4308.665,
    "text": "So how do we...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4310.379,
    "end": 4331.076,
    "text": " use active inference to study these different phenomena like how do you connect the nodes and edges from the graph the generative model the cognitive model how does that visualization representation connect with like the phenomena that we want to model I mean that's the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4332.617,
    "end": 4333.857,
    "text": " That's the standard question, isn't it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4334.117,
    "end": 4336.818,
    "text": "That's what we're working on at the computational phenomenology lab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4337.519,
    "end": 4351.543,
    "text": "I have a theory, um, but it's not like it's still being developed, but my sense is, um, you're going to start treating events as observations, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4351.883,
    "end": 4353.303,
    "text": "And you're going to start treating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4353.323,
    "end": 4361.526,
    "text": "So you're a node you're here in the graph and everything around you is a sort of observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4362.631,
    "end": 4368.854,
    "text": " and you're trying to determine layers in the graph which become states, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4368.894,
    "end": 4380.439,
    "text": "So you're gonna move across the graph by trying to predict effectively what is the next state and trying to see if this new thing that you're gonna observe matches with the state you're trying to see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4380.459,
    "end": 4383.6,
    "text": "And so that's just how you move in the graph.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4383.76,
    "end": 4387.922,
    "text": "And then the way that you're gonna establish what is,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4389.275,
    "end": 4391.217,
    "text": " true or not, so that's one way to do it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4391.257,
    "end": 4392.037,
    "text": "There are other ways, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4392.057,
    "end": 4402.586,
    "text": "There's also swarm beliefs and stuff, but like one way to do it is, well, how much can I predict from this node?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4403.887,
    "end": 4406.088,
    "text": "How much is actually connected to this node?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4406.729,
    "end": 4415.676,
    "text": "And if we take this structure again of like the graphs which are sparsely connected and don't allow for any connection to be lost,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4417.21,
    "end": 4421.752,
    "text": " you're gonna start seeing that there's gonna be a lot of dense connections between concepts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4422.532,
    "end": 4431.576,
    "text": "And it's gonna be very easy for you to sort of find your way through the graph and be like, well, I can go there and I can go there and I can go there and try to make,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4432.315,
    "end": 4437.459,
    "text": " predictions about the next potential nodes, given these two that you, or these three that you already have, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4437.879,
    "end": 4440.481,
    "text": "I have these three things and I know everything's sparse.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4440.601,
    "end": 4441.582,
    "text": "It's densely connected.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4441.622,
    "end": 4442.282,
    "text": "I can go there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4442.523,
    "end": 4442.983,
    "text": "It's easy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4443.083,
    "end": 4446.065,
    "text": "And if I go there, I don't lose any connection to anything else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4446.085,
    "end": 4446.746,
    "text": "So that's one way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4447.226,
    "end": 4455.052,
    "text": "Another way to do this is agents are going to start forming beliefs by observing real life or reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4455.932,
    "end": 4460.616,
    "text": "And agents who have a lot of observations about the world are",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4462.777,
    "end": 4466.058,
    "text": " are likely to have a more accurate model of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4466.498,
    "end": 4472.16,
    "text": "So the more they make predictions about things that eventually happen, the more we can give them a reliability rating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4472.48,
    "end": 4476.041,
    "text": "So this person sees a lot of things, one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4476.562,
    "end": 4479.282,
    "text": "And two, when they say something, it tends to happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4479.362,
    "end": 4480.643,
    "text": "So we give them a high rating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4481.343,
    "end": 4486.845,
    "text": "And then the agents talk to one another and coordinate their beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4487.506,
    "end": 4492.709,
    "text": " And eventually there's going to be this dude over there that, you know, says green and everybody else says red.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4493.009,
    "end": 4499.973,
    "text": "And it's like, well, you know, the probability of this green being true, like there's a high surprisal there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4501.374,
    "end": 4506.497,
    "text": "The kicker is there's a high surprisal, so we're giving it a lower reliability rating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4506.637,
    "end": 4512.8,
    "text": "But if it does end up happening, well, then the value is, you know, it is much higher as well, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4512.82,
    "end": 4515.902,
    "text": "Because we reduced a lot of variational free energy here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4515.942,
    "end": 4516.142,
    "text": "So like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4517.458,
    "end": 4533.233,
    "text": " I think that's how we're going to get to these two things combined with the graph leading to the nodes that you can connect together and the agents with reliability ratings that swarm towards a true belief are ways that we can integrate these things, I think.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4536.257,
    "end": 4536.537,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4536.637,
    "end": 4551.009,
    "text": "The first mode you had, I kind of wrote down, it was like dense connections, ideas that have grounding, you know, good maps for territories, more stable territory, more effective map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4551.79,
    "end": 4559.136,
    "text": "It's like in a family, if you went to someone else's family reunion, you shouldn't be too surprised that any given two people know each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4560.168,
    "end": 4564.069,
    "text": " because there's kind of a coherence or there's a prior about the density of that network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4564.609,
    "end": 4572.99,
    "text": "Whereas if the network's very sparse, then the coherence of it is susceptible to single facts being wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4573.01,
    "end": 4579.932,
    "text": "So you kind of point it to like where a thread will be tied, well, this person knew that person, and then this money was sent here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4580.532,
    "end": 4585.773,
    "text": "And then it's like, if even one of those things weren't true, then the whole contraption is fallacious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4587.393,
    "end": 4603.159,
    "text": " And then the dense connections have an element of conformity to them because you have an intrinsically validating world model, like the epistemic network of epicycles and that way of predicting how the planets moved.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4603.719,
    "end": 4609.461,
    "text": "And then you have insight from outside that goes against",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4610.481,
    "end": 4617.924,
    "text": " the conformity bias, the prior, but that can be how the community can move into a new space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4618.764,
    "end": 4634.871,
    "text": "So we can't have like just novelty driven, like simply different is better, but we can't have simply the same is better, which puts us in this active inference situation, which is why it's so cool to see epistemic modeling like you have all done.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4634.891,
    "end": 4638.392,
    "text": "There's something really interesting here about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4639.716,
    "end": 4648.839,
    "text": " the optimal space around which you start, you know, computing the right amount of information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4648.859,
    "end": 4651.02,
    "text": "So Mark Miller is working on this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4651.12,
    "end": 4653.101,
    "text": "Alex Kiefer is working on this as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4653.841,
    "end": 4658.383,
    "text": "I know that we're working on it with also Alejandra Assyria, Vruna Lara.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4658.683,
    "end": 4663.525,
    "text": "So there's this whole group we're working on, like, what is the optimal computation space, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4665.342,
    "end": 4669.324,
    "text": " And so this is, this is truly the question you just posed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4669.724,
    "end": 4674.146,
    "text": "Should I stay exactly where I am or should I try consuming error?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4674.706,
    "end": 4676.887,
    "text": "And I think that's the beauty of groups.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4676.927,
    "end": 4681.669,
    "text": "And this is where we sort of fall into what, what a group is in terms of a market blanket, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4682.51,
    "end": 4682.61,
    "text": "So.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4683.311,
    "end": 4689.073,
    "text": " In the inner spaces of a group, you'll have people who are less likely to start consuming error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4689.773,
    "end": 4696.055,
    "text": "They're just like, you know, they're just staying within what's being done, and that's stability, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4696.576,
    "end": 4702.698,
    "text": "And then towards the external parts of the group, there are people who are more connected to other groups, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4702.718,
    "end": 4704.938,
    "text": "And then who can start consuming error?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4705.499,
    "end": 4712.341,
    "text": "And this, because the internal parts of the group are very densely connected to one another, because, you know, they're an in-group,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4713.595,
    "end": 4715.739,
    "text": " This error can be passed in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4716.12,
    "end": 4723.713,
    "text": "It can be consumed in a way that is efficient for the group to deal with through this sort of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4726.604,
    "end": 4747.843,
    "text": " blanket so the the real question becomes like what's an active state what's a sensory like yeah a state at the level of a blanket for a group but you can start you can start to conceptualize it as like you know your influencers and your lurkers right like the lurkers consume information and the influencers promote information and then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4748.283,
    "end": 4770.568,
    "text": " this whole thing becomes sort of like there are people who just consume what this one dude says and there are people who just like um push out information and then maybe they take a little bit of information but they have like you know this this sparse network of people who are like like you know people who are like 90 000 followers but they themselves follow three",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4772.412,
    "end": 4777.116,
    "text": " So then there's this sort of layering of people who listen to others.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4777.196,
    "end": 4781.799,
    "text": "And so the smaller people who have less followers, they're still connected to one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4781.839,
    "end": 4786.823,
    "text": "And there's degrees through which I think information is passed and consumed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4786.863,
    "end": 4798.452,
    "text": "And so what Mark Miller is trying to say is that the computational optimal is where you compute enough error that you continue to...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4800.868,
    "end": 4802.89,
    "text": " to grow in your sort of fitness landscape.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4803.07,
    "end": 4812.058,
    "text": "So you're still learning about things, you're still discovering, but you're still stable enough that no error is gonna topple you, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4812.819,
    "end": 4822.347,
    "text": "So because you have all these other people here who keep your group relatively stable, you know that consuming a little bit isn't gonna like destroy your group, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4824.169,
    "end": 4826.191,
    "text": "It's like think of a polycule.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4826.803,
    "end": 4828.524,
    "text": " Like, we know we're in love.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4828.904,
    "end": 4832.187,
    "text": "This new metamor is not going to, like, break our shit up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4833.127,
    "end": 4834.028,
    "text": "So it's good, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4836.469,
    "end": 4850.479,
    "text": "So that's, I think, what allows, like, this sort of large-scale coordination among groups is that there are people who are, like, specialized in consuming the air and who can only do this because there are other people who ensure there's resources being produced for them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4852.452,
    "end": 4852.732,
    "text": " Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4853.353,
    "end": 4853.853,
    "text": "Two thoughts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4853.873,
    "end": 4868.764,
    "text": "So one, the core to periphery or fringe continuum, it also happens like in ant colonies where there might be a brood chamber that is the most homeostatically controlled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.944,
    "end": 4875.889,
    "text": "And then there's like a periphery out to like kind of a lobby or an antechamber where there is a lot more like in and out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4876.31,
    "end": 4879.252,
    "text": "And then of course that's the interface like with the external world where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4879.772,
    "end": 4884.177,
    "text": " And so then there's analyses with tracking of like where the ants go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4884.797,
    "end": 4893.025,
    "text": "And so there'll be some whose distribution spatially is more like the top parts of the nest or just the entry room and a little bit in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4893.525,
    "end": 4898.71,
    "text": "And there might be another one that spends more of its time towards the core and then it goes a little bit out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4900.692,
    "end": 4904.196,
    "text": "But that last piece that you said, like what roles...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4906.55,
    "end": 4934.19,
    "text": " contribute to colony or epistemic community stability or collective open-mindedness or resilience like those are such critical questions that people frame qualitatively every day and so it's just really cool to have the conversation and open it up to many different perspectives about what roles do play in communities and then try to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4935.686,
    "end": 4957.439,
    "text": " use the model to follow up and describe complex situations rather than like constraining to what communities can be or how they can regulate yeah and there's something beautiful about active inference here right because we could like we can literally potentially measure or or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4958.095,
    "end": 4967.303,
    "text": " or predict what might be an optimal state for a group given the free energy that the group can consume, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4967.623,
    "end": 4975.57,
    "text": "So if we can understand how this consumption of error can be distributed over the group, or at least can be absorbed, we can say, well, listen,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4976.391,
    "end": 4978.974,
    "text": " We don't need to destroy your QAnon group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4979.434,
    "end": 4994.288,
    "text": "All we need to do is give you a little bit, you know, like enough in the right distributed areas so that you guys integrate it all around and potentially shift without us having to further push and potentially even pull rides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4994.308,
    "end": 4999.153,
    "text": "Like one of the worst things you can do with one of your QAnon family members is antagonize them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4999.753,
    "end": 5013.053,
    "text": " because then they isolate and they're gone you're never finding them again like they will they will be lost to that thing which will consume them and this is and it's not just true for for for for fringe groups it's it's true for a lot of groups where we're like",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5014.011,
    "end": 5016.353,
    "text": " we rely on that community for survival.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5016.413,
    "end": 5022.556,
    "text": "As we said, like there's a lot of communities out there who need to stay tight knit because while it's beneficial for them to be tight knit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5023.317,
    "end": 5026.819,
    "text": "So let's say we're like a city, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5026.979,
    "end": 5030.001,
    "text": "And there's nothing wrong inherently about being a city.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5030.481,
    "end": 5034.484,
    "text": "And what you wanna do is to try to prevent a catastrophe, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5035.606,
    "end": 5041.712,
    "text": " But we can't all be researching the types of catastrophes that might happen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5041.772,
    "end": 5044.815,
    "text": "And someone's got to make bread, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5045.235,
    "end": 5047.538,
    "text": "So you start having these people who",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5048.536,
    "end": 5052.539,
    "text": " you can predict over time that I don't have to think about this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5052.739,
    "end": 5057.562,
    "text": "I don't have to pay attention to this scale because I'm paying attention to this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5057.962,
    "end": 5060.504,
    "text": "And I know that they can rely on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5060.964,
    "end": 5068.889,
    "text": "So my model of the scales makes it so that my role is super clear and allows for others to make these predictions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5068.949,
    "end": 5069.129,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5069.609,
    "end": 5074.132,
    "text": "So I think, I mean, it's not fully, it's not fully realized yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5074.252,
    "end": 5075.033,
    "text": "And there's a lot of,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5075.515,
    "end": 5097.854,
    "text": " work to be done still but i feel like we you know we have it's right there it's right there here's something that kind of makes me think about like the city is enabled by specialization and all these other features um what are epistemic infrastructure projects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5099.144,
    "end": 5106.311,
    "text": " Like, what are the thankless or thankful jobs that people do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5106.371,
    "end": 5111.435,
    "text": "Like moderation, governance, care for themselves and for other participants.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5111.515,
    "end": 5118.221,
    "text": "Like, what are those infrastructure tier roles where it's like, this is building the road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5119.358,
    "end": 5128.425,
    "text": " So we have to contextualize how well this shop does in light of the effort to build the road and the community that contributed there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5129.045,
    "end": 5135.33,
    "text": "And so it kind of like opens up the idea of attribution and community and it's like very generative space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5138.992,
    "end": 5142.515,
    "text": "Yes, I feel like they... It would be...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5144.172,
    "end": 5149.996,
    "text": " It would be difficult to say that there is a very clear distinction in any given infrastructure, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5150.016,
    "end": 5158.081,
    "text": "So like every field has people who innovate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5158.421,
    "end": 5161.383,
    "text": "Every field has people who just stay on tradition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5161.584,
    "end": 5163.665,
    "text": "Every field has people who just provide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5164.105,
    "end": 5167.067,
    "text": "Like it's not, it's not just like bakers just provide, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5167.087,
    "end": 5168.488,
    "text": "There are people who innovate in bread.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5168.988,
    "end": 5169.729,
    "text": "There are people who,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5170.333,
    "end": 5176.554,
    "text": " think of new recipes or think of new ways or try to bring the same recipes to different parts of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5176.834,
    "end": 5178.974,
    "text": "So like it's more distributed than that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5180.015,
    "end": 5187.976,
    "text": "But I really do think that these structures kind of self-emerge, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5187.996,
    "end": 5199.438,
    "text": "So like we all kind of have, not necessarily, I'm not gonna make that, but I do believe that there's a natural instinct to,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5201.129,
    "end": 5210.011,
    "text": " to try something new, once you have the certainty that shit isn't gonna fall under you, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5210.732,
    "end": 5221.974,
    "text": "And because we have this sort of distribution of like people who have more or less money and people who have had past experiences of having more or less money, they kind of tend to focus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5222.014,
    "end": 5226.636,
    "text": "And so it naturally sort of synchronizes into, well, you know what?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5226.656,
    "end": 5227.896,
    "text": "I was poor my whole life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5229.396,
    "end": 5230.276,
    "text": " I'm going to be careful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5230.416,
    "end": 5232.057,
    "text": "I'm not going to go crazy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5232.397,
    "end": 5239.819,
    "text": "And that's why the fallacy of the entrepreneur who had nothing and he became something, that is bull.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5240.259,
    "end": 5243.96,
    "text": "It is so easy to be an entrepreneur when you have barely anything to lose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5244.78,
    "end": 5249.021,
    "text": "The notion of risk in capitalism isn't true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5251.082,
    "end": 5254.343,
    "text": "They can do it because to them the risk is minimal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5254.443,
    "end": 5255.923,
    "text": "If I lose everything tomorrow, eh.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5256.954,
    "end": 5257.634,
    "text": " I can do it again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5258.254,
    "end": 5259.975,
    "text": "So there isn't really a risk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5260.295,
    "end": 5269.538,
    "text": "Whereas if, if little lady over there who has like 20,000 in her bank account decides to put everything in a business, it's a real risk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5270.158,
    "end": 5271.278,
    "text": "It's a real risk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5271.398,
    "end": 5279.941,
    "text": "And obviously she's less likely to do it because like what happens to her children if she loses everything, you know what I mean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5279.981,
    "end": 5285.363,
    "text": "Like, so there's going to naturally be these tiers of people who, because of the, the,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5287.728,
    "end": 5289.429,
    "text": " they're states-based, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5289.45,
    "end": 5297.256,
    "text": "So the probability of them continuing accessing resources over time is less spread out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5298.277,
    "end": 5300.939,
    "text": "They have to stay concentrated on this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5300.979,
    "end": 5314.631,
    "text": "And by virtue of doing this, they also keep producing value and resources for people who tend to accrue this and thus have more leeway to try shit out and innovate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5317.279,
    "end": 5321.901,
    "text": " There's a reason that it's so easy to go to university when your parents are rich.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5322.602,
    "end": 5329.405,
    "text": "Like, obviously, if your parents have the means to support you, you're going to try and continue studying longer and longer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5329.425,
    "end": 5331.466,
    "text": "And it's much harder if you have to support yourself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5331.707,
    "end": 5333.928,
    "text": "It's not impossible, but it's so much harder.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5334.268,
    "end": 5337.85,
    "text": "So anyway, yeah, capitalism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5338.786,
    "end": 5362.563,
    "text": " well to connect it to active inference you kind of brought up the situational risk sensitivity and how that relates to someone's experience in their situation and then in active inference the policy selection for whether the binary decision go to this university or go to some other path or a continuous policy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5363.524,
    "end": 5370.745,
    "text": " it's broken down into that pragmatic or kind of outcome or goal reward orientation as well as the epistemic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5371.766,
    "end": 5383.208,
    "text": "And so what happens when people don't have to have anxiety or find out epistemically about how they're going to get pragmatic reward for their action?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5384.908,
    "end": 5392.43,
    "text": "And how does that move us beyond the sort of like web to engagement maximization",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5394.642,
    "end": 5424.018,
    "text": " relationship with platforms where there's a very specific generative model generative process relationship and it's based around like a behavioral summaries of the person's time spent on the site or like they're spending or something like that versus like taking the cognitive reins and saying we want to have lower anxiety and we want people to be exposed to different perspectives or some other preference for platforms that's specified using an active inference framework",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5426.206,
    "end": 5427.066,
    "text": " There's a lot in there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5429.748,
    "end": 5436.251,
    "text": "So I'm going to try to think of the generative model always.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5437.852,
    "end": 5441.334,
    "text": "Generative models aren't one scale, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5441.634,
    "end": 5444.175,
    "text": "There's scales on scales on scales on scales on scales.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5444.195,
    "end": 5451.859,
    "text": "And what happens when you go across scales is that your states at one level becomes the observation at the next level, and then it embeds and embeds and embeds.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5452.85,
    "end": 5453.11,
    "text": " Okay."
  },
  {
    "start": 5453.591,
    "end": 5457.894,
    "text": "And then the embeddings can sort of, like, again, track into one another.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5457.954,
    "end": 5461.516,
    "text": "So I'm here and there's the bear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5461.596,
    "end": 5464.118,
    "text": "So I'm going to stop focusing on you, which is a higher level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5464.158,
    "end": 5465.759,
    "text": "I'm going to focus on directly this right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5466.12,
    "end": 5466.76,
    "text": "And there's the bear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5466.78,
    "end": 5467.621,
    "text": "And I'm going to focus on the bear.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5468.041,
    "end": 5470.823,
    "text": "But eventually the bear goes away because, you know, I was having a hallucination.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5471.443,
    "end": 5471.564,
    "text": "And...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5472.691,
    "end": 5481.694,
    "text": " Suddenly I can go back to a higher level and start monitoring other things and notice, okay, well, you know what, this lasted a long time and maybe I should be cooking because I'm going to get hungry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5482.054,
    "end": 5492.858,
    "text": "So I'm going to, you know, slowly navigate the scales of where I'm supposed to put attention based on how the free energy is rising at a given point in the scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5495.137,
    "end": 5502.582,
    "text": " All the same, for the web or for monitoring or for resource attribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5505.004,
    "end": 5506.125,
    "text": "What am I really trying to do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5506.665,
    "end": 5513.67,
    "text": "What I'm trying to do is to make sure that a person never has to feel like they're constantly putting out fires.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5514.969,
    "end": 5516.51,
    "text": " So anxiety is that, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5516.57,
    "end": 5523.492,
    "text": "Anxiety is the constant belief that you're, like, peaking everywhere and you have to pay attention to everything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5523.552,
    "end": 5524.512,
    "text": "You're hypersensitive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5524.953,
    "end": 5526.793,
    "text": "So let's lower that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5526.933,
    "end": 5539.598,
    "text": "Let's feel like you can start, like, giving a little bit more attention to a longer time frame or even a shorter one, but just on the moment because, like, all of the parts of your model are pretty certain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5539.858,
    "end": 5541.158,
    "text": "There's not going to be a fire.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5541.779,
    "end": 5542.199,
    "text": "So, like...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5543.416,
    "end": 5547.938,
    "text": " I have certainty across all my scales and I'm going to start paying attention to just this now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5548.498,
    "end": 5552.28,
    "text": "And, and like, I don't need to like, you know, give too much of my model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5553.56,
    "end": 5554.821,
    "text": "How do you do this with monitoring?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5554.841,
    "end": 5566.325,
    "text": "Well, with monitoring, you're like, well, look, given this trajectory right now and given this personality type and given like what we know already about her, she's going to freak out in about five minutes about X. And I'm monitoring this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5566.365,
    "end": 5568.426,
    "text": "So before she freaks out, let's,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5570.02,
    "end": 5578.148,
    "text": " give a little reminder about this or like, actually through IOT or whatever, let's start something like my dream is like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5579.073,
    "end": 5582.015,
    "text": " In the morning, I wake up, my breakfast is, like, started.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5582.175,
    "end": 5584.136,
    "text": "Like, nobody's starting it for me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5584.537,
    "end": 5585.417,
    "text": "It's just starting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5585.857,
    "end": 5601.768,
    "text": "So, you know, I do... My house predicts the kinds of things I'm likely to need so that eventually I never, like, ever have to feel like I need to pay attention to anything with too much, like... Too much uncertainty is going to arise anyway.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5601.788,
    "end": 5605.75,
    "text": "I'm not sure I answered your question exactly, but I feel like I'm going in that direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5607.391,
    "end": 5607.791,
    "text": "There's the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5611.274,
    "end": 5622.865,
    "text": " preparing your breakfast when you wake up and there's sort of the cybernetics 1.0 version, which is we have a prediction about what time you're going to wake up and then we're just going to do it like setting the thermostat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5623.345,
    "end": 5625.627,
    "text": "We're going to just prepare it for it to be ready at this time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5626.408,
    "end": 5628.87,
    "text": "Then this is kind of taking that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5629.875,
    "end": 5638.263,
    "text": " physical biofeedback layer to another level, but also what should we epistemically forage for in the morning?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5638.783,
    "end": 5653.796,
    "text": "How do we experience that sleep-wake transition in a way where like we wake up and sort of like sharpen or become more vigilant and focus on the things that matter and that have impact.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5653.877,
    "end": 5655.358,
    "text": "And then at the end of the day, sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5657.02,
    "end": 5681.521,
    "text": " have some unwind or some sort of relaxing process so that we can move into a healthy sleep there was um ah there was this i'm watching a lot of youtube lately and what's youtube it's like um there's this one dude who tried to replicate a billionaire morning right",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5682.679,
    "end": 5691.482,
    "text": " It was striking what the billionaire does in the morning, which is basically like, I'm going to do all this shit to make my body feel better and all that great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5691.962,
    "end": 5700.685,
    "text": "And then he did this stuff to think about who he wanted to be today and what kind of qualities he wanted to embody.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5700.745,
    "end": 5701.245,
    "text": "And it's like, yo.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5703.843,
    "end": 5710.229,
    "text": " I gotta think about not missing my bus or whether I'm gonna freeze my ass outside or whether, you know, I might get fired if I get late.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5710.249,
    "end": 5711.17,
    "text": "Like, do you see what I mean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5711.19,
    "end": 5721.76,
    "text": "Like, my concerns, my direct epistemic concerns in the morning are vastly different from what that dude has to care about because everything that I'm talking about, he's certain about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5721.801,
    "end": 5723.762,
    "text": "Like, he has no qualm about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5723.782,
    "end": 5724.563,
    "text": "He does not care.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5724.643,
    "end": 5726.165,
    "text": "Like, so...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5727.386,
    "end": 5729.668,
    "text": " How might one sort of shift this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5729.788,
    "end": 5739.455,
    "text": "Well, I feel like there could be structures that we could put in place in order for someone to not feel like they have to, you know, feel that, but also maybe a focus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5740.196,
    "end": 5756.989,
    "text": "I know it seems hard to say, but maybe a focus on the things that he has to focus on would potentially limit the sort of, you know, constant need to feel like you need to put out fires.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5758.433,
    "end": 5766.94,
    "text": " So let's say that I'm a smart interface and I'm like, well, this person needs to be certain about these things because their life has X constraints.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5767.0,
    "end": 5771.844,
    "text": "Well, maybe what we're going to do is give you X reports and look, you don't need to worry about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5772.384,
    "end": 5772.764,
    "text": "It's there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5772.985,
    "end": 5773.885,
    "text": "You have that information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5773.945,
    "end": 5777.508,
    "text": "Now, what about you tried to think about things that are longer scale?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5777.628,
    "end": 5783.013,
    "text": "What about you tried to think about things that if you had nothing else to care about, you'd start thinking about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5783.253,
    "end": 5783.393,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5784.292,
    "end": 5794.754,
    "text": " You know, maybe these are the sort of epistemic forging that would lead people to a slightly more peaceful life, but maybe I'm coming from a very privileged space and maybe this is completely unrealistic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5794.774,
    "end": 5801.556,
    "text": "So you'd have to ask people who are much less privileged might have a different view on this question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5804.596,
    "end": 5805.937,
    "text": "Awesome points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5808.737,
    "end": 5814.06,
    "text": " Just in our last few minutes, like, what are you going to continue to work on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5814.08,
    "end": 5815.301,
    "text": "Or what are you excited about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5815.341,
    "end": 5817.142,
    "text": "Or what do you want to talk about or ask?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5817.603,
    "end": 5819.504,
    "text": "Anything you want to talk about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5819.544,
    "end": 5822.146,
    "text": "Well, I mean, you mentioned your paper, but we never got to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5822.166,
    "end": 5823.787,
    "text": "Do we have time?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5824.567,
    "end": 5824.807,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5825.287,
    "end": 5831.291,
    "text": "So with a handful of co-authors, we wrote a paper about...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5833.183,
    "end": 5838.547,
    "text": " using active inference to study specifically the epistemic community of science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5839.207,
    "end": 5849.994,
    "text": "And so we, as a group, read and shared your paper on epistemic communities, and then took the idea of like this epistemic entity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5850.234,
    "end": 5854.237,
    "text": "And now we've seen active inference entities be at different scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5855.273,
    "end": 5862.057,
    "text": " That's several years and many different things we've talked about there, including the narrative scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5862.857,
    "end": 5869.601,
    "text": "And so we thought, well, how could we model the scientific epistemic ecosystem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5870.521,
    "end": 5875.504,
    "text": " How can we do a systems description of the scientific ecosystem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5875.884,
    "end": 5885.73,
    "text": "So like the entities, like the person, but also the lab, the university, the DAO in the case of decentralized science or like Web3 or open science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5886.47,
    "end": 5888.251,
    "text": "How do we model the active entities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5889.252,
    "end": 5898.677,
    "text": "And for the active entities, eventually flesh out a cognitive model like you've presented today, but also include entities",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5899.039,
    "end": 5907.543,
    "text": " the informational entities, which map not onto the adaptive active inference agents, but the mere active inference agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5908.023,
    "end": 5921.849,
    "text": "So we can still model the paper as like an entity, but it doesn't have any policy selection that it can engage in, or like a code can engage in limited policy selection when it's used by computer system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5922.47,
    "end": 5925.131,
    "text": "And so the goal was to develop",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5926.385,
    "end": 5935.01,
    "text": " an ontology, the AOS, the active entity ontology for science that would be able to link up natural language descriptions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5935.33,
    "end": 5938.772,
    "text": "Like I sent a message to my friend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5940.233,
    "end": 5942.494,
    "text": " person, friend sent a message.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5942.995,
    "end": 5957.643,
    "text": "So have the natural language representation with a graphical flow chart representation, kind of like a social network of different kinds of entities, including the informational ones, and then be able to connect that to a simulation architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5964.087,
    "end": 5965.228,
    "text": "So sorry, you cut off that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5965.948,
    "end": 5967.129,
    "text": "Oh, so okay, so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5967.796,
    "end": 5970.79,
    "text": " you were going to try and simulate agents using your ontology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5971.453,
    "end": 5972.136,
    "text": "So basically like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5973.467,
    "end": 5991.515,
    "text": " So the first EOS paper from last week, we focused a little bit more on the conceptual and the history of decentralized sense-making and history of science and an introduction to Web3 and DeSci, decentralized science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5992.156,
    "end": 5998.438,
    "text": "And then some of our ongoing work and collaborations are to go from the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5999.974,
    "end": 6022.368,
    "text": " flowcharts that we kind of sketched out in some of the figures like a funding motif or an information sharing motif or communications motif into a simulation that uses the active inference entity model okay wow you really need to talk to Maxwell about this like he's been trying to think about um how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6023.223,
    "end": 6026.926,
    "text": " communities react to active inference specifically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6027.566,
    "end": 6030.568,
    "text": "And this makes me feel, this makes me think of Lakatos, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6030.608,
    "end": 6036.332,
    "text": "Like how there's this like core and then people test out the external hypotheses until they reach the core.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6036.372,
    "end": 6037.894,
    "text": "If they don't reach the core, it expands.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6037.954,
    "end": 6041.476,
    "text": "And so there's something really cool there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6041.496,
    "end": 6044.538,
    "text": "I can't wait to see more of this work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6046.62,
    "end": 6047.0,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6047.32,
    "end": 6049.282,
    "text": "Yeah, I hope that we can continue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6051.05,
    "end": 6068.648,
    "text": " strangely attracting and intertwining and including just collaborators from different backgrounds in the discussion as some people who are listening might be hearing about active inference for the first time and might be connecting with like a community in us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6070.131,
    "end": 6072.753,
    "text": " that likes to do this kind of modeling and framing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6073.374,
    "end": 6083.842,
    "text": "And also there's people who might be more familiar with the active inference modeling and hopefully this like brought their attention to a really important and contemporary case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6084.282,
    "end": 6086.163,
    "text": "And of course, excellent recent research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6089.166,
    "end": 6089.466,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6089.646,
    "end": 6092.728,
    "text": "Let's do a interdisciplinary research for the win.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6092.748,
    "end": 6094.77,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6095.41,
    "end": 6096.651,
    "text": "Anything else you want to add?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6098.433,
    "end": 6099.794,
    "text": "No, we've covered a lot of breath.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6100.379,
    "end": 6101.121,
    "text": " I know, I know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6101.201,
    "end": 6102.845,
    "text": "Seriously, the time goes fast.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6103.346,
    "end": 6105.571,
    "text": "So thanks a ton for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6106.373,
    "end": 6106.954,
    "text": "See you around.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6109.38,
    "end": 6109.56,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]