[
  {
    "start": 1.087,
    "end": 22.078,
    "text": " hello it is january 25th 2023 and we are in cohort two of the par at all textbook we're in meeting 13. today we are going to jump back in start our second interval of activities",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 24.428,
    "end": 52.094,
    "text": " there are a few ways we can go we can just review structural aspects of the coda and accommodate anyone's like suggestions or notes on some things that could be interesting to develop with in this one or an aside little sandbox then we will look to the textbook itself and we will look at where the first five chapters got us",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 53.676,
    "end": 72.499,
    "text": " and where we're going with the second half of the book which has a different form and function than the first half of the book so first off anyone want to just add any general comment how now that it's 2023",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 76.007,
    "end": 80.31,
    "text": " Where are they in their act-inf learning and application journey?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 80.33,
    "end": 92.82,
    "text": "How is our niche similar or different than it was in September through November when we worked through the first five chapters?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 110.074,
    "end": 110.415,
    "text": " Any thoughts?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 110.775,
    "end": 111.617,
    "text": "Or we can continue on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 112.118,
    "end": 114.402,
    "text": "Just wanted to leave that space.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 120.908,
    "end": 125.511,
    "text": " Okay, feel free to raise your hand or just unmute or put in the chat or anything like that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 127.673,
    "end": 133.476,
    "text": "Broadly, the layout is similar.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 134.617,
    "end": 143.963,
    "text": "Textbook group overview has information on our live meetings and that's where you can download the textbook.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 145.985,
    "end": 147.886,
    "text": "The textbook section itself",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 149.491,
    "end": 172.686,
    "text": " contains different types of things that are in the textbook such as the equations which have all been brought out with images and page at least but there's a lot of improvements that we could make to the descriptions and the tagging similarly with figures we have all figures brought out",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 173.749,
    "end": 179.232,
    "text": " but there's a lot of contributions that can be made to descriptions and tagging.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 180.433,
    "end": 183.735,
    "text": "Boxes and tables, similar.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 185.476,
    "end": 186.576,
    "text": "Code implementations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 189.438,
    "end": 191.679,
    "text": "I'll add a link to Blockference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 192.02,
    "end": 202.726,
    "text": "So if anybody, which is one thing that we've worked on the last few months, we have about 40 or 50 implementations of Act-Inf.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 204.21,
    "end": 207.571,
    "text": " in Python, C++, Julia, MATLAB.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 208.771,
    "end": 211.171,
    "text": "So accessible from here.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 213.512,
    "end": 225.554,
    "text": "And we can, for those who want to start getting more into the code, and I'll just show one more piece that we worked on earlier today in the Blockference meeting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 227.234,
    "end": 230.294,
    "text": "In Model Stream 7.2, a notebook was used.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 233.928,
    "end": 240.053,
    "text": " an epistemic contextual multi-armed bandit simulation was provided by Conor Hines.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 241.994,
    "end": 244.716,
    "text": "Just works perfectly, no tweaking is needed.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 245.697,
    "end": 247.879,
    "text": "Uses actin, floop, defines, etc.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 248.819,
    "end": 257.926,
    "text": "And what we did today was we took the actin fontology and we then said, how is this set up in the contextual bandit?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 258.387,
    "end": 259.467,
    "text": "How do they set up B?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 260.268,
    "end": 262.65,
    "text": "Okay, here's how B is set up.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 264.531,
    "end": 289.751,
    "text": " one can click this and then in a plain text paste in the whole script so this is not the only way that we're going to be working towards modeling but as the second half of the textbook is about building a generative model and the process the recipe",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 291.704,
    "end": 309.902,
    "text": " we have like multiple functions in this cohort two as we go through chapter six or ten one function will be to to the extent that we want to develop our own generative model and simulation",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 311.465,
    "end": 337.206,
    "text": " just didactically just to have something that we increment along to help us understand or if there's some outcome that people want to pursue research or application oriented like second half of the textbook is um the time to do it and even relative to last September we have significantly better tools",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 339.369,
    "end": 351.162,
    "text": " So there's totally an approach to go from a natural language understanding of these ontology terms to how to do it in PyMDP.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 353.371,
    "end": 360.873,
    "text": " And it's pretty reasonable that somebody who wants to pursue this direction, we could just add another column, copy it over, make the tweak.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 361.233,
    "end": 366.435,
    "text": "And there's a few other pieces, but a lot of that is going to come up in chapter six.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 368.816,
    "end": 372.657,
    "text": "In chapter notes and questions, we have the chapters themselves.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 373.715,
    "end": 401.91,
    "text": " and a detailed table of contents and then each chapter has subset view of the questions so if you have a question within a given chapter or you want to help uh improve and curate the discourse please just like add a row in the questions section or just make improvements to the answers and discourse um so we'll um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 403.82,
    "end": 432.238,
    "text": " continue to work with questions as well as whatever notes people add uh to just what or anything else they want to highlight um into the more discourse sections here's the home of the questions table but it's shown in the chapters as well ideas and insights people are always welcome to add just sort of nuggets or summaries for what",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 433.666,
    "end": 438.388,
    "text": " they're updating their models with, what they're coming away from, from these sections.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 439.929,
    "end": 451.215,
    "text": "Math Learning Group has no current live activities, but there's a huge amount of resources and some summaries that are written.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 452.716,
    "end": 458.899,
    "text": "But there's always many things for people to do with testing out math learning.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 461.7,
    "end": 462.401,
    "text": "Project ideas.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 463.766,
    "end": 484.748,
    "text": " can return to but that's kind of where we left off within the last meeting of the first half um future textbook groups we organized that at the end of last interval but as always if people are having like thoughts or they want to give comments or have ideas for",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 485.999,
    "end": 495.867,
    "text": " I can provide the feedback here directly or other notes and errata, which have been shared with the authors.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 497.228,
    "end": 513.54,
    "text": "I'll also note that on February 27th, Thomas Parr is going to join for a live stream.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 515.413,
    "end": 522.318,
    "text": " So if anyone is, let me just check the UTC time right now.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 524.14,
    "end": 531.165,
    "text": "But if anybody wants to, it'll be 17 UTC, 17 UTC on February 27th.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 542.97,
    "end": 544.471,
    "text": " So it'll be in Zoom just like this.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 547.492,
    "end": 551.314,
    "text": "And we have one month before then to...",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 554.548,
    "end": 578.759,
    "text": " prepare some questions that we want to highlight and ask so um those are just some overview Coda elements and some updates that have happened in the broader modeling space over the last few weeks and months",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 582.992,
    "end": 586.494,
    "text": " Any just general or comments on that?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 593.699,
    "end": 599.902,
    "text": "Is the Thomas Power live stream going to be over a paper or is it going to be over the textbook?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 600.063,
    "end": 602.244,
    "text": "Or is he just joining to field questions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 602.404,
    "end": 603.725,
    "text": "Or what is the subject matter?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 604.625,
    "end": 605.466,
    "text": "It's this textbook.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 606.206,
    "end": 607.507,
    "text": "Also, your audio is very off.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 609.208,
    "end": 610.309,
    "text": "But yes, this textbook.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 622.301,
    "end": 630.941,
    "text": " okay any other thoughts or questions or we'll turn to look at the book",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 654.286,
    "end": 654.546,
    "text": " Okay.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 655.987,
    "end": 667.951,
    "text": "Well, anyone who has been in Cohort 1 or otherwise, how would they characterize chapters 1 through 5 as opposed to chapters 6 through 10?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 680.136,
    "end": 681.236,
    "text": "Is my audio any better?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 681.777,
    "end": 682.377,
    "text": "No, not at all.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 685.38,
    "end": 712.208,
    "text": " okay just you can type it or just add it in the coda Ali go for it and anyone else I think chapter one through five was basically for building the requisite fundamentals for designing and maybe applying those concepts in a much more uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 714.778,
    "end": 722.561,
    "text": " practical way to some real world situations that we will deal with in the second part of the book, second half of the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 723.721,
    "end": 733.745,
    "text": "But in my opinion, even more than the dichotomy between the fundamentals or application oriented approaches between the two halves of the book,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 736.346,
    "end": 762.477,
    "text": " The very structure of those chapters, I mean, the pedagogical structures of those chapters are very different because as much as in the first chapter, we're dealing with some general propositions and some general structures and frameworks in order to frame the theory in a comprehensive and a kind of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 764.555,
    "end": 766.436,
    "text": " layered structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 766.996,
    "end": 789.165,
    "text": "In the second half of the book, we're much more in a case of study-based approach, and we're dealing with some solved examples, so to speak, and in some other cases, even some open questions that we can try our hands on later after",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 791.567,
    "end": 798.73,
    "text": " while learning the basic fundamental approach to solving these kinds of problems in active inference framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 799.711,
    "end": 817.399,
    "text": "But in my opinion, these two halves of the book can even be seen as two separate books because of their fundamental differences in every aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 822.045,
    "end": 822.866,
    "text": " Very interesting.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 823.126,
    "end": 823.506,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 825.268,
    "end": 826.649,
    "text": "Anyone else?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 826.689,
    "end": 828.41,
    "text": "Just what are your thoughts?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 829.411,
    "end": 836.417,
    "text": "How have chapters 1 through 5 sat with you now that you've read it and digested it?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 837.798,
    "end": 845.485,
    "text": "And then if you have looked at 6 through 10, how would you contrast it with chapters 1 through 5?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 845.685,
    "end": 848.347,
    "text": "And then we'll look more in fine grains.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 855.672,
    "end": 882.268,
    "text": " i would say one through five was like the blanket and six through ten is like the hidden state awesome keep the keep the active ontology 100 a great metaphor yep",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 883.664,
    "end": 911.221,
    "text": " observations one through five observations six or ten hidden state inference neil yeah so the first half i i didn't get as much out of it as i would like to if it's it's still very mathematical um but that maths didn't really lead to insight um i've",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 911.861,
    "end": 926.194,
    "text": " I've gone ahead and had a look through chapters seven and eight, and they look a lot more like their applications.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 926.214,
    "end": 929.397,
    "text": "I guess I seem to be getting more from that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 931.699,
    "end": 932.98,
    "text": "So that's looking good.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 936.206,
    "end": 936.666,
    "text": " Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 936.826,
    "end": 937.147,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 937.507,
    "end": 946.133,
    "text": "Sometimes it helps to do the applications before the theory to give you some sort of direction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 949.496,
    "end": 949.796,
    "text": "Yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 957.602,
    "end": 963.486,
    "text": "Anyone else want to add a comment or I'll add a general comment on the chapters and then we'll go to the subsections and so on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 971.415,
    "end": 971.715,
    "text": " Ali?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 973.956,
    "end": 997.368,
    "text": "I also agree with Neil that maybe some of the contents of the second half of the book might work better if they were interspersed with the material from the first chapter to have a much more goal-oriented vision in mind and to not lose the big picture for the coming chapters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 999.549,
    "end": 999.669,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 999.689,
    "end": 999.809,
    "text": "Yeah.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1002.472,
    "end": 1031.334,
    "text": " have we have a lot to infer and do with the pedagogical ordering and respecting all different learning preferences and paths um we're going to be heading into chapter six in the coming um two weeks in our cohort and here's from the summary of chapter six um in this chapter they're outlining design choices and they provide a four-step recipe",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1032.332,
    "end": 1056.302,
    "text": " which we're going to spend a lot of time working on because like that is our you know we're all sous chefs in the kitchen this is our recipe structure that every single time a sous chef gives their input on how to improve it or how to make something that's a little bit tacit or implicit into a checklist",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1057.407,
    "end": 1076.427,
    "text": " a template or an automation every time a sous chef sees that opportunity the recipe gets better um this sets up the remainder of the book which is again what we're going to be working through in the next three months putting these ideas into practice through illustrative examples",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1077.478,
    "end": 1083.104,
    "text": " which Ali referred to as like solved examples, and basically they are.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1083.464,
    "end": 1099.319,
    "text": "They might be trivially solved, but whereas what we saw in terms of solved examples in chapters one through five was like the frog jumping out of the hand, which is kind of a solved example of Bayesian inference, now we're going to see some solved examples",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1100.556,
    "end": 1125.111,
    "text": " of the type that active inference models are like with a partially observable markov decision process and the second half of the book is designed to showcase the theoretical principles presented in the first half of the book so let's look back to the first chapters and then see how that is going to be showcased chapter one is like an introduction",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1126.022,
    "end": 1154.168,
    "text": " and on the other side of the bookshelf chapter 10 is going to be like a summary recap so that's kind of like the opening and the closing bookmarks chapter two and three cover the low road and the high road to active inference we're not gonna or don't need to go into it in a lot of detail right now but those are the two paths that are laid out to get to active inference",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1155.328,
    "end": 1165.82,
    "text": " and chapter four puts us squarely in active inference with a focus on what is at the heart of active inference modeling which are generative models",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1167.301,
    "end": 1178.55,
    "text": " Chapter five then focuses on one of the areas where active inference models have been most applied and applicable, which is in neurobiology.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1178.97,
    "end": 1184.694,
    "text": "And so chapter five looks at several neurobiological systems in detail,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1185.854,
    "end": 1211.733,
    "text": " how active inference is applied and then has some tables that show more broadly where those models have been applied so introduction on what the book is about and its overall framing and structure the two roads to active inference from the mechanistic and the bayesian in the low road and from the imperative for survival and the free energy principle on the high road",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1212.83,
    "end": 1241.227,
    "text": " chapter four describing the structure of the essence of what this kind of modeling entails at least in the style as the authors are laying it out and then immediately jumping into examples and somewhat of a literature review overview on some of the systems where it's been most applied that are the theoretical principles presented in the first half of the book",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1242.642,
    "end": 1264.006,
    "text": " low road high road what the model is itself and how we see it applied in neurobiology in the second half of the book chapter six is going to start us off with a recipe and um this question what are the four steps",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1265.68,
    "end": 1286.141,
    "text": " previously we had a lot of good discussion on these and a few other questions so improving the discourse as always adding questions is super helpful just checking people's understanding checking your own understanding everyone adding one question per week would result in",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1287.58,
    "end": 1313.015,
    "text": " a quantity and quality of questions that would be transformative truly one question per week even if it seems trivial or is a speculative question so questions are huge and in chapter six we're focusing on this four-step recipe it's about how to design active inference models and we'll have a lot of space and time to connect it to",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1314.264,
    "end": 1326.865,
    "text": " the cutting edge work in PyMDP and approaches that we're using with the active inference ontology so that we can have a pathway from a natural language understanding",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1328.374,
    "end": 1335.698,
    "text": " of a given system of interest on through the kind of states-based representations that are required for PyMDP.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1336.139,
    "end": 1341.322,
    "text": "So that's what chapter six is about, the recipe and the structure as the authors are laying it out.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1342.142,
    "end": 1353.309,
    "text": "And also keeping in mind, not sure exactly which moment this was said, but the audience for this textbook, I believe Carl said,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1354.73,
    "end": 1380.366,
    "text": " the audience is something like a master student in computational psychiatry looking to apply this to their own research so that is like squarely what this chapter is oriented to after um again as ali said like chapters one through five were about building those requisite fundamentals all right",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1381.348,
    "end": 1393.053,
    "text": " Then chapter seven and eight, kind of like the cousins of two and three, are going to present duality or some other kind of minimum two system.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1393.514,
    "end": 1403.718,
    "text": "Chapter seven is going to look at active in discrete time, DAI, discrete active inference, which is often affiliated with decision-making cognition.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1404.619,
    "end": 1404.999,
    "text": "And then chapter",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1406.345,
    "end": 1427.22,
    "text": " Chapter eight is going to present active inference in continuous time, also sometimes called MAI or motor active inference, because it can be and has been used to describe continuous motor reflex and actuation processes like joints and movement.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1428.541,
    "end": 1432.964,
    "text": "So there's many flavors and variants of active inference.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1434.15,
    "end": 1458.941,
    "text": " every time we see like an adjective active inference deep affective sophisticated branching time all of these flavors and adjectives there's a whole growing zoo wildlife preserve but one of the most important and also didactic differences amongst active inference models are their treatment of time",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1460.876,
    "end": 1463.618,
    "text": " along the lines of many other simulation approaches.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1464.259,
    "end": 1476.628,
    "text": "The difference between discrete time and continuous time, where the discrete time is more like taking a sum over finite sets, and the continuous time is a lot more like doing calculus.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1478.99,
    "end": 1487.417,
    "text": "In chapter 9, knowing what we now know about how active models can be cooked up,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1489.062,
    "end": 1503.193,
    "text": " and about two major classes of generative models discrete and continuous time we'll look at model based data analysis so um",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1505.285,
    "end": 1529.106,
    "text": " i'll just show one figure to um highlight here's figure 7.1 so we have a prior hidden states s b is how the hidden states change their time a is the mapping between hidden states and observations this relationship between the hidden states and observations is sometimes called the tale of two densities",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1531.209,
    "end": 1558.906,
    "text": " just loosely slash poetically because this a matrix can be used to take a hidden state and generate data what observations would we expect given the hidden state and a or you can take observations and through a do inference on hidden states that is using a generative model",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1560.091,
    "end": 1588.777,
    "text": " in its generative capacity which is from the hidden states to generate observations or in its recognition density from empirical data back to hidden state inference of unobservables so in chapter 9 that type of data-based modeling is described whereas in the previous examples",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1590.824,
    "end": 1596.487,
    "text": " things were more oriented towards like just what is the structure of the generative model?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1597.367,
    "end": 1602.951,
    "text": "Chapter nine is going to bring us to confront this question of with empirical data,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1603.976,
    "end": 1626.457,
    "text": " how can we then do state inference which is a task that starts to look a lot more like what day-to-day research and analysis looks like and then quickly as we begun chapter 10 is an overview summarizes the structure of the book again",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1628.032,
    "end": 1644.427,
    "text": " gives a quick recap of each section and provides some closing articulations and next steps so again they've laid out the book broadly into sections",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1645.441,
    "end": 1666.809,
    "text": " the first half gets as quickly as one can to the heart of active inference modeling the generative model then reminds us of some of the central applications over the previous years in neurobiology also using that as an opportunity to discuss message passing which doesn't",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1668.098,
    "end": 1693.411,
    "text": " centrally feature but is something that one can imagine will be developed more then chapter six or ten what we're going to be focusing on in this second interval of activity for cohort two we're going to start with a math free chapter where we um are just looking at this recipe that they're going to lay out which",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1694.674,
    "end": 1719.605,
    "text": " going to be just super exciting discussions and there's a lot that um everyone will be able to contribute on this because we'll be able to come to a lot of intersubjective clarity about how they are laying out the modeling approach in active inference again according to par zulo and friston",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1720.976,
    "end": 1748.844,
    "text": " And also use that as a starting point for specifying what they've proposed, asking questions that aren't addressed in these short texts, and then connecting to our experience with modeling, whether we've used programming languages or data analysis or in different disciplines and settings.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1751.769,
    "end": 1758.155,
    "text": " All right, so I was just giving a little overview on the chapters and the sections.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1759.136,
    "end": 1766.162,
    "text": "Anyone have any comments they'd like to add on structure or chapters?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1766.483,
    "end": 1766.803,
    "text": "M. Carl.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1768.905,
    "end": 1772.128,
    "text": " Yeah, I have a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1772.148,
    "end": 1776.651,
    "text": "I'm not so sure whether this is a little bit off.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1777.212,
    "end": 1787.039,
    "text": "But if you show this model, this hidden Markov model that you just showed with the hidden states and the observations,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1788.26,
    "end": 1793.766,
    "text": " I'm wondering, so I would like, maybe I can just say this briefly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1793.806,
    "end": 1799.111,
    "text": "You already read what my research is about, Daniel, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1800.132,
    "end": 1806.179,
    "text": "I may have, but please feel free, just for everyone's context, whatever you'd like to add, go for it.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1806.897,
    "end": 1810.158,
    "text": " OK, so I have a huge amount of data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.258,
    "end": 1814.119,
    "text": "And I'm wondering whether this is behavioral data, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1814.779,
    "end": 1818.881,
    "text": "And I was wondering whether this could be the right approach to model this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1819.401,
    "end": 1826.463,
    "text": "And my question here is, so the matrixes A and B are, I guess, independent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.543,
    "end": 1832.845,
    "text": "And so if there is a decision on these hidden states,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.725,
    "end": 1841.089,
    "text": " S and the emission of the observation through an A matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1842.75,
    "end": 1848.994,
    "text": "This is somehow independent from the successive observation, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1849.734,
    "end": 1871.589,
    "text": " So is there a possibility to tell the system that the emission of one observation from a state depends a little bit, or the successive state depends on what the previous state has emitted, what observation was produced?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1873.486,
    "end": 1874.567,
    "text": " I understand my question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1874.607,
    "end": 1880.852,
    "text": "So it looks like the transitions are independent from the emissions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1881.773,
    "end": 1889.619,
    "text": "And I'm not so sure what this actually implies in the modeling of my data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1892.601,
    "end": 1893.822,
    "text": "Does that question make sense?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1895.363,
    "end": 1895.704,
    "text": "Awesome.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1895.904,
    "end": 1896.244,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1896.264,
    "end": 1898.266,
    "text": "So there's a few pieces.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1899.798,
    "end": 1924.259,
    "text": " anyone want to give a first thought and then this is like again it's an example of what we can add as a question you don't have to go and tag everything with the actin fontology if you want but certainly one could because you use a lot of actin fontology terms but regardless of how fully formed or appropriate one thinks like adding the question to these tables",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1926.101,
    "end": 1955.673,
    "text": " is one of the most helpful ways that those insights that we do want to share in this space can have like extremely highly leveraged impact even without large language models being trained on these documents which will assuredly happen these are important questions so i'm just going to try to take notes as people discuss this on this questions and topics page so giuseppe and anyone else",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 1963.692,
    "end": 1968.535,
    "text": " So if I can answer my own question, or a thought at least.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1969.996,
    "end": 1973.938,
    "text": "So one could add at the output a kind of a language model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1977.421,
    "end": 1985.608,
    "text": " Or maybe, I don't know, are there such tweaks that are possible in this whole model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1986.789,
    "end": 1995.756,
    "text": "So if we say that one observation does not only depend on the state which has emitted it, but also on the previous observation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1996.917,
    "end": 1997.659,
    "text": " How can we model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1998.139,
    "end": 2002.908,
    "text": "I mean, one way to model this would be to have a language model that runs over maybe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.545,
    "end": 2022.055,
    "text": " alternative possible observations and then decide which chain of sequence of observations one has the highest likelihood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2023.095,
    "end": 2026.578,
    "text": "Or how could something like this be modeled?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2028.159,
    "end": 2031.182,
    "text": "Is this taken account to in some ways?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.163,
    "end": 2036.626,
    "text": "Yeah, great questions, Giuseppe, then Neil, then anyone else.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2045.037,
    "end": 2046.178,
    "text": " I don't hear you, Giuseppe.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2051.14,
    "end": 2051.68,
    "text": "Yes, I do.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2052.721,
    "end": 2054.242,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2054.302,
    "end": 2073.572,
    "text": "So I was thinking, although the transition, in my understanding, the transition matrices are pre-specified, then at the moment of learning, in a sense, the mean matrices are updated so to reflect",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2074.731,
    "end": 2091.679,
    "text": " observations so but but they're not immediately i guess and they're not immediately updated on the basis of the last observation is that is that correct yeah i'll just briefly directly respond",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.186,
    "end": 2102.389,
    "text": " In the simplest possible framing of this partially observable Markov decision process, there's no learning or parameter updating at all.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2102.969,
    "end": 2104.229,
    "text": "A and B are fixed.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2104.83,
    "end": 2110.971,
    "text": "However, we're in the Bayesian statistics world, we're in the Bayes area, so everything can be learnable.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2111.912,
    "end": 2122.575,
    "text": "For example, in this PyMDP script, first there was an active inference loop specified, and then a kind of cousin function was specified where the B matrix was learnable.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2123.945,
    "end": 2129.026,
    "text": " So one can have every variable here fixed or learnable.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2130.366,
    "end": 2132.587,
    "text": "It just depends how you actually do the modeling.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2132.667,
    "end": 2135.847,
    "text": "And that's, again, what chapter six is going to confront us with.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2136.708,
    "end": 2140.948,
    "text": "One can imagine that if you have a fixed A matrix, all you have to do is specify the A matrix.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2141.709,
    "end": 2148.21,
    "text": "If you want to have learning, the state space and the dimensionality of your model has vastly increased.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2149.488,
    "end": 2164.037,
    "text": " So that may be worth it in certain situations, but now you're dealing with decay rates and learning constants and critical forgetting, and just there's all these features that you're just not dealing with with the more reduced fixed model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2165.238,
    "end": 2168.16,
    "text": "So all the parameters can be fixed or not.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2169.921,
    "end": 2173.023,
    "text": "Okay, and then was there a second aspect or onto Neil?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2175.565,
    "end": 2176.185,
    "text": "Yeah, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2181.531,
    "end": 2194.985,
    "text": " I don't really understand this, but my feeling is if A and B are interdependent, does that mean that it's not a Markov decision process?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2197.237,
    "end": 2213.762,
    "text": " And if you've got a system where the current state is not just dependent on the previous state, but on states before that, then that's not a Markov process.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2216.403,
    "end": 2216.783,
    "text": "Awesome.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2216.903,
    "end": 2221.325,
    "text": "Yes, that was the direction I was going to add.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2221.945,
    "end": 2225.866,
    "text": "So from a pure empirical perspective,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2227.174,
    "end": 2253.782,
    "text": " observations may have a strong correlation so if you did a descriptive statistical approach like arima or just time series modeling you'd find that like there was a statistical correlation amongst similar observations again we're just thinking of some you know temperature in a room hidden state thermometer readings in the observations there's some like time auto correlation",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2255.146,
    "end": 2280.154,
    "text": " what the markovian property is even though last names aren't informative this is just what is called a markovian property is that the present is a markov blanket between the past and the future in other words this is a map this isn't the territory this is a map that helps us reduce the dimensionality of all possible models by considering those that have",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2280.956,
    "end": 2289.881,
    "text": " this one very important simplifying feature, which is that the past only influences the future through the present.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2290.881,
    "end": 2307.57,
    "text": "So yes, observations might be the same across different time points, or they might be correlated from a time series perspective, but architecturally from the Bayesian graph model that we're going to use, the way that we're going to model",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2309.019,
    "end": 2332.851,
    "text": " those observations through time is by having the observations emitted or received hashtag tail of two densities by a hidden state which undergoes time evolution so there's no direct edge between the observation at t minus one and the observation at t",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2335.182,
    "end": 2356.988,
    "text": " The A matrix could be the same if it's a fixed A, or the A matrix may have even changed if it's a learnable A. But the key feature that makes this partially observable is the fact that some parts of the model are observable, like data observations, and some parts are not observable, hidden states.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2357.588,
    "end": 2359.849,
    "text": "So that's the partially observable PO part.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2360.869,
    "end": 2363.99,
    "text": "And then what makes it a Markov process",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2365.08,
    "end": 2390.029,
    "text": " is this present acting as the blanket between the past and the future and then what makes it a decision process is that we're inter this is just a partially observable markov process in figure 7.1 partially observable hidden state observations markovian property current moment interleaving between the past and the future",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2391.107,
    "end": 2402.699,
    "text": " What makes it a Markov decision process is that it has the Markovian property and we are embedding action into the Markov process.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2403.46,
    "end": 2403.72,
    "text": "How?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2404.361,
    "end": 2413.13,
    "text": "By having evaluation of alternative policies and how they intervene at the B matrix.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2415.595,
    "end": 2419.877,
    "text": " So that's why this is a partially observable Markov decision process.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2420.377,
    "end": 2422.097,
    "text": "It has all of those attributes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2423.518,
    "end": 2431.321,
    "text": "And there's justifications for why we want it to be partially observable, why we want it to be Markovian, and why we want it to be a decision process.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2433.121,
    "end": 2443.045,
    "text": "And if somebody has some other modeling scenario in mind, then some of those adjectives might have to change or you might add adjectives.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2448.896,
    "end": 2450.177,
    "text": " Ali, and then anyone else.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2453.478,
    "end": 2466.645,
    "text": "Yes, adding to what you just explained, even when defining the B matrix, we just add the indices based on the state factors that are controllable or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2470.791,
    "end": 2476.775,
    "text": " Because in that case, with each action, the B matrix would be different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2477.236,
    "end": 2484.722,
    "text": "So this means that we would need an index specifying which action is actually taken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2484.782,
    "end": 2494.309,
    "text": "But for other contextual states, which are not under the control of the agent, we don't need any additional action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2495.313,
    "end": 2498.094,
    "text": " a transition probabilities for each action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2498.194,
    "end": 2511.68,
    "text": "So yeah, even in defining the structure of the B matrix, we distinguish between the states that are controllable and the contextual states that are out of the control of the agents.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2513.982,
    "end": 2541.573,
    "text": " awesome thank you yeah and and as we go through chapter six in the coming two weeks which is a qualitative chapter and then also look towards exactly how these are set up in pi mdp like this is a movement up down left right or this is just a left right movement or stay these affordances and transition probabilities and everything like that",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2542.546,
    "end": 2570.704,
    "text": " they get encoded in matrices and these operations are like linear algebra like arrays or tensors or matrices kind of being collided with each other the circles and the squares are variables they're variables of slightly different types but they are all variables and then the edges reflect like which we're going to combine",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2572.748,
    "end": 2601.309,
    "text": " and so each given variable has a semantics which we associate with an active inference ontology term d prior s hidden state a ambiguity matrix o observations b transition matrix pi policy policy is just the set of possible actions that are evaluated by the agent",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2602.509,
    "end": 2630.711,
    "text": " e is used for affordances which is like the action possibilities in one moment up down left right and then pi is affordances considered over the given time horizon so over one time step depth so not a deep model affordances are the same as policies because it's just the list of affordances whereas if you were doing like a depth of three in time",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2632.119,
    "end": 2658.27,
    "text": " then you would have affordances to the third power that number um how are policies evaluated using free energy calculations how are policies selected free energy minimization what does that look like in code here's the active inference loop the heart of the active inference loop",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2659.372,
    "end": 2687.707,
    "text": " is inference on states that is taking in observations and doing hidden state inference then inference on policy what am i updating my policy posterior to be and then sampling from your policy posterior this is like observe and orient this is like decide and act",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2689.773,
    "end": 2698.337,
    "text": " But what PyMVP has done an incredible job of is making it so that the A, B, C, D are defined.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2699.098,
    "end": 2700.459,
    "text": "You have to define what those are.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2700.499,
    "end": 2701.579,
    "text": "Here's how C is defined.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2703.0,
    "end": 2711.144,
    "text": "And then you define an agent as A, B, C, and D. My agent.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2712.025,
    "end": 2713.986,
    "text": "A is A, B is B, C is C, D is D.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2715.114,
    "end": 2717.495,
    "text": " We define the agent, that's the generative model.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2718.275,
    "end": 2720.776,
    "text": "We define the environment, that's the generative process.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2721.877,
    "end": 2727.579,
    "text": "And then we write the loop that connects the generative model and the generative process.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2730.76,
    "end": 2731.14,
    "text": "Giuseppe?",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2733.473,
    "end": 2734.113,
    "text": " Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2734.173,
    "end": 2739.416,
    "text": "So you, you talked about the E matrix, and you called it the matrix of affordances.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2740.357,
    "end": 2746.159,
    "text": "I think I remember in the book, it was, it was more like the habits.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2746.32,
    "end": 2746.56,
    "text": "Was it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2746.8,
    "end": 2747.52,
    "text": "Is it correct?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2749.041,
    "end": 2750.322,
    "text": "Yes, the same thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2750.982,
    "end": 2751.282,
    "text": "Yes.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2751.682,
    "end": 2760.747,
    "text": "So I afford us I, you know, I'm thinking about Gibsonian affordances, but",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2762.512,
    "end": 2770.766,
    "text": " is it this i maybe i don't see the links uh all right great i'm gonna go for um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2772.458,
    "end": 2796.112,
    "text": " a short answer and then a more um something that connects us to some ongoing debates in the area the e-matrix both describes the affordances in terms of the action possibilities as well as to what extent they're habitual and so like let's just say that there's four um we can go up down left right so if",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2797.068,
    "end": 2817.138,
    "text": " there's um a one one one one for up down left right that's like saying you can go up down left right and they're all equally likely to happen if it were like one one one nine then it's like you can go up down left right but this one has a higher prior probability on policy",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2819.682,
    "end": 2841.153,
    "text": " if this were like 1 1 0 9 it's like this cannot happen as well as things that aren't listed can't happen so the e-matrix describes action possibilities and by doing so whatever is included in the list is at least there is a prior on that action happening",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2842.372,
    "end": 2847.461,
    "text": " And then quantitatively, the value of the E matrix describes the habitualness.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2848.182,
    "end": 2852.871,
    "text": "And then like in chapter five, we saw about how like dopamine,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2854.156,
    "end": 2862.402,
    "text": " mediates or is modeled to mediate the handoff between more habit guided.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2863.243,
    "end": 2865.225,
    "text": "Here, habit just gets passed through.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2865.585,
    "end": 2870.348,
    "text": "Actions are selected more based upon what one has already acted upon in the past.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2870.849,
    "end": 2882.838,
    "text": "Whereas here, we can see free energy evaluation as sharpening your policy prior into a policy posterior that you then sample from.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2885.14,
    "end": 2895.658,
    "text": " So free energy minimization is then kind of like that type two thinking where we're sharpening our policy distribution so that we can make a decision that has a lower expected free energy",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2896.733,
    "end": 2925.687,
    "text": " even if that's not the one that we would have gone to from habit and then just to connect it to um some recent um discussions i'll put this in the chat so request um access if if you want on the gibsonian note there is this paper um trick or treat and long story long story but there is like a markov blanket trick paper by these authors and then a bunch of commentaries and then just a few days ago they made a comeback",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2927.344,
    "end": 2956.632,
    "text": " summarizing the commentaries and going further and um basically their main issue is the fep affordance concept isn't the gibsonian affordance direct perception of action possibilities concept ergo read the paper to find out more but we had very fun discussions and it it spoke exactly to the gibsonian question",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2958.007,
    "end": 2982.652,
    "text": " okay well thank you very very clear thank you awesome okay in our last just like few minutes any other notes awesome so um we're gonna be",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 2987.552,
    "end": 3016.736,
    "text": " in chapter six for the next two weeks chapter six is not that long um so this will be a good time to make this process of active modeling our own and customize it provide templates connect it to the work that's already happening in pyMDP",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3018.47,
    "end": 3034.678,
    "text": " explore ways that we can go from vision of the scenarios that people want to model into the kinds of models that will have pragmatic and epistemic value for us.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3038.219,
    "end": 3040.04,
    "text": "Any last comments or I will close the recording.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3041.65,
    "end": 3061.034,
    "text": " Quick question, because I haven't watched the PYMVP talk yet, but is it like all the codes that are in the book are actually being reworked and are available in Python?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3062.686,
    "end": 3069.169,
    "text": " No, that is not the case yet, but with some automated and semi-automated work, it could be.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3070.67,
    "end": 3078.193,
    "text": "In model stream 7.2, which you can find from live streams, in the video description is this notebook.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3081.375,
    "end": 3088.078,
    "text": "But we don't have notebooks for the MATLAB code, let alone Python transformations.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3088.658,
    "end": 3091.78,
    "text": "But if somebody wants to do that, let's do that.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3093.584,
    "end": 3104.074,
    "text": " okay thank you yep and in the code page there's there's a github repo so if some just if somebody",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3105.407,
    "end": 3108.488,
    "text": " wants to add the code, just feel free.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3109.708,
    "end": 3109.968,
    "text": "All right.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3110.428,
    "end": 3112.968,
    "text": "So see you cohort two.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3113.028,
    "end": 3114.349,
    "text": "Thanks for continuing on.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3114.989,
    "end": 3116.569,
    "text": "See you future weeks at this time.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3117.069,
    "end": 3124.111,
    "text": "And also there's the optional, like in like eight or 10 hours or something like the discord office hours, we'll just chill.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3124.891,
    "end": 3130.732,
    "text": "And just there'll be people from different cohorts and we'll just,",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3131.94,
    "end": 3132.722,
    "text": " go where people want to go.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3133.023,
    "end": 3134.126,
    "text": "So thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3134.346,
    "end": 3138.618,
    "text": "Feel free to stay on for cohort two beginning in just a minute.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3139.099,
    "end": 3139.359,
    "text": "All right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3139.801,
    "end": 3140.142,
    "text": "Thank you.",
    "speaker": "SPEAKER_06"
  },
  {
    "start": 3140.643,
    "end": 3140.904,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  }
]