[
  {
    "start": 6.848,
    "end": 7.731,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8.615,
    "end": 15.762,
    "text": "It's October 1st, 2024, and we're in quarterly roundtable number three for the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 17.159,
    "end": 18.602,
    "text": " Welcome to the ACT-INF Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 19.303,
    "end": 24.532,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 24.933,
    "end": 26.957,
    "text": "You can find more information at these links.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 27.978,
    "end": 33.168,
    "text": "This is recorded in an archived livestream, so please provide feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 33.929,
    "end": 38.357,
    "text": "All backgrounds and perspectives are welcome, and we'll follow video etiquette for livestream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 39.839,
    "end": 63.45,
    "text": " okay today in the quarterly roundtable we'll go over a few institute updates look at some developments occurring in projects and then talk a little bit about what will be happening in the last quarter of 2024 how we'll be setting up for next year before we jump in blue or alex want to make any comments or say hello",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 66.788,
    "end": 67.249,
    "text": " Sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 67.309,
    "end": 67.57,
    "text": "Hi.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 68.512,
    "end": 78.334,
    "text": "Excited to round this year out with the ecosystem paper and the symposium and yeah, looking forward to 2025 and all the updates we'll make then.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 82.28,
    "end": 97.324,
    "text": " Yeah, hey everyone, and possibly I will bring it into the live, what we shortly discussed in the beginning and before the stream, what it looks like for our current and next roundtables.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.484,
    "end": 101.19,
    "text": "We will talk more and more about some project results.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 102.592,
    "end": 108.962,
    "text": "And that's great what we see more and more projects and more developments, not only some specific plans.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 111.507,
    "end": 117.842,
    "text": " All right, so people watching live, feel free to write any questions or anything in the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.862,
    "end": 118.643,
    "text": "We'll keep an eye on it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.127,
    "end": 122.833,
    "text": "All right, first at the Institute scale,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 124.433,
    "end": 125.715,
    "text": " Here's an overview slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 125.735,
    "end": 132.885,
    "text": "You can screenshot a bunch of stable links that'll help start you on your journey.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.326,
    "end": 150.551,
    "text": "Email us, join the Discord, check out some projects, learn about the ecosystem, find out more structured ways to get involved, stay updated with video or newsletter, check out fellows programs, organizational partnerships, and provide financial support.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.212,
    "end": 152.314,
    "text": "Bunch of short links.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 152.294,
    "end": 176.563,
    "text": " okay as blue alluded to our main institute level focus and collaboration for the next six weeks or so is the versioning of this ecosystem and institute paper so we wrote the first version as a big team in 2023 with visuals and a lot of different discussion and hammering it out a lot of really interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.543,
    "end": 205.335,
    "text": " points and now we're in the versioning the first versioning heading towards the second snapshot version of what will be a large living document that will provide many entry points and many paths through different things happening at the institute and also at the ecosystem and clarify the relationships between them like what would be impactful for the active inference ecosystem to do what kinds of capacities could it build what kinds of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.315,
    "end": 206.236,
    "text": " Differences could it make?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.158,
    "end": 210.943,
    "text": "What would the Institute have to do and be in order to support that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 211.023,
    "end": 216.111,
    "text": "And what would we need from a support or participation perspective for how that would come to be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 217.012,
    "end": 223.142,
    "text": "So over the next six weeks, there'll be a lot of collaboration and discussion, synchronous and asynchronous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 223.722,
    "end": 230.192,
    "text": "No one is going to add everything to every page, but just like it always is, except more,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 230.172,
    "end": 243.355,
    "text": " This is a project where we just jump in and make many light touches and it's been awesome already to see how people have added things to these different pages and made structural suggestions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 243.47,
    "end": 244.633,
    "text": " There's one week left.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 245.014,
    "end": 251.629,
    "text": "If you want to register, go to ecosystem.activeinference.institute and fill out the form and you'll jump in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 251.669,
    "end": 261.613,
    "text": "And then for the last five weeks with whoever's on board then, there's already 20 or 30 people who will be co-authors and are writing in these pages.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.948,
    "end": 288.192,
    "text": " over the next five weeks we'll come together set up a few synchronous and asynchronous ways of people focusing their contributions and then we'll snapshot the version two in the days before the symposium and it's really an important way for people whether they've been largely on the sidelines watching or whether they've been involved for years how can we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 288.172,
    "end": 291.842,
    "text": " hear from people at the end of this year and help set a course for next year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.443,
    "end": 296.053,
    "text": "So there'll be new visuals, new fun discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.176,
    "end": 304.375,
    "text": "Blue or Alex, want to give any thoughts on this document or how we use it or anything else about it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 307.122,
    "end": 314.715,
    "text": " You mentioned visuals, and yes, I still see this picture we have from the last version.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 316.458,
    "end": 323.73,
    "text": "It looks very nice in terms of visuals, but also it was defining structure for our activities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 323.71,
    "end": 337.887,
    "text": " how we see Institute as an organization, how it operates, how it breaks down in organizational sense, which functions we need to operate such entity and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 338.728,
    "end": 344.875,
    "text": "Everything was basically in place and somehow planned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 344.855,
    "end": 372.988,
    "text": " our current vision and based on experience from the year working on projects and changes in ecosystem definitely we will work on contents of the paper but finally we will need to update visuals and i hope our new visuals will be even more attractive and defining in terms of structure for our future works thank you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 374.15,
    "end": 375.452,
    "text": " Well, that's a tough act to follow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 375.492,
    "end": 379.577,
    "text": "No, I'm just excited to see what pans out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 379.597,
    "end": 386.946,
    "text": "And it's nice for people to put their expectations for the Institute, for the next steps, for where they think we are right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 387.026,
    "end": 390.511,
    "text": "It's nice to see that from other people besides just us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 391.252,
    "end": 397.74,
    "text": "It kind of lets us update like, oh, well, maybe we are where we think we are, or maybe we're not where we think we are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 397.96,
    "end": 399.302,
    "text": "And what can we do to be better?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 399.442,
    "end": 400.984,
    "text": "So it's a fun process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 401.875,
    "end": 410.592,
    "text": " Also, without going too much into it, it's amazing how much the document writing environment has evolved in the last year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 411.213,
    "end": 418.568,
    "text": "Like a year ago, we were talking about a linear document and how to make it readable and accessible, all these different kinds of considerations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.7,
    "end": 443.863,
    "text": " Then taking that document already in the last few months, I was able to smash it up against a bunch of grant openings and get quite a ways towards translations into many languages, translations to many audiences, applications to grants, all these different sorts of things augmented to a pretty great first draft status using LLMs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.843,
    "end": 462.615,
    "text": " So having these kinds of comprehensive documents and living documentation that can have accurate information about what is the organization, who's available, who has what kinds of capacities, that kind of information can flow directly in grant pathways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.655,
    "end": 466.762,
    "text": "So it's just really exciting how that can play out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.782,
    "end": 466.982,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 468.835,
    "end": 476.485,
    "text": " Second major piece of the coming few months and weeks will be the 4th Applied Active Inference Symposium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 477.226,
    "end": 480.29,
    "text": "It's going to be November 13-15, 2024.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.079,
    "end": 489.763,
    "text": "It'll be free and online.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.351,
    "end": 498.924,
    "text": " We also hope that there'll be some satellite physical events for people who want to do a watch party or live stream from some physical location.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 499.845,
    "end": 503.731,
    "text": "The opening session will be with Carl Friston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 504.572,
    "end": 511.482,
    "text": "There'll be first session on just recapping what is the application environment look like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 512.44,
    "end": 536.406,
    "text": " what has changed since 2021 when we had the first applied active symposium with Carl uh what's happened this past year and then the second and third hour will be live stream 58.2 so that'll be the third discussion that we will be having on the renormalization group advances and then there's going to be a whole host of other presenters",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 536.875,
    "end": 566.494,
    "text": " sharing everything from tools and their case studies their updates their successes and challenges in applying actinv and also we'll have a lot of hackathon open source code collaboration opportunities it will be very welcome and open for beginners and all questions and we'll look to curate questions and help make sense of things together and we'll be sharing more information on that in october",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 567.655,
    "end": 571.0,
    "text": " Anything else that either of you would like to add about the symposium?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 577.527,
    "end": 585.518,
    "text": " Well, that's great that we have like this initiative became stable and we have each year we have symposium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 587.981,
    "end": 598.736,
    "text": "But if you remember, we like initially trying to choose a format which will be most valuable for our online community, which is growing and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 599.598,
    "end": 606.387,
    "text": "But from the very beginning, we were focused on that applied stance of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 606.367,
    "end": 635.665,
    "text": " of the topics because we understand that which rapidly grow in field in terms of theory and researchers researchers working in the field but finally from like systems engineering viewpoints we always need to have some understanding how it should be applied finally and this year i believe in terms of developments of tools and frameworks like rx info",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 636.725,
    "end": 651.831,
    "text": " it's really became more and more close to real life applications and we see around some like prototypes and some artificial bots are working there on offline",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 651.811,
    "end": 674.713,
    "text": " and yes we need to be aligned with ecosystem with our partners and participants and so on and see this for have this focus on applying active inference and check like each year with each hours in the field to share developments and perspectives",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 678.052,
    "end": 681.62,
    "text": " That's an exciting sneak preview about the renormalization group too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 681.88,
    "end": 685.287,
    "text": "I'm excited to peep that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 685.308,
    "end": 685.628,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 686.41,
    "end": 697.714,
    "text": "And it's just exciting to hold the open and plural space where we have research developments and applications all the way on through domain experts and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 698.386,
    "end": 718.183,
    "text": " It's one thing to hear about, well, active inference could be applied to supply chain here and to this kind of thing here, and then having that to a street with a domain expert and maybe just their verbal account of the situation or the systems modeling they've already done or the kinds of ontologies, narratives, formal documents, tools, et cetera, that they already have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 718.568,
    "end": 723.452,
    "text": " may even be closer than many people suspect to having a functioning active inference model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 724.013,
    "end": 725.514,
    "text": "So it's a great time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 725.634,
    "end": 739.826,
    "text": "We'll touch on some of these points coming up, but again, if you'd like to be a presenter or if you'd like to facilitate some other kind of interactive session, if you'd like to be a sponsor, we can share information on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.327,
    "end": 743.93,
    "text": "Just go to the symposium page and that's where information will be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 746.692,
    "end": 748.474,
    "text": "A quick note here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 748.825,
    "end": 778.393,
    "text": " on important developments of the format of symposium itself i believe it's about that hackathon sessions and we will put additional tensions and efforts to organize this part of symposium in best possible way and it's kind of development of the format and really possibly in a few years the most activities of such symposiums will be on hackathon side",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.116,
    "end": 803.2,
    "text": " we'll see yeah thanks i i agree live chats are awesome and the live interaction of live streams is awesome also a lot of trainings can be done like model streams ahead of time and having symposia and convenings where people can just rapidly break through many many layers of uncertainty it can go from like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 803.18,
    "end": 821.307,
    "text": " listening to hours of podcasts or reading papers and thinking okay it could apply here but i don't really see how or i don't even see that i don't see how and then all of a sudden when you're on the team and talk to people and the code is out and that the sketching is happening it can just happen so fast and it's just really exciting learning experience",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 824.392,
    "end": 825.894,
    "text": " Okay, about research fellows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.954,
    "end": 831.901,
    "text": "So our three current fellows, Anna Jean-Francois and John Boyk are still active.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 832.082,
    "end": 834.665,
    "text": "They've been research fellows for a couple of months now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 835.566,
    "end": 840.813,
    "text": "And our next round of review is going to be in about two weeks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 841.453,
    "end": 848.222,
    "text": "So if you're considering putting in a research fellow application and you want to be considered for this second cohort,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.35,
    "end": 851.334,
    "text": " get in contact whenever you can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 851.374,
    "end": 858.326,
    "text": "And we'll continue with the rolling deadlines around research fellows and other kinds of fellows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 858.867,
    "end": 864.397,
    "text": "So it's been awesome to see each of the three continue their projects in very unique ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.417,
    "end": 868.945,
    "text": "And there will be a lot more to come with more fellows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.743,
    "end": 889.414,
    "text": " on organizational partnerships we've continued and have a have a great collaboration with first principles first with john clippinger and the fp1 project and several other discussions with organizational partners",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 889.563,
    "end": 894.23,
    "text": " These are with financial or within kind donations and support.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 894.851,
    "end": 917.382,
    "text": "And there's a lot of opportunities for different organizations that want to contribute to the open source ecosystem, want to learn and apply Actim faster, want to give strategic input to the Institute and access the community, all these different sorts of things that partners can help synergize and collaborate on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 917.403,
    "end": 919.165,
    "text": "Any comments on anything?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.537,
    "end": 922.997,
    "text": " No.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 924.072,
    "end": 925.914,
    "text": " Let me add something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 926.155,
    "end": 943.037,
    "text": "Two important direction of research fellows and partnership with organization are strategic for this year and we see results, see working of people on our aligned goals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 943.238,
    "end": 946.081,
    "text": "That's great and we will develop this direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 947.063,
    "end": 952.109,
    "text": "For research fellows it's two weeks to make decisions and put your application.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.41,
    "end": 954.012,
    "text": "If you see some",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 953.992,
    "end": 979.24,
    "text": " perspectives and we as institution will support you in this way and for partnerships with organization yes we will continue this way and always happy to see new like players in ecosystem and if you as organizational entities see some affordances which can be realized together let's discuss",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 981.194,
    "end": 994.714,
    "text": " Cool, yeah, a lot of things happening with us writing letters of support or being possible, contractors on grants, ranging to us applying for grants and including other organizations, so doing together what we can't do alone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 996.922,
    "end": 999.204,
    "text": " Our philanthropy continues.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 999.945,
    "end": 1009.994,
    "text": "Donate.activeinference.institute now has some nice drop-down options for supporting a certain project with a restricted donation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.094,
    "end": 1013.618,
    "text": "So this means that the funds for the donation go to the project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1015.58,
    "end": 1018.202,
    "text": "We're a 501c3 organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1018.322,
    "end": 1020.284,
    "text": "That may matter for some donors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.145,
    "end": 1026.49,
    "text": "And while we are applying to grants, some of which we'll describe later on,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.571,
    "end": 1036.342,
    "text": " We're currently an all volunteer operation and donations are and will be vital to ensure that there's a sustainability to what we're working on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1036.362,
    "end": 1039.846,
    "text": "So onward we go with philanthropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1040.447,
    "end": 1041.108,
    "text": "Any comments here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1050.378,
    "end": 1054.023,
    "text": "And I'm bringing in a live super chat from Upcycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1055.064,
    "end": 1056.105,
    "text": "Thank you, Upcycle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1060.945,
    "end": 1085.451,
    "text": " our philanthropy program at work nice um some updates on our uh social media the project prepare and measure form continues to operate like with the fellows the partners several other aspects that we've been discussing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.152,
    "end": 1090.601,
    "text": " I'm really happy we have these quarterly roundtables and the newsletters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1090.822,
    "end": 1095.113,
    "text": "It's easy to forget how quickly these structural changes come into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1095.294,
    "end": 1102.292,
    "text": "It was only this year when a lot of those structures and affordances came into being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1102.272,
    "end": 1118.796,
    "text": " We continue to see many people propose projects, some of which we'll review, and having this always open measure opportunity for people to share ranging from what's happening in their internship to their research lab to their company.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.457,
    "end": 1125.245,
    "text": "And these channels will just continue to be important as the ecosystem grows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1125.305,
    "end": 1131.013,
    "text": "And just like any other ecosystem, no organism is in all places at once.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1130.993,
    "end": 1148.896,
    "text": " So having a culture of sharing what is intended to be shared and having the ways for people to select and using synthetic methods to expand and distill as needed, there's some extremely exciting possibilities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.22,
    "end": 1153.862,
    "text": "Just on our... Alex, go for it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1155.445,
    "end": 1175.04,
    "text": " Yeah, possibly get back to this slide and I just take a place of some newcomer which is first time on our stream of such discussion and seeing this picture and this structure and connections to some specific organizational process what we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.02,
    "end": 1193.383,
    "text": " it could be not clear but for me it's a great picture what we really have pieces changes in our organizational process which is based on our first principle materials what we have in institute",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1193.363,
    "end": 1223.286,
    "text": " and having understanding and seeing now how it's starting to work i just want to highlight for people who possibly not understand from the beginning what is presented here it's really first principles in works of organization and possibly for your organization it's could be interested to take a course of physics as information processing and take some principles into your work as we done it for hours",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1227.485,
    "end": 1256.8,
    "text": " thanks here we have kind of a formal organizational summary with the bodies and the rhythms with the scientific advisory board the officers and the board of directors we had a board of directors meeting last week that was very insightful and in the coming weeks and months we'll be preparing and already the applications and the information on these positions exists on our website",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1256.932,
    "end": 1261.118,
    "text": " And we'll be adding more information and clarifying like, what are these volunteer positions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1261.739,
    "end": 1272.556,
    "text": "What would be the kinds of pragmatic and epistemic value that somebody might glean or gain or contribute from, from working and contributing this way?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1272.576,
    "end": 1272.817,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1274.619,
    "end": 1277.644,
    "text": "Those are the Institute type activities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1278.005,
    "end": 1282.872,
    "text": "Now we'll have some shorter project oriented sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.59,
    "end": 1287.894,
    "text": " So here are the EduActive projects at the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.914,
    "end": 1290.316,
    "text": "We have the ontology project.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1290.356,
    "end": 1302.33,
    "text": "This has been continuing, had many fun conversations in the Discord, people learning using AI, using natural methods to explore the ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1304.072,
    "end": 1314.343,
    "text": "Audiovisual production will come to, textbook group will come to, and Active Inference Journal also continuing to explore what's possible with developing and augmenting transcripts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1315.066,
    "end": 1320.595,
    "text": " In the textbook group, we continue cohort six and cohort seven continue on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1321.376,
    "end": 1339.605,
    "text": "And as we're now about two and a half years out from the publication of the textbook and closing in on six and a half cohorts completed, we're thinking a lot about how does this role that the textbook served",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1339.906,
    "end": 1364.108,
    "text": " 2022 and 2023 how is that updating in 24 as people who have been through one or three cohorts start to move on to other research projects what kinds of entry points exist and how can we continue to to use the templates and the approaches like using generative AI to help unpack math as well as the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1364.088,
    "end": 1367.453,
    "text": " the math learning group that Octopus is facilitating?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1368.114,
    "end": 1376.648,
    "text": "How can we use the ontology to help connect natural language readings of equations with different kinds of situations and studies?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1377.509,
    "end": 1384.68,
    "text": "How can we curate questions and discourse that people ask and help promote collaboration all these different ways?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.321,
    "end": 1387.024,
    "text": "So the group's still active.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1387.004,
    "end": 1399.123,
    "text": " And also, it'll be continuing to develop as we change our offerings depending on what people want to do and what facilitators want to contribute what.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.803,
    "end": 1430.14,
    "text": " in production we've had 26 videos over the last few months for a total of 539 videos overall here were the streams from the last few months there were one two three four five math art streams with shanna dobson and friends covering a a wide variety very exciting and all over the place and math arty",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.12,
    "end": 1441.137,
    "text": " In the ActiveInference streams, I've been working in the ActiveInference code repo, developing open source code for a variety of different settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1443.561,
    "end": 1449.951,
    "text": "We've had 11 guest streams on topics like reinsurance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1450.251,
    "end": 1451.093,
    "text": "That was yesterday.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1451.133,
    "end": 1454.558,
    "text": "Thrilling, thrilling reinsurance live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1455.922,
    "end": 1476.698,
    "text": " limits of the brain and predicting events fellow John Boyk with a cognitive narrative ecosystem guest stream 86 on the biological neurons and how biomimetic and and heterogeneous computing methods contrast with reinforcement learning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1477.994,
    "end": 1491.025,
    "text": " Coming more from a computational side, David Blumen, and also talking about reinforcement learning and active inference, Robert Warden with a pair of live streams on the projective wave theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1491.595,
    "end": 1513.401,
    "text": " raf and charles talking about different kinds of cognition and in natural and lom type systems fellow anna talking about her ongoing book project and josh bongard talking about embodied intelligence really cool guest streams and then several other streams",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1517.836,
    "end": 1533.246,
    "text": " Ran Wei, in a model stream, giving one of the most distilled and powerful unpackings of how active inference is similar and different than reinforcement learning and meta-RL methods.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1533.766,
    "end": 1541.544,
    "text": " discussion of quantum inference and about quantum measurements and quantum information studies and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1542.807,
    "end": 1552.77,
    "text": "Toby Sinclair Smyth, from the category theory side, discussing structured active inference, which is a very promising way that active inference methods are starting to be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1552.75,
    "end": 1556.175,
    "text": " apply to APIs and other kinds of computational settings.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1557.817,
    "end": 1581.272,
    "text": "The closing season finale slash reflection with Darius from Insights, turning the tables, asking him about how the Insights series went, and those 23 prior episodes were some of the coolest and most viewed conversational",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1581.252,
    "end": 1599.548,
    "text": " uh onboarding points for a lot of different thinkers and ideas into art streams on on different work at the intersection of predictive processing actin aesthetics art a lot of fun discussion so if anyone's interested in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1600.642,
    "end": 1613.42,
    "text": " the planning part in inviting guests or curating the suggestions from others and just helping follow through on invites and just getting things planned.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1614.021,
    "end": 1624.877,
    "text": "If you're interested in audio visual production, manual craft production, or using synthetic methods to produce in ways that people have not been able to produce before,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.908,
    "end": 1631.278,
    "text": " If you wanna help on the journal side, there's a lot of ways to help improve this whole process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1635.324,
    "end": 1638.73,
    "text": "Okay, onto re-inference updates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.793,
    "end": 1643.277,
    "text": "Here are the re-inference projects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1644.198,
    "end": 1651.59,
    "text": "These are projects where people can get hands-on with coding and with knowledge engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.034,
    "end": 1661.263,
    "text": " It's been a productive month for the rxinfer.jl learning group at the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1661.423,
    "end": 1669.513,
    "text": "This short URL will pop you into our coda where there's always developments and things being posted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1669.653,
    "end": 1674.639,
    "text": "But this month we submitted two grants with some partially overlapping teams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.28,
    "end": 1676.802,
    "text": "That was exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1677.642,
    "end": 1684.572,
    "text": " Earlier in September, we submitted a Farmworks Decentralized AI Agents for Personalized Solutions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1685.494,
    "end": 1694.487,
    "text": "That was a Future of Life Institute grant program about centralized AI and power asymmetries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1694.467,
    "end": 1698.737,
    "text": " And also pretty fun to then put up the grant as a preprint.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1699.359,
    "end": 1701.945,
    "text": "So whether we get it or not, we're co-authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.847,
    "end": 1711.848,
    "text": "We go on with the show and we can communicate that around without even knowing whether we've gotten it or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1711.969,
    "end": 1712.61,
    "text": "And we don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1713.164,
    "end": 1720.658,
    "text": " And then just a few days ago, we submitted a multi-agent AI safety grants to a foresight Institute program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1720.758,
    "end": 1730.076,
    "text": "And this one that the tentative meme project name was village validating inference for large scale agent governance ecosystems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1730.36,
    "end": 1731.682,
    "text": " So we'll see where this goes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.364,
    "end": 1740.779,
    "text": "And even apart from the grant applications, there have been just many developments with RxInfer and the application ecosystem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1740.819,
    "end": 1743.664,
    "text": "So it's quite exciting to see where it's all going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1745.828,
    "end": 1752.199,
    "text": "And then here's just the other projects that are in the ACT-AMP ecosystem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1756.027,
    "end": 1782.135,
    "text": " really cool that people have proposed all these different things and and so much also happens outside of these tables so big thanks to all those who have put up their projects so that others can join in and learn more about them and uh put in the measurements and that's how we'll share more specific detail any more comments blue or alex",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1785.642,
    "end": 1786.243,
    "text": " No, I'm good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1786.543,
    "end": 1786.844,
    "text": "Thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1790.429,
    "end": 1793.634,
    "text": "Okay, for live chatters, feel free to write any questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1794.536,
    "end": 1797.44,
    "text": "Otherwise, here's just one final slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1799.984,
    "end": 1801.627,
    "text": "Here we are looking in the mirror.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1802.668,
    "end": 1803.53,
    "text": "Life's a blur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.772,
    "end": 1807.316,
    "text": "Even if we could record it all, what would it really say?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1807.356,
    "end": 1808.798,
    "text": "And so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1810.955,
    "end": 1817.101,
    "text": " all these different views and angles that we take day to day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1817.161,
    "end": 1821.065,
    "text": "How is active inference helping us navigate this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1822.086,
    "end": 1837.401,
    "text": "How can surprise, pragmatic and epistemic value, how can all of these things that we're talking about be their own intrinsic, meaningful contributions and also help us in the times between?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1838.579,
    "end": 1867.641,
    "text": " is a view from the topos institute blue and i went to a small meeting there just a few weeks ago learning about category theory but that's what it looks like from the nth floor of a building in berkeley and the walk continues through whatever we suppose it to be um i'll wait a minute just if there's any live chat questions or anything people that want to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.752,
    "end": 1874.104,
    "text": " ask otherwise um what would be your closing thoughts blue and alex",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1880.75,
    "end": 1889.109,
    "text": " Possibly I will get back to education and that experience of textbook group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1890.532,
    "end": 1900.193,
    "text": "And yes, right questions you raised about how we should use that experience from that learnings on specific textbook.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1900.173,
    "end": 1922.67,
    "text": " but also i believe that during that way we set up and tested and evolved the methodic process itself and currently we for our needs if you'll see some new textbook or course we can organize the group learning in the same way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1922.65,
    "end": 1941.52,
    "text": " And possibly from some moment it also could be affordance from some other projects or institutes or someone who are searching, looking for new approaches on such collaborative ways of learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1941.5,
    "end": 1954.532,
    "text": " And we can share possibly templates, encoder, how to enable, or provide some other support for such activities for any other valuable knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1957.816,
    "end": 1958.096,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1959.657,
    "end": 1960.979,
    "text": "At multiple scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.039,
    "end": 1967.625,
    "text": "I mean, if there's a time slot for something that you want to jump in and stick by, make the suggestion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.685,
    "end": 1969.887,
    "text": "If there's another textbook group,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1970.103,
    "end": 1992.567,
    "text": " with a similar structure another book or another another way it's all whatever volunteers step up to do so we have a lot of latitude don't let the structures in play give a blind spot to the degrees of freedom that still exist blue",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1995.449,
    "end": 2010.832,
    "text": " For me, I'm just excited, like, to see, you know, every time, like, we're rounding out the year and we're coming to, like, the close of our activities for 24 and, like, where will we be a year from now is always, like, I'm always surprised by how far we've come.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2010.872,
    "end": 2020.226,
    "text": "And not only the Institute, but overall, just what's possible and coming to the forefront with all the synthetic knowledge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2021.207,
    "end": 2022.389,
    "text": "And what does that mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2022.609,
    "end": 2025.253,
    "text": "And, like, will synthetic knowledge be...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2025.689,
    "end": 2050.6,
    "text": " as useful more useful will people like want real knowledge again someday like a human human generated like will we crave that will it become so pervasive or i don't know i'm just always curious to see um where where that's taking us because it seems like uh kind of the cat is out of the bag or the pandora's box has been opened and um the possibilities really seem",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2050.968,
    "end": 2051.629,
    "text": " seem endless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2051.669,
    "end": 2062.701,
    "text": "So I'm excited to see where we're at at this time in 25 and how much will have been done and how much will have changed and then the course that is still the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2069.688,
    "end": 2070.049,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2073.612,
    "end": 2073.933,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2075.094,
    "end": 2080.62,
    "text": "So stable links to check out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2081.123,
    "end": 2090.714,
    "text": " If you're watching in near-ish real time, join on in to the ecosystem project or come along for another versioning run.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2092.436,
    "end": 2093.898,
    "text": "Similarly for the symposium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2095.92,
    "end": 2096.16,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2097.402,
    "end": 2098.363,
    "text": "Thanks, Blue and Alex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2099.064,
    "end": 2100.365,
    "text": "Thank you, Upcycle, everyone else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.766,
    "end": 2101.707,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.727,
    "end": 2102.407,
    "text": "Bye.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2102.427,
    "end": 2104.43,
    "text": "Thanks, everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2104.45,
    "end": 2104.65,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  }
]