[
  {
    "start": 3.457,
    "end": 26.629,
    "text": " Hi everyone it's cohort three August 8th and we're in our first discussion on chapter 10. so before we look to the text or any of the specific questions um would anyone like to just give any comments or thoughts on 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.644,
    "end": 74.827,
    "text": " Daniel, I'm pretty.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 75.088,
    "end": 76.049,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 76.21,
    "end": 78.173,
    "text": "I'm not prepared for chapter 10.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 78.393,
    "end": 79.775,
    "text": "So it's better.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 80.957,
    "end": 83.722,
    "text": "I'll read later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 84.783,
    "end": 85.665,
    "text": "It's all good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 86.085,
    "end": 88.089,
    "text": "Sounds good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 88.169,
    "end": 88.529,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 88.85,
    "end": 89.19,
    "text": "Sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 89.571,
    "end": 90.673,
    "text": "Sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 91.093,
    "end": 92.235,
    "text": "No, sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 93.898,
    "end": 94.118,
    "text": "Bye-bye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 97.444,
    "end": 100.288,
    "text": "Well, chapter 10 has no",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 101.416,
    "end": 104.401,
    "text": " David Price- figures or equations it's it's a lot of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 105.603,
    "end": 109.81,
    "text": "David Price- synthesis and overview.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 111.533,
    "end": 118.986,
    "text": "David Price- Anyone want to give any comments or or we can like look over it and try to pull out some questions pull out some thoughts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 134.677,
    "end": 137.101,
    "text": " What do you think is the relevance of this quotation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 137.401,
    "end": 139.966,
    "text": "In general, we are least aware of what our minds do best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 148.94,
    "end": 149.421,
    "text": "Is that true?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 149.461,
    "end": 161.14,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 162.368,
    "end": 166.794,
    "text": " I think we should first know what he mean about awareness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 170.419,
    "end": 171.241,
    "text": "What is awareness?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 175.407,
    "end": 188.886,
    "text": "Because we just supposed to this world, but you know, we have so much different approach about awareness, about consciousness, about mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 188.906,
    "end": 190.468,
    "text": "Some philosopher",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 190.583,
    "end": 193.386,
    "text": " Reza Azard, They they don't accept this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 193.406,
    "end": 204.019,
    "text": "Reza Azard, Assumption they think this is a we should just work with neuron and bearing network neuron synapse and no.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 204.039,
    "end": 207.183,
    "text": "Reza Azard, Extra work because.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 207.243,
    "end": 213.31,
    "text": "Reza Azard, Nobody can exactly know what is awareness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 213.33,
    "end": 214.372,
    "text": "Reza Azard, We have different.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 214.712,
    "end": 218.076,
    "text": "Reza Azard, introduction about awareness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 226.882,
    "end": 228.424,
    "text": " Why would Minsky say this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 238.54,
    "end": 254.644,
    "text": "It reminds me of the discussion of the transparent and opaque mental processes, where transparent mental processes are like air, like you see through them, which is to say you can't see them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 254.81,
    "end": 279.467,
    "text": " opaque you can see them by virtue of them blocking the something of light so it's kind of like the fish in the water doesn't know about the water and so the processes that are transparent to us the things that are the most routine the most mundane we have this at least quote is saying we're going to have the least awareness of these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 283.582,
    "end": 289.27,
    "text": " I'm not fully sure because I believe there are certain things we are unaware of that our minds do well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 290.772,
    "end": 294.577,
    "text": "But also I believe there are things our minds do well that we are aware of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 295.819,
    "end": 302.788,
    "text": "So I don't know if the general claim can be said that we're least aware of what we do best.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 303.578,
    "end": 320.389,
    "text": " since I think there's things that we're aware of or not that we do well or not but it's kind of a side point but but it's a you know as with all these quotes they just start the chapter with kind of a fun provocative declaration",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 323.457,
    "end": 326.841,
    "text": " All right, well, Chapter 10 is a really interesting chapter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 326.901,
    "end": 336.954,
    "text": "They wrap up Active Inference's main theoretical points, that's Part 1, Chapters 1 through 5, and the practical implementations, Chapters 6 through 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 338.536,
    "end": 348.81,
    "text": "Then they connect the dots, abstract away from the specific Active Inference models discussed in previous chapters to focus on integrative aspects of the framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 348.83,
    "end": 349.11,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 353.258,
    "end": 361.091,
    "text": " This is another, another spicy piece, spicy and contentious.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 367.842,
    "end": 374.693,
    "text": "Does active inference provide a complete solution to the adaptive problems that sentient organisms have to solve?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 381.068,
    "end": 384.732,
    "text": " Is active inference a complete solution at all of anything?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 392.18,
    "end": 393.341,
    "text": "I mean, we can vote and decide.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 394.903,
    "end": 403.012,
    "text": "But what would be another way to say it or how would people?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 403.472,
    "end": 404.353,
    "text": "Yeah, Esmail, please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.115,
    "end": 410.4,
    "text": "Yeah, you ask amazing question about",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 411.055,
    "end": 416.642,
    "text": " This approach, I mean, an active inference can solve everything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 417.262,
    "end": 433.001,
    "text": "But if nobody knows about the future, but at least this optimistic approach is so better than we just suppose.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 433.982,
    "end": 440.269,
    "text": "Everything is like a mystery.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 442.088,
    "end": 454.939,
    "text": " With this assumption, we can order so much thing for research, and scientists and philosophers can research about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 455.539,
    "end": 471.353,
    "text": "But if we think everything is mystery, just we forbid people for researching, and in the end, we can't achieve anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 472.463,
    "end": 478.41,
    "text": " So my approach is optimistic, but not in the moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 479.552,
    "end": 484.238,
    "text": "This will be long procedure, and future is open.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 489.464,
    "end": 489.825,
    "text": "Great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 491.988,
    "end": 492.328,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 494.401,
    "end": 514.283,
    "text": " treating things as a mystery or somewhere on the mystery continuum there with some amount of uncertainty then it plus action so let's let's figure it out and then this is kind of like do we think that we're on the path to achieving a solution",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 516.153,
    "end": 519.838,
    "text": " to the adaptive problems that sentient organisms have to solve?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 520.92,
    "end": 522.882,
    "text": "Or is this going to be a fruitless path?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 522.902,
    "end": 528.63,
    "text": "I think through our actions, we're on the optimistic path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 530.252,
    "end": 534.398,
    "text": "But I think this is a really, I mean, it's a bold claim.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 535.98,
    "end": 541.688,
    "text": "And the narrow interpretation is, did the textbook provide a complete solution?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 543.507,
    "end": 544.468,
    "text": " but that's a little too narrow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 544.488,
    "end": 562.364,
    "text": "And I think the broader question, Esmail, that you point to is like, as a long-term field, will we have a scope of addressing adaptive problems that sentient organisms have to solve?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 563.225,
    "end": 571.692,
    "text": "I even think about it outside of sentient organisms, just to the adaptive problems that things have to solve.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.65,
    "end": 578.557,
    "text": " where some kinds of things are adaptive sentience organisms, but that's not all kinds of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 580.439,
    "end": 585.225,
    "text": "And then also, but that's big.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 585.505,
    "end": 592.614,
    "text": "However, the second part of the claim is a little bit clearer and I think more supported.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 593.635,
    "end": 600.463,
    "text": "Active inference therefore offers a unified perspective on problems like, or phenomena like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 601.186,
    "end": 609.114,
    "text": " perception, action selection, attention, and emotional regulation, which are usually treated in isolation in psychology and neuroscience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 610.055,
    "end": 623.227,
    "text": "So I think that is a super strong claim that can be pointed to when people say, well, what does it mean that it's a unifying theory of perception, cognition, and action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 623.347,
    "end": 628.172,
    "text": "Or what does it mean that it's a first principles approach?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 628.372,
    "end": 642.685,
    "text": " It's like, well, if you go to a neuroscience conference, you're going to see totally different ontology narratives, tools, documents, philosophies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 643.846,
    "end": 666.546,
    "text": " on even just like the visual system perception action selection attention the models that are developed for visual perception select action selection and attention those models may have no interoperability at all now that's not to say that they can't be part of an integrated fabric of of a pluralistic scientific accounts",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 667.538,
    "end": 673.986,
    "text": " So it's not like it doesn't matter if they're not unified, but this comes back to the needs and the scruffies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 675.028,
    "end": 679.994,
    "text": "Do we want coherence within and across systems of interest?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 681.276,
    "end": 686.482,
    "text": "Or everybody has kind of like a level where they tap out and just say, no, that's like too much integration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 687.083,
    "end": 697.056,
    "text": "But at least with these phenomena that they point to here, the book and the literature demonstrate that these different phenomena",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 697.492,
    "end": 721.575,
    "text": " can be considered in an integrated model whereas approaches that don't start from a first principles position in general do not have that ability then they're going to connect to some established theory",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 721.876,
    "end": 745.791,
    "text": " and finally extend into some broader topics okay wrapping up only 190 pages only only only 95 page flips away 95 little epistemic actions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 747.847,
    "end": 772.588,
    "text": " uh we're at the the end of the this little chapter of the journey the book offers a systematic account of theoretical underpinnings and practical implementations of active inference uh on these pages they summarize the chapters this is one reason why I think it may be helpful to have chapter 10 be read at the beginning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 773.969,
    "end": 800.584,
    "text": " because they're going to summarize like really clearly what each chapter does so chapter one that's an overview chapter two the low road that's the how Bayesian statistics and the generative modeling chapter three is the high road the Y self-organization and persistence far from equilibrium modeled through the Markov blanket",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 803.247,
    "end": 817.162,
    "text": " Chapter four gives formal details on active inference, focusing again on the generative model and this time exploring it a little bit more fully in the context of variational inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 820.325,
    "end": 832.258,
    "text": "Chapter five gives three connected case studies from mammalian neuroscience and talks about how these different neural systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 833.285,
    "end": 855.175,
    "text": " can be modeled with active inference and then how once you model them separately with active inference you can kind of stitch them together really nicely chapter six was the recipe for designing active inference models a little bit of a playbook or a guidebook that also brings up a lot of different questions and considerations about scientific modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 856.724,
    "end": 863.236,
    "text": " Chapter seven and eight were respectively about discrete and continuous time generative models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.798,
    "end": 871.29,
    "text": "Chapter nine was about active inference in the setting of model-based data analysis",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.047,
    "end": 880.697,
    "text": " giving a little bit of information about how you'd go about doing a data-based analysis, why you might do that and what that looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 881.518,
    "end": 892.07,
    "text": "And so in that way, it's kind of like chapter six about building the generative model, but chapter nine is gonna pull back another level and look at what do you do with data?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 896.876,
    "end": 898.518,
    "text": "10.3, connecting the dots.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 899.719,
    "end": 901.041,
    "text": "Great, done it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.118,
    "end": 917.019,
    "text": " So Dennett, decades ago, many decades ago, lamented that cognitive scientists devote too much effort to modeling isolated subsystems or even isolated phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 917.099,
    "end": 921.004,
    "text": "So not even just like, oh, the visual tract, but like...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 921.423,
    "end": 950.67,
    "text": " visual perception in this one setting whose boundaries are often arbitrary or even worse disciplinary he suggested to try instead modeling the whole iguana a complete cognitive creature perhaps a simple one and an environmental niche for it to cope with Esmail what do you think about that or what did the Dennett reference bring up for you yeah then it's uh always",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 951.106,
    "end": 961.682,
    "text": " I mean, he always speaking about the extra world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 963.685,
    "end": 978.107,
    "text": "He first asked why you imagine, for example, consciousness, after that you make for yourself problem, like philosophy zombie.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 978.127,
    "end": 979.83,
    "text": "I think all of you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 980.198,
    "end": 1006.864,
    "text": " what i mean from philosophy zombie but uh he asked first first you should you you should suggest we have something named consciousness after that we can speak uh philosophy zombie doesn't have uh consciousness and everything like mind like awareness i told you the first of meeting",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1008.076,
    "end": 1017.329,
    "text": " And we should just research about a specific experimental equation about mind, about brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1017.489,
    "end": 1024.999,
    "text": "And even he denied the phenomenal and epiphenomenal concept.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1027.142,
    "end": 1031.248,
    "text": "I think his idea is so close to emergence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1032.983,
    "end": 1044.951,
    "text": " This thing you accounted like perception, sensation, and so on, all of them are kind of emergence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1045.893,
    "end": 1049.862,
    "text": "I mean, the difference,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1050.736,
    "end": 1053.079,
    "text": " Fereshteh Ganjavi- Compare with neuron and brain but.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1053.78,
    "end": 1076.828,
    "text": "Fereshteh Ganjavi- basis just brain and neuron and not extracting and something we affect on the world and work effect on us something like this and we don't need i'm angry with them and we don't need so much extra vote supposed and after that we will fall in the problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1082.782,
    "end": 1109.565,
    "text": " awesome yeah pretty cool how a lot of those topics like emergence and systems properties which come from the natural sciences then connect back to consciousness and awareness like like we discussed a little earlier um so benefits of active inference you know next time you're at a party and you know hanging out relaxing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1110.102,
    "end": 1116.792,
    "text": " One benefit of active inference is that it offers a first principle account of the ways in which organisms solve their adaptive problems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1117.633,
    "end": 1139.046,
    "text": "So even beyond the theoretical unity of diverse cognitive phenomena, like perception, attention, and so on, a benefit of active inference is that it gives a normative approach, so not just an is, but actually an ought, and says this is how it should work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1139.482,
    "end": 1140.123,
    "text": " be modeled.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1141.444,
    "end": 1152.655,
    "text": "I think it's easy to be startled by a normative approach because it can feel like impositional or constraining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1155.458,
    "end": 1163.987,
    "text": "But I think that's part of our interesting journey is to understand what this normativity is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1164.592,
    "end": 1170.397,
    "text": " And what exactly is being, what ought to be what way?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1172.479,
    "end": 1181.727,
    "text": "And I'm sure there's many ways to say it, but there's sort of some, there's some narrow oughts and some broader oughts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1181.747,
    "end": 1192.877,
    "text": "A narrow ought would be like for solving a statistical problem with variational inference, variational free energy is the best that you're going to do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1194.967,
    "end": 1216.671,
    "text": " so that's kind of that's like saying you know if you're doing a linear regression you ought to use the L2 sum of squares norm um but but there's also kind of this broader potentially less formalized normative stance which is that one ought to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.478,
    "end": 1243.536,
    "text": " extend from that narrow ought about variational free energy as the imperative for statistical modeling and that you then ought to model specific cognitive processes perception action attention and emotion as well as their mechanistic uh manifestations in a unified way",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1245.473,
    "end": 1248.077,
    "text": " Now, someone else could say, well, I have a different normativity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1249.038,
    "end": 1257.069,
    "text": "I think that specific cognitive processes should be modeled in different and incommensurate ways.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1259.433,
    "end": 1260.975,
    "text": "I guess that could be someone's normativity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1261.095,
    "end": 1264.26,
    "text": "Or somebody could say, I've never really thought about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1264.4,
    "end": 1268.005,
    "text": "I don't think I have a strong prior knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1268.643,
    "end": 1297.941,
    "text": " let alone a normative stance on whether things like should or shouldn't be integrated but but again it's just an interesting um topic and and how many times does normative come up in the book you know 30 times that's um that's more times than you'll see normative outside of like a deontological ethics book and here's what they explain right in the very beginning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1299.001,
    "end": 1301.824,
    "text": " Normative means there's some standard against which behavior can be scored.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1301.844,
    "end": 1303.166,
    "text": "This is that narrower sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1304.467,
    "end": 1310.955,
    "text": "Free energy, they're saying, ought to be the right quantity for perceptual modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.176,
    "end": 1320.345,
    "text": "But then there's this secondary ought, which is a little bit like, and so you ought to do things in a unified way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1321.867,
    "end": 1324.35,
    "text": "But that's a little bit less formal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.798,
    "end": 1327.701,
    "text": " But here's that normative level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1328.221,
    "end": 1331.226,
    "text": "It's central assumptions all processes minimize variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.686,
    "end": 1333.048,
    "text": "So again, there's kind of this narrower piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1334.009,
    "end": 1337.214,
    "text": "For a given statistical problem, VFE is the best estimator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1338.155,
    "end": 1345.565,
    "text": "And then there's this like slightly broader normativity, which is, and you ought to use VFE for everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1348.069,
    "end": 1353.877,
    "text": "To the extent that they say that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1353.917,
    "end": 1354.017,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1355.768,
    "end": 1377.523,
    "text": " the problems that things face that organisms or or um other things face can be described as inactive they're they're related to action in the world so that's very compatible with embodied inactive extended and cultured Etc affective neuroscience and pragmatism",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.853,
    "end": 1386.282,
    "text": " And also the preferences are defined explicitly over observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1387.183,
    "end": 1389.846,
    "text": "This connects to perceptual control theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1390.968,
    "end": 1405.165,
    "text": "And also just not historically, by tethering our modeling to sensory data, that's kind of like where the rubber hits the road with not overfitting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1406.647,
    "end": 1426.326,
    "text": " like there's more that could be said there but by making sure that variational free energy is a function of our beliefs and the real incoming data that's a um a very strong check on not overfitting not like proposing some auxiliary variable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1426.795,
    "end": 1436.707,
    "text": " and then being super precise about the auxiliary variable, but then the actual empirical data, we may be not modeling well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1440.411,
    "end": 1443.655,
    "text": "Again, more lists of cognitive phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1445.016,
    "end": 1448.14,
    "text": "Pretty similar here, the insert looks like memory and intention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1450.143,
    "end": 1453.967,
    "text": "So slowly mutating and expanding the list of cognitive phenomena.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1456.141,
    "end": 1457.583,
    "text": " What can organisms do?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1458.264,
    "end": 1468.1,
    "text": "They can change their belief, perception, learning, attention, internal states, or they can change the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1469.622,
    "end": 1469.882,
    "text": "Action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1470.864,
    "end": 1472.246,
    "text": "Change your mind, change the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.428,
    "end": 1477.073,
    "text": "Two ways to produce free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1478.536,
    "end": 1484.545,
    "text": "The third piece of the organism is the sensory data, but we keep our thumb off the scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1485.25,
    "end": 1490.757,
    "text": " So the only two things that the organism can do is change its mind and change the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1491.438,
    "end": 1499.968,
    "text": "Changing the world then changes the external states, and that has indirect effect on sensory data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1505.175,
    "end": 1506.336,
    "text": "They talk about memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1508.819,
    "end": 1510.161,
    "text": "They talk about planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.01,
    "end": 1519.216,
    "text": " planning and memory can be understood as two sides of the same timeline.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.379,
    "end": 1541.7,
    "text": "They have different, in our arrow of time going forward world, of course, memory is different than planning because memory doesn't have the same causal impact on our action selection, but yet our memories can influence what we do.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1542.423,
    "end": 1566.912,
    "text": " so it's not that they're without causal impact but in both cases whether it's reaching into the past with memory or reaching into the future with planning we can consider that a deep temporal model and deep temporal models so so that that's how you synthesize memory with planning and situational awareness in the moment deep temporal models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.887,
    "end": 1590.705,
    "text": " now we're going to bring in another level of the synthesis which is well what is that deep temporal model about maybe that deep temporal model says it has something to do with interoception and emotion so just there in a few sentences that is a synthesis of past present and future",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.462,
    "end": 1619.899,
    "text": " sensory exteroceptive sensory interoceptive and affective so that's that's what they mean by what's enabled and these kinds of relationships might be pointed to in another field of neuroscience or in another field but if it came from neuroscience it's unlikely to transfer to spaceships and computers and all these other systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1621.786,
    "end": 1631.42,
    "text": " And whether it did or didn't transfer, it would be kind of descriptive and elusive, but it wouldn't have a formal basis like we know that active inference does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1634.645,
    "end": 1636.928,
    "text": "Again, they're just hammering the point home.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1638.27,
    "end": 1644.88,
    "text": "We don't start by defining cognitive functions and try to puzzle piece them together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1644.92,
    "end": 1650.628,
    "text": "We start by what they characterize as the complete solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.486,
    "end": 1676.938,
    "text": " or maybe we could modify the adjective and the noun, like a comprehensive approach or a unified account, but we provide a complete solution to the problems that organisms have to solve and then analyze those dynamics or fine tune those dynamics to develop properties that remind us of cognitive functions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1677.919,
    "end": 1680.582,
    "text": "So like what this reminds me of is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1684.105,
    "end": 1686.167,
    "text": " sequential dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1688.75,
    "end": 1691.033,
    "text": "So this came up multiple times.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1693.155,
    "end": 1697.46,
    "text": "So sequential dynamics have been modeled with the Locke-Volterra model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1699.042,
    "end": 1701.344,
    "text": "It's just a property of certain dynamical systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1701.424,
    "end": 1705.549,
    "text": "It's not an a priori atomic cognitive function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1706.67,
    "end": 1712.577,
    "text": "But then that becomes deployed in a cognitive behavioral modeling setting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1713.08,
    "end": 1715.763,
    "text": " to sequential actions like writing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1717.024,
    "end": 1736.747,
    "text": "So writing isn't some core canonical function, but properties from dynamical systems we can connect to their cognitive concordances.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.429,
    "end": 1740.471,
    "text": "And all of these are maps, not territories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1741.244,
    "end": 1767.842,
    "text": " so you know maybe there is some module in some system but but that's not necessarily even the best way to go about modeling it this connects back to the whole iguana as well as to for example J.F cloutier's work with robotics which mechanisms permit a living organism to perceive the world remember it and plan",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1769.678,
    "end": 1796.31,
    "text": " so once you really think about what something needs to do and be to persist amidst uncertainty the whole iguana then even if you have a very coarse grained picture of the whole iguana like it's not Adam level here you know it moves um out of the sun when it's too hot into the sun was too too cold that is getting closer",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1796.999,
    "end": 1804.808,
    "text": " to an understanding of the mechanisms that permit it to live rather than infinite molecular description.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1805.629,
    "end": 1813.137,
    "text": "Those certainly are mechanisms, but they're not helping us understand from a cognitive perspective what's happening.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1823.709,
    "end": 1826.112,
    "text": "Okay, with the normative perspective,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.425,
    "end": 1852.352,
    "text": " we can re-approach analogies and trade-offs that have been identified in in different systems so exploration and exploitation this paper um is it's actually a really nice one hills at all 2015 i believe has some representations of explore and exploit in body and in mind",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1853.024,
    "end": 1874.425,
    "text": " so like come up with 10 words you know you go red orange yellow green blue purple like that's kind of like exploiting colors or you can have like a divergent thinking and similarly foraging um you could be exploiting one resource or um exploring across resources",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1879.703,
    "end": 1889.133,
    "text": " understanding that in the context of active inference, which we explored a little bit in the epistemic rat in the maze.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1889.153,
    "end": 1893.358,
    "text": "But it helps us rethink that explore exploit and how to model and approach it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1896.401,
    "end": 1904.85,
    "text": "So beyond the theoretical unity, we also get a bridge, a principled means of understanding corresponding neural computations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1906.838,
    "end": 1911.367,
    "text": " It offers a process theory that connects cognitive processing to expected neuronal dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1912.389,
    "end": 1924.915,
    "text": "So you'll notice in the SPM package that a lot of the simulations, just as part of the default outputs, they include like dopaminergic signaling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1925.57,
    "end": 1932.777,
    "text": " And so that doesn't, you know, dopamine does multiple things, even in the mammalian brain, does multiple things in different organisms' brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1933.538,
    "end": 1938.403,
    "text": "So it's not saying that's the one and only trace of dopamine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1939.604,
    "end": 1952.758,
    "text": "However, we can connect molecular mechanisms to statistical properties like surprise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.422,
    "end": 1980.67,
    "text": " okay now they're going to explore implications of actin for psychological functions as if we were sketching a psychology textbook so it's kind of like within the body of this textbook there is the germ of another textbook and they're going to highlight similarities and differences",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.342,
    "end": 2005.054,
    "text": " another reason why it may be relevant to read chapter 10 early 10 4 predictive brains predictive minds predictive processing we've talked about this a fair amount but rather than a world view in which sensory data come in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2005.22,
    "end": 2015.496,
    "text": " and are processed and then make their way to their final internal representation and then are used to engage action, a sort of feed-forward model of perception and action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2015.556,
    "end": 2033.303,
    "text": "In active inference inheriting from predictive processing, we have an ongoing generative model that is generating predictions, expectations, anticipations about sensory data and about action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2033.958,
    "end": 2042.488,
    "text": " And then incoming sensory data are able to be juxtaposed, as they say, to validate their hypotheses, predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2043.949,
    "end": 2047.393,
    "text": "And there's some subtlety with what's predictive coding, what's predictive processing, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2048.334,
    "end": 2053.861,
    "text": "And then at a slower timescale, you have the model updating essentially its weights through learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2056.944,
    "end": 2062.21,
    "text": "That imperative is self-evidencing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2063.287,
    "end": 2067.575,
    "text": " The best generative model is the one that's least surprised by incoming sensory data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2069.137,
    "end": 2072.083,
    "text": "That's the maximum model evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2072.103,
    "end": 2085.727,
    "text": "And so that is how this epistemic and pragmatic dual imperative is unified through action and active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2085.747,
    "end": 2086.729,
    "text": "Predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.843,
    "end": 2095.989,
    "text": " They write, the term predictive processing is used in a broader and less constrained sense compared to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2097.211,
    "end": 2111.809,
    "text": "So again, probably a lot of things you could say, like active inference is predictive processing plus action, or active inference is predictive processing with action under the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2113.971,
    "end": 2119.618,
    "text": "But they're more alike than not, and predictive processing is the gateway drug.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2121.235,
    "end": 2129.306,
    "text": " I mean, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.326,
    "end": 2131.729,
    "text": "Lots more debates and topics on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2134.192,
    "end": 2134.733,
    "text": "Perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2139.559,
    "end": 2142.964,
    "text": "Our perception is our generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2143.905,
    "end": 2147.931,
    "text": "Of course, we want to be careful with the map and the territory, but I always return to vision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2148.852,
    "end": 2151.175,
    "text": "We don't pay attention to our eye saccade.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2151.442,
    "end": 2154.345,
    "text": " we don't notice our blind spot, literally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2154.845,
    "end": 2155.325,
    "text": "We fill it in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2155.386,
    "end": 2165.034,
    "text": "And we have high resolution color vision all around the eye, even though the retina doesn't support that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2166.195,
    "end": 2180.588,
    "text": "So for me, saccades, blind spot, and peripheral color vision give absolutely tangible evidence that our visual perception is generated and fine-tuned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2181.412,
    "end": 2201.243,
    "text": " not received and likewise for other sensory modalities that concept of perception as subconscious or subliminal inference is ancient Helmholtz and before",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2207.568,
    "end": 2218.088,
    "text": " John Kane- Bayesian brain again another very closely allied topic with active inference after all we're talking about brains, sometimes and we're talking about um.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2218.108,
    "end": 2224.62,
    "text": "John Kane- Bayesian statistics, so how is active inference related to Bayesian brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2224.64,
    "end": 2228.547,
    "text": "John Kane- Well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2229.877,
    "end": 2239.187,
    "text": " Benji Carlson- Bayesian brain refers to a family of approaches that are not necessarily integrated and make different empirical predictions it's kind of a broad family it's not like one specific model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2239.247,
    "end": 2251.421,
    "text": "Benji Carlson- Because it could also refer to a little bit more of a realist flavor the brain does Bayesian computation or a little bit more of an instrumentalist flavor we use Bayesian statistics to model, the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2252.262,
    "end": 2259.85,
    "text": "Benji Carlson- But in either and and also it can apply at different levels of explanation, but broadly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2259.998,
    "end": 2264.223,
    "text": " active inference is a Bayesian brain hypothesis, but it's not just about brains.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.003,
    "end": 2267.006,
    "text": "And it's a process theory, not a hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2267.606,
    "end": 2268.908,
    "text": "But yes, it's Bayesian.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2269.628,
    "end": 2270.79,
    "text": "It could be about the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2271.591,
    "end": 2280.861,
    "text": "But if you do Bayesian brain plus action under the FEP, I believe you also compose active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2287.408,
    "end": 2289.55,
    "text": "But active inference is more integrated",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2290.154,
    "end": 2299.448,
    "text": " It's more normative and it is better described as a process theory that's falsifiable, but that is very closely aligned with the hypothesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2302.673,
    "end": 2316.955,
    "text": "They returned to predictive coding, which was discovered as a video compression algorithm and only brought into the neurosciences most empirically in the late 90s.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2318.622,
    "end": 2327.135,
    "text": " So it's only been 24 years since some of these things have even come onto the scene.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2335.027,
    "end": 2335.367,
    "text": "Action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2340.835,
    "end": 2344.06,
    "text": "In active inference, action processing is analogous to perceptual processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2345.162,
    "end": 2347.245,
    "text": "It's all part of the generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2348.828,
    "end": 2359.759,
    "text": " In chapter five, we explored how top-down descending set points predictions can then induce action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2365.484,
    "end": 2368.207,
    "text": "That's the equilibrium point hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2373.011,
    "end": 2376.675,
    "text": "There's another discussion of sensory attenuation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2377.246,
    "end": 2380.591,
    "text": " There was a box on that earlier in the book.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.611,
    "end": 2383.395,
    "text": "It's kind of like the opposite of attention is attenuation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2384.216,
    "end": 2387.941,
    "text": "Turning it up is like more attention, turning it down is like attenuating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2389.023,
    "end": 2404.705,
    "text": "And there was discussion around how attenuation of our, so attenuating our attention to sensory input creates like, it opens up a space of the possible",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2405.562,
    "end": 2433.375,
    "text": " where then we can undertake an action selection and then lock in that precision and that's exactly what happens with an eye cicade that's why we don't perceive the eye cicade high attention fixed gaze and then it's like we push on the clutch or pull off the gas whether you drive automatic or manual um move the eye it's not noticed it's not attended to but of course it's still getting photons",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2434.216,
    "end": 2438.922,
    "text": " And then once it's fixed again, we redeploy the attention.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2439.803,
    "end": 2446.311,
    "text": "And so that's why our phenomenology of vision is basically fixed, fixed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2448.634,
    "end": 2452.459,
    "text": "And maybe some pathologies, maybe there's nausea.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2453.56,
    "end": 2463.092,
    "text": "If there's a failure of that kind of attenuation, it might be very unsettling in the isocate setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.207,
    "end": 2473.661,
    "text": " But in a bodily motor setting, this is where some people are challenged with beginning motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2474.923,
    "end": 2476.725,
    "text": "So they can't step off the gas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2477.867,
    "end": 2480.31,
    "text": "So then their sensory input's like, no, you're in a chair.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2480.33,
    "end": 2481.392,
    "text": "You should just stay here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2481.432,
    "end": 2488.101,
    "text": "Or inability to stop motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2489.532,
    "end": 2513.11,
    "text": " idea motor these are kind of broad um conceptual theories that active inference brings a lot of rigor to but they basically relate to mind and body actions are selected on the basis of their predicted consequences cybernetics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2514.338,
    "end": 2529.479,
    "text": " Tote test operate test exit we've also connected active to UDA observe orient decide act perceptual control theory, we also have requisite diversity and good regulator theorem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2531.081,
    "end": 2533.645,
    "text": "Basically, everything related to cybernetics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2536.208,
    "end": 2538.051,
    "text": "Active inference is going to be able to handle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2540.191,
    "end": 2567.937,
    "text": " with this specific note that the preferences are over perceptions which kind of grounds higher levels of the system optimal control Theory so the inbound perceptual and learning side of active inference the cybernetic entity that's like signal processing and sense making the outgoing dependency on the mark on blanket is connected to control Theory um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2569.672,
    "end": 2579.328,
    "text": " Here's some discussions about control theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2579.348,
    "end": 2587.401,
    "text": "Importantly, optimal motor control is kind of aligned with reward learning in that there's a cost or a value function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2587.421,
    "end": 2593.772,
    "text": "It uses these economic metaphors, cost, value, reward, utility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2594.815,
    "end": 2608.908,
    "text": " Whereas we use all the apparatus that we've described earlier, we don't need to invoke these economic metaphors or anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2608.928,
    "end": 2612.071,
    "text": "But we can account for utility in decision-making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2614.533,
    "end": 2617.976,
    "text": "Here's the economic theories of utility maximization and reinforcement learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2619.538,
    "end": 2623.101,
    "text": "We can account for those with pragmatic value.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2628.481,
    "end": 2629.543,
    "text": " dynamic programming.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2629.583,
    "end": 2634.209,
    "text": "There's really cool modeling work that's using dynamic programming in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2642.641,
    "end": 2658.083,
    "text": "When all people have is pragmatic value, utility, reward, then they have to propose these ad hoc strategies to get non-pragmatic behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2658.282,
    "end": 2668.403,
    "text": " or to escape local optima, like burn-in, novelty bonus, intrinsic reward, the list goes on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2669.926,
    "end": 2676.78,
    "text": "Active inference, we just specify it up front, expected free energy, epistemic plus pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2692.117,
    "end": 2700.186,
    "text": " rather than trying to find the most rewarding or the highest utility path, we try to find the most likely path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2701.207,
    "end": 2708.194,
    "text": "So instead of climbing to the mountain, top of the mountain, who knows if we're at the top of the mountain, we're taking the path of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2709.055,
    "end": 2713.74,
    "text": "And that's what connects all of these discussions to Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2716.543,
    "end": 2720.908,
    "text": "That's what makes it physics based among other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2721.04,
    "end": 2740.753,
    "text": " is that it's a variational principle of least action for cognitive systems so just like a baseball with certain starting conditions and so on has a certain parabola that's the path of least action the bayesian updating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2740.784,
    "end": 2748.973,
    "text": " with a given prior and attention and incoming data stream is gonna update a certain way on the path of least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2749.594,
    "end": 2768.074,
    "text": "Now that path of least action may also be described by the most rewarding trajectory or the highest utility trajectory or whatever, but it turns out that it's a lot more general and generic to describe it as taking a path of least action, which is something that physical systems do,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2769.033,
    "end": 2793.859,
    "text": " rather than this kind of like aspirational highest utility approach that's connected to decision making again there's no utility or cost function in active inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2795.51,
    "end": 2805.906,
    "text": " we select action plans based upon their probability of happening, not based upon their probability of providing a reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2806.768,
    "end": 2811.875,
    "text": "And there's parameters like the shaky hand parameter or the temperature on decision-making.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2811.916,
    "end": 2820.589,
    "text": "If you turn the temperature to absolute zero, then you're gonna select the action that you think is better, even if it's only a little bit better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2820.907,
    "end": 2832.264,
    "text": " Whereas if you have the shaky hand parameter, very high, high temperature decision-making, then you blur differences in the expected free energy of policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2832.304,
    "end": 2840.677,
    "text": "And you basically select the policies at reinforcement learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2844.863,
    "end": 2846.526,
    "text": "Policy is used differently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2850.218,
    "end": 2868.737,
    "text": " model-based and model-free RL and policy gradient methods which are similar procedurally in certain ways to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2871.16,
    "end": 2874.083,
    "text": "However, the objective function is different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2875.075,
    "end": 2879.24,
    "text": " It's a reward function that's being reinforced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2879.34,
    "end": 2887.809,
    "text": "It's not a generative model, surprise-bounding free energy explicitly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2889.711,
    "end": 2891.513,
    "text": "And there are some differences more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2895.958,
    "end": 2896.359,
    "text": "Planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2902.946,
    "end": 2904.508,
    "text": "Behavior-bounded rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2910.58,
    "end": 2913.624,
    "text": " This kind of connects to type one, type two thinking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.27,
    "end": 2918.592,
    "text": "Deliberative, dual theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.755,
    "end": 2921.756,
    "text": "Rational, Kahneman.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2929.448,
    "end": 2931.21,
    "text": "Free energy theory of bounded rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2938.541,
    "end": 2939.963,
    "text": "Valence, emotion, motivation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.208,
    "end": 2946.12,
    "text": " Now they're kind of exploring broader phenomena.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2953.437,
    "end": 2956.163,
    "text": "Homeostasis, allostasis, interoceptive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2963.888,
    "end": 2975.76,
    "text": " Pretty cool that Active Inference is very flexible to describe visual input or packets coming over the network or interoception.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2977.321,
    "end": 2978.643,
    "text": "Again, NEETs and Scruffys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.323,
    "end": 2984.969,
    "text": "The NEET wants to have a unifying model that can describe all those input-output systems or measurement control systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2986.09,
    "end": 2991.195,
    "text": "The Scruffy says, no, interoception is different than vision, and that's different than the computer packet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2996.508,
    "end": 3021.587,
    "text": " attention salience epistemic dynamics attention is covert action it's internal action and it's modeled as such overt action is embodied action we can operationally define attention as the precision associated with sensory input if you're not paying attention",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.525,
    "end": 3027.35,
    "text": " The sensory input doesn't matter in the sense that it doesn't update your model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3028.512,
    "end": 3035.361,
    "text": "In the limit of paying extreme attention, whatever data point comes in, you will update your beliefs to be that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3038.645,
    "end": 3043.913,
    "text": "That's related to gain control in the Bayesian setting, like in audio engineering.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3048.879,
    "end": 3050.882,
    "text": "Salience is expected information gain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3055.992,
    "end": 3064.57,
    "text": " Salience is in terms of an action or policy, while attention is an attribute of beliefs about sensory input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3064.59,
    "end": 3066.874,
    "text": "Rule learning, causal inference, fast generalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3069.079,
    "end": 3070.221,
    "text": "Great quote by Rumi.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3079.499,
    "end": 3088.549,
    "text": " These are like half page to one page long but there's there's there's so much here, and then active and other fields open directions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3095.957,
    "end": 3105.388,
    "text": "sociocultural dynamics we're exploring that a lot in the ongoing course active inference for the social sciences machine learning and robotics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3106.668,
    "end": 3133.671,
    "text": " huge topic a lot of work in this field are those the only two yeah in summary ending with with the Tolkien Lord of the Rings quote alluding to the golden ring on the cover of the textbook we are now at the end of our journey",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3135.642,
    "end": 3140.049,
    "text": " Their aim was to offer an introduction to those interested in using methods conceptually and formally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3142.733,
    "end": 3143.214,
    "text": "Did they do it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3145.177,
    "end": 3149.203,
    "text": "However, it is important to emphasize active inference is not something that can be learned purely in theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3151.787,
    "end": 3155.453,
    "text": "We encourage anyone who has enjoyed this book to think about pursuing it in practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.097,
    "end": 3161.903,
    "text": "Whether or not you pursue a computational practice,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3162.322,
    "end": 3165.665,
    "text": " We hope you will reflect on it as you engage in active inference in day-to-day life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3168.548,
    "end": 3172.572,
    "text": "It might be looking to see something you're not sure what it is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3173.894,
    "end": 3176.216,
    "text": "It might be eating what you know you like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3176.977,
    "end": 3178.018,
    "text": "It might be trying something new.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3180.64,
    "end": 3182.762,
    "text": "It might be turning down the shower heat if it's too hot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3182.782,
    "end": 3186.326,
    "text": "It might be not turning down the shower heat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3188.468,
    "end": 3192.312,
    "text": "Ultimately, we are confident that you will continue to pursue active inference in some form.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3198.586,
    "end": 3199.247,
    "text": " That's the book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3201.109,
    "end": 3202.091,
    "text": "And then there's the appendices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.577,
    "end": 3223.159,
    "text": "Any kind of closing thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3258.796,
    "end": 3287.436,
    "text": " yeah it's a long chapter textual tap chapter no figures no equations it's all it's like a whole undergrad degree kind of compressed so it covers a lot i guess uh next week we can uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3290.285,
    "end": 3318.621,
    "text": " return to some of these discussions bring up some of these notes into the questions ask new questions cool any last comments all right thank you all see you next time thank you very much bye",
    "speaker": "SPEAKER_00"
  }
]