[
  {
    "start": 2.647,
    "end": 5.271,
    "text": " Andrew Tucci- All right, welcome back to cohort six.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6.913,
    "end": 12.922,
    "text": "Andrew Tucci- Andrew.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 12.942,
    "end": 13.422,
    "text": "Andrew Tucci- Take away.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 13.442,
    "end": 15.225,
    "text": "Andrew Tucci- Really quickly, can you all hear me okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 16.727,
    "end": 31.708,
    "text": "Andrew Tucci- Perfect um yeah so everyone welcome back over at six just resuming here midway through July we're going to be starting the second half of the textbook.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 32.077,
    "end": 44.432,
    "text": " First half, we were introduced to a lot of the underlying ideas and mechanics behind active inference, Bayes' role, Bayesian brain hypothesis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 44.918,
    "end": 55.235,
    "text": " hidden states being inferred from observations, action as a means of trying to change the hidden state through transitions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 56.197,
    "end": 69.238,
    "text": "A lot of really kind of foundational ideas towards understanding active inference as well as following along the low road to active inference starting from",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 69.218,
    "end": 70.781,
    "text": " James J Mullooly, Ph.D.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 70.761,
    "end": 82.587,
    "text": ": Bayesian Canada statistics, so as the higher adaptive inference following the principle of free energy minimization, so the second half of the textbook I think is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 83.343,
    "end": 87.749,
    "text": " It's great for better understanding how to more directly apply active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 88.349,
    "end": 98.903,
    "text": "So chapter six, a recipe for designing active inference models right off the bat kind of gives you a sense of what the rest of the textbook is actually going to potentially be about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 98.963,
    "end": 101.206,
    "text": "We'll be learning how to design models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 101.827,
    "end": 110.498,
    "text": "Chapter seven and eight will be about putting together discrete and continuous time models respectively.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 110.849,
    "end": 118.702,
    "text": " So that's great for people who want to figure out which kind of model they need for their particular use case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 119.463,
    "end": 123.189,
    "text": "It's nice that they're rather expansive chapters on both types of those models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 123.65,
    "end": 127.175,
    "text": "Chapter nine gets more into analysis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 127.436,
    "end": 137.532,
    "text": "So once you've set up an active inference simulation, it starts to discuss how you can actually interpret your results.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 137.512,
    "end": 146.805,
    "text": " depending on your use case, like how you might set things up, depending on what your particular question or inquiry is whenever you're setting up the simulation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 147.466,
    "end": 158.06,
    "text": "And finally, chapter 10 is a nice wrap up that is maybe slightly out of place compared to the rest of what I said about the second half of the book, but it's good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 158.1,
    "end": 160.363,
    "text": "It's a rather holistic",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 160.867,
    "end": 190.603,
    "text": " kind of conclusion type chap variables wrapping up the book comparing active inference to a variety of other disciplines and fields like control theory other social sciences psychology reinforcement learning as another approach to these kinds of problems and so on so just a quick overview on chapter six again a recipe for designing active inference models the book the",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 191.258,
    "end": 206.348,
    "text": " then Tro to this chapter, Friston et al write, the challenge is not to emulate the brain piece by piece, but to find the generative model that describes the problem the brain's trying to solve.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 206.665,
    "end": 231.407,
    "text": " the model provides it so that refers to is the model provides a complete description of a system of interest and the resulting behavior inference and neural dynamics can all be derived from a model by minimizing free energy all these ideas should be familiar from the first half of the book but it's just more clearly stating yes active inference is heavily",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 231.725,
    "end": 261.09,
    "text": " inherited from or derived from uh different ways of approaching computational neuroscience that said we are not trying to recreate you know um billions of individual neurons and all of the kind of crazy uh sparsely connected architecture underlying say the human brain or otherwise the emphasis is upon developing generative models um you know this kind of gets into",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 261.374,
    "end": 271.672,
    "text": " difference between complexity and accuracy found in any machine learning related problem, reinforcement learning problem, so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 271.793,
    "end": 282.492,
    "text": "So again, not trying to recreate the entire brain, just to where we can get things accurate enough to where they start to track and potentially could even be fitted to empirical data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 284.035,
    "end": 285.998,
    "text": "So whenever",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 287.345,
    "end": 297.555,
    "text": " We'll be introduced over time to more exemplar kind of models, but we can adapt the form of the models presented in this textbook to our respective problem of interest.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 297.575,
    "end": 298.836,
    "text": "We can change their form.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 299.737,
    "end": 301.879,
    "text": "Should they be shallow or hierarchical?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 302.62,
    "end": 306.584,
    "text": "We can modify the variables involved, i.e., the beliefs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 306.604,
    "end": 308.666,
    "text": "So what are the states to infer?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 308.826,
    "end": 311.589,
    "text": "What are the observations that the agent receives?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 312.149,
    "end": 315.833,
    "text": "What are the actions or policies available to the agent to commit?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 316.741,
    "end": 322.768,
    "text": " So from there, it's really just a four-step recipe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 323.99,
    "end": 334.082,
    "text": "There are entire discussions that could be had about each step, but in summary, first part, first step is decide which system are we modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 334.943,
    "end": 339.668,
    "text": "So what are the internal versus external states?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 340.269,
    "end": 343.693,
    "text": "What are the sensory versus action states?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 344.095,
    "end": 346.597,
    "text": " What is the Markov blanket of the system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 346.838,
    "end": 348.319,
    "text": "What separates it out?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 348.339,
    "end": 351.302,
    "text": "Are there nested Markov blankets involved here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 352.183,
    "end": 354.645,
    "text": "Those are all basically questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 354.785,
    "end": 360.831,
    "text": "And then step two of the recipe is deciding what's the most appropriate form for the generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 361.652,
    "end": 368.999,
    "text": "Like I mentioned earlier, chapter seven and chapter eight each discuss discrete versus continuous time models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 369.18,
    "end": 371.622,
    "text": "So that's a big decision to make.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 371.99,
    "end": 393.492,
    "text": " potentially involving somewhat different computations for minimizing free energy underneath, and one of them we're working with categorical probability distributions, another one we're working more with Taylor series and approximations, all of which are covered in the textbook as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 393.893,
    "end": 397.116,
    "text": " We know that hierarchical models versus shallow models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 397.136,
    "end": 401.6,
    "text": "So hierarchical models may operate at a slower time scale.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 402.561,
    "end": 416.554,
    "text": "They might basically involve learning states or beliefs about states, which are then supplied back down to a lower layer, supplying priors for the lower layer at the next time step or otherwise.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 418.356,
    "end": 422.82,
    "text": "Other questions involve like the depth of inference and planning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 423.29,
    "end": 423.951,
    "text": " William Newburry, Ph.D.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 423.931,
    "end": 431.98,
    "text": ": How far into the future is the agent inferring states where questions about the expected free energy come up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 433.242,
    "end": 434.143,
    "text": "William Newburry, Ph.D.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 434.083,
    "end": 445.416,
    "text": ": So step three of the recipe, how do we set up the generative model they've already touched on it, but we decide on the models variables states observations actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 445.953,
    "end": 450.678,
    "text": " In more detail, that means what are the observation modalities?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 451.359,
    "end": 453.441,
    "text": "What are the in-state factors overall?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 454.502,
    "end": 461.93,
    "text": "Other things like how do we define the agent's habits or the priors over its available policies?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 463.031,
    "end": 469.998,
    "text": "That's kind of its starting point for deciding how to act whenever we exclude all infractors from the equation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 470.999,
    "end": 474.643,
    "text": "And then finally, which parts of the model are fixed and which parts are learned?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 475.231,
    "end": 483.127,
    "text": " So certain parts might be updated over time while others remain static variables in the model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 484.27,
    "end": 488.939,
    "text": "Finally, step four, how do we set up the generative process?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 490.182,
    "end": 495.012,
    "text": "The quick and easy way of saying that is how do we define everything that is not the agent?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 495.464,
    "end": 495.885,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 495.905,
    "end": 510.706,
    "text": "So so if it's the agent who commits actions, well, those actions are then going to technically be received by the environment is one kind of figurative way of looking at it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 511.487,
    "end": 524.205,
    "text": "So you need to define an environment that can take in actions and then at each step, whether in discrete or continuous time, output the appropriate observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 524.59,
    "end": 526.713,
    "text": " which will then be received by the agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 527.274,
    "end": 534.945,
    "text": "So that starts to define an acronym for transaction perception loop whenever setting things up in code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 536.688,
    "end": 544.419,
    "text": "So that's in general the sum of the chapter as far as its four steps go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 544.439,
    "end": 553.592,
    "text": "There's plenty of other things that are discussed along the way and those four steps broken down into smaller parts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 553.612,
    "end": 554.293,
    "text": "But",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 554.948,
    "end": 557.631,
    "text": " I think that's a good enough overview for now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 559.132,
    "end": 570.023,
    "text": "So I'll open up the floor for any kinds of questions or just general points of interest that people might want to bring up to start a conversation about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 570.964,
    "end": 580.433,
    "text": "And then I believe Daniel had some other thoughts regarding other projects that are going on at the Institute, depending on what we have time for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 583.501,
    "end": 587.866,
    "text": " I really enjoyed the first point, the which system are we modeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 588.506,
    "end": 602.942,
    "text": "Because as we design a system that's going to have some specific environment, we're going to have some problem that we may have imagined solving inside of it, which, of course, we're going to set up our Markov blanket and we're going to set up all of our situations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 603.002,
    "end": 610.69,
    "text": "But it was interesting to me because it seems like that's exactly what nature did whenever it built the brain and us and stuff like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.159,
    "end": 622.437,
    "text": " And it kind of put it into perspective that the resolution in which you're trying to solve is kind of an arbitrary decision of variables and where you arbitrarily decide to set up your Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 623.118,
    "end": 627.546,
    "text": "And it kind of just set it into motion to me that, oh, it's just Markov blankets all the way down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 631.813,
    "end": 632.053,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 633.063,
    "end": 660.927,
    "text": " definitely i always any time i i start to reflect more on markov blankets and what's been written about them i just feel like we're in a world of uh of relativity um you know if i attempted to model like myself say like what separates me from what's around me um well that said i'm composed of a series of smaller markov blankets right i'm proposing a series of neurons and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 661.497,
    "end": 671.185,
    "text": " and other sort of processes that potentially could be seen as engaging in active inference themselves or other inferential processes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 672.686,
    "end": 691.082,
    "text": "So yeah, it's so important to be able to delimit if you're going to actually apply active inference and set up a simulation, like what is your system of interest and what separates it from the so-called environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 691.417,
    "end": 693.82,
    "text": " Otherwise, we don't know what to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 693.84,
    "end": 695.682,
    "text": "We don't know what to code.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 696.764,
    "end": 701.289,
    "text": "And yeah, we don't quite know what our field of study is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 705.794,
    "end": 713.644,
    "text": "Yeah, going off of that, I was just reading some of RxEnvironment's documentation earlier today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 714.755,
    "end": 724.33,
    "text": " And in that case, they actually treat the environment, or you can treat the environment like its own agent in a sense, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 724.35,
    "end": 727.735,
    "text": "It just doesn't have a generative model behind it, but that's abstracted away.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 729.698,
    "end": 731.961,
    "text": "Just going off the Markov blankets all the way down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 734.986,
    "end": 736.408,
    "text": "Yeah, a lot of great points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 736.448,
    "end": 739.513,
    "text": "Just on that last Rx environments piece,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 740.692,
    "end": 769.348,
    "text": " it seems like part of what is happening here is the generalization of entity and then subtypes for like agent and niche and and that highlights what is also um like the deep symmetry between agent and niche with the same blanket one person's send and receive is the other person's receive and send in like a um Alice and Bob communication situation um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 769.413,
    "end": 793.986,
    "text": " then also i mean there's there's a lot of other um pieces to say like if you do account for both directions across the interface like you have modeled what is at the overlap of the agent in the niche so at that point choosing like where which part belongs to which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 794.472,
    "end": 818.826,
    "text": " it's like it's it's almost defined as the interface belonging to both or interfacing with both so that leads to a lot of like the more philosophical speculations and and discussions around Markov blanket while also just pragmatically giving a very nuanced way to talk about like nested systems",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 825.488,
    "end": 826.029,
    "text": " Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 826.069,
    "end": 828.111,
    "text": "I found it really, I'm sorry, please go ahead.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 829.013,
    "end": 833.618,
    "text": "I was just going to say practically just it eases implementation a lot in the case of environments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 836.843,
    "end": 837.944,
    "text": "I found that really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.144,
    "end": 855.006,
    "text": "And I also wanted to ask you guys, I can't seem to find it in the text embarrassingly right now, but whenever it was talking about creating an agent that could walk, they were saying that you could have an agent that embodies some generative model that learns how to walk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 855.56,
    "end": 866.357,
    "text": " Or you can have legs that are built with the dynamics that in inherently don't have a generative model, but know how to walk already know how to move in that environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.038,
    "end": 873.188,
    "text": "I found that to be really interesting, because it asked, for me the question of, do we need the generative model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 873.349,
    "end": 876.273,
    "text": "Or do we just need a generative model that has the generative model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 876.393,
    "end": 879.599,
    "text": "And is that just a larger generative model in and of itself?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 880.34,
    "end": 881.381,
    "text": "Do you guys think about that at all?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 881.402,
    "end": 882.343,
    "text": "Do you have any thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 885.918,
    "end": 913.242,
    "text": " one relevant direction brought up earlier was that like the choices about the model can always be cast as a higher order modeling topic and then another piece which I'll find the link for will involve like this kind of embodied modeling like um let's just say that the elbow has like a limited amount of lateral Mobility or something like that then if you're going to make a map of that control Theory setting",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 913.947,
    "end": 930.64,
    "text": " there might be two kinds of maps you can make one that just simplifies no there's only one um control variable and it has like this limit it has this kind of like frictions and things like that so then over evolution that would come to embody features that would make the first order inference easier and easier",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 933.522,
    "end": 956.486,
    "text": " but that's not a guarantee of just throwing some code on the page, but perhaps in, in iterated evolution with embodiments features of the model that in silica would be purely needing simulation would come to like off source or just be heuristics for what the embodiment was already doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 962.012,
    "end": 962.112,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 963.374,
    "end": 973.597,
    "text": " Yeah, I think it comes back to, I personally view it as like that kind of complexity, accuracy trade off question again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 973.657,
    "end": 982.817,
    "text": "One of my favorite simulations from active inference, like pieces of literature I've read, I'm personally interested in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 983.303,
    "end": 986.807,
    "text": " I guess what would be called computational psychiatry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 986.827,
    "end": 998.0,
    "text": "And there's this nice paper that was put together to try and simulate a classic teammates paradigm, but where the agent has like an effective layer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 998.981,
    "end": 1007.37,
    "text": "All that is to say is that you take the teammates paradigm, you model a mouse that has",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1007.738,
    "end": 1018.515,
    "text": " a hierarchical layer that relates to emotion and see how the mouse's behavior changes in the teammates and how it learns differently.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1018.535,
    "end": 1022.14,
    "text": "And I mean, super cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1022.34,
    "end": 1030.313,
    "text": "And that said, there are dozens upon dozens of like model architecture decisions that could have been made there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1031.094,
    "end": 1035.18,
    "text": "You've added an entire aspect to the model and you could have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1035.38,
    "end": 1039.364,
    "text": " you know, there could be so many different things that you included in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1039.384,
    "end": 1047.853,
    "text": "So why, why just that one thing suddenly is what the question that comes next, rather than thinking about this is a massive addition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1049.474,
    "end": 1052.578,
    "text": "So yeah, it's just a lot of it is relativity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1052.638,
    "end": 1061.787,
    "text": "And I think classic way of going about things is to design a model, do your best.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1061.807,
    "end": 1064.61,
    "text": "And if you're designing it for a particular use case,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1065.029,
    "end": 1090.328,
    "text": " uh see if it's possible to try and fit that model to empirical data if you're trying to you know approximate behavior of a real living organism or if you're trying to produce something that you know has very high optimal behavior for a particular task robotics and so on so you just have to test things out",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1091.506,
    "end": 1116.568,
    "text": " this is that kind of one of the examples it's like interesting how it's it is being pursued in neuromorphic in other areas like this is this is a great empirical example through differential stiffness and and control on differential stiffness you have multi-joints action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1117.612,
    "end": 1144.716,
    "text": " with the falling weight with differential stiffness and like different tune tuning stiffnesses but that's how posture actually is held rather than being like this wide open control space like well my shoulder could be at any angle and my elbow could be any angle well then then there's going to be many control like dimensions and interactions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1151.834,
    "end": 1158.153,
    "text": " So another topic to connect here is an example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.313,
    "end": 1166.417,
    "text": "So in the summary Andrew gave of step three, how to set up the generative model, like what we associate to what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1166.667,
    "end": 1169.895,
    "text": " This is kind of a link to the active inference ontology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1170.095,
    "end": 1184.288,
    "text": "This is why we do learn a generic system independent scale free ontology, even though our pragmatic interest might be like in this specific, you know, X.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1184.572,
    "end": 1210.14,
    "text": " um here's taking basically what are coming up in chapter seven the discrete time generative model as the a b c d e o s by listing those and then here it's at three nested levels of modeling like the pheromone level most um feet on the ground",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1210.475,
    "end": 1235.773,
    "text": " detecting pheromone perception that was kind of what we got into in the infra ants paper but then also we could think okay well but the location switching and that's kind of like the live stream 42 slam where the bottom level of the nested model was the posture and the top was location so you could have like a warehouse robot that was like i want to go like to location on the other side",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1235.939,
    "end": 1260.765,
    "text": " but not have to do all the postural modeling just having a slower transition and then here it's like okay well and task could have a transition maybe it's just a binary transition or that would be the exploration how you model it but this is the whole point about the system and scale independent ontology is that it's not the details of the system",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1260.998,
    "end": 1285.251,
    "text": " which is why the ontology doesn't have opinionation on like how many nest mates should be in a colony or how rapidly should nurses shift the forgers or back and forth like those are once you kind of see it very far in the last mile of modeling that system of interest and so it's totally described by chapter six why are we making this model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1285.45,
    "end": 1311.947,
    "text": " what are we actually choosing to model what what kind of features are we taking in as data what latent states are we going to consider but the tabular form helps like structure what otherwise can be a very open-ended assembly process I guess this is all it just clarifies it visually and this is also good input for language models with templates of other code",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1314.543,
    "end": 1316.406,
    "text": " That's really fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1316.827,
    "end": 1326.001,
    "text": "And it also kind of reminds me of a problem that I heard of in self-driving cars from a researcher named Yann LeCun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1326.942,
    "end": 1339.622,
    "text": "And it was in his paper about JEPA, which they're asking how you create a self-driving car that pays attention to important things like other cars on the road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1340.041,
    "end": 1366.133,
    "text": " instead of just focusing on in machine learning just classically minimizing the loss because if you give really really high definition cameras to the environment the car is going to start looking where the most information content is which is going to be at the trees because those leaves moving there is so much information going into there but you're completely focusing on the wrong things if you're looking at trees whenever you're driving you might just crash",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1366.619,
    "end": 1381.577,
    "text": " So what they have to do in choosing the right sort of variables is they found out they have to use these hierarchical models, which to try to cast it into active inference terms, they had to create a hierarchy of a few different Markov blankets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1382.138,
    "end": 1389.366,
    "text": "However, the actual variables for the interfaces of the inward blankets had to be kind of coalescing inwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1389.386,
    "end": 1390.788,
    "text": "They had to be abstractions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1391.209,
    "end": 1396.575,
    "text": "You aren't allowed to use the same variables again and again, because then you would find yourself",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1396.758,
    "end": 1406.012,
    "text": " in a recursive problem where you keep looking at the trees instead of focusing on things like time scales or important variables that occur down the road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1406.974,
    "end": 1412.242,
    "text": "And that's just something that I thought was tangentially related to setting up the generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1412.722,
    "end": 1413.523,
    "text": "Really interesting stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1415.286,
    "end": 1415.847,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1416.518,
    "end": 1431.76,
    "text": " great comments a few ways that's played out so here's like one one um fan favorite paper from 2021 that makes a three-level phenomenological model so this is commonly replicated",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1431.74,
    "end": 1448.635,
    "text": " and you're right like a nested model does instantiate a markov blanket such that let's just say that experience were residing in the green but it doesn't even matter about whether it's phenomenological like awareness without going too deep into that from the green model's perspective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1449.425,
    "end": 1464.598,
    "text": " the the node that interfaces with the orange is the markup blanket and then also it's like that actually goes further and so it is the reason why although sometimes the discussion is like what is the markup blanket quote around in agents",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1465.051,
    "end": 1474.708,
    "text": " But at the same time, S13 is blanketed from S23 by B. B is the Markov blanket intervening between two timesteps.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1474.848,
    "end": 1476.03,
    "text": "It's the transition operator.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.431,
    "end": 1484.545,
    "text": "Or A, the observation to hidden state mapping, like the partially observable part, is the Markov blanket between the observable and the hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1485.79,
    "end": 1508.845,
    "text": " so like the markovian time concept past only influencing the future through the present that's just the mark i'll blanket through time so it's it's not a statement or expression about how any agent or any base network should be it's actually so pervasive that the content itself does like relatively limited work",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1509.432,
    "end": 1535.187,
    "text": " because it's just a feature of any base graph that's not fully connected is going to have these markup blankets so it it doesn't like distinguish certain kinds of sparse connected base graphs from others it's just a feature that is like basically is the sparsity of the graph that is absolutely fascinating I can't wait to check that out thank you for bringing it up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1535.656,
    "end": 1562.136,
    "text": " yeah that that's a cool one and then another another angle to to like bring a more recent paper um than than the textbook is uh active data selection and information seeking which was live stream 57 with with friston and par in the dot one and then par joining in for dot two um and and great preparation work for the dot zero",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1562.2,
    "end": 1578.687,
    "text": " Like that is one of the things that's super exciting about active inference is there can be a lot of useful tinkering along the low road and like generating different architectures for nested models and unified approaches to perception, cognition, action, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1578.727,
    "end": 1587.381,
    "text": "Here are some explicit ways to value the information with epistemic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1587.682,
    "end": 1610.314,
    "text": " that gets into talking about pragmatic plus epistemic value but this is the difference between reinforcement learning and active inference in reinforcement learning epistemic features must get projected down to or onto or get lumped in with utility slash reward because there's like a uni",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1611.256,
    "end": 1631.577,
    "text": " ranking that different policies are getting ranked against and then policies are selected or sampled from that utility basis and so there's all kinds of tricks like we'll give a bonus for learning information but that would also come to exactly the same question which is how should information be valued",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1631.759,
    "end": 1646.14,
    "text": " And then like a sort of first pass approach, like just have frame rate differencing, which is the origins of predictive coding, where the frame rate differencing is giving high information content, that's where you would want to focus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1647.042,
    "end": 1656.636,
    "text": "But that is like a rapidly moving tree, like you brought up, like it could have high frame rate differencing, but it wouldn't reduce uncertainty about, is there a tree there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1656.734,
    "end": 1681.358,
    "text": " And so active data selection and considering epistemic value explicitly helps give exact and composable epistemic values for generative models and gives like a playground slash space where epistemic and pragmatic value are not the same as each other, and yet they can be balanced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1681.338,
    "end": 1694.588,
    "text": " so there is the parametric balancing like if if it's an Explorer exploit teammates or multi-armed bandit it's not just like making this situation is going to guarantee that you have resolved the trade-off",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1695.563,
    "end": 1724.592,
    "text": " even though language is kind of used to that extent or effect in the textbook that this like dissolves the explore exploit trade-off whereas a slightly more toned down approach that doesn't like promise a given result is it sets up the setting where explore exploit can be compared without collapsing like the explore component to some higher order exploitation problem",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1727.305,
    "end": 1737.799,
    "text": " So a quick comment on that, that I've personally been putting together a three-hour tutorial on applying active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1737.819,
    "end": 1748.493,
    "text": "I'll actually be presenting it in a couple days at an international conference on computational social sciences in Philadelphia a couple days from now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1748.513,
    "end": 1757.245,
    "text": "And I've, you know, one of the strongest points of interest for social scientists is this explore-exploit dilemma.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1757.461,
    "end": 1770.916,
    "text": " And I think one of the most interesting points about it is it can almost be viewed as like both things are being included in roughly the same optimization problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1771.657,
    "end": 1787.215,
    "text": "And I think that the textbook is coming out of a context where this active inference is being heavily compared to reinforcement learning as a potential alternative way of going about producing these models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1787.718,
    "end": 1806.547,
    "text": " And exploration and exploitation do tend to be treated separately, where you need an additional set of rules for defining what is it that defines exploratory behavior for an agent versus exploitative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1807.329,
    "end": 1813.438,
    "text": "And it's seen, I think, as just introducing additional assumptions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1813.739,
    "end": 1839.426,
    "text": " uh into a reinforcement learning model in order to differentiate those whereas with active inference there's this sort of quote-unquote natural balancing between the two but also agreed that like yes now they're in the same optimization problem they're both included in computing expected free energy for an active inference agent but it doesn't necessarily mean the agent is always going to find",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1840.199,
    "end": 1848.029,
    "text": " some theoretical correct amount of exploratory value or absolute value in particular action versus pragmatic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1848.049,
    "end": 1848.789,
    "text": "There could be none.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1848.89,
    "end": 1849.871,
    "text": "There could be zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1850.291,
    "end": 1854.757,
    "text": "It could always think like, oh, if I do this or this, I'm never going to learn anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1854.797,
    "end": 1858.281,
    "text": "So I might as well just go for the goal, so to speak.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1859.002,
    "end": 1863.728,
    "text": "But yeah, sorry, I've just been thinking about that a lot while putting this together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1863.788,
    "end": 1866.491,
    "text": "But maybe that's useful for someone thinking about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1868.734,
    "end": 1869.835,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1870.22,
    "end": 1876.011,
    "text": " Where that's shown most clearly and analytically is figure 2.6.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1876.97,
    "end": 1902.707,
    "text": " here's expected free energy it's a functional on Pi which is like a vector of policy priors that sums to one and then actions are either drawn from the top or the most likely or sampled from Pi with either a straight sampling on Pi or you can have a temperature on action so sample from a more blurred out pie",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1902.856,
    "end": 1932.863,
    "text": " a more sharpened pie what g does in these models expected free energy is it takes a policy prior prior to the update and then updates it into a policy posterior so it's sharpening policies according to pragmatic plus epistemic value both explicitly designed so it has these elements one two three four five but really it's two major terms the first one here is pragmatic value so if you only have pragmatic value",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1932.944,
    "end": 1958.53,
    "text": " only utility maximization that is expected utility and bayesian decision theory so this does not encompass there to be learning or at a higher level it reflects a setting where a modeler has given a utilitarian value to a learning event so in practice that might pursue learning",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1958.746,
    "end": 1983.977,
    "text": " like learning like behavior but it did so by saying well uh getting the problem right is worth one but learning how to do it is worth two so then pursue as many points as you can and then it starts learning capacities or something or you can have two three four five included and drop the pragmatic value this is like the novelty search Infomax",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1983.957,
    "end": 2008.176,
    "text": " because it kind of has implicitly a flat utility distribution so then decisions are weighted only according to the amount of information that they provide which is operationalized as the kl divergence double line between hidden states x tilde",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2008.375,
    "end": 2030.653,
    "text": " with pi either way and y tilde is the sequence of observations so if the sequence of observations was expected to contribute nothing to beliefs about extra time this kl divergence would be zero whereas if y tilde is anticipated to change beliefs on x through time that has a high kl divergence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2030.887,
    "end": 2032.41,
    "text": " So it's the pure epistemic element.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2032.951,
    "end": 2045.132,
    "text": "The pure pragmatic element is about alignment of observations, future observations through time with preferences, the prior distribution on observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2046.277,
    "end": 2052.805,
    "text": " And then those two pragmatic and epistemic imperatives come together in expected free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.546,
    "end": 2059.994,
    "text": "And then there's the degree of freedom of how those are balanced and then choices about how would you dynamically allocate the balance?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2060.535,
    "end": 2063.058,
    "text": "So it's not solved in practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2063.579,
    "end": 2066.162,
    "text": "However, analytically, it's pretty clear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2073.652,
    "end": 2073.752,
    "text": "Well,"
  },
  {
    "start": 2074.12,
    "end": 2093.926,
    "text": " Another fun direction to at least begin here is like we're two years after publication of the book and one of the biggest changes in the Active Inference environment has been RxInfer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2094.847,
    "end": 2102.237,
    "text": "Several of us are working on this and we have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2102.757,
    "end": 2129.946,
    "text": " uh figure 1.2 with with help from some of the bias lab I'll put this in the chat and and we'll see but the the goal of this kind of um shared project between the arts and for a project in textbook group the goal is to have code for every setting and figure in the textbook and that would be um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2130.955,
    "end": 2132.777,
    "text": " We can do it in a few different repos.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.837,
    "end": 2138.405,
    "text": "We can have copies in notebooks, so it can just be run.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2138.465,
    "end": 2146.295,
    "text": "There's a table of all RxInfer examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2147.477,
    "end": 2148.979,
    "text": "So here's the reactive base.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2149.019,
    "end": 2151.282,
    "text": "These are 23 examples from the documentation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2153.885,
    "end": 2155.587,
    "text": "Here's Cobus Esterhausen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2156.148,
    "end": 2159.933,
    "text": "Here's eight examples from his website, Learnable Loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.613,
    "end": 2186.072,
    "text": " then here's figure 1.2 so here's a notebook that will install you click run runtime run all first time it hits the first block it's going to install julia then it'll say reload the page that brings you into the julia kernel then runtime",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2186.238,
    "end": 2186.999,
    "text": " run all again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2187.039,
    "end": 2198.497,
    "text": "Second time through, it runs the tests that confirm that Julia is installed, and then it installs the packages that are relevant for RxInfer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2200.06,
    "end": 2203.926,
    "text": "Then here is a great example of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.121,
    "end": 2217.78,
    "text": " without even going into Rx in the first performance slash engineering or like computational benefits, just focusing on the textbook group possibilities and educational possibilities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2217.862,
    "end": 2243.852,
    "text": " we have figure 2.1 so it's like the frog of the apple is either jumping out of the hand or not and then we have an agent who has priors about the prevalence of frogs and apples in the world and then they update what they believe they're actually holding on to or did did hold on to based upon the observation of either a jump or not so the app model block",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2244.17,
    "end": 2270.734,
    "text": " in rx and fur is like the nut to crack this is the closest not not the closest it could ever be but this is the closest we've ever seen the concordance between the equations that analytically define a generative model and the code to do so and so that also captures the biggest difference with rx and fur from a design",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2270.714,
    "end": 2282.817,
    "text": " perspective overall which is in pi mdp and in matlab there's a procedural definition of for example the agents interfacing with the environment like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2283.725,
    "end": 2307.066,
    "text": " for a new observation then this happens that kicks off this calculate this update that move this to here and so it gives a script like flow that's amenable to explicit looping over like elements of planning or elements of of across multiple agents then there's a lot of degrees of freedom with like okay but then you know should agent one go first every time step or how do we deal with that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2307.738,
    "end": 2312.767,
    "text": " Oricson-Ferr replaces that with a declarative programming style.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.449,
    "end": 2316.895,
    "text": "So here, this is the Bayes graph as declared.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.857,
    "end": 2322.986,
    "text": "And it's basically what you see is what you get with the types of distributions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2323.988,
    "end": 2329.358,
    "text": "And they could be parameterized here directly, or it could be parameterized elsewhere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2329.743,
    "end": 2343.364,
    "text": " and then the inference is also as direct as you can get it's basically just calling that base graph as declared doing some stuff under the hood that we can explore more and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2343.496,
    "end": 2354.738,
    "text": " Letting that graph in its definition be uncoupled from the actual message passing like logistics of information flow between the nodes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2355.539,
    "end": 2359.327,
    "text": "That's the part that goes under the hood now with RxInfer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.767,
    "end": 2362.112,
    "text": "So it opens up this possibility where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.223,
    "end": 2380.624,
    "text": " the app model specifications of the generative model look a lot like the equations and like the minimal way to describe a situation without this extra control flow of which nodes are updated in what order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2380.604,
    "end": 2384.108,
    "text": " However, that has to be supplemented in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2384.549,
    "end": 2390.576,
    "text": "So that's a lot of the ongoing work is like, what are the syntax and possibilities for these app model functions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2391.437,
    "end": 2404.873,
    "text": "What else needs to come into play to have interpretability and kind of like getting it run without any errors also, but getting it working in a way that seems to...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2404.853,
    "end": 2422.727,
    "text": " David Price- function and maybe even leverage the reactive message passing part and then also what that would mean is not just for like different languages and programming backgrounds and everything, but then in this par textbook group, there would be a really clear path.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2422.775,
    "end": 2450.571,
    "text": " from like here's figure or 2.1 and now here's how you could continue to learn more about rx and fur and that would take one like all the way to the horizon of modeling it in advanced settings so that's a clear pathway whereas the 2022 textbook otherwise the appendix doesn't fully reproduce all the figures it's also in matlab so then it's like well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2450.99,
    "end": 2478.246,
    "text": " you're at a fork with whether you recommend or go to study these examples code in more detail or kind of start on a fresh slate with like pi MDP which is probably what in earlier cohorts we discussed a lot but now there's kind of a tiebreaker with RX and fur and the missing artifact that we could greatly benefit from would be the one time",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2478.344,
    "end": 2505.077,
    "text": " finite basically task of making rx infer models and notebooks for the textbook group and in doing so making the accessory um kind of explorations and having the conversations that are like the questions in chapter six and so just kind of then then we like we have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2506.188,
    "end": 2522.345,
    "text": " like a tinkering format in common and one that we can run in notebooks and one that looks largely like the equations kind of written out more in a programming form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2522.365,
    "end": 2533.697,
    "text": "So not, not, not to go too, too much on this, but, and, and this notebook also contains some extraneous information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2535.314,
    "end": 2555.415,
    "text": " but if we can bridge it with rx infer and the textbook group it'll like really give a great connection between the educational on-ramps and the application that that is also like an open source framework",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2560.306,
    "end": 2562.048,
    "text": " Yeah, I would second that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2563.069,
    "end": 2565.212,
    "text": "I think that'd be super cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2565.833,
    "end": 2572.22,
    "text": "I've personally been using PyMDP for that tutorial I mentioned earlier.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2572.28,
    "end": 2575.564,
    "text": "And I mean, the developers of it are great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2576.465,
    "end": 2578.628,
    "text": "You know, I've been talking with them personally a little bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2579.309,
    "end": 2585.155,
    "text": "But that said, yeah, I've seen a lot of the benefits of RxInfer and hope to get back into the RxInfer group.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2586.077,
    "end": 2587.799,
    "text": "Seems like really exciting work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2587.819,
    "end": 2588.98,
    "text": "And finally, to bring it back,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2589.179,
    "end": 2606.759,
    "text": " I think especially for part two of the book, for anyone in the textbook groups coming in, cohorts looking to actually design active inference models themselves, like this chapter, like how do we define a system of interest?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2606.799,
    "end": 2616.029,
    "text": "How do we actually code that is the additional question that isn't necessarily answered in the chapters that we're reading here, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2616.389,
    "end": 2617.971,
    "text": "It's kind of implied in that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2618.305,
    "end": 2637.664,
    "text": " You know it's the authors of the textbook do use MATLAB, as you mentioned, Daniel and so it's kind of as well as the the appendix does include like some some figures of direct MATLAB code constructing a matrices and so on, and you know these but.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2638.946,
    "end": 2643.25,
    "text": "yeah being able to supplement the textbook group with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2644.023,
    "end": 2651.995,
    "text": " RxInfert code, which is also, from my perspective, the most up-to-date way of maybe even doing active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2652.075,
    "end": 2655.099,
    "text": "I think that would be incredibly exciting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2655.62,
    "end": 2663.151,
    "text": "And I think it would also supply people with, one, a great learning resource, like, oh, this is how you do this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2663.311,
    "end": 2670.942,
    "text": "And then two, it supplies a bunch of potential templates that people could download and modify for their own",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2671.36,
    "end": 2682.377,
    "text": " personal experiences, in the sense that, you know, part of active inference is that we don't just learn by changing our perception, we learn by changing the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2682.437,
    "end": 2698.281,
    "text": "So making these kind of templates available for people for them to try and test out their ideas themselves, I think kind of fulfills the other half of the equation of maybe how to learn how to apply active inference in the first place.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2699.503,
    "end": 2700.304,
    "text": "Really exciting stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2703.659,
    "end": 2714.059,
    "text": " Yeah, I just wanted to second the value of templates for RxInfer in that different models can be hierarchically composed along with each other.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2714.079,
    "end": 2717.546,
    "text": "So yeah, once one is specified, it has a lot of value going forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2719.85,
    "end": 2724.84,
    "text": "Yeah, getting some really clear documented examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2725.495,
    "end": 2753.967,
    "text": " and and getting the visualization functionalities and then the examples of what those motifs look like building libraries that can then be referenced by llms for code generation to um building some more methods for like the meta programming and and the interpretability moving in and out of other formats like there's a lot of exciting ways to go um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2754.706,
    "end": 2782.941,
    "text": " and chapter six is going to be kind of their meeting point because that's where we will that's that's the beginning of the modeling process again with the selection of the system of interest which is kind of this like open ended stage but then following that it starts to progressively specify and eventually in a way constrain the output of just a final generative model",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2785.3,
    "end": 2805.216,
    "text": " So that, that demystifies, I think a lot of the process and, and we'll, we'll like create lower friction paths to get from like a given dataset to something that's, that's doing something useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2810.005,
    "end": 2815.527,
    "text": " I remember one discussion from many cohorts ago of like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2816.063,
    "end": 2840.535,
    "text": " then there's the pragmatic value of making the generative model which would be like okay I'm making air conditioning and so I prefer it to be like low energy so then I need to make a working model so that it works and then there's also the epistemic value like people learning about active inference learning about themselves learning about each other um like learning about what is possible that it's like it never even",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2840.515,
    "end": 2852.247,
    "text": " needs to reach the final artifact, although that final artifact might also provide epistemic value separate from its pragmatic value too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2852.547,
    "end": 2862.077,
    "text": " So it's like not a worthless process, even if it and how hard different stages are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2862.097,
    "end": 2867.223,
    "text": "It's super system dependent, and that frontier is very rapidly moving too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2868.684,
    "end": 2872.909,
    "text": "So it's quite different than it was like one or two or three years ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2872.929,
    "end": 2882.419,
    "text": "So I would expect it to be also multiple fold to orders of magnitude easier in one, two, three years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2882.922,
    "end": 2907.951,
    "text": " so it's just sort of like jumping in while you can and and then your own experiences and records will help calibrate and show where things actually are shifting and how easy or hard they are yep i do want to quickly add because i know we're about out of time but uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2908.792,
    "end": 2920.966,
    "text": " much, much earlier, during introductions, someone, I think Zach had mentioned an interest in interpretability of models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2921.186,
    "end": 2930.137,
    "text": "And I would love to see an RX and for like, I'm saying this partially because of just ignorance of what people have tried so far.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2930.217,
    "end": 2935.643,
    "text": "But of course, people are minimizing free energy, but maybe a little bit of emphasis on like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2936.23,
    "end": 2961.951,
    "text": " different sorts of helper functions that can maybe pull out you know for a given time step for example what was the expected information gain um of you know choosing a particular action or policy for the agent like basically having functions that help you pull out like well here's the parts of this that are comprehensible right um for me i'm",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2962.336,
    "end": 2976.615,
    "text": " putting together this tutorial for social scientists, it's like, well, if we can't extract any interesting or useful insights from these models, then why are we memorizing all of this relatively complex math?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2976.655,
    "end": 2978.778,
    "text": "Why are we spending our time doing that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2979.379,
    "end": 2990.013,
    "text": "And so like, for me, it's like, oh, well, you can, you know, make, say 30 agents, and now you can have them do things that lead to emergent behaviors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2990.093,
    "end": 2992.056,
    "text": "But now you can actually peer into",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2992.373,
    "end": 3018.93,
    "text": " you know, if they're learning their likelihood models, now you can look at their particular beliefs and how they change over time and consider those to be something like cognitive metrics that we can actually interpret, like we can interpret them mathematically, we understand how they work, but we also can see how they impact behavior, model performance and longevity, and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3019.13,
    "end": 3021.874,
    "text": "So yeah, it'd be super cool to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3022.428,
    "end": 3038.187,
    "text": " to just make sure with all these nice technical advancements that are being made with Julia and RxInfer to also supplement that with interpretability and having that as a ready resource as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3042.112,
    "end": 3042.412,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3042.432,
    "end": 3043.894,
    "text": "No, absolutely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3044.455,
    "end": 3044.875,
    "text": "Oh, sorry, after you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3045.901,
    "end": 3046.703,
    "text": " Oh, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3046.723,
    "end": 3050.513,
    "text": "I was just going to say, I think today it's probably quite limited.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3050.633,
    "end": 3056.147,
    "text": "But RxInfer Debug Mode does show messages being passed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3056.187,
    "end": 3060.197,
    "text": "It's mostly useful, to my understanding, recommended.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3061.578,
    "end": 3066.025,
    "text": " for when you're unable to optimize the graph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3066.045,
    "end": 3067.648,
    "text": "You're not converging on a solution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3067.668,
    "end": 3068.429,
    "text": "You're just running forever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3069.37,
    "end": 3071.834,
    "text": "Usually, you're running into some sort of intractable problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3072.355,
    "end": 3076.301,
    "text": "I don't know how much that helps with interpretability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3076.441,
    "end": 3079.186,
    "text": "I don't understand message passing super well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3079.847,
    "end": 3084.935,
    "text": "And I just watched a talk from Dimitri Bagev earlier today.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3084.955,
    "end": 3088.26,
    "text": "It's linked to the engineering Discord.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3088.24,
    "end": 3089.366,
    "text": " General.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3090.19,
    "end": 3092.784,
    "text": "He talks about how it took him years to understand message passing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3093.628,
    "end": 3094.774,
    "text": "So there's that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3095.041,
    "end": 3110.844,
    "text": " Um, the other thing that I would, I don't think this functionality exists, but I would possibly look forward to maybe understanding these models, especially as they're growing complexity, um, is sort of like loss of function research on them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3110.905,
    "end": 3119.277,
    "text": "So like disabling or removing parts of the subgraph, um, because these are all of the message passing happens locally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3119.297,
    "end": 3121.14,
    "text": "It's just in between two nodes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3121.58,
    "end": 3123.343,
    "text": "Um, so you can.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3124.471,
    "end": 3131.373,
    "text": " The example that's commonly used is like you could lose a sensor that's feeding into the model and it would still continue to work with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3131.433,
    "end": 3133.219,
    "text": "It's just optimizing without that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3135.125,
    "end": 3138.295,
    "text": "So yeah, maybe that would be kind of an interesting approach as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3142.358,
    "end": 3158.528,
    "text": " i'll try to give the shortest possible message passing that this this is a super interesting paper i hope we can like understand these different approximations but but leaving that for a second the 2017 paper with with burt",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.508,
    "end": 3182.811,
    "text": " here's the key figure this is connecting figure 4.3 discrete time generative model this is a base graph nodes are the random variables edges are the causal relationships in the 40 factor graph the nodes and edges are flipped so that the nodes are like combiners or functions of where different variables which which are on the edges come from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3183.466,
    "end": 3189.936,
    "text": " There's, as they show, there's like a one-to-one mapping between a base graph and a 40-factor graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3189.956,
    "end": 3191.979,
    "text": "So they can contain the exact same information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3192.36,
    "end": 3197.208,
    "text": "What you gain, though, with a factor graph is this like logistics or scheduling order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3197.588,
    "end": 3205.761,
    "text": "So it allows you to like turn the crank ahead one step and to say that's going to take these 22 messages in this exact order.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3205.994,
    "end": 3232.018,
    "text": " what those messages are there's a lot of different like payloads they can contain but what it lets the whole graph do is do one descent on a variational free energy landscape for example it could probably also do other things so in 2017 they were like we're already making these base graphs here's a logistically deterministic scheduler that'll let us crank even on a large base graph",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3232.741,
    "end": 3235.465,
    "text": " let us crank the whole thing ahead one time step at time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3236.387,
    "end": 3239.031,
    "text": "That's message passing, variational message passing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3239.492,
    "end": 3250.229,
    "text": "The difference with reactive and what Dimitri, I think, brought in with the rocket is it uncouples the update frequencies from different parts of the graph.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3250.729,
    "end": 3260.605,
    "text": "So instead of having to turn the whole crank and run this deterministic schedule of every single thing, you can have the reactive like just in time sending and receiving, I believe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3261.293,
    "end": 3289.748,
    "text": " that opens up some other things that need to be specified like how the logistics are timed but it seems like those are just conventions and actually the reactivity means that like the graph doesn't have an order or tempo per se but it's like figuring out all those things are some of the most important things",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3290.69,
    "end": 3290.95,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3291.951,
    "end": 3305.606,
    "text": "And this kind of reactivity, I've wondered like the connection between message passing here and message passing in the case of like multi-thread or distributed computing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3307.528,
    "end": 3311.752,
    "text": "It seems like with the reactivity, you're getting possibly very close to that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3312.573,
    "end": 3314.335,
    "text": "I don't know if it's something that's been discussed much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3316.576,
    "end": 3338.837,
    "text": " that's super interesting I think it's probably almost totally unexplored with a multi-threading there's multi-threading and concurrent uh programming as like a multi-agent situation right I don't know if how like if those kinds of moves have been brought into like possible multi-CPU or GPU RX and fur",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3339.863,
    "end": 3366.698,
    "text": " yeah yeah i don't i don't know either it's it's very interesting the parallel there it seems yeah i'd love to learn more about it but i i also know not too much about distributed computing so maybe something to explore cool well this is a fun uh sort of re-entry into six like also we'll have the three-week rhythm so let's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3368.298,
    "end": 3396.229,
    "text": " in the third weeks let's either work on a textbook example and or annotating code from from kobus or the examples but let let's go into rx infer and um and curate the questions along the way and make the notebooks etc possibly we could record these sessions but we'll see if it just is more like an application workshop",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3396.648,
    "end": 3416.57,
    "text": " Um, I think this will be really fun though, and, and help give like kind of a textbook part two plus, because after having done, and then also with, then we leave these kind of like perhaps multiple workshop templates for cohort seven, going through the second half.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3417.17,
    "end": 3425.98,
    "text": "And then that would be like a jumping off point for, okay, then you finish that, but you're already pretty familiar with art and fur by the end of the textbook group.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3426.922,
    "end": 3430.386,
    "text": " because the application oriented part of the book gives templates and examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3431.628,
    "end": 3444.183,
    "text": "So still many people slash all people will be learning code and Julia and Rx and Fur, but then that's where we can also connect to using LLMs for code explanations and all this other stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3446.086,
    "end": 3447.287,
    "text": "So thank you, Andrew.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3447.327,
    "end": 3448.809,
    "text": "Thank you, John and Zach.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3450.852,
    "end": 3451.673,
    "text": "Thank you guys so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3451.993,
    "end": 3455.297,
    "text": "Daniel, I'm excited to read those papers and check out Rx and Fur.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3455.317,
    "end": 3456.118,
    "text": "I'll talk to you guys soon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3456.453,
    "end": 3457.118,
    "text": " See you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3457.138,
    "end": 3457.554,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]