[
  {
    "start": 7.169,
    "end": 31.135,
    "text": " hello welcome it's may 21st 2025 we're in active inference guest stream 107.1 with david benremo the need for a common language to unite levels of explanation in mental health the potential of computational psychiatry so thank you for coming david looking forward to the presentation and to anyone's questions in the live chat so thank you to you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 32.178,
    "end": 32.659,
    "text": " Perfect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 32.679,
    "end": 33.26,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 33.3,
    "end": 34.282,
    "text": "It's a pleasure to be here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 34.302,
    "end": 39.734,
    "text": "I don't think I've done a live stream before, so this is a new experience for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 40.215,
    "end": 42.901,
    "text": "Looking forward to any questions that come from the audience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 44.424,
    "end": 52.06,
    "text": "So today I'll be talking a little bit about some work we've been doing, much of which is relevant",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 52.04,
    "end": 74.113,
    "text": " either directly involving or peripherally involving active inference around levels of explanation in mental health research and some new and more recent theoretical work that we've done in incorporating affective states into understanding things like psychosis development, which is a particular interest of mine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.273,
    "end": 75.735,
    "text": "I am a psychiatrist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 75.715,
    "end": 83.586,
    "text": " at the Douglas Mental Health University Institute, which is a mental health hospital in Montreal, Canada.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 84.488,
    "end": 91.718,
    "text": "I did a master's degree with Carl Fristin at UCL, where we did some work that I'll be talking about today on modeling hallucinations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 92.94,
    "end": 100.691,
    "text": "I have a lab at McGill, and I also happen to be the chief science officer of a mental health company, which is not really relevant to the talk today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.711,
    "end": 103.495,
    "text": "It's not active inference focused at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.829,
    "end": 107.089,
    "text": " So just keep in mind the the disclaimer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 107.862,
    "end": 128.655,
    "text": " So my journey towards active inference and towards computational psychiatry in general really was motivated by this difficulty I had as a medical student, as a pre-medical student, with the idea that everything seemed to be about cutting things from bigger boxes into smaller boxes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 128.755,
    "end": 135.726,
    "text": "And it's nice to know how many boxes you have to deal with, but that doesn't necessarily tell you anything about what the boxes are actually doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 136.043,
    "end": 153.985,
    "text": " So, you know, if you start with humans, we can split those into individuals and societies, and then individuals have a bunch of things that are phenomena, and those phenomena, we think, you know, are rooted in the brain, and then the brain has regions, and then those light up with different tasks and what have you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 154.353,
    "end": 156.336,
    "text": " on fMRI and other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 156.396,
    "end": 157.838,
    "text": "And then those regions have circuits.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 158.439,
    "end": 162.165,
    "text": "And then those circuits have neurons and astrocytes and glia and et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 163.026,
    "end": 168.214,
    "text": "And those have genes which are regulated by genetic regulators, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 168.695,
    "end": 170.758,
    "text": "And so it all just kind of felt like we were just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 170.738,
    "end": 172.38,
    "text": " breaking things into smaller boxes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 172.4,
    "end": 174.904,
    "text": "And this is not a dig against a reductionist approach at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 175.805,
    "end": 178.228,
    "text": "It just didn't feel like we were quite getting at mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 179.069,
    "end": 182.073,
    "text": "And I always wondered, how does all this work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 182.133,
    "end": 183.134,
    "text": "What is the mechanism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 183.174,
    "end": 184.757,
    "text": "What are we actually trying to achieve?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 184.817,
    "end": 187.52,
    "text": "What is the thing that is being computed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 188.261,
    "end": 194.89,
    "text": "And of course, for all those of you who are interested in computational work, this is by no means a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 194.87,
    "end": 208.949,
    "text": " a foreign concept, but since I'm sure many people listening aren't necessarily thinking about this from a medical or mental health standpoint, I just sort of wanted to give you an insight into how I think about this and the utility of computational psychiatry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 208.989,
    "end": 218.903,
    "text": "So the way I see it is that it's using new and old computational techniques to understand the healthy and pathological mind or the environment, no reason why we can't use it to explain the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 218.883,
    "end": 227.965,
    "text": " And it comprised of different methods that focus on answering different questions, what is thought and behavior, which we think is the manipulation of information, and what answers are useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 228.788,
    "end": 233.176,
    "text": " And those are the ones that can provide predictive tools for clinical or preventative use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 233.196,
    "end": 239.348,
    "text": "Sometimes the useful answers are not the ones that teach us anything about the brain and vice versa.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 239.368,
    "end": 243.396,
    "text": "So we'll be focusing today mostly on the what is thought and behavior piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 243.416,
    "end": 250.189,
    "text": "The predictive stuff is, I have another talk for that, not really super relevant to active inference per se.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 250.169,
    "end": 267.713,
    "text": " But it gave us these two camps of computational psychiatry, the modelers, which is where I'll be focusing most of my focus today, and then the predictors, which build models that are, I say useful as a facetious way of indicating that sometimes the models that we build for prediction are very helpful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 267.753,
    "end": 271.178,
    "text": "We don't necessarily learn anything from them, but they give us something useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 271.518,
    "end": 277.206,
    "text": "And sometimes you have to make that choice between utility and mechanistic insight.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 277.186,
    "end": 285.897,
    "text": " Though obviously with more and more technical progress, the distance between those two camps is being reduced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 286.535,
    "end": 292.743,
    "text": " So we're going to be focusing really on models of psychosis development from individual patient level to the social level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 293.023,
    "end": 301.154,
    "text": "And psychosis is something I've always been fascinated by clinically and sort of epistemologically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 301.194,
    "end": 309.985,
    "text": "How does one generate an understanding of phenomena and beliefs that aren't really there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 310.866,
    "end": 315.192,
    "text": "What is the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 315.172,
    "end": 324.378,
    "text": " the understanding of how we can have a base optimal agent, the human brain, that is generating something that seems from the outside perspective to not be optimal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 324.398,
    "end": 328.59,
    "text": "Obviously, of course, it is, but for complex and interesting reasons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.072,
    "end": 343.77,
    "text": " So we built in my master's degree with Carl a computational model of auditory hallucinations and this was because schizophrenia is a common and devastating condition and about 70% of people with schizophrenia will have auditory hallucinations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 345.473,
    "end": 357.649,
    "text": "We often find ourselves at a therapeutic deadlock because likely of poor mechanistic understanding we don't really know how the brain is generating psychotic symptoms and so we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 357.629,
    "end": 359.732,
    "text": " I don't really have any new ideas about treatment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 359.792,
    "end": 376.693,
    "text": "The first new drug for schizophrenia, RXT, which came out recently, I went to a talk recently, and the thing they were all interested in was how do we relate this back to the dopamine story, which has been very influential for many years, obviously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.734,
    "end": 382.54,
    "text": "And I went up to the speaker, I said, isn't it a shame that you have a drug with a completely new mechanism of action?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 383.195,
    "end": 386.199,
    "text": " And you feel the need to relate it back to dopamine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 386.359,
    "end": 391.947,
    "text": "Because it's not possible that there might be other mechanisms at play here that might be interesting or novel or useful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 392.007,
    "end": 393.93,
    "text": "We don't have to always have the same answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 395.733,
    "end": 398.557,
    "text": "Because having the same answer all the time is what's led us to having a therapeutic deadlock.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 400.399,
    "end": 401.721,
    "text": "Not to say the dopamine isn't important.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 401.761,
    "end": 402.022,
    "text": "It is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 402.162,
    "end": 405.186,
    "text": "But there's possibly and likely more to the story than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 406.533,
    "end": 415.058,
    "text": " They have a rich and complex phenomenology that presents specific targets for modeling, which is always nice to have if you have phenomenology that you can produce in your models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 415.831,
    "end": 418.013,
    "text": " So we decided to use active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.433,
    "end": 425.961,
    "text": "I have a slide here on what is active inference, which I'm assuming for this population I do not have to go through.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 426.521,
    "end": 431.786,
    "text": "So I'm going to go through it extraordinarily quickly just because it's on my slide list, but I'm not going to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 432.587,
    "end": 434.388,
    "text": "I'm going to assume this is not news to anybody.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 435.269,
    "end": 439.834,
    "text": "So Bayesian theory, we seek to minimize uncertainty, surprise our free energy about causes of sensations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 439.854,
    "end": 440.835,
    "text": "We act to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 441.635,
    "end": 444.538,
    "text": "It can be formulated as exploitation trade-off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 444.518,
    "end": 450.705,
    "text": " It assumes that we build models of the world and act to maximize the accuracy of this model while minimizing complexity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 450.765,
    "end": 461.596,
    "text": "And if you're in a dark room and you see scary yellow eyes, you will act to produce more information to better understand the causes of your sensations, which in this case was a harmless kitty, but could not have been a harmless kitty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 461.616,
    "end": 466.862,
    "text": "And therefore we acted to get ourselves more information so that we could reduce uncertainty.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 467.222,
    "end": 470.526,
    "text": "I'm assuming this is not a surprise to anybody, so I'm just going to move on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 470.506,
    "end": 500.277,
    "text": " um so now to the fun stuff so uh how might hallucinations occur in a base optimal context um you know the uh the idea really was we've got our priors or likelihoods in our posterior our posterior is where the percept is happening in our conceptualization we have a state that we infer to be the case in the world that there is a cause of sensation um that is present uh when there is none um from a quote-unquote objective standpoint",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 500.257,
    "end": 515.903,
    "text": " And that's got to be happening through some combination of prior and likelihood and differential precisions on those two that give us a posterior that is not consistent with everybody else's consensual hallucination of reality, if you will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 516.507,
    "end": 526.725,
    "text": " And so we created a couple of in silico models that were able to generate these kinds of hallucinations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 527.487,
    "end": 534.499,
    "text": "And it taught us a lot about the possible implementation or biologically of what might be going on when people hallucinate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 535.07,
    "end": 538.774,
    "text": " So the first model we built was, so this is a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 539.055,
    "end": 540.116,
    "text": "It's a 2018 paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 540.136,
    "end": 541.157,
    "text": "It's a bit old at this point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 541.177,
    "end": 542.899,
    "text": "But it's called Active Inference and Hallucinations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 543.46,
    "end": 546.223,
    "text": "And the next three models are all from the same paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.944,
    "end": 551.409,
    "text": "And this is the best we were able to do in terms of graphical representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 551.749,
    "end": 552.831,
    "text": "I'm not very good at graphics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.491,
    "end": 561.08,
    "text": "Thomas Parr, who was my co-author here and my sort of co-supervisor for my master's degree, helped a lot with making these somewhat palatable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 561.18,
    "end": 562.782,
    "text": "But they're still a little bit overwhelming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 562.762,
    "end": 571.674,
    "text": " The idea here was that our states are representing our percept, our posterior, whether or not you're hearing somebody speaking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 572.435,
    "end": 578.544,
    "text": "We have outcomes, which are the real outcomes in the world, whether or not you are speaking and whether or not you're hearing anybody else speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 579.345,
    "end": 582.289,
    "text": "And then we have our policies where we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 582.607,
    "end": 591.165,
    "text": " are preparing ourselves to either listen or to speak, depending on where we think we're at in a turn-taking conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 592.227,
    "end": 596.295,
    "text": "The first thing we found is that agents hallucinate when",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 596.731,
    "end": 608.486,
    "text": " you reduce the sensory precision, the zeta, on the A matrix sufficiently such that, essentially, exterior information no longer can correct anomalous prior beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 609.087,
    "end": 615.195,
    "text": "The prior beliefs here are being engendered by the policies, by the sensory expectations of the policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 615.555,
    "end": 620.882,
    "text": "So if you expect to be listening to somebody at the next time step because you're in a turn-taking conversation, you expect the other person to speak,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 620.862,
    "end": 642.159,
    "text": " If the person doesn't speak, normally you would correct that expectation with sensory information, but what ends up happening is that if you reduce the precision of that sensory information, you can no longer make that correction and then you actually generate a percept to fulfill your expectation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 642.82,
    "end": 644.102,
    "text": "So that was the first piece.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 644.639,
    "end": 657.385,
    "text": " Then we did the same thing, but now with a slightly different agent, we modified the gamma, so the prior precision over the policies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 658.127,
    "end": 660.792,
    "text": "And gamma, as many of you might know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.772,
    "end": 666.66,
    "text": " has been previously linked to dopaminergic function in work by Schwartzenbeck in the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 667.381,
    "end": 672.868,
    "text": "And so the idea was, we know the dopamine is relevant, obviously in psychosis, how?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 673.369,
    "end": 675.392,
    "text": "What is the computational kind of meaning behind that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 675.993,
    "end": 688.129,
    "text": "And the idea here was that in cases of permissive low sensory precision, the likelihood precision, but you had to have the low likelihood precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 688.109,
    "end": 694.569,
    "text": " high gamma or an increase in dopamine was able to kick the agent over into hallucination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 696.936,
    "end": 700.026,
    "text": "But it only worked if you also had the reduction in sensory precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 701.66,
    "end": 711.651,
    "text": " So dopamine seems to be sort of like facilitating, but not necessarily the primary mover, which makes sense because patients with schizophrenia don't lose all of their symptoms when they're treated with antipsychotics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 711.671,
    "end": 720.159,
    "text": "They stop hallucinating most of the time, not always, but most of the time, but they still have a lot of the other symptoms that come with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 720.6,
    "end": 722.442,
    "text": "So something about the brain clearly hasn't changed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 722.542,
    "end": 724.144,
    "text": "It's not all dopamine dysregulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 724.764,
    "end": 726.506,
    "text": "There's other pieces going on here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 726.526,
    "end": 728.308,
    "text": "And to get a sense of what that might've been,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 728.71,
    "end": 740.053,
    "text": " We did a lesion study, which was a lot of fun because I was a master's student fresh out of medical school, and I'm doing computational lesion studies, and I felt pretty darn cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 740.454,
    "end": 746.466,
    "text": "Obviously, this is something many people do and by no means is unique, but I felt very fun doing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.446,
    "end": 756.075,
    "text": " And so what we did here was that we built an agent that had many different policies, and one of those policies would lead to hallucinations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.717,
    "end": 775.052,
    "text": "However, version A of the agent, the unlesioned agent, had enough policies, enough flexibility, if you will, that if you were to reduce its sensor precision all the way down to basically zero, it always had a policy that was correct, that was consistent with the world around it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 775.532,
    "end": 776.453,
    "text": "And so it didn't hallucinate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 776.433,
    "end": 792.496,
    "text": " Then you lesion that policy, you destroy the neurons that are encoding those expectations of the world and now you get hallucinations because you don't have a prior that is non-maladaptive that can rescue your phenotype.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 793.057,
    "end": 804.533,
    "text": "And so we were able to show that really it was an element of lack of sort of cognitive flexibility of being able to find solutions that were not essentially",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 804.513,
    "end": 805.777,
    "text": " there is a hallucination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 805.837,
    "end": 814.06,
    "text": "When you get rid of all other options and sensory precision is low and you have maladaptive priors, you get hallucinations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 814.32,
    "end": 819.535,
    "text": "And so the conceptualization that we had here was maladaptive but strongly held",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 819.515,
    "end": 826.664,
    "text": " priors could not be corrected because of imprecise sensory information, which led to a precise prior belief in precise sensory reference view of hallucinations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 827.145,
    "end": 831.009,
    "text": "This is not the only way of thinking about this, even from an active inference perspective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 831.19,
    "end": 839.48,
    "text": "There's other ways of thinking about hallucinations that are very interesting and we can talk about if people are interested, but this was the conceptualization we came to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.9,
    "end": 846.328,
    "text": "It was very consistent with patients that I had seen in the hospital.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 846.589,
    "end": 848.391,
    "text": "I had a patient once who",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 848.371,
    "end": 858.808,
    "text": " What she would do was that she would have very poor sensory precision on essentially all information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 858.828,
    "end": 860.911,
    "text": "You would be talking to her and she was mostly ignoring you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.893,
    "end": 871.729,
    "text": "The environment around her, she would spend her time mostly focused on what she was thinking about and not really paying attention to everything else around her, except when there were sirens.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.198,
    "end": 876.245,
    "text": " Whenever there were sirens, she was convinced that the police were coming to get her.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 876.325,
    "end": 879.15,
    "text": "Even though she was already in the hospital, the police had already come to get her.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 879.17,
    "end": 880.032,
    "text": "It had already happened.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 880.653,
    "end": 882.697,
    "text": "She was convinced they were coming to take her again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 882.717,
    "end": 885.421,
    "text": "And I looked at her and I said, you've already been taken.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.441,
    "end": 885.842,
    "text": "You're here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 885.882,
    "end": 887.926,
    "text": "They're not taking you anywhere else.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 888.086,
    "end": 889.228,
    "text": "They already brought you here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 889.597,
    "end": 891.801,
    "text": " That didn't make a difference to her.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 891.841,
    "end": 892.603,
    "text": "She was convinced.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 893.484,
    "end": 901.88,
    "text": "So she was able to allocate sensory precision to specific kinds of stimuli, but generally was ignoring the rest of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 902.341,
    "end": 909.073,
    "text": "And we're going to talk a little bit about that when we get to the affective model that I alluded to at the beginning, which is a paper we recently just published.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 909.053,
    "end": 910.596,
    "text": " Well, sorry, it's not published yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 910.716,
    "end": 915.504,
    "text": "It was accepted with minor revisions at IGNP, and we're hoping to get it published relatively soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 916.245,
    "end": 918.048,
    "text": "But it's up as a preprint that you can access.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 919.05,
    "end": 922.095,
    "text": "And we'll talk a little bit about where that story comes into play.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 922.115,
    "end": 925.982,
    "text": "So that one patient and her story has been with me",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 925.962,
    "end": 953.607,
    "text": " the entirety of my career at this point because she's really inspired my master's work this most recent paper i actually saw her after my master's work and i sat down with her i said you know you inspired my thesis and i sat down with her and i tried to go over it with her i think that was probably more for me than it was for her but it was nice to sort of let her know that that her story sort of inspired some some academic work and may help other patients in the future",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 954.11,
    "end": 961.073,
    "text": " Anywho, so this precise prior imprecise evidence view of hallucinations has had some experimental validation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 961.635,
    "end": 964.987,
    "text": "Many of you might be familiar with the landmark study by Powers et al.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 965.027,
    "end": 967.174,
    "text": "in 2017 in science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 967.728,
    "end": 990.951,
    "text": " that used the hgf the hierarchical Gaussian filter which is essentially simplified active inference and where they found that a stronger prior weighting was in fact the driver compared to sensory evidence was the driver of hallucinations in both people with hallucinations who had psychosis and people who didn't have psychosis but had hallucinations kind of like spirit mediums and people",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 990.931,
    "end": 993.695,
    "text": " who are voice hearers but don't have an illness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 993.755,
    "end": 1000.746,
    "text": "So in order to hear hallucinations, it is irrelevant to have an overweighting of priors compared to sensory evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1002.309,
    "end": 1008.298,
    "text": "This didn't really get us much about the sensory evidence in particular, because it's just a question about differential weighting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1008.43,
    "end": 1010.852,
    "text": " and not necessarily the sensory evidence itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1011.413,
    "end": 1027.007,
    "text": "So I did a study with Al, who is my mentor now, and I'm very grateful to him, where we looked at the same task slightly differently with a linguistic focus in a hallucination prone individuals in a general population sample.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1027.527,
    "end": 1038.437,
    "text": "And that sample, we found an interesting thing, which was that patients with more hallucination proneness or recent hallucinations in the general population",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1038.417,
    "end": 1042.507,
    "text": " were more likely to require louder stimuli when establishing their priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.547,
    "end": 1052.713,
    "text": "So a suggestion that perhaps they need to be provided more precise sensory information, which would suggest that they have lower sensory precision overall.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.031,
    "end": 1059.303,
    "text": " The priors are also more resistant to change in more versus less hallucination prone individuals.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1059.343,
    "end": 1060.525,
    "text": "They decay slower.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1060.806,
    "end": 1076.355,
    "text": "So the way the task works is that you condition people to hallucinate and over time you generate more and more trials where they will get a condition stimulus that is supposed to generate the hallucination, but there's no actual auditory stimulus present.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1076.335,
    "end": 1084.344,
    "text": " So they hear, they see like a checkerboard, it's like checkerboard sound, checkerboard sound, checkerboard sound until they learn that there's a checkerboard sound association.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1084.804,
    "end": 1090.331,
    "text": "Then you show the checkerboard without the sound, but you present white noise and they'll hear the sound in the white noise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1090.791,
    "end": 1094.415,
    "text": "Over time, you present more and more trials where there's the checkerboard, but no sound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1094.455,
    "end": 1098.84,
    "text": "So that's technically evidence against the association between the checkerboard and the sound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1098.86,
    "end": 1105.988,
    "text": "So you would expect the prior to decay and it does, but it decays more slowly in people with more hallucination proneness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1105.968,
    "end": 1116.96,
    "text": " which suggests either the prior is very strong and doesn't decay or that the sensory information that is being presented is not sufficient to decay that prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1118.762,
    "end": 1132.498,
    "text": "So, so far we focused really on the individual patient, but the social environment is key in psychosis development and often people in psychosis, early onset or development of psychosis stages will",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1132.799,
    "end": 1144.378,
    "text": " have very poor social bonds, they will socially isolate, and there's sort of an overall reduction in social contact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.865,
    "end": 1154.26,
    "text": " So we investigated in a theoretical paper that I published again with Al, how different kinds of treatments, programs could impact computational processes underlying psychotic symptoms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1154.421,
    "end": 1154.661,
    "text": "Why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1154.701,
    "end": 1167.582,
    "text": "Because some of the most successful programs for treatment of psychosis, besides providing medication, provide essentially a forced social interaction because you've got intensive case management or you've got",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1167.562,
    "end": 1195.02,
    "text": " uh sort of a very comprehensive program that involves therapists and doctors and nurses and you basically are provided with a group of friends and people um that uh well not our friends obviously they're your caregivers but they're they're people that you have uh contact with um which uh which which we thought might have an important as an important uh impact on uh computational mechanisms of symptom development and maintenance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1195.895,
    "end": 1215.925,
    "text": " And so we looked at assertive community treatment, which is basically when you have a team of people who will show up at your house every day or every couple of days and they will make sure you take your meds and they'll chat with you and make sure that your needs are taken care of and that you've got a good, you know, your housing is up to date and you're paying your stuff and all these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1216.626,
    "end": 1219.49,
    "text": "It's a very effective way of helping these patients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.67,
    "end": 1225.699,
    "text": "For those of you who are not familiar with schizophrenia, that might sound extraordinarily invasive and paternalistic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1225.679,
    "end": 1231.509,
    "text": " That's probably because you haven't worked with many people who have serious psychotic illness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.571,
    "end": 1236.738,
    "text": "The reality is because of cognitive and negative symptoms, people really need a lot of help.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1237.279,
    "end": 1242.608,
    "text": "And this help is often either much appreciated or at least very useful for the person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1242.588,
    "end": 1253.164,
    "text": " And then coordinated specialty care clinics, which is basically like specialized clinics for people that are at risk for psychosis or who've just started experiencing psychosis, which is just a much more intensive, it's not just see your doctor every three months.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.524,
    "end": 1259.533,
    "text": "You have a case manager, you have potentially a therapist, a nurse, people who you can turn to when you need help.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1259.513,
    "end": 1267.162,
    "text": " And so when we thought about this, we wanted to integrate the social with the sort of individual and biological levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1267.883,
    "end": 1276.332,
    "text": "And the idea really was that we could use computational psychiatry as a common language to integrate between these different levels.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1277.073,
    "end": 1283.12,
    "text": "And the idea was that we could look at this as sort of a social treatment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1283.2,
    "end": 1288.947,
    "text": "So all of these services are making sure patients get their medications, but they're more effective.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1289.18,
    "end": 1311.205,
    "text": " than normal services and we we assumed it was more than just people getting their antipsychotics um and so the idea was you know there could be different ways in which um the the access to a more more important social environment um a more active social environment might help you so uh one might be improving sensory precision",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1311.185,
    "end": 1312.707,
    "text": " So what do I mean by that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.907,
    "end": 1322.26,
    "text": "If you have, you know, somebody who is coming to you and giving you good information that you trust, well, maybe you are engaging with the world a bit better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1322.3,
    "end": 1331.894,
    "text": "Maybe you are artificially boosting the precision that you're placing on sensory information, which may reduce, because we said the sensory precision has to be low for the Hulu stations to obtain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1331.954,
    "end": 1338.002,
    "text": "So maybe that is helping to reduce your maladaptive low sensory precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1337.982,
    "end": 1351.08,
    "text": " an expanded policy space, increasing your cognitive flexibility, either through cognitive remediation like formal therapy, or just having people that you can discuss problems with and have a sort of extra brains around you that you can problem solve with.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1351.902,
    "end": 1362.977,
    "text": "That might help expand your cognitive reserve, if even artificially, and therefore leave you less forced to rely on the priors that generate hallucinatory behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1362.957,
    "end": 1371.06,
    "text": " There's obviously the impact of medication, which is reducing the prior precision over policies, the gamma, the dopamine, so dopamine blockade.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1371.378,
    "end": 1399.883,
    "text": " um and then um potentially also reducing the influence of sensory priors if you've learned that uh the hallucination should be present for example um and you have very strong sensory prior beliefs um the the the the help from from therapists or from from clinicians that you trust over time to help you realize when those aren't present uh through things like cbt for psychosis might reduce the strength of those sensory uh prior so this is an idea this is an example of how",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1399.863,
    "end": 1409.645,
    "text": " the interaction with the social environment might actually have an impact on the computational mechanisms underlying the development and maintenance of psychotic symptoms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1411.87,
    "end": 1414.716,
    "text": "And then we sort of said, okay,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1414.831,
    "end": 1417.315,
    "text": " This is a sort of an idea about treatment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1417.836,
    "end": 1422.843,
    "text": "We have an idea about what the symptoms are computationally when they're present.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1423.424,
    "end": 1427.551,
    "text": "How about symptom development?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1428.312,
    "end": 1437.987,
    "text": "So we recently published in Biological Psychiatry a theory of psychotic symptom development.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1437.967,
    "end": 1457.983,
    "text": " um and so uh here we really did try and integrate across the different levels of explanation from the cellular all the way to the behavioral and the story we came up with was this we know in the beginning of psychosis that there are changes neurobiologically that seem to have a strong impact on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1457.963,
    "end": 1462.329,
    "text": " cortical excitability and just the noise available in cortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1462.529,
    "end": 1464.933,
    "text": "Cortex degenerates and degrades in many cases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1465.293,
    "end": 1468.117,
    "text": "White matter tracts are not as integral as they used to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1468.157,
    "end": 1471.923,
    "text": "So information is less precise in the brain than it should be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1471.943,
    "end": 1486.924,
    "text": "So the idea was through things like the hypofunction of NMDA receptors and later on dopamine dysregulation, you get hyper excitability and decrease signal to noise radio in cortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1487.208,
    "end": 1489.945,
    "text": " ratio in cortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1490.046,
    "end": 1494.332,
    "text": "This leads to aberrant prediction errors, inappropriate learning,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1495.24,
    "end": 1521.197,
    "text": " the inappropriate learning gives us delusional formation because we learn priors that aren't necessarily properly coherent with the evidence because the learning process has been sort of poisoned by prediction errors, by aberrant prediction errors, prediction errors that are really based on appropriate sensory information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1521.548,
    "end": 1540.452,
    "text": " So you start forming your delusions and you start estimating a higher environmental volatility because you learn over time that the environment is not providing precise information because it's being funneled through a very noisy cortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1540.472,
    "end": 1548.822,
    "text": "And so your impression of that is that the environment itself isn't precise since you don't really know that your own cortex is not precise anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1549.291,
    "end": 1578.252,
    "text": " um all over all of this over time leads to a compensatory increase in prior strength which um probably is is uh is computationally manifested at least in part by dopaminergic dysregulation and the hyper dopaminergic state that we see in many patients who develop hallucinations and delusions and then you get your delusional conviction so you actually believe the delusions that you that you've started to generate um and then you generate uh hallucinations as well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1578.232,
    "end": 1589.457,
    "text": " with the idea that the hallucinations probably are a reaction to the delusion formation so you probably have your odd beliefs first and the hallucinations are generated um sort of with the delusions as a prior to those hallucinations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1590.635,
    "end": 1599.267,
    "text": " And we have several hypotheses that come from this directly that we could test with neurobiological and other tests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1599.768,
    "end": 1609.181,
    "text": "One of them was that we expected delusions to emerge before hallucinations, which we actually showed to be the case in a companion paper to this from three different data sets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.103,
    "end": 1620.237,
    "text": "Hallucinations usually for most patients emerge after delusions, which is in keeping with at least part of our model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.638,
    "end": 1627.404,
    "text": " One thing that, however, isn't covered in that model is affect and the interpersonal aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1628.104,
    "end": 1629.125,
    "text": "And why is that important?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.346,
    "end": 1639.154,
    "text": "It's important because if it was just noise, there's nothing to say that that noise should be negatively valenced, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1639.494,
    "end": 1650.544,
    "text": "If it's just a question of aberrant prediction errors because of random cortical noise, well, you would expect to have as many positive as negative hallucinations, as many positive as negative delusions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1650.828,
    "end": 1651.809,
    "text": " That's not what we see.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1651.989,
    "end": 1667.727,
    "text": "What we see is quite precisely that in patients, people with diagnosed illness, you actually have far more negative levalence to hallucinations and delusions than you do have positively or neutrally valence hallucinations or delusions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1668.648,
    "end": 1674.255,
    "text": "Generally, these are experienced as negative and not just scary because it's happening, but the content is negative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.315,
    "end": 1679.14,
    "text": "So it's not like you're hearing a sound and you're scared because you're hearing a sound that isn't there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1679.2,
    "end": 1680.582,
    "text": "I mean, that does happen, but",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1680.562,
    "end": 1687.71,
    "text": " The classical descriptions are the words I'm hearing the voice tell me are themselves negative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.81,
    "end": 1697.48,
    "text": "It's telling me that I'm bad or that I'm useless or worthless or that I should kill myself or that somebody wants to probe my brain or what have you, or the NSA is watching me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1698.661,
    "end": 1705.008,
    "text": "They are, or in Montreal, a common one is that the mafia is after me because we have a mafia problem in Montreal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1705.028,
    "end": 1709.893,
    "text": "It's quite specific to the location you're in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1710.211,
    "end": 1714.821,
    "text": " So the valence of the experience itself is negative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1715.223,
    "end": 1743.728,
    "text": " and so we kind of built an addition to this model that we're going to talk about now which really focused on the affective component and you know we looked at previous handling of affect and computational psychiatry we looked at reinforcement learning drift diffusion modeling active inference and hierarchical Gaussian filter models active inference actually has done a lot of work or rather there's a lot of active inference work especially by Ryan Smith on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1743.708,
    "end": 1758.671,
    "text": " modeling of affect, probably more than most other and more comprehensively than most other modeling approaches, though, as often happens in active inference with less empirical validation, which is sad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1759.793,
    "end": 1763.539,
    "text": "Though Ryan has done a lot of good work in empirically validating a lot of his models.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.869,
    "end": 1779.846,
    "text": " The idea is that a lot of these models see affective states as a dynamic modulation of current and future expectations, intimately linked with interoception and individual differences in emotional awareness, and to be both state and trait-like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.866,
    "end": 1783.591,
    "text": "So you can feel a certain way in the moment and also have a mood over a longer time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1785.413,
    "end": 1791.64,
    "text": "There wasn't as much of a focus, however, on how affect and social interactions interact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1792.06,
    "end": 1793.442,
    "text": "And we know, you know, from",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.248,
    "end": 1800.48,
    "text": " Anybody who's spoken to other human beings, interactions with other people certainly has an effect on our mood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1801.462,
    "end": 1801.943,
    "text": "My apologies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1805.129,
    "end": 1808.636,
    "text": "So we actually built a new version of our model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1808.977,
    "end": 1811.582,
    "text": "It has all the pieces that we talked about previously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.95,
    "end": 1826.466,
    "text": " um but essentially we added an affective component so in our new conceptualization you have as we talked about degradation of cortical neural signals and increased expected sensory noise which not only",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1826.902,
    "end": 1836.358,
    "text": " provides the soup in which you can develop delusions and hallucinations, and that is permissive to those, but also directly affects affective states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1836.498,
    "end": 1850.462,
    "text": "Which makes sense, because if you think about papers like the affective papers by Smith and Hesp, knowing that one's model of the world is imprecise,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1850.763,
    "end": 1874.205,
    "text": " um is going to lead to a negative effective outcome because we would like to have precise models of the world if we find ourselves in a state in which our model of the world is not precise because we are not because our our cortical machinery is not precise so we're not able to integrate sensory information very very effectively we're going to notice this and we're going to have negative out affect as a as a result",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1874.185,
    "end": 1887.539,
    "text": " The other idea we had was that, and this is the disconnection hypothesis that Carl has written a lot about, we know that there's degradation of connections between temporal and frontal regions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1888.159,
    "end": 1900.412,
    "text": "Generally speaking, when that happens, because a lot of the emotional stuff is in the temporal lobe and it's being regulated by the frontal lobe, if you don't have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1900.612,
    "end": 1908.443,
    "text": " effective connectivity between those regions, there may be sort of an overabundance of negative affect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1908.864,
    "end": 1910.486,
    "text": "So we have a negative affective state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1910.907,
    "end": 1917.676,
    "text": "This negative affective state actually then does exactly what affect has been shown to do in many other computational modeling approaches.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1918.497,
    "end": 1921.041,
    "text": "It will bias your expectations of the future, which makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1921.081,
    "end": 1925.387,
    "text": "If we expect bad things to happen, we will take actions that will align with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1925.367,
    "end": 1927.377,
    "text": " of that expectation to protect ourselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1928.021,
    "end": 1930.956,
    "text": "So our expectations, our priors become more and more negative over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1931.476,
    "end": 1957.517,
    "text": " normally we would have our observations to rescue this so if you know we we have a bad day we're not somebody who has psychosis we have a bad day um we should be able to over the next couple of days if good things happen kind of recalibrate our expectations of the future but if our if our our likelihood precision is low and we can't use information uh effectively we may not be able to recalibrate as effectively in addition",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1957.497,
    "end": 1963.186,
    "text": " affect has been shown to modify how we explore the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1963.206,
    "end": 1968.174,
    "text": "And the idea here being that we are probably going to be negatively biasing our exploration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1969.015,
    "end": 1971.68,
    "text": "We're going to be expecting negative outcomes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1971.74,
    "end": 1976.387,
    "text": "We will be looking out for negative outcomes because they're generally worse for us than positive outcomes are good for us, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1976.407,
    "end": 1981.395,
    "text": "If there's a line in the forest, that's more important not to miss than a cookie on the ground.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1981.375,
    "end": 2005.071,
    "text": " um and so we're going to be biased also towards uh negative uh interpretations of the world and and and exploring negative outcomes and ignoring the positive ones um this leads to a more and more and more negative uh posterior um which uh affects our long-term beliefs because if we keep in the moment experiencing negative",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2005.372,
    "end": 2018.366,
    "text": " beliefs about what's going on that's going to change our long-running priors, which over time might cause us to socially isolate and eventually become the priors that lead to hallucinations and delusions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2018.687,
    "end": 2022.216,
    "text": "And this is why patients have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2022.449,
    "end": 2024.893,
    "text": " specifically negatively valence hallucinations and delusions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2025.293,
    "end": 2034.808,
    "text": "Interestingly, in people who are healthy voice hearers, you don't get a lot of negative affect and often their hallucinations and delusions are much more positive or they're more spiritual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2034.828,
    "end": 2039.715,
    "text": "They're not disabling because they're not associated or not as this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2039.695,
    "end": 2044.943,
    "text": " Obviously, some people still struggle, but they're not clinical people by definition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2044.983,
    "end": 2053.435,
    "text": "So generally speaking, they're functional, and they have much more positive or healthy, in many cases, relationships with their experiences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2053.936,
    "end": 2065.433,
    "text": "And so one hypothesis for why this might be would be that they don't have the cortical degeneration that leads to the negative affect that leads to the specifically negatively valenced priors over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.987,
    "end": 2076.859,
    "text": " and why they can go about their lives being spirit mediums or what have you and living normal, happy, fulfilling lives in people with schizophrenia, not so much when it comes to their hallucinations and delusions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2078.363,
    "end": 2080.249,
    "text": "So it's not the hallucination itself",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2080.685,
    "end": 2082.168,
    "text": " That becomes the focus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2082.209,
    "end": 2087.301,
    "text": "It's really the affective and functional outcomes, which is, I think, a much more humane way of approaching it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2087.341,
    "end": 2089.145,
    "text": "I tell patients this all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2089.205,
    "end": 2097.765,
    "text": "If they come to me and they have a hallucination and it doesn't bother them and they don't care, it doesn't affect their daily life or they have a positive association with it,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2098.167,
    "end": 2125.93,
    "text": " i don't really care it doesn't really bother me i treat symptoms that's not a symptom in my opinion right i have a patient actually who has schizophrenia a very mild case but she's doing very well um we treated her for her very negative hallucinations and over time she had one voice left that became a positive voice she was able to shift it into a a positive kind of friend that she can bounce ideas off of and that doesn't bother her when she doesn't want to bother her and i looked at her and i said",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2125.91,
    "end": 2129.715,
    "text": " I mean, if you want, we can keep increasing the dose of your medication until it's gone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2129.775,
    "end": 2132.638,
    "text": "But I don't know if we need to, if your life is fine right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2132.658,
    "end": 2134.661,
    "text": "And she said, I honestly am okay with it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2134.801,
    "end": 2135.402,
    "text": "And we left it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2135.502,
    "end": 2138.906,
    "text": "And she's fine and happy with that voice remaining.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2139.447,
    "end": 2140.909,
    "text": "She's very open about it, talks about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2141.249,
    "end": 2147.357,
    "text": "And it doesn't, for me, it's not a symptom if it's not causing her distress, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2147.697,
    "end": 2149.96,
    "text": "And I think it's because we were able to help her",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2150.513,
    "end": 2172.623,
    "text": " change her affective view of the symptoms her experience of those symptoms and her brain also I think was more intact than most patients and she was able to we also treated her very quickly and she was we were able to to make that change and she she's having a better outcome because of it so in summary",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2172.923,
    "end": 2178.252,
    "text": " computational psychiatry can be used to integrate across multiple levels of explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2179.394,
    "end": 2182.879,
    "text": "We can link the social, neurobiological, and individual levels of explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2182.939,
    "end": 2187.667,
    "text": "The core next step, of course, is empirical validation development of novel treatments based on all of this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2188.388,
    "end": 2194.999,
    "text": "And we have the two recent reviews that are both up and available to read.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2194.979,
    "end": 2200.369,
    "text": " in those we have generated very specific model predictions for empirical validation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2200.43,
    "end": 2204.017,
    "text": "So both from a computational standpoint, but also phenomenologically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2204.417,
    "end": 2211.992,
    "text": "Like we actually say, for example, if this model is true, we expect that if you treat patients who are at risk for psychosis,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2211.972,
    "end": 2226.235,
    "text": " for their negative effect during the risk period, we don't necessarily expect that to stop transition to psychosis, but we expect the intensity and the negativity of the psychotic phenomena to be less negative and less intense when psychosis does onset.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2226.535,
    "end": 2240.41,
    "text": " So that's a very specific prediction that is probably only true if the affect really has something to do with the valence of the priors which drive the hallucinations afterwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2241.271,
    "end": 2247.839,
    "text": "We're also working on an affect diversion of the conditional hallucinations task, the one that Dr. Powers developed that I talked about before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2248.76,
    "end": 2255.327,
    "text": "And the results so far seem to be consistent with the idea that prior beliefs,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2255.307,
    "end": 2264.862,
    "text": " about negative things are kind of privileged in patient populations compared to prior beliefs about negative things and will lead to more hallucinations and higher prior weighting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2266.377,
    "end": 2289.027,
    "text": " um and that my friends is uh is that um before we finish up and and ask uh people to ask questions um i try to keep it to 45 minutes so that we have time for questions um i'd like to invite everybody who's here um to the sixth international workshop on active inference october 15th to 17th in montreal canada where i am",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2289.682,
    "end": 2294.271,
    "text": " It is the first time that this conference is happening in North America.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2294.812,
    "end": 2296.675,
    "text": "So all of those of you from North America, please come.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2298.559,
    "end": 2300.442,
    "text": "It will be lovely to have you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2300.482,
    "end": 2306.994,
    "text": "And it's a premier conference on active inference, of course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2307.395,
    "end": 2308.677,
    "text": "We'll be having a lot of great speakers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2308.737,
    "end": 2310.12,
    "text": "Carl will be there in person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2310.809,
    "end": 2313.092,
    "text": " So if you want to meet Carl in person, this is your chance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2313.172,
    "end": 2317.877,
    "text": "He doesn't get out often much anymore by his own admission.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2318.037,
    "end": 2320.06,
    "text": "So if you want to meet Carl in person, come.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2320.56,
    "end": 2328.369,
    "text": "But we'll also be having Ryan Smith, Chris Mathis, and a number of other wonderful speakers on the Bayesian brain and active inference who'll be present.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2329.751,
    "end": 2331.232,
    "text": "I am one of the co-chairs of the conference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2332.734,
    "end": 2334.616,
    "text": "We put in a bid for Montreal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2334.636,
    "end": 2335.197,
    "text": "We won.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2335.177,
    "end": 2338.967,
    "text": " which is great but also terrifying because we have to fill the seats.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.167,
    "end": 2340.751,
    "text": "So please register.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2340.811,
    "end": 2345.102,
    "text": "Early Bird is still available until the 28th.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2345.825,
    "end": 2348.527,
    "text": " We extended the early bird period.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2348.547,
    "end": 2350.99,
    "text": "So if you go on the website, you don't see the early bird extension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2351.01,
    "end": 2351.41,
    "text": "It's fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2351.55,
    "end": 2352.291,
    "text": "The links work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2352.991,
    "end": 2355.093,
    "text": "You can buy your tickets up until next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2356.475,
    "end": 2359.237,
    "text": "So please get them because the price does go up afterwards.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2359.918,
    "end": 2362.42,
    "text": "And we'd love to see you in Montreal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.241,
    "end": 2365.363,
    "text": "The call for submissions is still open.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2365.403,
    "end": 2367.885,
    "text": "You can submit extended abstracts or full papers as you wish.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2368.686,
    "end": 2375.832,
    "text": "And we expect that the majority of submissions, if they're not selected for talks, will at least be selected for an abstract",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2375.812,
    "end": 2405.11,
    "text": " we can't commit we can't promise that obviously if somebody produce something that our peer reviewers do not like that it won't get in but most things will at least be an abstract so please do um submit and we look forward to seeing you in Montreal um and the website is just if you if you Google IY I I W I W AI 2025 you will find it um it's it's a GitHub website um that's it awesome thank you questions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2405.697,
    "end": 2405.998,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2406.701,
    "end": 2406.962,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2407.363,
    "end": 2408.507,
    "text": "Those are the live chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.527,
    "end": 2413.887,
    "text": "Please feel free to write more questions and I will just read them from the top.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2413.907,
    "end": 2414.509,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.569,
    "end": 2418.111,
    "text": " Andrew P. writes, Very exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2418.131,
    "end": 2419.612,
    "text": "Thank you for the presentation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.933,
    "end": 2422.275,
    "text": "Always on the search for measurable substrates here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.935,
    "end": 2427.439,
    "text": "You briefly mentioned the relationship between gamma and dopaminergic activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.0,
    "end": 2431.903,
    "text": "I've been fascinated by the prospect of aligning model components with neurotransmissions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2432.704,
    "end": 2444.614,
    "text": "The Active Inference Pardol textbook provides a table on some potential evidence for likelihood precision being more relatable to acetylcholine or serotonin for interoceptive likelihood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2444.594,
    "end": 2450.605,
    "text": " any thoughts on this or other neurotransmitter cognitive relationships",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2451.023,
    "end": 2451.724,
    "text": " Yeah, for sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2451.824,
    "end": 2471.644,
    "text": "So I think the two big ones we often talk about are, I guess, three, if you count the serotonin for the interception, are the dopamine for prior precision and the acetylcholine for attention and likelihood precision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2472.164,
    "end": 2474.146,
    "text": "Likelihood precision by means of attention, essentially.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2474.166,
    "end": 2479.191,
    "text": "It's how you manipulate attention, and so you can deploy it in different places.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2479.171,
    "end": 2509.178,
    "text": " and what's really fun about that is that you could theoretically deploy it differentially so you could have uh deployment of attention to specific stimuli but not others um which is relevant because we can we can orthogonalize things in active inference so it's nice in that way um so i think those are the big ones i think there is some empirical validation with the dopamine one the acetylcholine is i think a little bit more uh theoretical in nature um but uh but that is the the story and i i think it's interesting when you think about the fact that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2509.158,
    "end": 2521.344,
    "text": " You know, in some of the dementias, we have acetylcholine reduction, and you have hallucinations and delusions that are often a bit different than you get in psychosis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2521.384,
    "end": 2523.488,
    "text": "There are similarities, but also differences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2523.772,
    "end": 2545.122,
    "text": " um uh you know uh that that might be lead to them being more sort of likelihood driven than prior driven um at least in certain cases um the um other interesting thing is is is as i mentioned the uh xenomyelin atrospium the new antipsychotic is actually a procholinergic",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2545.102,
    "end": 2573.927,
    "text": " uh antipsychotic uh and it's also the uh the only other really significantly prochloric antipsychotic at least that i use commonly is clozapine which is the best antipsychotic um which has a bit of uh cholinergic agonist effect um and that may be why it's so good we don't know clozapine is a very dirty drug it basically touches every receptor so we don't really know why it works but it works um and so i think uh it's important",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2574.363,
    "end": 2600.539,
    "text": " to do more empirical studies pet studies would be good for this kind of thing but that requires you know money and expertise in in that in those methodologies what's really relevant is making sure that one does not get too wrapped up in just the neurotransmitter story so one idea that we've had in the past was there is probably a component",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2600.806,
    "end": 2605.455,
    "text": " that is neurotransmitter and a component that is structural, right, or that is circuit based.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2606.057,
    "end": 2613.491,
    "text": "So that's why, you know, if you don't get full resolution of your symptoms with a neurotransmitter change, don't get too sad.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.872,
    "end": 2618.241,
    "text": "But it's because it's probably because there's also a structural effect on the circuit as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2618.558,
    "end": 2634.424,
    "text": " um and so you may need to think about decomposing your computational terms into a neurotransmitter sensitive and neurotransmitter insensitive term like for example for likelihood precision you could have the acetylcholine responsible for a certain percentage of that and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2634.404,
    "end": 2643.666,
    "text": " the sort of white matter attractor or great matter degeneration responsible for another percentage of time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2643.686,
    "end": 2651.185,
    "text": "And the sort of other component that I think is relevant to that would be... I lost my train of thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.205,
    "end": 2651.445,
    "text": "It's fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.465,
    "end": 2651.726,
    "text": "Continue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.766,
    "end": 2652.227,
    "text": "Next question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2653.608,
    "end": 2679.7,
    "text": " great yeah that speaks like partitioning variants across different levels of analysis different subsystems and taking the total overall cognitive or phenotypic variants and then looking at how certain parts have like additive or interactive effects as we get different measurements across different levels but like that came up in for example insect research",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2679.68,
    "end": 2687.287,
    "text": " Because for a fruit fly, the affinities for a given drug might be known, or there might even be designer drugs or transgenic lines.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.667,
    "end": 2693.873,
    "text": "Whereas for most insects, the affinities for different pharmaceuticals to the receptors is just not even known.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2694.493,
    "end": 2701.119,
    "text": "So then it's like, well, then how do you think about what the effects are when there's these uncertainties around affinities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2701.159,
    "end": 2705.163,
    "text": "But even if you knew the affinities perfectly, it's like there's like secondary signaling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.703,
    "end": 2709.687,
    "text": "So there's so many parts, and yet those are intervention points empirically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.667,
    "end": 2714.736,
    "text": " that actually do very naturally and open themselves up to causal intervention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2715.136,
    "end": 2732.667,
    "text": "So it's like not hopeless, but it has this whole biological complexity, which is why having the interoperable generative models where you can actually talk about mixing and blending across those levels, that's kind of why those model formats matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2733.769,
    "end": 2734.51,
    "text": "Yes, I agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2735.907,
    "end": 2744.605,
    "text": " Okay, another question from Andrew, who wrote, Does a notion of trust come up in your research, e.g.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2744.625,
    "end": 2746.609,
    "text": "for understanding or treating psychosis?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.152,
    "end": 2754.625,
    "text": "I suppose it does implicitly if the patient is unsure if they can trust sensory stimuli, but I suppose in a social sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2756.09,
    "end": 2767.882,
    "text": " Yeah, so I think it depends at what level, because the other point, right, is that I'm presenting these parameters as if they were singular things, but really they're played out over hierarchies in the brain, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2768.622,
    "end": 2777.271,
    "text": "And just because of time and also the complexity, I kind of pretended they were singular things, but they're not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.512,
    "end": 2782.536,
    "text": "So yes, trust does certainly play a role at the sort of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2782.904,
    "end": 2803.326,
    "text": " almost metacognitive level of what is it that i'm thinking about right and where where can i place my trust and not but the sensory precision story goes all the way down to sort of the very basic like intactness of information right so there's a low precision on information because of low confidence",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2803.694,
    "end": 2813.764,
    "text": " at a very low level, and then there's higher level low confidence probably that's been shaped over time by that lower level lack of confidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2815.105,
    "end": 2818.308,
    "text": "But I think, yes, for sure trust does play a role.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2818.469,
    "end": 2831.001,
    "text": "Many patients are very untrusting, especially when they're acutely psychotic, usually because they seem to have learned that the environment is not trustworthy and the only thing they can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2830.981,
    "end": 2838.676,
    "text": " resolve uncertainty with is their own prior beliefs, which clearly makes it difficult to have a trusting conversation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2838.697,
    "end": 2848.416,
    "text": "You have to build that over time, sort of gently introduce a bit more precision into the hierarchy until they see you as a precise source of information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2851.062,
    "end": 2873.948,
    "text": " yeah that reminds me of the kind of work like in altered states of consciousness and mapping out spaces where it's like i'm sure i'm seeing this rare animal or like i'm surprised i'm seeing this common thing or i'm not certain but it's familiar so there's all these different intersecting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2873.928,
    "end": 2891.093,
    "text": " precisions and and beliefs about beliefs which is kind of why again like the cognitive model um is important to to have and to build variants of and another part i thought was really interesting about the models was uh there was a part about the policy precision",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.562,
    "end": 2897.369,
    "text": " So that would, and also I think adding or changing the affordance space or the policy space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.21,
    "end": 2920.118,
    "text": "So just interesting that, that, um, there could be different steps or parts of the system, like the sensory precision or signal might be a, um, peripheral pathology or damage or just variation, but that is a totally different situation than.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2921.802,
    "end": 2924.729,
    "text": " memory-mediated changes in belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2925.731,
    "end": 2930.543,
    "text": "And then all of that is, again, kind of factorized off from what is done about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2931.746,
    "end": 2939.625,
    "text": "What is in the persons or whatever the systems... What's the probability distribution of their action outputs...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2939.605,
    "end": 2958.323,
    "text": " and so certain things depending on sensitivities that that could be exaggerated or um even like take a a counter seeming response so then i think that is like the challenge that you brought up at the beginning well what space optimal about that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.505,
    "end": 2961.608,
    "text": " But that's how that whole space is mapped.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2962.869,
    "end": 2963.29,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2963.31,
    "end": 2970.637,
    "text": "Under that tautological assumption, like, well, whatever it is, that will be the base optimal for what it is, but what is it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.899,
    "end": 2972.099,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2972.68,
    "end": 2972.84,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2973.16,
    "end": 2973.701,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2974.081,
    "end": 2974.381,
    "text": "For sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2977.164,
    "end": 2982.289,
    "text": "Is there anything you're, like, wanting to add about where you're going to take it, or anything else you want to say about IY?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.57,
    "end": 2986.774,
    "text": "Uh...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2990.146,
    "end": 2998.883,
    "text": " I mean, I guess in terms of where we want to take it, what we really want to do is longitudinal studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3000.947,
    "end": 3010.686,
    "text": "We have all these ideas of the different parameters that are going to be influenced at different stages and how they're reacting with each other longitudinally through time, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3010.666,
    "end": 3023.626,
    "text": " This whole longitudinal aspect is something that is been obviously discussed, but we don't really have good, aside from a couple by Ryan Smith, longitudinal studies of computational parameters in patients.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3023.887,
    "end": 3026.431,
    "text": "It's just not something that we've done because you need money for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3026.471,
    "end": 3036.707,
    "text": "And our field has been able to do really, really cool cross-sectional studies and a couple of sort of longitudinal studies, but not so many kind of like large cohort studies over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3037.43,
    "end": 3042.597,
    "text": " And what we really want to do is we've built a battery of these tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3043.277,
    "end": 3050.266,
    "text": "In fact, if anybody's interested in using a battery of these tasks, we're looking for beta testers, if you're interested.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3051.888,
    "end": 3055.173,
    "text": "We had a small grant from McGill to build a computational battery.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3056.154,
    "end": 3057.736,
    "text": "It's ready-ish for testing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3057.756,
    "end": 3059.598,
    "text": "We're just fixing a couple of last bugs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3060.319,
    "end": 3061.961,
    "text": "There's four different tasks that are in there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3062.582,
    "end": 3065.546,
    "text": "A fifth one is on its way, and then we're going to be adding in all the modeling as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3066.427,
    "end": 3067.268,
    "text": "And you've got everything for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3067.99,
    "end": 3069.633,
    "text": " all the outputs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3070.555,
    "end": 3080.717,
    "text": "And so the idea would be to use this battery, which measures different parameters in tasks across time,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3080.967,
    "end": 3092.138,
    "text": " in different populations with different risk profiles for psychosis to see if we're actually right about the sequence of onset, the sequence of events that we are describing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3092.818,
    "end": 3108.493,
    "text": "Because it would be really nice to be able to say, yes, in fact, we do see an increase in sensory noise over time, and we do then see after a lag period, priors increasing, and after a lag period, expected environmental volatility is increasing, and it's matching up with what we expect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3108.98,
    "end": 3112.846,
    "text": " So we've been trying to get that funded for the last year and a half.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3112.866,
    "end": 3115.05,
    "text": "It has not yet succeeded, but we are working on it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3115.43,
    "end": 3118.715,
    "text": "We were funded at least to turn some of these tasks into a proper video game.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3118.776,
    "end": 3119.276,
    "text": "That was fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3119.336,
    "end": 3130.414,
    "text": "So we're going to be working on developing a computational video game of tasks that kind of like, for example, you can turn the conditionless nations task into avoiding a dragon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3130.394,
    "end": 3131.757,
    "text": " which is kind of fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.639,
    "end": 3143.104,
    "text": "But anyways, I think the future really isn't getting good longitudinal data and making sure that what we have really does map onto how symptoms evolve over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3144.282,
    "end": 3150.931,
    "text": " And then with that, the neurobiological validation in subsamples of those samples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3152.013,
    "end": 3155.377,
    "text": "So that's the future work, assuming that someone gives us money to do it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3155.417,
    "end": 3167.033,
    "text": "If anybody out there is a funder who is listening in on this and has a couple million extra bucks that they gotta spend before the end of the year, hit me up, I'm ready to spend it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3167.08,
    "end": 3172.467,
    "text": " And if not, please do come to join us at IY.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3172.747,
    "end": 3175.851,
    "text": "It'll be a lot of fun to see all of you guys that I can't see right now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3176.772,
    "end": 3180.436,
    "text": "And we're going to have a really, really, really good conference this year.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3180.496,
    "end": 3181.718,
    "text": "Go check out the website.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3181.738,
    "end": 3182.739,
    "text": "It's a fantastic lineup.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3183.62,
    "end": 3187.845,
    "text": "And I think I would just love to see many registrations after today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3188.706,
    "end": 3190.528,
    "text": "And remember, early bird ends next week.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3190.548,
    "end": 3191.59,
    "text": "So go get your tickets.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3193.071,
    "end": 3196.075,
    "text": "You can register and then submit your paper later if you want, but register.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3197.152,
    "end": 3200.418,
    "text": " We need to know that we have enough butts and seats to fill the space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3202.802,
    "end": 3203.002,
    "text": "Good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3203.523,
    "end": 3203.764,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3204.104,
    "end": 3204.825,
    "text": "That's all from me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3205.326,
    "end": 3205.707,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3206.028,
    "end": 3208.552,
    "text": "Well, thank you for the presentation and for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.592,
    "end": 3211.317,
    "text": "Also wishing you the best for IY.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3211.697,
    "end": 3213.12,
    "text": "So till next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.14,
    "end": 3213.34,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.202,
    "end": 3214.643,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.703,
    "end": 3215.464,
    "text": "Take care.",
    "speaker": "SPEAKER_00"
  }
]