[
  {
    "start": 1.347,
    "end": 19.104,
    "text": " Hello everyone, I just wanted to jump on before the podcast starts, just to give you a prior warning that unfortunately, for a reason that I haven't been able to discern, Ronnie's video is a little jumpy, it's not particularly smooth, so you would notice that anyway, but I wanted to give you a heads up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 19.685,
    "end": 31.236,
    "text": "Obviously if you find it too much, don't watch the video, but it's a wonderful conversation, so please don't miss out, and yeah, you'll enjoy whether you're watching it or listening to it, but yeah, just wanted to let you know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 31.317,
    "end": 32.418,
    "text": " Okay, enjoy the episode.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 37.662,
    "end": 41.286,
    "text": "Hello, everyone, and welcome back to Active Inference Insights.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.666,
    "end": 43.908,
    "text": "I'm your host, as always, Darius Parvizi-Wayne.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.408,
    "end": 47.151,
    "text": "And today I'm thrilled to be able to speak to Ron Sladke.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 47.731,
    "end": 54.377,
    "text": "Ron is a cognitive neuroscientist at the University of Vienna, Austria, where he teaches courses on cognitive science and predictive processing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 55.037,
    "end": 60.362,
    "text": "His research focuses on the amygdala as well as emotion processing and social cognition in the human brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 60.747,
    "end": 72.407,
    "text": " In addition to this, he has been part of a team developing real-time fMRI, or functional magnetic resonance imaging, where people can learn to regulate their own brain states while they are inside the MRI scanner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.427,
    "end": 73.83,
    "text": "Ronny, welcome to the show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 73.87,
    "end": 75.573,
    "text": "Thank you so much for joining me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 75.693,
    "end": 79.96,
    "text": "It's really exciting to have a proper, fully fledged neuroscientist on the show.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 79.98,
    "end": 81.603,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 81.623,
    "end": 83.346,
    "text": "It's really a pleasure to be here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.714,
    "end": 93.166,
    "text": " So part of the reason why I wanted to have you on is because you wrote this fascinating paper grounding what you called the amygdala complex in active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 93.967,
    "end": 95.348,
    "text": "And I have plenty of questions about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.369,
    "end": 108.625,
    "text": "But before we actually go there, I thought an interesting starting point is that one very rarely meets people who teach active inference and predictive processing, at least in my experience within universities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.077,
    "end": 117.105,
    "text": " It's kind of like, oh, there's this little thing that started emerging and there are these kinds of, um, esoteric people studying, but let's not worry too much about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.145,
    "end": 121.5,
    "text": "Let's talk about reinforcement learning or, or something a little bit more accepted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.155,
    "end": 127.481,
    "text": " What's the reception been like teaching predictive processing and active inference within your courses?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.463,
    "end": 129.944,
    "text": "Okay, that's a good question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 130.385,
    "end": 136.192,
    "text": "I mean, I think it only works because of the master program that we have in Vienna.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 136.833,
    "end": 140.557,
    "text": "So we have an interdisciplinary master program in cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 140.577,
    "end": 146.104,
    "text": "So I was one of the first students actually studied this back in 2007, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 146.405,
    "end": 151.773,
    "text": " And so it's located at the philosophy faculty, but it's interdisciplinary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 151.793,
    "end": 159.264,
    "text": "So we have some kind of core seminars and then sent out to all the different institutes, say neuroscience or behavioral biology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 159.765,
    "end": 167.637,
    "text": "And we just take lectures there and do our exams there and then come back to the philosophy department and then try to integrate everything we've heard.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 167.617,
    "end": 176.251,
    "text": " So there has always been this kind of curiosity to say, okay, we take up students coming from different backgrounds with different bachelor's degrees.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 176.572,
    "end": 178.896,
    "text": "So my bachelor's was in computer science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 179.897,
    "end": 187.65,
    "text": "And then we basically want them to reflect on the paradigms that they are using.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 187.833,
    "end": 191.538,
    "text": " Back then, the most recent paradigm was actually for eCognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 191.798,
    "end": 194.102,
    "text": "And from there we kind of moved on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 194.382,
    "end": 202.273,
    "text": "And so they asked me to teach now the new trends in cognitive science seminar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 202.353,
    "end": 204.937,
    "text": "And this was then about predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 205.557,
    "end": 206.098,
    "text": "Fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 206.278,
    "end": 209.363,
    "text": "Around what year did they ask you to do that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.264,
    "end": 212.507,
    "text": "So, I mean, I started with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 212.673,
    "end": 239.17,
    "text": " let's say predictive processing in about 2009 or something a while and so actually it was already inspired early on but after reading uh on intelligence by jeff hawkins so i stumbled on this book it was yeah a little bit outside the typical canon in cognitive science but i stumbled on it and i thought this idea very interesting this idea of predictive coding and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 239.707,
    "end": 248.859,
    "text": " Then the interest actually grew in 2009, 2010, and I was kind of familiar with the early writings of Carl Fristen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 249.5,
    "end": 255.068,
    "text": "And from there on, I started to tell people, hey, guys, this is, I think, the next big paradigm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 255.528,
    "end": 261.917,
    "text": "And at some point I was able to convince people in Vienna to give me a course on this topic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 262.1,
    "end": 292.039,
    "text": " it grew from there and every year i've got 25 new students and teach them wow that's fantastic uh that's super cool i mean i was at ucl and again i'm not gonna badmouth ucl they gave me a very good education this was for my masters uh as i said interestingly although carl's there and chris friff and all these people who are very seminal in the creation of active inference very little so i think that's really encouraging that you guys are teaching it um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 292.593,
    "end": 308.782,
    "text": " That said, obviously there are some fantastic resources out there online, whether it's the textbook, whether it's, uh, something like Ryan Smith's tutorial, but that's how have you seen the, I'm curious about how you've seen the kind of transformation in the acceptance of active inference as an idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 309.223,
    "end": 316.255,
    "text": "Cause I presume back in sort of 2009, 2010, when people were still talking about feed forward models, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 316.471,
    "end": 323.562,
    "text": " you know, it was probably frowned upon that the brain was constructing its experience and there was a so-called controlled hallucination going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.602,
    "end": 328.349,
    "text": "So how, you know, what was that process like of people coming on, coming on side?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 329.29,
    "end": 330.031,
    "text": "Oh, absolutely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 330.071,
    "end": 332.775,
    "text": "I mean, I was somehow caught between the lines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 332.796,
    "end": 344.453,
    "text": "So, I mean, I was coming from my cognitive science background to say, okay, let's, um, you know, uh, get over with behaviorism and cognitivism even, and, and, you know, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 344.433,
    "end": 346.436,
    "text": " move towards 4E cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 346.896,
    "end": 359.534,
    "text": "But at the same time, I had a very hard time to actually apply this to my work in cognitive neuroscience, because after my master program, I did a PhD in medical physics at the medical university.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 360.034,
    "end": 362.017,
    "text": "I was working together with physicists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 362.077,
    "end": 369.968,
    "text": "We mostly focused on neuroimaging, but also dynamic causal modeling then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 370.285,
    "end": 375.139,
    "text": " But they didn't really care for these ideas from cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 375.18,
    "end": 384.447,
    "text": "I mean, those four e-models that we tried to come up with back then, quite honestly, they were very useless for cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 384.95,
    "end": 391.798,
    "text": " And so they always knew, okay, I'm the guy who knows how to code and my computer science background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 391.838,
    "end": 393.079,
    "text": "I also worked in the industry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.52,
    "end": 396.624,
    "text": "They knew that they could give me some data and then I will make sense of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 396.684,
    "end": 401.609,
    "text": "And this is how they basically handled me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 402.41,
    "end": 409.118,
    "text": "But they knew that I had this kind of esoteric side coming from cognitive science, always questioning the paradigms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 409.098,
    "end": 411.822,
    "text": " not thinking that the brain is just reactive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 412.523,
    "end": 418.651,
    "text": "And then at one point I came up with my interest in predictive processing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 418.691,
    "end": 433.49,
    "text": "And finally, I mean, the big confirmation was when people like Carl and Andy Clark also started talking about it, then people realized, oh, okay, it's not only Ronnie saying something like this about predictive processing, it's also other people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 433.631,
    "end": 436.995,
    "text": "And this is how it got a little bit more accepted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.975,
    "end": 447.627,
    "text": " But honestly, there were basically two camps in Vienna, one very much into this kind of neo-behaviorism and the other one more for e-inspired incognito science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 447.647,
    "end": 452.093,
    "text": "And I was caught in the middle and now I try to, you know, bring those camps together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 453.294,
    "end": 453.815,
    "text": "Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.095,
    "end": 454.215,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.235,
    "end": 454.535,
    "text": "That's cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.555,
    "end": 454.716,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 454.776,
    "end": 461.764,
    "text": "So that must've been what sort of 2013, 2014 when the, you know, Andy Cox book came out and whatever next was published.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.784,
    "end": 464.968,
    "text": "And I guess that's when all the buzz around predictive processing emerged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.988,
    "end": 465.328,
    "text": "That's brilliant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 465.781,
    "end": 466.322,
    "text": " That's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 466.342,
    "end": 473.29,
    "text": "I, you know, it's, I love talking about the actual ideas, but I'm also fascinated in the kind of meta aspects of people fighting over their ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 474.011,
    "end": 482.582,
    "text": "Um, so, so yeah, so we had sort of 4E and then very strict computational counts and then active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 484.544,
    "end": 486.287,
    "text": "Just sticking with 4E and active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.307,
    "end": 491.273,
    "text": "Cause I feel like those are the two that are kind of spearheading cognitive science at the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 492.234,
    "end": 495.518,
    "text": "Do you sense that they're compatible?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 495.818,
    "end": 511.141,
    "text": " There's been a real tension, I would say, between sort of the traditional and activist cognition side and autopoetic side and more, let's say, representational forms of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 511.161,
    "end": 513.985,
    "text": "Where do you kind of see the middle ground there and their confluence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 515.347,
    "end": 517.169,
    "text": "Yeah, I think they're totally compatible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 517.49,
    "end": 523.699,
    "text": "Because, I mean, like I said, I'm coming from autopoiesis and this was the big...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 524.168,
    "end": 532.783,
    "text": " the big motivation actually to seek out a kind of model that somehow accommodates the ideas of auto crisis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 533.505,
    "end": 543.983,
    "text": "And so it was only natural for me to stumble on the free energy principle at some point and say, yeah, this is how I think we can interface those ideas too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 543.963,
    "end": 554.085,
    "text": " basically have something tangible to have something that can make experimental predictions in terms of how you interpret behavioral data, but also neuroimaging data and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 554.526,
    "end": 562.343,
    "text": "But at the same time in its foundation is already also integrated in the ideas of autopoiesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 562.323,
    "end": 564.668,
    "text": " and self-regulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 565.128,
    "end": 567.673,
    "text": "So this was already fine for me from the start.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 567.994,
    "end": 578.374,
    "text": "And now what I learn is that there are some semantic differences, I would say, where people say, no, no, no, this is not the kind of activism and embodied cognition that we want to have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 578.489,
    "end": 584.546,
    "text": " And yeah, I mean, for me, those differences are not so severe, I would say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 584.566,
    "end": 593.511,
    "text": "I would like to leave this debate to philosophers, where you say, OK, maybe it's just my too sloppy reading of the material.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 593.491,
    "end": 597.137,
    "text": " But in this foundation, I think it's totally compatible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 597.277,
    "end": 608.394,
    "text": "And I think if we work together and get the semantics right and what we actually want to achieve, I think we can come up with a very nice unified model to bring the whole cognitive science together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 608.895,
    "end": 609.616,
    "text": "Fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 609.636,
    "end": 610.438,
    "text": "I love the optimism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.818,
    "end": 613.322,
    "text": "I share it because I also love",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 613.741,
    "end": 624.411,
    "text": " The earlier work of Varela and Rosh and Thompson, and then, you know, Varela's later work in the nineties, actually trying to bridge the phenomenology with the neurology and the neuroscience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 624.471,
    "end": 626.032,
    "text": "And I think all of that stuff is fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 626.673,
    "end": 634.58,
    "text": "Uh, albeit incomplete that, that, as you say, like we're still working towards those generative passages, but, um, excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 635.941,
    "end": 637.602,
    "text": "And it's funny that you did physics as well, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 637.662,
    "end": 642.887,
    "text": "Because then you fold in the kind of so-called high roads to active inference and.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 643.913,
    "end": 649.37,
    "text": " the Bayesian mechanics and the Fokker-Planck equation and the Langevin's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 650.193,
    "end": 656.573,
    "text": "Was it cool to see all of that come into the picture given your mathematical background?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 657.582,
    "end": 684.315,
    "text": " so i have to say i'm not a real physicist i've worked with physicists so which means that all the ideas that i had i always discussed in uh in our coffee room and they always feedback on it so it had to make sense in the physical world but this doesn't necessarily mean that i understand what the uh planck equation is really about right so um yeah i have to admit um this is not my my um my biggest uh expertise in the field",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 684.565,
    "end": 685.065,
    "text": " Fair enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.386,
    "end": 685.826,
    "text": "Fair enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 686.167,
    "end": 686.787,
    "text": "Me neither.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 686.807,
    "end": 688.509,
    "text": "So let's not even go there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 689.189,
    "end": 696.917,
    "text": "I want to ask again, before jumping onto the amygdala, I thought this real time fMRI idea is fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.797,
    "end": 702.342,
    "text": "And I was really, I guess it's not it doesn't need to be too related to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 702.382,
    "end": 706.446,
    "text": "I guess the nice thing about this podcast is we can just as I said before we went on, go wherever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 707.166,
    "end": 709.028,
    "text": "How does that work?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 709.308,
    "end": 712.311,
    "text": "And why was real time fMRI",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 712.612,
    "end": 713.834,
    "text": " a historical challenge?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 713.854,
    "end": 715.596,
    "text": "Was it just people just didn't think about it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 715.676,
    "end": 720.722,
    "text": "Or did it prove challenging to predecessors?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.805,
    "end": 728.532,
    "text": "So I mean, first of all, it takes quite some, some time to process the fMRI data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 728.592,
    "end": 736.122,
    "text": "So I think it goes back to like 2006, where the first people started to do real time fMRI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 736.557,
    "end": 740.69,
    "text": " And back then there were many pragmatic challenges back then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 740.71,
    "end": 746.027,
    "text": "So how to get the images quickly off the scanner onto some computer to do the analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 746.362,
    "end": 752.012,
    "text": " And these things have been resolved over the next couple of years.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 752.052,
    "end": 755.859,
    "text": "So the scanner manufacturers were more accommodating to the researchers' needs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 755.999,
    "end": 758.484,
    "text": "And this really improved the field.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 758.504,
    "end": 767.56,
    "text": "And then also data analysis and pre-processing was very much improved by new methods to do it really in real time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 768.198,
    "end": 772.903,
    "text": " I mean, one fundamental problem that still exists is that there is this hemodynamic delay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 773.404,
    "end": 779.551,
    "text": "So you always, when you do functional MRI, you don't measure neural activity directly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 779.591,
    "end": 789.522,
    "text": "You measure the blood flow in the brain, which means there's always a delay by about six seconds when you have the peak of the hemodynamic response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 790.222,
    "end": 796.99,
    "text": "And some people said for philosophical reasons that this is much too late actually for somebody to interfere.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 796.97,
    "end": 807.366,
    "text": " If you want to regulate your own brain, then you will always see the outcome of this regulation effort about six seconds later.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 807.867,
    "end": 814.438,
    "text": "And so some people say, okay, I mean, this means by principle, real time fMRI is impossible for neurofeedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 815.399,
    "end": 817.603,
    "text": "But I disagree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 817.723,
    "end": 823.011,
    "text": "I think the humans are very good in association learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 823.413,
    "end": 829.164,
    "text": " Um, they can steer huge trucks, you know, larger than they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 829.184,
    "end": 831.95,
    "text": "They can, uh, huge carrier ships whatsoever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 832.331,
    "end": 842.13,
    "text": "So, um, this is what you can basically learn by getting used, uh, to the, uh, to the task and, um, and, and yeah, getting, getting a little bit of training.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 842.903,
    "end": 857.542,
    "text": " And when I wanted to do, when I was, when I was studying my PhD program, actually, so I had a job interview by my supervisor, Kristin Windischberger, a real hardcore fMRI physicist from, from the early days of fMRI actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 858.023,
    "end": 861.447,
    "text": "And he asked me, okay, so Ronnie, what would you like to do after all?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.527,
    "end": 863.991,
    "text": "So what, what is your career goal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 864.351,
    "end": 867.375,
    "text": "And I said, oh, I really would like to learn this real time fMRI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 867.355,
    "end": 870.699,
    "text": " And back then he said, no way, this is not going to work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 870.759,
    "end": 872.602,
    "text": "There's so many technical challenges.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 872.762,
    "end": 884.657,
    "text": "And first you should really learn proper fMRI and also a little bit dynamic causal modeling, which was quite on board back then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.677,
    "end": 888.922,
    "text": "It came up as a new method and this was absolutely the right choice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 889.182,
    "end": 892.907,
    "text": "So I didn't waste any time during my PhD to, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 893.528,
    "end": 900.137,
    "text": " you know, spend endless time in the lab to really set up those, those pipelines.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 900.157,
    "end": 913.596,
    "text": "So I waited a couple of years for my first postdoc abroad in, in Zurich at the Buch-Herzli clinic where I had the opportunity to work with Frank Czernowski who was also at UCL.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 914.133,
    "end": 919.66,
    "text": " at the Welcome Trust Center, where he also was one of the pioneers of real time fMRI.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 919.68,
    "end": 920.701,
    "text": "And this is where we started.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 920.862,
    "end": 922.744,
    "text": "And this is how we got it going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 923.645,
    "end": 928.551,
    "text": "And we set up a small pilot experiment, I would call it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 928.571,
    "end": 932.676,
    "text": "So with different interventions, but people had to regulate their own amygdala.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.696,
    "end": 935.5,
    "text": "So I'm always a little bit centric.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 936.053,
    "end": 940.519,
    "text": " We instructed people inside the scanner to either up or down regulate the amygdala.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 940.82,
    "end": 943.704,
    "text": "And we used emotional faces as feedback.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 943.764,
    "end": 948.271,
    "text": "So one instruction was, for example, to make neutral faces happy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 948.371,
    "end": 951.515,
    "text": "So we used morphed faces and then they looked more and more happy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 952.316,
    "end": 957.704,
    "text": "Or to down regulate the amygdala by making fearful faces less fearful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 959.507,
    "end": 961.69,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.311,
    "end": 973.401,
    "text": " it's, you know, people, it's difficult, you know, as you know, as an experimentalist, it's hard sometimes to understand exactly what your participants are doing in a brain scan, or when they're doing an experiment, I presume you was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.668,
    "end": 977.534,
    "text": " Asking them questionnaires quality to what, like what tactic are you using?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 977.574,
    "end": 981.32,
    "text": "Because you've got this six second delay, but then you've also got this functional task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.34,
    "end": 988.091,
    "text": "Like, oh, you've got like, let's see how you're actually actively, um, modulating the response of your amygdala.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 988.372,
    "end": 991.096,
    "text": "What kind of reasons did people come up with?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.136,
    "end": 993.56,
    "text": "Even if they're kind of spurious and, and post hoc.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 994.502,
    "end": 995.043,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 995.063,
    "end": 995.203,
    "text": "Uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 995.487,
    "end": 1010.63,
    "text": " I mean, we we didn't have a systematic way of asking those questions, but I wanted to do some qualitative analysis of the data and, you know, just to collect some samples of what people are reporting, what kind of strategies they might be using or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1011.411,
    "end": 1016.578,
    "text": "And so I always ask them how certain they were that they were performing well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1017.48,
    "end": 1020.364,
    "text": "And so this was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1021.323,
    "end": 1049.338,
    "text": " yeah not not really indicative of the actual performance so i i remember this one particular participant she was absolutely stunning she was really able to up or down regulate the amygdala at will you could really see how the signals would go up would go down again so really like this textbook as an example what you show in a post is a typical subject and then we asked her so how satisfied were you with your regulation effort and she said",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1049.555,
    "end": 1051.557,
    "text": " Oh no, it could have been better.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.697,
    "end": 1053.259,
    "text": "And I'm not sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1053.299,
    "end": 1065.213,
    "text": "And, um, when you also asked him for strategies, what kind of, um, uh, strategies they used, it was also very hard to pinpoint because some people had really, uh, good ideas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1065.293,
    "end": 1076.946,
    "text": "So some people had experience with meditation, some, um, somewhere maybe a little bit from a psychology background and had some training, uh, in, in psychotherapy and did it, let's say, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1077.382,
    "end": 1106.46,
    "text": " um different cognitive regulation mechanisms that a priori would make lots of sense but they failed on the other hand we had some some guys from um let's say from the eth so uh from technical university there and uh they said yeah without knowing anything about the brain actually he said yeah i was just lying there and thinking about playing basketball with this person i'm seeing and just for some reason so that's great",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1106.828,
    "end": 1115.66,
    "text": " So the only thing that seemed to work was to consistently pay attention to what you're doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1116.08,
    "end": 1128.377,
    "text": "So if you're trying too hard, if you try to adapt a very complex regulation strategy or something, and you don't manage to focus your attention for the whole time, then it will not work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1128.417,
    "end": 1133.764,
    "text": "But if you're very consistent with your strategy, I think the brain can also take care of the rest, maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1134.284,
    "end": 1135.125,
    "text": " Oh, this is okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.145,
    "end": 1135.866,
    "text": "This is really cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1135.906,
    "end": 1136.707,
    "text": "This is really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.727,
    "end": 1138.249,
    "text": "I'd love to go a little bit further into this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1139.371,
    "end": 1151.566,
    "text": "So just so I can get some sort of clarity on the paradigm, you're showing people these faces, some of which you're expecting to raise amygdala activity and others you're expecting to sort of downregulate amygdala activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1152.528,
    "end": 1155.251,
    "text": "And so where does the self-regulation aspect come in?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1155.311,
    "end": 1163.141,
    "text": "And they're not party to the actual, the fMRI information of their amygdala.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1163.161,
    "end": 1163.802,
    "text": "Is that right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1164.153,
    "end": 1168.878,
    "text": " It is so is basically they can see what they can kind of see what's going on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1168.958,
    "end": 1177.768,
    "text": "And so why would so my question is, why would that person not think they're doing very well, if they can see that they're sort of conscious?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1178.108,
    "end": 1187.038,
    "text": "Well, again, philosophically, sticky words here, but like their will, their activity, their attention is actually having this modulator effect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1187.058,
    "end": 1192.624,
    "text": "So why would they have this like, this kind of self deprecating self reflexivity?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1193.093,
    "end": 1209.112,
    "text": " Yeah, it might be hard to really quantify how and to really know how good you are in relationship to other people, maybe, because they don't have much experience with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1209.132,
    "end": 1218.763,
    "text": "And they might be dissatisfied if it takes longer than expected, if they try to focus, but they also see the signal going the other direction for a brief moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1219.584,
    "end": 1221.126,
    "text": "So it's very hard to tell that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1221.865,
    "end": 1223.568,
    "text": " Okay, so people just have very high standards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1225.23,
    "end": 1227.934,
    "text": "So so okay, so let's let's just get some clarity on the paradigm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1227.954,
    "end": 1237.348,
    "text": "So we've got these faces, different faces, the so that's going to kind of exogenously affect the amygdala.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1238.19,
    "end": 1243.357,
    "text": "But then you've got you've been telling these participants, okay, we want to see if you can contribute to that process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1244.379,
    "end": 1247.003,
    "text": "So let's say I'm looking at a happy face.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1248.125,
    "end": 1248.345,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1248.899,
    "end": 1252.772,
    "text": " What would you be saying to the participant in that sort of context?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1253.514,
    "end": 1256.665,
    "text": "And what effects would you be hypothesizing that you might see?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.045,
    "end": 1265.417,
    "text": " So what we know from the literature is that amygdala activity scales with the intensity of the emotions that someone is perceiving.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1266.178,
    "end": 1275.933,
    "text": "And so what you see is there is already some kind of dependency of the stimulus that is shown and how the amygdala should respond.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1276.534,
    "end": 1284.947,
    "text": "So in a way, what we talk about here is a closed loop between the stimulus that is also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1285.349,
    "end": 1296.389,
    "text": " depending on the amygdala activity and you as the agent inside the MRI scanner are somehow in the position to manipulate on that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1296.409,
    "end": 1305.265,
    "text": "So find a way to influence this closed loop between what the amygdala is doing and processing the faces and what is actually presented.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1306.055,
    "end": 1311.022,
    "text": " And I mean, this was without much theory, actually.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1311.062,
    "end": 1317.671,
    "text": "So there are control theoretical assumptions on that, that you're somehow regulating this disclosed loop.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1318.452,
    "end": 1324.461,
    "text": "But at some, at some point, we could also come up with an active inference model lecture of what might be going on there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1325.122,
    "end": 1325.602,
    "text": "Right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1325.622,
    "end": 1328.907,
    "text": "Yeah, it definitely lends itself to a kind of hierarchical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1329.46,
    "end": 1333.124,
    "text": " modeling perspective where you have kind of higher order constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1333.905,
    "end": 1344.256,
    "text": "I guess it was the, uh, was the role of the kind of endogenous attention or endogenous will to always like oppose the closed loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.276,
    "end": 1350.643,
    "text": "So if, for example, I'm seeing a very fearful face, so we're expecting this to correlate with increased amygdala activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1351.104,
    "end": 1356.75,
    "text": "Would it always, would the task always be, well, try and deregulate or downregulate",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.372,
    "end": 1358.555,
    "text": " activity of your amygdala.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1358.575,
    "end": 1362.204,
    "text": "And maybe if it was, again, I'm just asking, I wasn't there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1362.946,
    "end": 1370.746,
    "text": "But if there's sort of minimal activity, because you're just seeing a very neutral phase, you might say, well, try and spike it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1370.766,
    "end": 1374.756,
    "text": "Was it always kind of doing the inverse of what might be happening endogenously?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.428,
    "end": 1378.111,
    "text": " No, we actually did several interventions with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1378.131,
    "end": 1389.165,
    "text": "What we found what was working best was actually to either downregulate the amygdala to make fearful faces less fearful and neutral faces more happy by upregulating the amygdala.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1389.545,
    "end": 1398.516,
    "text": "So if it was somehow consistent with these natural tendencies, then it worked best, I would say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1399.053,
    "end": 1401.256,
    "text": " Wow, this is I really like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1401.396,
    "end": 1402.378,
    "text": "This is cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1402.398,
    "end": 1408.006,
    "text": "So as you say, it kind of lends itself to this active inference hierarchical perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1409.228,
    "end": 1410.129,
    "text": "I believe you did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1410.65,
    "end": 1411.591,
    "text": "I know this is a weird thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.611,
    "end": 1415.076,
    "text": "But obviously, I search up everyone I'm speaking to just so I can do my intro and stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1415.096,
    "end": 1417.68,
    "text": "And I think I saw you did some work on Schopenhauer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.821,
    "end": 1422.006,
    "text": "I know it was a long time ago, it was your master's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.56,
    "end": 1423.281,
    "text": " work, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1423.661,
    "end": 1425.203,
    "text": "That's right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1425.223,
    "end": 1425.323,
    "text": "Yeah."
  },
  {
    "start": 1425.343,
    "end": 1429.067,
    "text": "Shopping, shopping, Howard does, you know, shopping, our focus is very much on the will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.869,
    "end": 1431.149,
    "text": "What?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1432.311,
    "end": 1433.612,
    "text": "I mean, this question just came to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1433.732,
    "end": 1434.934,
    "text": "So it sounds very contrived.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1435.114,
    "end": 1436.195,
    "text": "And but it really isn't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.817,
    "end": 1447.107,
    "text": "What role would you say this points, you know, for a kind of naive audience or folk psychology audience, it might sound well, of course, this is just the will, this is me doing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1447.147,
    "end": 1448.128,
    "text": "This is like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1448.345,
    "end": 1453.733,
    "text": " purposeful activity and I can control my thoughts and I can control my actions and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1454.053,
    "end": 1464.569,
    "text": "What do you see being the kind of operating function or operating mechanism in play here in terms of top-down regulation?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1466.551,
    "end": 1467.293,
    "text": "Yeah, that's interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1467.433,
    "end": 1475.905,
    "text": "I mean, so when it comes to the brain now, I would say it has something to do with prefrontal control of the amygdala.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.779,
    "end": 1484.777,
    "text": " If we're talking about more metaphysical accounts, what Schopenhauer could give with his metaphysical will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1485.218,
    "end": 1493.016,
    "text": "I mean, a short explanation first, because this is, as I said, this was my master thesis and I stumbled on Schopenhauer while...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.996,
    "end": 1501.11,
    "text": " I'm reading a little bit of philosophical literature in my third and fourth semester in my common science studies.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1501.13,
    "end": 1508.423,
    "text": "So Wittgenstein, but also Schopenhauer then, and was really fascinated by how many interesting ideas he already had in the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1508.403,
    "end": 1527.289,
    "text": " um 19th century and i thought that many of the things that he was talking about are still state-of-the-art discussions in cognitive science and that's why i tried to you know apply some of his ideas to um to current problems that we have that's why i called my master thesis schopenhauer's last will",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1527.269,
    "end": 1539.745,
    "text": " And it's not very good, philosophically speaking, because I'm not a trained philosopher, but it was very interesting actually to step into this debate and discuss with philosophers about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1539.825,
    "end": 1552.821,
    "text": "And this was really informative, but it was kind of a singular point in my history before I moved on again to the more empirical, more cognitive neuroscience side of cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.375,
    "end": 1557.863,
    "text": " But let's talk about the will now and the way I interpret Schopenhauer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1557.903,
    "end": 1563.193,
    "text": "So, I mean, at one point, I really want to take a philosopher and write a proper paper about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.293,
    "end": 1572.73,
    "text": "But I think Schopenhauer had lots of interesting things to say that are still relevant for active inference as well, because he talked about two things, about representations and will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1572.87,
    "end": 1574.553,
    "text": "The world is a representation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1575.335,
    "end": 1577.779,
    "text": "And representations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1579.227,
    "end": 1583.514,
    "text": " have a lot to do with the models that we are using, uh, in, in cognitive science.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1583.534,
    "end": 1590.426,
    "text": "So he didn't use, of course, representation, just loaded fashion that, um, that we now have in cognitive science where there are representation wars.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1591.267,
    "end": 1597.978,
    "text": "Um, but, uh, it was, uh, the, the, the, the, the, the German word of representation would be .",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1598.465,
    "end": 1600.247,
    "text": " which is like an imagination.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1600.408,
    "end": 1608.098,
    "text": "So there is some kind of, um, uh, imagination going on that I use to actually, uh, model the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1608.118,
    "end": 1611.823,
    "text": "So we cannot access, uh, access to a world directly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1611.863,
    "end": 1614.786,
    "text": "So he was very much influenced by Kant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1614.807,
    "end": 1620.414,
    "text": "Um, there's only the, the, only the consequences, the phenomena are somehow, uh, reachable to us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.534,
    "end": 1625.2,
    "text": "And based on that, we form imaginations, representations of the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1626.081,
    "end": 1626.582,
    "text": "And,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1627.085,
    "end": 1628.788,
    "text": " For him, of course, this was not enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1629.51,
    "end": 1643.798,
    "text": "And I mean, when we now translate it also to predictive processing, we see, okay, just collecting samples of the world and compiling it somehow, this would be very passive predictive coding without any intention, without life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1643.858,
    "end": 1646.443,
    "text": "It is just a way of storing data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1646.879,
    "end": 1654.121,
    "text": " And so Schopenhauer already needed to have this kind of second power at work, and this would be the will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1654.983,
    "end": 1659.657,
    "text": "And the will was nothing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1660.463,
    "end": 1665.735,
    "text": " metaphysically rich in the sense that there was some, uh, God and its will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1665.955,
    "end": 1672.35,
    "text": "And, uh, it has some, some, yeah, it was more a force of nature, very much directed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1672.45,
    "end": 1678.303,
    "text": "So you would say on the most primitive level, um, it's, it's the laws of nature, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1678.283,
    "end": 1706.586,
    "text": " that are a manifestation of this will and then when you go up on a living system in the hierarchy of living systems he had this very strong hierarchical view you see that plants somehow manage to fight against gravity because they're growing upwards and and you you get from there to animals and then human beings but in essence they are a manifestation of the same will of the same um force of life or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1706.566,
    "end": 1709.369,
    "text": " maybe of the same principles that we have in nature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1709.389,
    "end": 1715.995,
    "text": "When we think of thermodynamics, for example, we need to find a way to fight the second law of thermodynamics, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1716.135,
    "end": 1723.802,
    "text": "And these mechanisms could link to this meri-metaphorical idea of will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1725.063,
    "end": 1725.503,
    "text": "Interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1725.944,
    "end": 1726.484,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1726.504,
    "end": 1727.385,
    "text": "Yeah, yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.405,
    "end": 1736.353,
    "text": "I mean, obviously, yeah, the notion of a will, especially of a six-second delay, is tricky, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1736.705,
    "end": 1737.446,
    "text": " philosophically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.967,
    "end": 1742.156,
    "text": "But I think it's not a it's not a it's not it's not a redundant question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1742.236,
    "end": 1747.526,
    "text": "Some philosophy, you know, the really strict materialist might just say, Well, it is just the prefrontal cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1748.668,
    "end": 1752.235,
    "text": "But at least on this podcast, I don't hold any ontological requirements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1752.255,
    "end": 1753.718,
    "text": "So if you wanted to say that it's",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1754.221,
    "end": 1759.587,
    "text": " a panpsychist proto agent, or if you wanted to say it's God, I'm going to entertain it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1760.668,
    "end": 1778.447,
    "text": "But at least in terms of what I would like to say, it would be a little bit more precise about my idea of will is not necessarily philosophers somehow like to detach the actual problem of living systems to very abstract spaces where time doesn't play a role.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1779.088,
    "end": 1782.912,
    "text": "And for me, six seconds today is not really",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1782.892,
    "end": 1797.893,
    "text": " a problem because I think that agency has nothing to do with momentum on the level of moment to moment, but also in the level of the process that you are causing something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.954,
    "end": 1800.077,
    "text": "You see the outcome of your actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1800.537,
    "end": 1811.633,
    "text": "You might not be even aware of the behavior that gave rise to these outcomes, but then you evaluate the outcomes and then you learn from it and then you adjust your behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1811.613,
    "end": 1841.248,
    "text": " i think in in this kind of ballpark this is where most of free will actually happens because most of the behavior that we do is automatic and for good reasons because it's efficient and fast but over your continuous effort you're able to steer yourself also when you have very delayed feedback like in your feedback yes yes i think i think a lot of these sort of broader philosophical",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1841.482,
    "end": 1844.547,
    "text": " questions are underpinned by your resting axiom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1845.368,
    "end": 1853.602,
    "text": "If you're taking the notion of a substantial self, a Cartesian, dualistic self, then sure, the time probably doesn't matter, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1853.622,
    "end": 1854.784,
    "text": "There might just be a delay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1855.485,
    "end": 1864.941,
    "text": "But if you're just taking these neurophysiological mechanisms, well, then we're not going to get off the ground by even talking about your recognizing the consequences of your own action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1865.444,
    "end": 1876.06,
    "text": " I think it's funny because Schopenhauer also said, I believe a man can do what he wills, but he can't will what he wills, which are just a beautiful reputation to kind of soft determinism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.16,
    "end": 1883.631,
    "text": "I always thought was the best reputation of soft determinism, which is like, yeah, like I'm doing what I want, but I'm like, well, why did you choose this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1884.172,
    "end": 1885.554,
    "text": "You know, why did you choose what you wanted?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1885.594,
    "end": 1887.857,
    "text": "And you run that infinite regress and.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.36,
    "end": 1913.828,
    "text": " yeah he was a brilliant writer he was really really great in um you know making really good points really uh um uh really uh high in rhetorics and everything uh but the point was i i think that he was misguided in a couple of ways and i think it has something to do with his lifestyle he was he was a very odd person he was living alone he didn't have um much social",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1915.546,
    "end": 1919.363,
    "text": " although he was very mean to friends and people interested in him.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1919.849,
    "end": 1923.956,
    "text": " So, yeah, never family, never relationship whatsoever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1924.517,
    "end": 1929.845,
    "text": "So I think he has had a very depressive deposition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1930.246,
    "end": 1932.83,
    "text": "And and I think so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1932.89,
    "end": 1938.579,
    "text": "I mean, this is what now now we move back into into the into the clinical neuroscience domain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1938.599,
    "end": 1947.173,
    "text": "Maybe when we look at people with depressive symptoms, they also tend to be more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1947.153,
    "end": 1950.196,
    "text": " uh, incompatibilistic with their beliefs about free will.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1950.756,
    "end": 1956.121,
    "text": "So they, they also feel that they are, uh, less able to, you know, control their life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1956.141,
    "end": 1959.164,
    "text": "They are more, uh, basically driven by external factors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1959.724,
    "end": 1959.844,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1960.425,
    "end": 1963.348,
    "text": "So there could be this interesting relationship there as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1964.008,
    "end": 1965.109,
    "text": "Oh yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.129,
    "end": 1965.229,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1965.249,
    "end": 1966.45,
    "text": "Go ahead, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1966.47,
    "end": 1966.611,
    "text": "Please.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1966.631,
    "end": 1970.754,
    "text": "And so, because I mean, it was kind of a dead end for him in life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1970.774,
    "end": 1975.338,
    "text": "It was always, uh, it was, it was always covered by external factors and there was no way out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.499,
    "end": 1977.16,
    "text": "And, um, this,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1977.14,
    "end": 2002.725,
    "text": " it just drove him to this extremely strong nihilism and also his uh idea of antinatalism actually it's better to um not have any you know offsprings at all and to die out at one point very dark very um um nihilistic and this is definitely the side that I don't like about it yeah also is disregard for women yeah well",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2003.482,
    "end": 2006.106,
    "text": " they were all pretty rubbish in that domain, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2006.167,
    "end": 2018.708,
    "text": "Yeah, I think we can kind of, in some sense, those elements of those philosophers, the disparaging attitudes towards women, just kind of that element dooms them all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2019.329,
    "end": 2021.092,
    "text": "I'm not sure Schopenhauer has an exemption to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2021.112,
    "end": 2026.421,
    "text": "I mean, of course, there are some who are a bit nicer, but I think they were all pretty twatty in that domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2026.441,
    "end": 2027.262,
    "text": "So that's not great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2027.562,
    "end": 2029.384,
    "text": " Um, that's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.404,
    "end": 2029.644,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2029.664,
    "end": 2039.315,
    "text": "You, you hear this stuff about sort of a locus of control, internal versus external locus of control and its correlates with, um, meaning in life and depression and stuff like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2039.335,
    "end": 2039.615,
    "text": "I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.876,
    "end": 2056.253,
    "text": "What's interesting there is even to make that point just on a philosophical basis, you're, you're, you're still, you're still investing in this kind of physicalist axiom, which I just don't think is particularly well substantiated by science or by philosophy or by whatever it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2056.773,
    "end": 2067.753,
    "text": " you know, this notion that we just don't know, because we have this remarkable ability to be subjectively aware of things and have intentional stances on things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2068.434,
    "end": 2072.942,
    "text": "And well, Ronnie, if you can find the person who can explain that to me, then you win.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2073.091,
    "end": 2074.893,
    "text": " And I'll become Schopenhauer and nihilistic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2074.933,
    "end": 2080.14,
    "text": "But until then, I'm quite happy to sort of bathe in the loveliness of that mystery.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2080.961,
    "end": 2087.429,
    "text": "And I wonder whether if Schopenhauer had read Thomas Nagel or David Chalmers, whether he would have been a bit more optimistic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2087.49,
    "end": 2101.107,
    "text": "But I think you sense a lot of this in the scientific turn in the 19th century and the 20th century, this gross nihilism, which obviously Nietzsche basically foretold more than anyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2101.762,
    "end": 2103.164,
    "text": " So this is interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2103.184,
    "end": 2122.428,
    "text": "I mean, so I think this, your, your integration here of the therapeutic landscape is interesting as well, because you know, this is very broad brush and rough, but a lot of therapy, especially for something like an anxiety disorder will be, will look something like reestablishing the prefrontal cortex as the master over the amygdala.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2123.49,
    "end": 2130.098,
    "text": "So I'm worried that the world is going to fall down or the plane is going to crash or well, like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2130.517,
    "end": 2140.167,
    "text": " you know, that's why people like vagus nerve breathing, but let's reestablish the role of the prefrontal cortex to moderate and regulate that overactivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2141.148,
    "end": 2147.035,
    "text": "But it almost sounds like, okay, if we focus so much on that neuro anatomy, we almost lead into a nihilism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2147.635,
    "end": 2150.939,
    "text": "Because, well, the prefrontal cortex isn't me, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.999,
    "end": 2155.404,
    "text": "If you showed me my little flesh of prefrontal cortex, I wouldn't say, Oh, well, that's my will.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2155.484,
    "end": 2156.645,
    "text": "That's my desire.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2156.705,
    "end": 2158.627,
    "text": "That's my capacity for regulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.188,
    "end": 2159.528,
    "text": "So",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.828,
    "end": 2166.336,
    "text": " What was your experience when you saw that people were able to regulate their amygdala, regulate their emotions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2166.376,
    "end": 2169.248,
    "text": "Was it liberating for them or were they kind of spooked out?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.236,
    "end": 2173.118,
    "text": " So yeah, that's an interesting point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2174.82,
    "end": 2177.983,
    "text": "So yeah, because this is actually where I'm also coming from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2178.003,
    "end": 2182.468,
    "text": "I always thought of the amygdala being regulated by the prefrontal cortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2182.488,
    "end": 2186.713,
    "text": "So this was also my main focus in my PhD thesis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2186.813,
    "end": 2199.387,
    "text": "I worked with people with social anxiety disorders, and you could see in neurotypical people that when they were watching emotional faces, they were able to downregulate the amygdala",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2199.367,
    "end": 2204.692,
    "text": " by a small region called the medial orbital frontal cortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.393,
    "end": 2211.139,
    "text": "And precisely this mechanism was not functioning so well in people with social anxiety disorder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2211.96,
    "end": 2224.412,
    "text": "And in another study where people were given SSRIs, so antidepressant medication, they were able to have stronger downregulation of the amygdala by the orbital frontal cortex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2224.392,
    "end": 2229.098,
    "text": " So it's very much played into this kind of narrative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2229.279,
    "end": 2240.594,
    "text": "And this is also what we find in the neurofeedback study that people who regulate the amygdala also have stronger influence of the prefrontal cortex on the amygdala.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2241.035,
    "end": 2243.498,
    "text": "So this kind of works.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2243.917,
    "end": 2261.856,
    "text": " Um, it has something, uh, also to do with, uh, with the, uh, studies on, um, uh, cognitive, uh, effort and how people are doing cognitive reappraisal and then are able to, uh, regulate subcortical areas by using prefrontal areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2262.137,
    "end": 2263.899,
    "text": "So this kind of network, but you're right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2264.239,
    "end": 2265.58,
    "text": "This is not the full story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2265.981,
    "end": 2266.261,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2267.482,
    "end": 2271.807,
    "text": "Well, we can't, we can, yeah, we'll move on, but I guess I'm, I'm really just trying to ram home.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.847,
    "end": 2273.569,
    "text": "We can't discard the phenomenology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.887,
    "end": 2277.491,
    "text": " And as a 4E man, I'm sure you'll agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.092,
    "end": 2278.733,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2278.753,
    "end": 2280.735,
    "text": "You see where my problem actually is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2280.775,
    "end": 2290.146,
    "text": "So I kind of accepted this kind of narrative that we use in clinical neuroscience and cognitive neuroscience to model amygdala connectivity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2291.387,
    "end": 2298.696,
    "text": "What I've been actually struggling with the topic of amygdala and active inference was",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2298.676,
    "end": 2304.862,
    "text": " for many years, so more than ten years, I was not able to basically bring those two together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2305.122,
    "end": 2312.268,
    "text": "I knew that I was a nuclear research searcher during the week and on the weekend I could think about active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2312.308,
    "end": 2317.153,
    "text": "But those were things that were highly compartmentalized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2317.213,
    "end": 2318.194,
    "text": "I couldn't bring them together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.655,
    "end": 2319.915,
    "text": "Why?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2319.975,
    "end": 2326.101,
    "text": "Because I mean, it was you could say, OK, I have to think about top down control of the amygdala.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2326.317,
    "end": 2334.966,
    "text": " But like you said, I was not happy just to say, okay, it should have something to do with the prefrontal cortex and the prefrontal cortex regulating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2335.467,
    "end": 2336.872,
    "text": "But yeah, there's more to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2336.892,
    "end": 2339.28,
    "text": "You mentioned breathing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2339.648,
    "end": 2346.498,
    "text": " basically a link also to, uh, interceptive processes that will regulate also the amygdala.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2346.518,
    "end": 2354.35,
    "text": "So if you are, uh, if you have a panic attack, it has nothing to do with what you're thinking, you're experiencing that you're losing control of your body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2354.951,
    "end": 2356.833,
    "text": "And this alone is enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2356.934,
    "end": 2364.104,
    "text": "It has nothing to do with some kind of abstract reasoning that you're doing is an embodied process that should play a role.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2364.885,
    "end": 2366.027,
    "text": "So, um,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2367.593,
    "end": 2377.204,
    "text": " Then the other thing is, so it has something to do with the insular cortex then maybe, or it has something to do also with brainstem input into the amygdala.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2377.505,
    "end": 2387.556,
    "text": "The other thing is then also reward processing because much of the debate is focused on fear conditioning experiments in animals because it works so nicely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2388.417,
    "end": 2392.122,
    "text": "And this is where you say, okay, this is the function of the amygdala.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2392.142,
    "end": 2394.985,
    "text": "It's about fear and threat processing or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2395.64,
    "end": 2403.463,
    "text": " And even in my PhD thesis, I wrote about also the, you know, that amygdala also responds to positive emotions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2403.543,
    "end": 2410.864,
    "text": "And I had a big fight with one of the reviewers of my PhD thesis because they said, no, the amygdala is just for fear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2410.844,
    "end": 2413.847,
    "text": " even though it was already outdated, this kind of view back then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2414.227,
    "end": 2423.336,
    "text": "But yeah, nowadays we know so much more from animal experiments that the amygdala is heavily connected with the ventral striatum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2423.356,
    "end": 2429.442,
    "text": "So it has a lot to do with, you know, making decisions about risk and rewards and balancing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2429.722,
    "end": 2435.368,
    "text": "And so we now know from the animal models, very precise mapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2435.388,
    "end": 2438.151,
    "text": "So those circuits definitely exist somehow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2439.032,
    "end": 2439.552,
    "text": "And",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2441.27,
    "end": 2442.852,
    "text": " So this is another conundrum then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2443.012,
    "end": 2447.979,
    "text": "So where should I start to actually draw the top level of the hierarchy?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2447.999,
    "end": 2451.463,
    "text": "You say, okay, this, okay, the amygdala is driven by reward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2451.483,
    "end": 2460.494,
    "text": "No, we could also say that no, the amygdala is driven by interception and therefore kind of fail to come up with a way to start my active inference model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2460.514,
    "end": 2467.003,
    "text": "And this shifted then a little bit later when I had this insight for, for the transient cognitive science paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2467.683,
    "end": 2467.884,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.004,
    "end": 2468.164,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2468.224,
    "end": 2470.467,
    "text": "We'll, we'll certainly come to the text paper, I guess one thing,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.02,
    "end": 2471.621,
    "text": " I, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2471.701,
    "end": 2481.476,
    "text": "One interesting addition to this, uh, conversation that the pre the, the loop between the prefrontal cortex and the amygdala is not enough is OCD.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2482.257,
    "end": 2485.482,
    "text": "And OCD is interesting because it was cost as a anxiety disorder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2485.902,
    "end": 2492.252,
    "text": "And there's no, you know, and so you would say, okay, well, cognitive behavioral therapy is about reinstating the role of the prefrontal cortex, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2492.722,
    "end": 2496.29,
    "text": " OCD actually involves hyperactivity of the orbitofrontal cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2497.052,
    "end": 2502.804,
    "text": "And how that maps onto therapeutically is they'll say, don't do logicking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2503.045,
    "end": 2504.368,
    "text": "Don't do rumination.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2504.428,
    "end": 2508.216,
    "text": "Don't logic your way out of a problem.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2508.196,
    "end": 2533.005,
    "text": " right that's actually worsening the problem so and and what's odd is that in many ways the symptoms of ocd are very similar to the symptoms of something like gad or generalized anxiety disorder and yet it seems like there's the inverse relationship or the inverse problem where you have hyperactivity over the uh frontal cortex and so you'll have stuff like tms or you know intrusive lectures going in there and actually trying to deregulate that process so it's um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.593,
    "end": 2540.103,
    "text": " It's a mystery, but as you say, of course it's a mystery because it's hundreds of millions of years old.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.183,
    "end": 2543.669,
    "text": "It would be lovely if it was just one loop, but alas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2543.809,
    "end": 2549.017,
    "text": "Okay, so let's jump to this text paper, your trends in cognitive science paper on the amygdala.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.899,
    "end": 2552.783,
    "text": "So you called it the amygdala complex, which I really liked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2553.705,
    "end": 2556.529,
    "text": "I thought it sounded kind of Victorian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.37,
    "end": 2565.992,
    "text": " Before you fold in active inference into the amygdala, you mentioned that, you know, one of your reviewers, your PhD went, well, amygdalas are only for fear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2566.794,
    "end": 2571.666,
    "text": "What are the other kinds of preconceptions that historically have held about the amygdala?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.76,
    "end": 2575.846,
    "text": " I would say that there is only one amygdala.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2576.026,
    "end": 2581.276,
    "text": "But essentially, what's very important is, I mean, of course, there are two, they are bilateral.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2581.997,
    "end": 2589.993,
    "text": "But even more important than lateralization is that the amygdala consists of at least two completely different nuclei.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2590.373,
    "end": 2592.878,
    "text": "And the one would be the central amygdala.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2593.482,
    "end": 2597.488,
    "text": " And the other one, the basolateral complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2598.189,
    "end": 2606.622,
    "text": "So these are actually two different nuclei that somehow are fused together over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2607.523,
    "end": 2612.13,
    "text": "And the origin of the central amygdala is actually the ventral stratum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2613.232,
    "end": 2619.962,
    "text": "And while the basal and lateral part of the amygdala are actually more cortical-like in structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2620.094,
    "end": 2624.7,
    "text": " So this is an important game changer already.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2624.76,
    "end": 2628.625,
    "text": "I mean, many people in the rodent literature know about this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2628.705,
    "end": 2636.235,
    "text": "I mean, they map the differences between central amygdala, medial amygdala, all the different parts of the basolateral complex.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2636.876,
    "end": 2638.798,
    "text": "And they're totally familiar with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.918,
    "end": 2640.28,
    "text": "But in human neuroimaging,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2640.513,
    "end": 2649.887,
    "text": " We mostly focus on the whole amygdala or just some active voxels within the gross neighborhood of where the amygdala might be or something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2650.448,
    "end": 2661.525,
    "text": "So it's very unclear when we look at neuroimaging data what we actually mean when we talk about the amygdala because many groups are talking about different things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2662.67,
    "end": 2670.739,
    "text": " And it may be worth just unpicking for the non trained audience when you say, so the central amygdala, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.905,
    "end": 2673.107,
    "text": " Well, actually, I guess people are coming from an active inference hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2673.127,
    "end": 2680.335,
    "text": "So when I was reading, I was thinking, okay, the central amygdala is higher up the hierarchy and provides predictions to the basolateral area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2681.116,
    "end": 2689.886,
    "text": "But when you say, okay, it emerges from the ventral striatum, so it has something to do with motivation and reward, and the basolateral feeds back into the sensory cortex.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2690.246,
    "end": 2700.878,
    "text": "If we now feed in these classic terms of perception and action, which are kind of the currency of active inference, what does that say more broadly about these different bits, if that's a feasible distinction?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2700.858,
    "end": 2706.767,
    "text": " Okay, let's start maybe with the different historical views.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2706.808,
    "end": 2708.134,
    "text": "So let's say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2708.654,
    "end": 2719.667,
    "text": " The simple human neuroimaging view might be the amygdala is something like a fear detector or emotion detector or relevance detector, something like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2719.767,
    "end": 2727.696,
    "text": "And if, let's say, a new emotional phase pops up, then the amygdala would increase its activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2727.716,
    "end": 2731.941,
    "text": "This is the traditional view in neuroimaging, and many experiments are done this way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2732.001,
    "end": 2738.509,
    "text": "And they're, yeah, sometimes really good experiments, and you can learn a lot from this kind of amygdala reactivity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2739.282,
    "end": 2763.636,
    "text": " The more nuanced views nowadays in neuroscience would be to say, okay, let's look at the different subnuclear, let's say in a mouse model, for example, to say, okay, we have the basolateral amygdala at one end, at the lateral end of the basolateral amygdala, you have unimodal inputs and those are integrated towards the more basal part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2763.616,
    "end": 2770.346,
    "text": " and become a multimodal integrated stimuli.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2771.207,
    "end": 2778.298,
    "text": "And from there, there is a connection to the central amygdala and the central amygdala would then be the output region.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.698,
    "end": 2786.67,
    "text": "So there is some kind of gating that is modulated by, let's say, ventral stratum or prefrontal cortex or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2787.19,
    "end": 2799.226,
    "text": " And they're basically decisions I made if you should show some kind of stereotypical threat response, like infringing behavior or fighting or running away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2799.667,
    "end": 2809.781,
    "text": "So it very much depends on the context, what kind of behavior is actually used to get away from this kind of situation and mainstream view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2810.402,
    "end": 2810.582,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.372,
    "end": 2826.046,
    "text": " What I try to do is then to basically flip it around and say, no, central amygdala is not just receiving the signal, but it is actually the one that is on top of the hierarchy and sending down predictions to the base of natural amygdala.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2826.066,
    "end": 2828.308,
    "text": "And do you, so yeah, that's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2828.409,
    "end": 2834.835,
    "text": "So do you then reconfigure or recast this gating mechanism as a contextualization mechanism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.676,
    "end": 2836.336,
    "text": "Would that be fair?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.396,
    "end": 2837.197,
    "text": "Would that be fair to say?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.919,
    "end": 2839.219,
    "text": "I mean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2839.992,
    "end": 2846.282,
    "text": " So many of the things that we are seeing in this paper are very compatible with what people already know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2846.442,
    "end": 2862.608,
    "text": "So many people who follow the classical feed-forward perspective would say, yeah, of course, the output of the central amygdala is additionally gated by input from insular, PFC, ventral stratum, and potentially also other areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2863.111,
    "end": 2866.296,
    "text": " So this already is there.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2866.796,
    "end": 2875.028,
    "text": "But for me, the big question was actually, but how does the basolateral amygdala know what kind of data to forward to the central amygdala?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2875.108,
    "end": 2878.173,
    "text": "So what is relevant for the central amygdala?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2878.193,
    "end": 2885.163,
    "text": "And this big question of meaning and relevance, this is something that is not answered in the classical feedforward paradigm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2885.183,
    "end": 2886.705,
    "text": "This is what we had to change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2887.462,
    "end": 2901.917,
    "text": " So it's worth pointing out there that the transmission of information from the unimodal to the multimodal to something like the abstract level at the central amygdala is not necessarily, it doesn't, it doesn't, it's not like a replication process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2901.957,
    "end": 2906.681,
    "text": "There's some like stripping out of information as it gets passed up the hierarchy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2907.602,
    "end": 2914.269,
    "text": "Is that, is that, is that fair in terms of relevance, meaning and yeah, I mean, personal relevance, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2914.389,
    "end": 2916.151,
    "text": "It's going to be individual specific.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.872,
    "end": 2917.232,
    "text": "What.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.702,
    "end": 2924.252,
    "text": " Do you therefore suggest that those non-relevant stimuli just get, as we say, explained away?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2924.272,
    "end": 2925.875,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2925.915,
    "end": 2929.32,
    "text": "So it's a kind of abstraction gradient, as I like to call it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2929.34,
    "end": 2940.537,
    "text": "So you get away from very concrete sensory features more to something generalized that is maybe even detached from the context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2940.972,
    "end": 2969.173,
    "text": " uh, long now also in time and, and, um, so, so in the temporal dynamics actually, so you, uh, um, so you explain smaller stimulus features to fluctuate more, uh, more quickly than, um, you know, the object identity, for example, or the, the effective state that you are in, whether you think that you are currently under threat or, uh, even that you're in a, uh, constant state of anxiety, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2970.267,
    "end": 2981.739,
    "text": " Yeah, so just for myself and the audience, it's kind of this idea that we have these slower contextual fluctuations which can regulate the faster fluctuations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2982.22,
    "end": 2984.863,
    "text": "So maybe an example would be worth using here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2984.883,
    "end": 2986.024,
    "text": "So I really like your example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.044,
    "end": 2989.087,
    "text": "I actually used it as well, and I genuinely did not take it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2989.668,
    "end": 2994.373,
    "text": "It may have been something that Carl mentioned, but it's the kind of snake on the lawn, rope on the lawn dichotomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2994.393,
    "end": 2996.275,
    "text": "So you have a rope in your lawn.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2996.305,
    "end": 3000.511,
    "text": " and it's kind of curled up in the grass, so you don't know whether it's a snake or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.551,
    "end": 3008.443,
    "text": "Now, your lower level parts of the amygdala are just responding to the sensory input, which is snake-like, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3008.523,
    "end": 3010.446,
    "text": "The curledness, the texture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3011.027,
    "end": 3018.278,
    "text": "But then you have this higher order contextual prior that, no, you're in your garden, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3018.338,
    "end": 3019.94,
    "text": "So you're in Austria, I'm in London.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3020.621,
    "end": 3021.823,
    "text": "We don't have snakes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3022.647,
    "end": 3030.938,
    "text": " Where do you find that those two meet and therefore the prediction error gets suppressed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3031.038,
    "end": 3032.98,
    "text": "Is that in the central amygdala or is that higher up?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3034.602,
    "end": 3047.039,
    "text": "So I would say that the central amygdala has more something to do with having a general feeling of how safe you are at the moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3047.059,
    "end": 3050.443,
    "text": "Safe also in terms of how well you are regulated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3050.542,
    "end": 3053.787,
    "text": " and how well you expect to be regulated in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3053.907,
    "end": 3060.998,
    "text": "So if you're experiencing pain or death in the near future, then you're not safe, then this is something you should be afraid of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3061.078,
    "end": 3064.824,
    "text": "And this is where I think the central amygdala plays a role.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3065.224,
    "end": 3066.947,
    "text": "So if there is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3066.927,
    "end": 3078.853,
    "text": " sufficient contextual evidence that, OK, you are in a tropical jungle and there might be snakes out there, then you're, of course, more on the edge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3079.193,
    "end": 3082.32,
    "text": "So in this would mean that you're up regulating",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3082.3,
    "end": 3089.19,
    "text": " And those parts of the amygdala, the vasolateral amygdala, that is very good in detecting those snakes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3089.831,
    "end": 3097.102,
    "text": "While when you are in a safe context, when you are sailing, this is the example that I'm using in the paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3098.284,
    "end": 3100.647,
    "text": "You know that there are many ropes lying around, but there",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3101.555,
    "end": 3112.208,
    "text": " usually no snakes, then you should be actually quite at ease and not misinterpret all coiled snake-like objects as snakes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3113.05,
    "end": 3125.425,
    "text": "Yeah, I think this is really interesting because I think it's an area that actually I've been talking to some people about this, that the fact that I don't think these attentional mechanisms are actually that well articulated in active inference literature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.525,
    "end": 3126.887,
    "text": "There are some wonderful papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3127.306,
    "end": 3133.753,
    "text": " I keep pointing to people in the direction of Mirza and his papers on attention with Carl and others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3134.454,
    "end": 3143.603,
    "text": "But I think this is a really interesting point because I view attention in some way as a mental action, which involves priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3144.384,
    "end": 3155.676,
    "text": "And so for me, when I talk about the priors in terms of attention, for me, it's like, okay, we recognize through these slower contextual cues where you are, and that constitutes...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3156.517,
    "end": 3167.272,
    "text": " So as you say, there's priors involved here in the down regulation of gain control or down weighting and precision weighting over anything, which might fit the template of a snake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3168.534,
    "end": 3172.76,
    "text": "But then people, I guess, generally think of that in terms of the likelihood distribution, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3172.78,
    "end": 3183.435,
    "text": "So what are the, you know, given my state, what's the likelihood of having this observation of a state, but for us, we're kind of saying, well, actually this might be constrained by a higher order action policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3184.394,
    "end": 3196.848,
    "text": " maybe it's worth unpicking because I think one reason I really, really liked your paper, and I think it's a really fascinating paper is because I think more than anyone I've actually ever read, you unpicked the problem with the ambiguity of the term prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3198.691,
    "end": 3201.394,
    "text": "So you say there are two types of priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3201.994,
    "end": 3209.944,
    "text": "There's kind of the phenotypic prior, or what you call the preferred prior, I believe, preference prior, reference prior, very good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.444,
    "end": 3212.106,
    "text": "And then you talk about the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3212.542,
    "end": 3213.785,
    "text": " priors aiding perception.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3213.845,
    "end": 3221.701,
    "text": "So kind of the priors I've been talking about here in terms of suppressing prediction error, and then also belief updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3222.683,
    "end": 3229.116,
    "text": "So maybe it's worth putting on your teaching hat and just saying, okay, we can keep using the snake example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.771,
    "end": 3234.836,
    "text": " For people who are very confused at this point, because they're like, why are we using the word prior for these things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3235.197,
    "end": 3240.423,
    "text": "Maybe it's worth you helping us sort of unpick those two senses of the word prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.744,
    "end": 3241.844,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3242.345,
    "end": 3247.05,
    "text": "So yeah, I'm sometimes very liberal with using the word prior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3247.39,
    "end": 3253.336,
    "text": "And this comes actually from this kind of science debate of whether you have a model or you are a model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3253.997,
    "end": 3255.679,
    "text": "And I think it's usually both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3255.779,
    "end": 3259.423,
    "text": "So metaphorically, we can say that our body and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3259.96,
    "end": 3266.832,
    "text": " yeah, the fact that our body works in this kind of environment, that it is a very good model on its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3267.613,
    "end": 3269.917,
    "text": "And I think the same also applies for priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3270.097,
    "end": 3284.061,
    "text": "I think you are able to construct priors that you are able to introspectively assess and also report and do reasoning about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3284.041,
    "end": 3288.145,
    "text": " But I think that some priors are just, let's say, hardwired.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3288.785,
    "end": 3293.349,
    "text": "In a way, I sometimes use this as an example for my students.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3293.389,
    "end": 3299.175,
    "text": "I would say that even the bone structure, the skull, these are also priors in a way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3299.515,
    "end": 3302.257,
    "text": "They're very inflexible, highly precise priors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3302.618,
    "end": 3306.661,
    "text": "But in a way, they allow us, the whole organism, to do inference about the world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3308.263,
    "end": 3308.383,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3308.403,
    "end": 3313.187,
    "text": "And then maybe differentiating that from the second type,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3313.606,
    "end": 3322.7,
    "text": " where you say that these priors, and here I can quote, aid perception by guiding attention, enhancing the relevant signal features and suppressing noise in sensations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3323.402,
    "end": 3331.134,
    "text": "So that's one side, the homeostatic priors, the preference priors, these are somewhat fixed unless you're sleeping and you can let your body temperature go down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3331.214,
    "end": 3334.519,
    "text": "But that aside, they're somewhat fixed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3334.539,
    "end": 3341.25,
    "text": "What's the difference between those and these priors involved in perceptual belief updating?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3342.26,
    "end": 3342.54,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3342.621,
    "end": 3351.054,
    "text": "I mean, I always like to make this distinction between creative coding and creative processing or active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3351.415,
    "end": 3358.186,
    "text": "So maybe some of my students are watching now and this is a typical exam question that I like to give for their master's defense here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.206,
    "end": 3359.829,
    "text": "I'm so jealous of these kids.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3359.849,
    "end": 3362.213,
    "text": "Kids as well, what am I talking about?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3362.273,
    "end": 3362.894,
    "text": "I'm so jealous.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3363.395,
    "end": 3364.116,
    "text": "Great exam question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3365.041,
    "end": 3373.376,
    "text": " So, I mean, the difference is now perceptual priors can be seen in this very stupid predictive coding way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3373.396,
    "end": 3384.395,
    "text": "So you have just a system that just tries to absorb the environment as it is to minimize the difference between what is actually sensed and what it already knows.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3384.415,
    "end": 3388.382,
    "text": "So this is predictive coding, nothing really interesting, so to speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3388.362,
    "end": 3394.733,
    "text": " from cognitive science or from this idea of organizing a living system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3395.214,
    "end": 3405.291,
    "text": "I think the interesting point comes if you say, no, it's not only about updating your Bayesian beliefs, it's also about Bayesian regulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3405.271,
    "end": 3419.258,
    "text": " And this is another formalism basically that you can easily introduce into the whole idea of of patient processing by saying, no, some of the priors, they don't update fixed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3419.9,
    "end": 3420.681,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3420.661,
    "end": 3440.83,
    "text": " in terms of perception this is a to give you a very simple example you might have the idea that there could be a snake out somewhere you take a look around and you don't see any snake so you update your prior belief okay well i heard something but there is no snake so this is okay so it's easy to update those very flexible priors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3441.232,
    "end": 3446.318,
    "text": " But there are some priors that have to be more or less fixed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3446.399,
    "end": 3452.526,
    "text": "And that's, for example, ideal body temperature or blood oxygenation, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3453.067,
    "end": 3463.24,
    "text": "Sometimes I hear as a criticism of people who are not familiar with predictive processing to say, oh, wait, why don't you just update your prediction that you die?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3463.827,
    "end": 3468.662,
    "text": " Of course, and this has something to do with fixed preferences that you have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3469.665,
    "end": 3472.996,
    "text": "So there is no way of actually reducing prediction error.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3473.437,
    "end": 3476.166,
    "text": "And I think having prediction error on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3476.804,
    "end": 3492.349,
    "text": " On some levels of your hierarchy, this is something that we have to learn and figure out experimentally in the future where it actually plays the biggest role, leads to the feeling of negative valence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3492.709,
    "end": 3496.315,
    "text": "So if there is prediction error that you cannot minimize,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3496.295,
    "end": 3497.296,
    "text": " it doesn't feel right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3497.637,
    "end": 3500.18,
    "text": "There is something, something very wrong about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3500.922,
    "end": 3516.464,
    "text": "So the only thing, and this now closes the loop, how you can actually minimize the prediction error between your sensations that you're having, for example, too little oxygen and your homeostatic set points, your preference is by doing actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3517.265,
    "end": 3518.927,
    "text": "You can, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3519.515,
    "end": 3523.281,
    "text": " breathe again, you can if you're too cold, you can put on a jacket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3523.721,
    "end": 3528.168,
    "text": "So this is how action is the only way of actually making this right again.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3528.769,
    "end": 3529.33,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.59,
    "end": 3544.212,
    "text": "And as I've said to my audience on many times, this is perfectly cast within the variational free energy equation itself, right, reducing KL divergence, recognition density and the true posterior, and then also maximizing model evidence, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3544.793,
    "end": 3546.696,
    "text": "So two things come to my mind here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3546.716,
    "end": 3547.918,
    "text": "The first is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3548.557,
    "end": 3553.204,
    "text": " We also talk about now we're using these POMDP schemes and Bayes graphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3553.224,
    "end": 3559.513,
    "text": "We also talk about priors over states and priors over paths and priors over actions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3559.533,
    "end": 3569.368,
    "text": "So we're talking about preferences, sensory, preferred sensory observations of my action, or we're talking about state transitions and we're talking about the E tense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3569.388,
    "end": 3570.249,
    "text": "So we're talking about habits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.269,
    "end": 3577.5,
    "text": "So I guess the reason why I bring that up is because for me, it's an incomplete picture without mentioning that, because in many ways,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3578.628,
    "end": 3582.777,
    "text": " right, I might, for me, I actually think it's important to divorce these different types of priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3583.659,
    "end": 3592.84,
    "text": "Because without that, I might say, well, I have an inflexible if I if I say that they're all one type, I have this inflexible prior that I don't want to be around snakes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3593.933,
    "end": 3604.632,
    "text": " But that means I get this perceptual information, right, with precise likelihood distribution that I'm probably, you know, this observation is quite likely given that there's a snake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3605.033,
    "end": 3607.377,
    "text": "I don't update that prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3607.398,
    "end": 3610.423,
    "text": "So I'm in real trouble, right, because there's a snake, but I'm not updating it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3611.095,
    "end": 3639.685,
    "text": " i guess the point here is well if i recognize at the higher level of the hierarchy that i am in a jungle for example i can now start doing this mental action where i through my mental action increase gain control over the likelihood distribution the a matrix and down regulate my prior right that doesn't mean that i discard my homeostatic requirements it just means it's more likely that there's going to be a snake and i'm going to respond accordingly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3639.985,
    "end": 3648.734,
    "text": " Um, I think a really useful piece of terminology here actually comes from Samji Nangoshi, who works at versus and is writing this textbook on Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3649.295,
    "end": 3653.359,
    "text": "Cause he talks about, uh, perceptual priors and what he calls autonomous priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3654.14,
    "end": 3669.216,
    "text": "And these autonomous priors are these like genetically determined or, or, or very, you know, deep rooted learn cultural priors, which as you say, are super high precision and, um, not affected by.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3670.023,
    "end": 3672.687,
    "text": " idiosyncratic context in which we find ourselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3673.148,
    "end": 3682.542,
    "text": "So maybe it's worth picking up here the role of attention and talking about the sort of hierarchy here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.564,
    "end": 3687.73,
    "text": "The picture that I've laid out, does that sound okay?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3687.75,
    "end": 3692.959,
    "text": "And does it kind of conflate issues by adding in like a third type of prior, which are the priors over action?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3693.92,
    "end": 3694.721,
    "text": "No, I don't think so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3694.741,
    "end": 3696.344,
    "text": "I think it totally makes sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3697.666,
    "end": 3698.427,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3698.795,
    "end": 3703.025,
    "text": " I mean, the amygdala cannot solve all the problems on its own.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3703.065,
    "end": 3705.11,
    "text": "So it has to be somehow integrated in that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3705.632,
    "end": 3713.952,
    "text": "I mean, this is this is what we how we also tried to reframe this whole idea of of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3713.932,
    "end": 3716.594,
    "text": " seeing the central amygdala as the only output region.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3716.655,
    "end": 3729.066,
    "text": "I think that every part of the amygdala has its output that play a relevance here in this kind of perceptual and action hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3729.487,
    "end": 3741.778,
    "text": "So the thing is, when you talk about attention, I think that predictions from the lateral amygdala to the unimodal cortices, for example,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3741.758,
    "end": 3748.665,
    "text": " they upregulate areas there to be more sensitive towards incoming stimuli.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3749.066,
    "end": 3755.312,
    "text": "So this is also a kind of neural gain control has something to do with attentional processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3756.413,
    "end": 3758.755,
    "text": "The same also for the central amygdala.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3758.775,
    "end": 3764.641,
    "text": "It's not only for actions, but also regulating arousal through the whole body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3764.762,
    "end": 3770.027,
    "text": "So if it's upregulating arousal, then your whole body",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3770.007,
    "end": 3783.798,
    "text": " physiology changes, your vision, the way you sample the world totally changes as a top down phenomenon, your your way of how you integrate interceptive feelings in your body as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3784.239,
    "end": 3786.244,
    "text": "So I think",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3786.393,
    "end": 3788.756,
    "text": " There is not just one attention mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3788.796,
    "end": 3803.351,
    "text": "I think attention is also a very multilevel process, and it's not only the kind of attention that we like to think of as conscious mental action that we also can do on this kind of agent personal level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3803.391,
    "end": 3813.582,
    "text": "But I think there are many sub personal aspects also playing a big role in how attention then forms the kind of attentional experience that we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3814.102,
    "end": 3815.244,
    "text": " Yeah, precisely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3815.504,
    "end": 3815.905,
    "text": "Precisely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3815.925,
    "end": 3816.806,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3818.729,
    "end": 3821.013,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3821.033,
    "end": 3830.788,
    "text": "I've been trying to stress in my own internal dialogue and also with other people that I see precision, precision, waiting and attention as three different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3831.609,
    "end": 3832.511,
    "text": "They are not the same thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3832.531,
    "end": 3835.695,
    "text": "Precision is a very technical mathematical inverse entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3835.756,
    "end": 3837.358,
    "text": "Precision waiting is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3838.064,
    "end": 3840.688,
    "text": " in part informed by precision, but also context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3841.188,
    "end": 3845.895,
    "text": "And then attention is this kind of optimization of that precision weighting over one tensor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3846.315,
    "end": 3854.146,
    "text": "So I think that's kind of useful for people because most people are just used to hearing, well, attention is precision weighting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3854.667,
    "end": 3857.811,
    "text": "It's like, that won't do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.993,
    "end": 3864.36,
    "text": " I guess even like confound this problem even more, you have, you start having stuff like priors over priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3864.44,
    "end": 3874.812,
    "text": "So you have like, okay, I have a prior about the actual distribution of my prior, but I think the way that Sanju explained this to me, which is really useful is look at the brain and look how many ridges there are in the brain, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3874.832,
    "end": 3880.598,
    "text": "Like once you start actually folding in these hierarchies, it all kind of makes sense why the brain looks like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3881.299,
    "end": 3886.785,
    "text": "So, and this is an interesting question, I guess, because of your expertise in neuroscience and neuroanatomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3887.457,
    "end": 3891.16,
    "text": " Do you think, so we've now brought like four different priors into the game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3891.22,
    "end": 3895.644,
    "text": "Do you think that these are going to look the same?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3895.664,
    "end": 3903.271,
    "text": "I know that's a very broad brush question, but what I mean when I say look the same is, are they going to have the same signature of neuronal firing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3903.811,
    "end": 3908.856,
    "text": "Are they going to be, is the neurotransmitter associated with them going to be the same?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3909.496,
    "end": 3916.182,
    "text": "Or are we just giving a semantic blanket to simplify the situation for something which is going, they're going to be wildly different?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3916.162,
    "end": 3918.507,
    "text": " That's a very good point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3918.527,
    "end": 3922.495,
    "text": "I mean, the model that we are proposing, this is a kind of functional model that we're saying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3922.535,
    "end": 3928.667,
    "text": "We are not yet sure how it will be implemented on a neural level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3929.188,
    "end": 3935.2,
    "text": "But what we can say is, I mean, a lot...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3935.804,
    "end": 3944.443,
    "text": " A lot of things moving forward will have something to do with dopaminergic innovation, for example, but also other neuromodulators.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3944.904,
    "end": 3953.863,
    "text": "I think neuromodulators will play a big role in understanding this precision modulating, but not only for inference, but also for learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3954.232,
    "end": 3962.663,
    "text": " So I very much like Chris Mattis idea of precision weighted belief updating.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3963.364,
    "end": 3968.09,
    "text": "This is a context that he is a concept that he uses very frequently in his research.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3968.771,
    "end": 3983.31,
    "text": "And so one prediction would be if you have no way of modulating top down precision, then you're not going to keep going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3984.134,
    "end": 3987.198,
    "text": " then you're also not updating your prior beliefs, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3987.218,
    "end": 3994.907,
    "text": "If it's if it's just a very fixed belief, then no way of modulating it by dopamine, for example, you're stuck.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3995.267,
    "end": 4003.937,
    "text": "And this is something that actually might take place in in the central medial amygdala, where you have less flexibility.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4005.159,
    "end": 4008.443,
    "text": "There is less innovation by dopaminergic regions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4009.164,
    "end": 4012.808,
    "text": "And this is something that is, yeah,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4012.788,
    "end": 4033.912,
    "text": " is now basically also of interest for the effects of serotonergic medication, even psychedelics, that neuroplasticity might be actually increased by giving large doses of serotonin.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4034.313,
    "end": 4041.681,
    "text": "And this would then allow for re-updating those preference priors in those areas.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4042.353,
    "end": 4043.634,
    "text": " Yeah, yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.735,
    "end": 4043.975,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.995,
    "end": 4053.045,
    "text": "So in that picture, it sounds like the preference priors or homeostatic priors, you're on the call them are higher up than in some ways the perceptual priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4055.107,
    "end": 4056.189,
    "text": "Okay, that's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4056.229,
    "end": 4070.925,
    "text": "Because as I said, before, to have this flexible updating of your prior in terms of the perceptual belief updating, you have to down regulate your precision waiting over that prior that perceptual prior right in turn, a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4071.395,
    "end": 4074.639,
    "text": " increase the precision over the likelihood distribution of the sensation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4075.421,
    "end": 4080.848,
    "text": "But that seems to me to be governed at the higher level by an action policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4081.008,
    "end": 4083.892,
    "text": "Like, do I want to relinquish precision over this prior?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4084.673,
    "end": 4093.606,
    "text": "And maybe in many ways, we have this idea of rebus, which is Carl and Robin Carl Harris's notion that psychedelics flatten out the prior landscape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.626,
    "end": 4097.571,
    "text": "But that's a very neat narrative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4097.804,
    "end": 4099.607,
    "text": " But which priors, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4099.647,
    "end": 4102.09,
    "text": "Like all of them at which level?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4102.21,
    "end": 4108.219,
    "text": "And I think what I'm really excited about in being an active inference in the community is this notion of deep parametric modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4108.819,
    "end": 4116.63,
    "text": "The idea that we can't just take one slice of the hierarchy and say that that's sufficient to account for perception or action, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4116.67,
    "end": 4119.214,
    "text": "Because it runs deep, unfortunately.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4120.035,
    "end": 4125.803,
    "text": "I wonder, yeah, I wanted to kind of go to your teaching",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4128.112,
    "end": 4137.065,
    "text": " When you say, okay, this is a hierarchy and whatever you think is going on at like the perceptual level is going to be informed by the conceptual level, which is going to, and God knows what's at the top.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4138.247,
    "end": 4146.859,
    "text": "How many layers, this is a very stupid question, but how many layers do you kind of envisage mentally when you're talking about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4147.059,
    "end": 4151.105,
    "text": "And if you can even say, where does it stop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4151.526,
    "end": 4153.849,
    "text": "What's the kind of guiding principle?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4154.268,
    "end": 4155.531,
    "text": " So it's definitely 7.2.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4159.301,
    "end": 4160.484,
    "text": "I've heard people say 7.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4160.885,
    "end": 4161.747,
    "text": "I'm not even joking.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4161.767,
    "end": 4162.85,
    "text": "I've heard people say 7.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.491,
    "end": 4163.772,
    "text": "Really?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.554,
    "end": 4168.243,
    "text": "Yeah, 7 or 8 or maybe 12.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4169.371,
    "end": 4181.113,
    "text": " I mean, now I'm taking on my data scientist had actually if you add layers to a hierarchical model, at some point you will run out of data to actually process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4181.193,
    "end": 4185.201,
    "text": "So you will see that some layers will not process anything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4185.221,
    "end": 4187.806,
    "text": "So it can go on, can be gone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4187.926,
    "end": 4188.527,
    "text": "And that's that's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4190.65,
    "end": 4193.794,
    "text": " So it's it's removing complexity whenever it can.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4194.015,
    "end": 4196.899,
    "text": "This is the things of the friendship principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4197.64,
    "end": 4200.624,
    "text": "So if there's nothing to process, they will be gone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4201.646,
    "end": 4213.182,
    "text": "And I mean, this has a lot in this also nicely links, for example, to the concept of of meditation where you say, okay, you basically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4213.482,
    "end": 4227.298,
    "text": " just you want to disengage with your normal way of being in the world of, you know, acting on the world having goals in mind that you want to achieve, but the only thing that you want to do is just sit there and be there in this very moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4227.719,
    "end": 4241.515,
    "text": "So what are you actually doing, you create a state where not pros actively processing anything, and you try to, you know, just calm everything down that you see, and what is the experience that you're going to have if you have never meditated before?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4242.17,
    "end": 4242.751,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4242.771,
    "end": 4244.373,
    "text": "Well, yeah, it's just distraction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4245.315,
    "end": 4246.216,
    "text": "It's distraction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4246.417,
    "end": 4250.663,
    "text": "And the effective feeling would be boredom, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4251.144,
    "end": 4251.625,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4251.645,
    "end": 4256.753,
    "text": "In some way, actually, you don't have anything to process at this kind of level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4257.053,
    "end": 4257.574,
    "text": "You feel it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4258.095,
    "end": 4261.781,
    "text": "You don't know what to kind of do with this kind of experience that you're having.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4262.202,
    "end": 4268.211,
    "text": "But over a long time, when you're trained to that, you will basically",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4268.444,
    "end": 4278.161,
    "text": " Yeah, get maybe also this kind of hierarchical layer that would be necessary to actually process this kind of meter, meter.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4278.542,
    "end": 4279.744,
    "text": "That's really nice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4279.764,
    "end": 4281.968,
    "text": "Kind of informative data.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4281.988,
    "end": 4284.312,
    "text": "And then you get used to it and then you're fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4284.372,
    "end": 4287.718,
    "text": "This is how you can add yet another level of the hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4288.306,
    "end": 4289.468,
    "text": " Oh, that's really lovely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4289.669,
    "end": 4289.869,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4289.889,
    "end": 4290.35,
    "text": "That's cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4290.951,
    "end": 4299.848,
    "text": "Uh, it's kind of like we're inventing our, or, or creating our own Markov blankets, our intermediate Markov blankets between just, I mean, which we have right already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4299.908,
    "end": 4300.849,
    "text": "I mean, of course we do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4300.87,
    "end": 4304.897,
    "text": "We're deeply hierarchical beings, but I like the idea that we're kind of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4305.923,
    "end": 4320.166,
    "text": " It's context contingent in the sense, I think you mentioned actually in your paper that the central amygdala was kind of generally seen as responding to these kind of hardwired, appetitive or aversive stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4320.867,
    "end": 4328.86,
    "text": "So a tiger or a mango, but actually that hasn't been fleshed out at all in experimental contexts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4328.924,
    "end": 4333.908,
    "text": " because stimulus stimuli have subjective values, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4333.928,
    "end": 4339.033,
    "text": "It's we don't all sit down and agree with God that we want mangoes and we don't want tigers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4339.093,
    "end": 4341.275,
    "text": "Cause maybe you have a pet tiger and maybe you're allergic to mangoes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4342.076,
    "end": 4353.306,
    "text": "So maybe it's worth, I don't know if you've got anything to say on that, but like, as you say, there are clearly some hardwired ones that we need to be human, right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4353.326,
    "end": 4358.29,
    "text": "To be this thing that persists through time that minimizes variational free energy, but they're also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4358.692,
    "end": 4361.699,
    "text": " others which are downstream on subjective evaluation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4362.942,
    "end": 4367.953,
    "text": "Where do you kind of do you see those as two distinct categories with a bright line between them?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4368.013,
    "end": 4373.385,
    "text": "Or do you see maybe the subjective evaluative ones emerging from the homeostatic ones?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4373.445,
    "end": 4375.57,
    "text": "Where's the what's the kind of interplay between those two?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4376.697,
    "end": 4377.318,
    "text": " Yeah, always.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4378.339,
    "end": 4382.784,
    "text": "Whenever I start to think about these things, it always looks a little bit like a gradient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4383.544,
    "end": 4388.129,
    "text": "So I think there are no exact boundaries at some point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4388.59,
    "end": 4396.598,
    "text": "But I mean, some of the very fixed beliefs we have about how the world should be, I mean, they feel very much real.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4396.658,
    "end": 4404.747,
    "text": "They feel like we're losing parts of ourselves if we give up this, I don't know, this fact that we are",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4404.727,
    "end": 4420.44,
    "text": " seem to believe about the world so we feel that everything falls down if we have to give it up even even though it's just something constructed even show it even if it's just something made up right so um in a sense you could say that certain uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4420.42,
    "end": 4430.312,
    "text": " beliefs have had adaptive value, where you say this might be also cultural norms that were transmitted.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4430.433,
    "end": 4433.476,
    "text": "And so there might be some merit to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4434.958,
    "end": 4442.007,
    "text": "But I think it's this,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4441.987,
    "end": 4451.665,
    "text": " There's still this gradient of things that you can easily unlearn and easily update, and that is where you are holding on a little bit harder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4452.827,
    "end": 4453.067,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4455.051,
    "end": 4455.692,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4455.976,
    "end": 4460.804,
    "text": " So now we've been talking about hierarchies and the complexity of the human system and its capacity to adapt.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.725,
    "end": 4466.392,
    "text": "You also mentioned in brief in your paper, the possibility of engrams in the amygdala.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4467.153,
    "end": 4473.624,
    "text": "So people associate engrams, I mean, you'll do a better job explaining engrams than I will, but with the hippocampus and with memory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4474.465,
    "end": 4482.237,
    "text": "And the way that I read that in the computational sense is kind of almost automated behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4482.588,
    "end": 4487.735,
    "text": " and habits and really, you know, strong priors over action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4488.957,
    "end": 4494.345,
    "text": "So maybe it's worth starting there with the neuroanatomy because the amygdala is connected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4494.365,
    "end": 4501.174,
    "text": "It has a route to the hippocampus and then say exactly what you mean, because it sounds like, oh, the amygdala has a memory in some sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4501.535,
    "end": 4502.376,
    "text": "What does that mean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4502.416,
    "end": 4506.802,
    "text": "And what does that, how does that add to this already complicated story?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4508.204,
    "end": 4508.384,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4508.444,
    "end": 4510.367,
    "text": "What I'd like to say,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4510.634,
    "end": 4521.045,
    "text": " stress because I think this is really important is that I don't think that there are distinct memory and processing networks in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4521.165,
    "end": 4530.836,
    "text": "I think when you look at the neuron, you could say, I mean, when you use the computer metaphor, it's both the CPU and the memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4531.016,
    "end": 4535.781,
    "text": "So one neuron already does this kind of computation and it has memory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4536.822,
    "end": 4537.823,
    "text": "Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4538.208,
    "end": 4550.026,
    "text": " Sometimes, you know, when we write cognitive neuroscience textbooks, we like to put big section headlines and we call one section memory and the other one decision making, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4550.127,
    "end": 4552.25,
    "text": "This is already what a neuron is doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4552.63,
    "end": 4554.954,
    "text": "It has its thresholds and it has its memories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4556.036,
    "end": 4563.287,
    "text": "And the interesting question now is what does a memory recognize, actually?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4563.841,
    "end": 4575.406,
    "text": " Some of the features or some of the neural computational role a neuron is playing is only played when it's actually, when it's spiking, when it shows activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4575.887,
    "end": 4577.27,
    "text": "But there is another aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4577.55,
    "end": 4581.158,
    "text": "A neuron also can be totally inactive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4581.138,
    "end": 4586.106,
    "text": " and already plays a role in that by, for example, suppressing inputs that are coming in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4586.186,
    "end": 4588.79,
    "text": "It filters away noise.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4588.81,
    "end": 4605.016,
    "text": "And this would be a very energy efficient way of actually doing neural processing when it just shuts down things that are not needed anymore and only propagates those things that are meaningful deviations and then newsworthy for the other parts of the hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4605.436,
    "end": 4609.002,
    "text": "And this is what I actually mean with memory engrams.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4608.982,
    "end": 4638.043,
    "text": " So what would that look like in terms of... Because for me, and I make reference here to this new paper by George Dean and Lars Sandberg-Smith and others looking at canalized behavior, it sounds to me that actually having kind of engrams or kind of a proto-memory system or a memory system in the amygdala could be somewhat pathological in the sense that if it's done...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4638.547,
    "end": 4650.678,
    "text": " you know, if it's a non-adaptive form of response, then we have this habituated response that we have no prefrontal cortex regulation over that's freaking out every time we see a rope, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4650.718,
    "end": 4656.503,
    "text": "Because I'm like, oh, I think that's a snake or a face in a rock because I have social anxiety.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4657.444,
    "end": 4663.589,
    "text": "So what's the adaptive role of these kind of engrams?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4663.969,
    "end": 4666.832,
    "text": "And yeah, what's their...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4666.981,
    "end": 4671.408,
    "text": " that being so, what's their role also potentially in something like psychopathology?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4673.571,
    "end": 4691.419,
    "text": "I mean, I kind of see myself as also following this idea that brought forward by computational psychiatry people like Klaas Engelstefan and Carl Fristen and Ray Dolan and also Phil Collette, of course, because sometimes they like to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4691.905,
    "end": 4702.269,
    "text": " reframe pathologies in a way to say, okay, hey, listen, people, actually, it's coming from a, there's some kind of good intention behind this mechanism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4702.549,
    "end": 4703.411,
    "text": "It stays optimal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4703.672,
    "end": 4709.104,
    "text": "There's actually an adaptive value of depression, of anxiety, and so on and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4709.084,
    "end": 4714.572,
    "text": " And in this context, I would like to say, yeah, I mean, it is good to be afraid of certain things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4714.752,
    "end": 4722.063,
    "text": "It's good to have this kind of stereotypical reactions, those habitual reaction to stimulus that is coming.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4722.083,
    "end": 4729.433,
    "text": "If something is dashing towards me and I would just, you know, raise my arms to protect my face, then this is a very good adaptive response.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4729.894,
    "end": 4733.639,
    "text": "Even though, I mean, even it might be a train running towards me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4733.699,
    "end": 4735.682,
    "text": "And of course my hands will be, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4735.662,
    "end": 4763.593,
    "text": " uh quite uh futile to use less yeah good luck i mean it's the last resort that i have it's the only thing that i can potentially do and maybe it helps me but of course in the modern world it does not the thing is uh many of these things are pretty adaptive in in nature but of course something can go wrong and the question is um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4764.147,
    "end": 4771.296,
    "text": " Is it always that is it actually going wrong or is it something that the brain cannot just no longer adapt to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4771.637,
    "end": 4776.623,
    "text": "When you think of of of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4776.643,
    "end": 4783.192,
    "text": "This preference price, many of them in the middle, I think, are acquired during early parts of your childhood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4784.453,
    "end": 4789.48,
    "text": "I mean, this is studied in most models and there is indirect evidence also in humans for that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4789.848,
    "end": 4796.791,
    "text": " So you basically learn what kind of place the world is, whether it's a very dangerous place or whether it's a safe place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4797.594,
    "end": 4799.52,
    "text": "And depending on that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4799.804,
    "end": 4806.072,
    "text": " I mean, the whole architecture of of the brain down to the biochemical level will change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4806.492,
    "end": 4808.715,
    "text": "So, I mean, gene regulation is a big thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4809.356,
    "end": 4817.867,
    "text": "And the way the DNA is called up around the histones are how likely it is to, for example, produce stress hormones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4819.168,
    "end": 4822.032,
    "text": "These are things that are already",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4822.619,
    "end": 4835.58,
    "text": " some kind of not determined, but influence already at this early part in development and the developmental windows where those things can actually take place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4836.021,
    "end": 4841.59,
    "text": "And then they are there for the rest of your life in a way, if not treated properly, if not unlearned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4842.43,
    "end": 4847.717,
    "text": " So the thing is, they might have had an advantage back then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4847.757,
    "end": 4852.724,
    "text": "You know that the world is dangerous, so you should be fast with your stress responses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4853.024,
    "end": 4858.973,
    "text": "And so this could be then also the reason for many psychopathologies later on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4859.073,
    "end": 4863.679,
    "text": "So some people then will find when they are grown up",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4864.25,
    "end": 4866.352,
    "text": " Um, different behavioral solutions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4866.372,
    "end": 4879.426,
    "text": "So some could be, um, yeah, they're more anxiety prone because they know they are always basically the victim of a situation in a situation, but other people might find that aggression is actually the go to solution for many things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4879.526,
    "end": 4888.536,
    "text": "And, um, then when behavior can be a consequence from that, because they're basically avoiding, uh, being hurt by hurting somebody else, uh, before that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4889.056,
    "end": 4903.569,
    "text": " But the foundation for that could already be basically ingrained into those preference priors that are set early during maturation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4904.35,
    "end": 4916.481,
    "text": "Yeah, that's really fascinating because I think it adds another level of complexity to this kind of bracketed category that we've been calling preference priors, because I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4917.068,
    "end": 4946.974,
    "text": " reason reason my two cents on this is the reason why something becomes pathological as you say in many cases what we would consider pathological or maladaptive is very adaptive in certain contexts so in some ways it's the social context but it's also the capacity or the consequence of the individual reflecting on their own behavior and so things get worse you know in layman's terms things get worse if you're like oh this is terrible like why can i not go to the party why can i not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4947.19,
    "end": 4950.235,
    "text": " leave my house without checking the door 15 times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4951.096,
    "end": 4965.699,
    "text": "And that seems to me that like, what's what's happening here is that you've got two preference priors fighting with one another one is one is a higher order one, I would actually say, which is I kind of want to be a normal, adaptive, socially functioning human being.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4966.381,
    "end": 4971.088,
    "text": "And the other is, there's a very high probability of they're going to be danger.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4972.013,
    "end": 4978.52,
    "text": " And then these both kind of feed into the perceptual act and the active act, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4979.32,
    "end": 4987.388,
    "text": "And so you end up with this miscalibrated hierarchy where things are getting confirmed on one level, which is clashing with the confirmation at another level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4988.189,
    "end": 4998.96,
    "text": "Which makes me think that there might be some truth in the idea that a sort of adaptive human being is one where the hierarchy is consonant or compatible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4999.0,
    "end": 5001.042,
    "text": "The levels are compatible with each other all the way up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5002.0,
    "end": 5016.323,
    "text": " So you don't have something like cognitive discord or, yeah, this kind of, well, I actually been calling oppositional self-modeling, this kind of idea that we might be sustaining ourselves at one level, but denying evidence at another level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5016.804,
    "end": 5021.531,
    "text": "Just wondering if you have any ideas about that and maybe how they actually feed into the way that we're perceiving and acting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5021.551,
    "end": 5025.618,
    "text": "I know it's very complicated because it's hierarchical, so it's always going to be complicated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5025.678,
    "end": 5027.721,
    "text": "But I was wondering if you had any thoughts about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.005,
    "end": 5032.171,
    "text": " No, I think this is a wonderful explanation that you gave already.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5032.472,
    "end": 5039.082,
    "text": "I mean, if we try to now link it to the amygdala model, I think it would be precisely this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5039.122,
    "end": 5050.62,
    "text": "I mean, you have in anxiety disorders, patients are aware that their anxiety, their experience is excessive and it's not useful what they're having, but they cannot do anything about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5050.837,
    "end": 5053.583,
    "text": " So what they're feeling is a loss of control.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5053.603,
    "end": 5064.346,
    "text": "I mean, first also about their bodily states, because when you have to say social anxiety disorder, they feel that the heart is racing, that they're sweating, they cannot control the blushing whatsoever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5064.827,
    "end": 5070.6,
    "text": "This loss of control actually feeds into their, uh, into their feel, uh, feeling of, uh,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5070.58,
    "end": 5075.649,
    "text": " of threat, of danger, of terror, of being humiliated, all those negative emotions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5076.23,
    "end": 5077.132,
    "text": "So this is one thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5077.152,
    "end": 5083.563,
    "text": "The other thing is also the loss of control that they're not able to change this part of themselves.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5084.505,
    "end": 5089.634,
    "text": "So they cannot just update their belief to say, okay, but this is fine or this should be fine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5090.596,
    "end": 5092.74,
    "text": "And the reason could be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5092.838,
    "end": 5100.308,
    "text": " that what we were saying when we talked about the preference priors, you are not able to update them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5100.688,
    "end": 5114.907,
    "text": "And for good reason, because I mean, you should learn during your early maturation what the world is like, and you should stick to that because this is something that is apparently useful and you shouldn't just update it because you are in a good mood.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5115.368,
    "end": 5118.492,
    "text": "Like you shouldn't change your preference priors for blood oxygen.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5118.64,
    "end": 5128.074,
    "text": " If something is interfering with this kind of mechanisms, like say opiates, for example, then the system might break and you might die.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5128.575,
    "end": 5134.463,
    "text": "The same might also be for this kind of social preference priors of what social signals are dangerous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5134.683,
    "end": 5141.914,
    "text": "And so it's very good that they work very efficiently without you paying attention to it in a very autonomic way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5141.894,
    "end": 5153.295,
    "text": " And even if you're stupid, even if you're drunk or whatever, in this situation, you should be able to just, you know, update those beliefs and, and, and it should be, uh, and, and bring yourself into, into danger.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5155.299,
    "end": 5155.6,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5155.66,
    "end": 5155.76,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5155.8,
    "end": 5158.906,
    "text": "I've got one more technical question and then we can leave it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5159.146,
    "end": 5160.088,
    "text": "Um, I guess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5161.317,
    "end": 5169.993,
    "text": " I can't really mentally figure out what's the kind of mechanism underlying this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5171.015,
    "end": 5176.145,
    "text": "Because on one hand, it sounds like it's hyper or aberrant precision over the likelihood distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5176.526,
    "end": 5181.435,
    "text": "And I think this maps onto something like hyper fixation or vigilance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5181.415,
    "end": 5183.798,
    "text": " because the A matrix is associated with attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5184.419,
    "end": 5208.553,
    "text": "And why I say that is okay, so the likelihood is, I would, you know, I think of it as y given x, so the observation given the state, and let's use our sort of, if I've got a snake phobia, if I say that, if I put really high precision over that likelihood matrix, what I'm saying is, these observations I've had is very likely to have come from the state of there being a snake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5209.883,
    "end": 5214.629,
    "text": " At the same time, I think of these disorders as being rooted in the priors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5215.61,
    "end": 5222.958,
    "text": "I might have a hyper precise or extremely strong prior that I can't be in the company of snakes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5224.12,
    "end": 5235.132,
    "text": "And so if I get the slightest evidence of that, given my likelihood distribution, my posterior is so divergent from my prior that that constitutes prediction error and a call to action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5236.334,
    "end": 5239.097,
    "text": "So there are two kinds of mechanisms going on there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5240.326,
    "end": 5253.205,
    "text": " And maybe that has actually been underpinning my sort of general qualm with the notion of prior and the ambiguity surrounding the word prior, which I think has not been really discussed in the active inference community enough.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5255.027,
    "end": 5260.015,
    "text": "Could you help us see what, given from the perspective of the amygdala, is it both?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5260.736,
    "end": 5261.797,
    "text": "Is it one of those?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5261.857,
    "end": 5262.779,
    "text": "Is it neither?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5263.66,
    "end": 5266.604,
    "text": "Like what's kind of going on here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5266.724,
    "end": 5270.029,
    "text": "That's a fascinating question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5270.195,
    "end": 5273.181,
    "text": " I mean, you are the first one to ask me this kind of question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5274.263,
    "end": 5277.449,
    "text": "And I have to say, I also thought about it and I don't have a solution for it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5277.529,
    "end": 5281.116,
    "text": "I mean, it could have something to do with how we formulate the active inference model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5281.717,
    "end": 5292.017,
    "text": "I think this problem vanishes if we use a simpler hierarchical Gaussian filter, for example, by Chris Mattis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5291.997,
    "end": 5305.32,
    "text": " I don't know, maybe the active inference model got a little bit overambitious at some point and is no longer pure in this very simple computational sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5305.4,
    "end": 5311.39,
    "text": "And many things were added to it to do many impressive things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5311.37,
    "end": 5317.179,
    "text": " maybe a more vanilla, more simple model could actually also help us to figure it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5318.12,
    "end": 5329.237,
    "text": "So maybe there is no such a thing as a likelihood mapping that is different from prior beliefs that we should take care of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5329.257,
    "end": 5329.678,
    "text": "But I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5330.118,
    "end": 5331.28,
    "text": "Yeah, well, not yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5331.36,
    "end": 5332.101,
    "text": "I guess no one knows.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5332.121,
    "end": 5339.993,
    "text": "I mean, the proof will be in the experimental work and the triangulation that can come from experimental work and the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5340.378,
    "end": 5368.073,
    "text": " neurology and the neuro scanning and the computational modeling right um i think i think what you show very nicely here is that there's a limit to theorizing um and i think to be honest my perspective is active inference is really in its kind of uh it's at its highest moment of strength when it's extremely general so when i say i'm minimizing variational free energy all the time",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5368.39,
    "end": 5371.375,
    "text": " Yeah, I'm 100% on board with that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5371.475,
    "end": 5378.967,
    "text": "And for me, that way that decomposes into perceptual adequacy and normative adequacy is really nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5379.768,
    "end": 5381.29,
    "text": "And the expected free energy equation is really nice.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5381.31,
    "end": 5385.557,
    "text": "But I guess these questions is, well, you're going to need some deep modeling here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5386.258,
    "end": 5392.588,
    "text": "I guess the slight problem is, and this is stuff I've run into when I've been trying to think about these Bayes graphs and modeling the phenomena that I'm interested in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5392.628,
    "end": 5395.933,
    "text": "There might be two Bayes graphs which give you the same output.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5396.47,
    "end": 5398.736,
    "text": " Um, so which one wins, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5398.756,
    "end": 5402.726,
    "text": "Is it just elegance because we want non-complex accurate models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5403.388,
    "end": 5410.446,
    "text": "Is it a generalizability, but you know, so these are open questions, but I think they're really important to raise in this kind of forum.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5410.966,
    "end": 5412.188,
    "text": " I totally agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5412.208,
    "end": 5419.299,
    "text": "This was also the motivation for this kind of paper, because at one point we want to make empirical predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5419.359,
    "end": 5430.016,
    "text": "I mean, what we're doing in this paper at the moment is we post hoc reframe certain explanations that we have in the literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5430.036,
    "end": 5433.261,
    "text": "I mean, they're all compatible with the story that we are telling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5434.49,
    "end": 5436.432,
    "text": " new way of looking at these things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5437.273,
    "end": 5442.5,
    "text": "But the next step would be, of course, we have to, I mean, we're already making some kind of empirical predictions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5442.58,
    "end": 5459.08,
    "text": "Next will be more precise computational predictions where we really look at how it could be, what kind of modeling parameters that we use are actually reflected by some changes in the brain or behavior that we can actually observe with the methods that we have.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5459.06,
    "end": 5487.16,
    "text": " available and then only then we will see if this model is actually useful or if it's just a nice folk story or something with no relevance for science whatsoever so this is what we have to find out and i mean this is also what i tell my my colleagues from cognitive neuroscience who engage now also in active inference and i tell them yeah we have to make good predictions empirical predictions about yet another modeling paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5487.14,
    "end": 5491.487,
    "text": " where we just showed behavior of some artificial agent doing something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5491.987,
    "end": 5496.033,
    "text": "Because nowadays we come to the point that philosophers are making fun of us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5496.154,
    "end": 5497.936,
    "text": "They say, okay, we're too theoretical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5497.996,
    "end": 5501.682,
    "text": "We are too detached from really empirical practice.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5502.183,
    "end": 5505.688,
    "text": "And we should now get back to the lab and really try it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5506.09,
    "end": 5508.113,
    "text": " So this is definitely the roadmap for the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5508.153,
    "end": 5523.131,
    "text": "Now, first that I conceptualize this kind of the space of different phenomena that we usually like to think of when we talk about the amygdala, how it could actually map to a different narrative.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5523.252,
    "end": 5529.119,
    "text": "The next will be to come up with a computational model with precise predictions, and then we are going to test it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5529.72,
    "end": 5535.507,
    "text": "And I will, yeah, I haven't figured out what kind of architecture I actually want to use.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5537.073,
    "end": 5537.694,
    "text": " Fantastic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5538.274,
    "end": 5540.217,
    "text": "Well, this is fascinating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5540.237,
    "end": 5549.849,
    "text": "I mean, the one thing we didn't even mention are the parameters involved in perceptual updating and the fact that they contribute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5550.81,
    "end": 5555.896,
    "text": "And here you can sort of have all your linear equations and stuff, but we'll leave that to the mathematicians.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5556.276,
    "end": 5559.3,
    "text": "And I also don't think we're going to solve this problem today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5559.82,
    "end": 5573.314,
    "text": " I mean, there's an important thing that I want to say as a finisher for this last block, because, I mean, I said I was so unsure about the likelihood mapping and how the price actually encoded.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5573.815,
    "end": 5577.139,
    "text": "So, I mean, there's this idea of, you know, Cunningham's laws.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5577.639,
    "end": 5585.027,
    "text": "You get an answer to your question by posting the wrong answer to a question on the internet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5585.087,
    "end": 5586.188,
    "text": "And this is what I'm doing now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5586.208,
    "end": 5589.692,
    "text": "I say, okay, no, no, no, there is no such a thing as a likelihood mapping.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5590.617,
    "end": 5613.587,
    "text": " go ahead and show me how it's really done and this is also applies to this kind of uh new amygdala model i don't know if it's the right model but i i think we we wanted to do something a little bit ambitious because what we found was that the typical narrative doesn't add up with what we observe in the human but also in the rodent data so it was collaborating with two mouse researchers and",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5613.972,
    "end": 5621.219,
    "text": " I mean, when I talked to them about my ideas of effective inference, they said, yeah, this might be the only way our data could make sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5621.78,
    "end": 5629.627,
    "text": "So there is some problem with the existing theory that we're having, and maybe we provided the wrong answer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5630.027,
    "end": 5638.396,
    "text": "But I think if somebody is able to falsify us to show us where we are wrong, I think we will learn a lot of what the amygdala is actually doing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5638.576,
    "end": 5640.958,
    "text": "This would be the next step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5641.478,
    "end": 5642.119,
    "text": " Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5642.139,
    "end": 5646.927,
    "text": "Well, I appreciate both the both the pessimism and the optimism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5648.93,
    "end": 5663.614,
    "text": "Yeah, and sometimes I just wonder whether it's just we're just in a semantic cloud of confusion, you know, whether if we just can have different work, like I've been trying to integrate this word autonomous prior and differentiate it from something like a perceptual prior or hidden state prior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5663.754,
    "end": 5666.338,
    "text": "And, and then I, you know, again, as I said,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5667.398,
    "end": 5679.542,
    "text": " we need to fold in stuff like parameters, the parameters of our generative model and linear functions and the way that this might spit at like the Y given X is really complicated, especially in dynamic stochastic worlds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5679.762,
    "end": 5683.109,
    "text": "Um, it's not just like a static hidden variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5683.209,
    "end": 5684.091,
    "text": "So.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5684.257,
    "end": 5684.858,
    "text": " in variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5685.719,
    "end": 5687.36,
    "text": "So you're absolutely right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5687.38,
    "end": 5691.805,
    "text": "I think I think the money Yes, I mean, there's this, there's this, um, I think you're absolutely right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5691.825,
    "end": 5694.968,
    "text": "I mean, I don't know where the humans have the capacity to model these things perfectly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5695.209,
    "end": 5696.41,
    "text": "And maybe we don't need to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5697.331,
    "end": 5701.715,
    "text": "Science doesn't necessarily work on perfect modeling, it kind of works on effective predictions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5702.296,
    "end": 5708.883,
    "text": "And so maybe we need to get back to the lab and do a bit more, oddly go back to a bit more of a coarse grained world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5710.485,
    "end": 5713.588,
    "text": "Where if things work, things work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5714.058,
    "end": 5715.581,
    "text": " I totally agree.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5715.641,
    "end": 5720.811,
    "text": "So because I think there is no big narrative of what the world really is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5720.851,
    "end": 5723.436,
    "text": "And there's not one model to model the whole world.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5723.837,
    "end": 5734.497,
    "text": "I think and this is I think one of the natural consequences of active entrance is that we can only go for an instrumentalistic interpretation of what's going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5734.477,
    "end": 5762.492,
    "text": " because anything we observe is always conditional on something it's conditional on our model but it's also conditional on our actions so we have certain uh we have certain preferences we want uh we want to achieve certain things and i mean the minimal preference could be not to die for example already causes us to inquire and to act in in a specific way when we're interacting with the world",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5762.472,
    "end": 5768.502,
    "text": " So there is always this conditional dependency that we should take under consideration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5768.702,
    "end": 5772.849,
    "text": "And there is no way of getting the whole joint distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5772.869,
    "end": 5774.572,
    "text": "It's always conditional on something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5774.953,
    "end": 5783.687,
    "text": "So it's always all kinds of data that we are sampling is sampled for a particular use case because it asks the thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5784.106,
    "end": 5785.808,
    "text": " That's that's perfectly put.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5785.828,
    "end": 5791.915,
    "text": "That's exactly what I wanted to say, but for the last hour and a half, but way better said, Ronnie, this was, this was amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5791.935,
    "end": 5798.221,
    "text": "I mean, I, I, you know, I, all the expected us to spend more time talking about the amygdala and less time talking about active inference more generally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5798.282,
    "end": 5807.852,
    "text": "But I think you're, you're one of the, you're one of genuinely, you're one of the only people I know who was teaching active inference directly on the ground day by day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5808.625,
    "end": 5817.858,
    "text": " And I think that is a huge, I mean, there's huge kudos to you because I can imagine that's not easy, especially with the fact that it's updating the whole time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5817.918,
    "end": 5820.381,
    "text": "We have different schema that we're employing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5820.461,
    "end": 5824.807,
    "text": "We're chucking some ideas out, retaining some, simplifying, complexifying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5825.448,
    "end": 5827.711,
    "text": "So thanks for doing that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5827.852,
    "end": 5828.813,
    "text": "Rather you than me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5828.853,
    "end": 5831.697,
    "text": "I guess I'm doing that in part here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5832.74,
    "end": 5834.202,
    "text": " albeit much worse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5834.222,
    "end": 5835.543,
    "text": "But yeah, no, thank you so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5835.604,
    "end": 5837.326,
    "text": "This was incredibly useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5837.406,
    "end": 5841.751,
    "text": "I, again, I leave all of these conversations oftentimes just a touch more confused than when I started.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5841.791,
    "end": 5845.616,
    "text": "But I think that's a good Socratic sign that we're making progress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5846.197,
    "end": 5852.004,
    "text": "I always ask our guests, where can people find you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5852.064,
    "end": 5853.546,
    "text": "I'm sure people are gonna have lots of questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5853.566,
    "end": 5853.786,
    "text": "I'm",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5853.766,
    "end": 5857.093,
    "text": " The amygdala is a kind of permanent object of fascination for people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5857.153,
    "end": 5864.409,
    "text": "So if they wanted to ask questions or find out about the courses you're running, where can people reach out to you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5864.429,
    "end": 5868.758,
    "text": "So my Blue Sky and Twitter handle is Sweet Neuron.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5869.981,
    "end": 5873.749,
    "text": "And you can also find my website, sweetneuron.at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5874.742,
    "end": 5875.143,
    "text": " Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5875.163,
    "end": 5880.309,
    "text": "And I mean, I also like to say that I really loved talking to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5880.77,
    "end": 5888.099,
    "text": "This is recorded here because I mean, I get so much in my headspace and talking about these interesting things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5888.419,
    "end": 5890.542,
    "text": "So yeah, I love this format.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5890.562,
    "end": 5892.725,
    "text": "I love your way of doing it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5892.865,
    "end": 5897.671,
    "text": "And it was truly an inspiring and thought provoking discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5898.191,
    "end": 5898.932,
    "text": "Oh, you're very kind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5899.093,
    "end": 5899.633,
    "text": "You're very kind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5899.653,
    "end": 5901.335,
    "text": "I think that might be the best send off I've had.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5901.576,
    "end": 5903.398,
    "text": "That's made my day.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5903.733,
    "end": 5904.976,
    "text": " Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5905.036,
    "end": 5906.84,
    "text": "Ronnie, it's been an absolute treat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5906.94,
    "end": 5907.823,
    "text": "I've learned a lot.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5907.923,
    "end": 5908.905,
    "text": "I'm confused.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5909.146,
    "end": 5910.93,
    "text": "Like last week, I'm going to go take a nap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5913.596,
    "end": 5915.079,
    "text": "Thank you so much for joining me again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5915.119,
    "end": 5916.282,
    "text": "Thank you for me and the Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5917.305,
    "end": 5918.367,
    "text": "Thanks for having us.",
    "speaker": "SPEAKER_01"
  }
]