[
  {
    "start": 7.008,
    "end": 35.454,
    "text": " hello and welcome everyone it is june 13th 2022 and we're here in actinv lab guest stream number 23.1 with maxwell and dalton we're talking about rebooting the free energy principle literature and their recent publication so i'll pass it to the two of you to provide just an initial introduction and some context for the paper before we jump into some specific parts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.98,
    "end": 37.661,
    "text": " Maxwell first.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 38.822,
    "end": 39.502,
    "text": "Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 39.562,
    "end": 41.083,
    "text": "My name is Maxwell Ramstad.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 42.464,
    "end": 52.513,
    "text": "I'm the director of research at the versus research lab, where we specialize in probabilistic approaches to artificial intelligence.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 54.434,
    "end": 60.139,
    "text": "And of late, most of my research has been on the physics foundations of the free energy principle.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 61.44,
    "end": 65.443,
    "text": "And yeah, very, very much looking forward to having this conversation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 68.248,
    "end": 68.548,
    "text": " Awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 68.669,
    "end": 69.069,
    "text": "And Dalton?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 70.731,
    "end": 71.892,
    "text": "Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 71.993,
    "end": 72.213,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 72.233,
    "end": 73.474,
    "text": "Well, I'm Dalton.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 74.395,
    "end": 76.778,
    "text": "I'm a mathematician and a physicist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 79.389,
    "end": 83.513,
    "text": " So right now I'm at Stony Brook University in New York.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.753,
    "end": 88.677,
    "text": "I'm also at the Versys Lab where we're doing some work on the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 89.198,
    "end": 97.825,
    "text": "Right now, my research interests are about formal approaches to biological physics and mathematical foundations of complex systems and these kinds of questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 98.426,
    "end": 103.23,
    "text": "One of the most interesting frameworks in this sphere is the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 103.771,
    "end": 106.273,
    "text": "And that's how I've gotten involved in this literature.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 108.519,
    "end": 108.839,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 109.58,
    "end": 114.322,
    "text": "So maybe in the same order, what brought us to this paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 114.602,
    "end": 120.945,
    "text": "What was the gap that this paper stepped into and how did this team arise around the paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.365,
    "end": 122.986,
    "text": "And I'll bring it up on the screen as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 123.006,
    "end": 126.067,
    "text": "It's a good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.349,
    "end": 131.27,
    "text": "Well, I think the paper does a bunch of different things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 132.33,
    "end": 136.813,
    "text": "The first, I mean, we've presented this as rebooting the free energy principle literature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 138.621,
    "end": 163.18,
    "text": " i think uh yeah over the last it's it's been almost two decades now since uh the fup has been a thing uh i think the first paper was circa 2005-ish and the framework or the the field of study that is emerged around the free energy principle has um changed a lot over the last two decades no small part",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 163.993,
    "end": 171.158,
    "text": " in terms of the self-understanding that we have as a community of practitioners working with these techniques.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 172.559,
    "end": 191.072,
    "text": "And I mean, as Dalton pointed out a while back, I think the last time that really the FUP literature had been surveyed in a systematic fashion to kind of present where we were at, where we are currently, like the state of the art, was probably Carl's",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 192.282,
    "end": 215.429,
    "text": " monograph from 2019 january 2019 um i mean you know both of you were part of this international physics reading group that we had uh this was not this was not a simple uh piece to read and uh yeah since then um there hasn't really been uh basically a summary of where the literature is so on the one hand we were aiming to uh",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 216.118,
    "end": 236.777,
    "text": " reboot the literature to basically summarize the ways that the free energy principle had been applied in the literature and to also present a lot of the progress that had been made over the last three years, a lot of which is due to Delta.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 237.978,
    "end": 241.341,
    "text": "So I think that segues nicely into the Delta.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 242.475,
    "end": 245.136,
    "text": " Well, too generous by far, as usual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 245.636,
    "end": 258.958,
    "text": "But yeah, so Maxwell raises a good point that there hasn't been really an effort to tie together all the different threads since probably 2019.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 259.418,
    "end": 267.42,
    "text": "And one of the reasons why, I mean, that's a long time, but it's not overly long.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 268.427,
    "end": 277.737,
    "text": " However, in the last couple of years, there have been some pretty serious advances in the state of the mathematics and the physics behind the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 278.358,
    "end": 282.422,
    "text": "So now, you know, three years later, we're in 2022.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 282.822,
    "end": 287.547,
    "text": "It's not a long time, but nevertheless, there have been big developments that really have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 288.608,
    "end": 308.091,
    "text": " uh beg this kind of a survey to be done and so that was one of the aims at least of the paper was to draw together all the different threads to unify them make them a bit more cohesive and and present the free energy principle as we're conceptualizing it today in a very top to bottom fashion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 311.167,
    "end": 334.381,
    "text": " before we jump into the sections and the arguments and the claims in the paper which i'm sure will cover a lot of these updates i'd just love to hear what is the free energy principle what is active inference and how are they related i mean i guess in the most general sense the free energy principle uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 335.532,
    "end": 347.016,
    "text": " is a statement that says that we can understand the dynamics of self-organizing systems as following a path of least surprisal in the most general sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 348.216,
    "end": 351.537,
    "text": "And then in that context, it's good that you asked the question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 351.577,
    "end": 356.719,
    "text": "I think that there are at least two uses of the term active inference in the literature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 358.095,
    "end": 370.179,
    "text": " The one that I've tended to use is a very broad sense, which is just like active inference is specifying a path of least action for what are called autonomous states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 370.219,
    "end": 377.941,
    "text": "So like the active and internal states of systems that are considered things under the free energy formulation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 379.421,
    "end": 388.943,
    "text": " Active inference has also been used to refer to a class of specific partially observable Markov decision process models that have been deployed.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 389.023,
    "end": 394.865,
    "text": "And most of the implement in silico implementations of the free energy principle rely on these.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 396.225,
    "end": 401.987,
    "text": "I think this has led to a little bit of confusion in that when folks say,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 403.132,
    "end": 408.153,
    "text": " Active inference is a general theory that's able to account for self-organization.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 408.173,
    "end": 415.135,
    "text": "They're not saying this specific class of POMDP models is effectively repurposable for everything.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 416.275,
    "end": 425.478,
    "text": "So yeah, I would say the first sense that I outlined is the sense in which we say that active inference is a corollary of the free energy principle.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 427.601,
    "end": 443.213,
    "text": " And yeah, I mean, in its most general form, the free energy principle is just a statement, an alternative statement or a restatement of the principle of stationary action, where the action is defined as a surprisal, in effect.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 445.454,
    "end": 445.735,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.975,
    "end": 447.496,
    "text": "Dalton, same questions to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.244,
    "end": 452.865,
    "text": " Yeah, I think Maxwell pretty much covered it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 454.346,
    "end": 461.508,
    "text": "So as I mentioned, my background is actually not in the free energy principle, not originally, and it's not even in machine learning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 462.708,
    "end": 466.85,
    "text": "So I have come at this literature with a bit of a different set of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.03,
    "end": 470.091,
    "text": " ideas and traditions and tools.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 471.131,
    "end": 474.172,
    "text": "And so as a result, I can't really talk about active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 474.192,
    "end": 480.174,
    "text": "I'm not totally familiar with it, but I can talk about the free energy principle at length.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 480.634,
    "end": 482.055,
    "text": "I'll try to be brief.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 483.475,
    "end": 495.019,
    "text": "So to me, the free energy principle is a statement that random dynamical systems do, on average, unsurprising things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 496.715,
    "end": 498.096,
    "text": " And it's a very simple statement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 498.337,
    "end": 510.666,
    "text": "All it means is that if you have a random dynamical system and it's trying to get to some place in state space, that is not surprising to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.566,
    "end": 516.27,
    "text": "So some preferred region of state space, maybe a particular phenotype",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 516.77,
    "end": 536.304,
    "text": " maybe a particular morphological blueprint something like this the free energy principle is a statement of not only that that happens but also a set of tools to model how that happens how do systems get to these kinds of attractors and there's this very interesting way in which",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 537.56,
    "end": 542.323,
    "text": " the getting to that attractor can be read as inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 543.003,
    "end": 548.106,
    "text": "And this is where all these connections in literature appear to things like active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 548.366,
    "end": 553.329,
    "text": "You can talk about how systems actually get themselves to that attractor as a perception and action problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.729,
    "end": 558.312,
    "text": "And you can model it using this very famous variational free energy bound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 558.372,
    "end": 564.856,
    "text": "And you can show, okay, when the system is encoding some sort of belief about its environment and about itself,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 565.656,
    "end": 571.081,
    "text": " When it does this inference, you have the minimization of some upper bound on surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.681,
    "end": 579.648,
    "text": "So the system is at least doing unsurprising things at the level of, you know, it's not exceeding some kind of intrinsic surprisal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 580.188,
    "end": 581.79,
    "text": "That's some of the early formulations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 582.17,
    "end": 590.897,
    "text": "Some of the more recent formulations take it even further, and you say the surprisal, full stop of some trajectory of the system is going to be minimized by the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 591.258,
    "end": 591.858,
    "text": "So it's going to take...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 592.979,
    "end": 602.207,
    "text": " on average, the system is going to do what it expects to do, which in this case is get to some region in the state space that it prefers to inhabit.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 603.808,
    "end": 611.154,
    "text": "What makes that not a tautology and what makes it something that we can actually operationalize and ask interesting questions about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 611.594,
    "end": 613.956,
    "text": " is the fact that there is this nice connection to inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 614.376,
    "end": 628.228,
    "text": "There are all of these explicit mathematical tools that we can use to talk about surprise minimization, not just as the kind of information theoretic statement of systems that aren't surprising or systems that aren't surprised.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 629.028,
    "end": 654.967,
    "text": " do unsurprising things it ends up a little bit more nuanced than that and so so to me the free energy principle is this whole host of results about random dynamical systems and especially random dynamical systems which are organized or which self-organize i think that is uh how i would think of it and it's and it's got some physics and uh stuff that that we can actually talk about in that context",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 657.048,
    "end": 659.277,
    "text": " Awesome, thanks both for those great answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 660.396,
    "end": 686.594,
    "text": " I'm pulling up the paper and so many things in what you said, I just wanted to follow up on, but let's follow the main line of the paper and wherever you think there's some dots that could be connected or any questions arising or areas of future research or the connection to applications that you're working on or other people might think about getting involved in, we can just take those little cul-de-sacs from the main line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.334,
    "end": 689.295,
    "text": "So I have the paper up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 691.236,
    "end": 695.54,
    "text": " on Bayesian mechanics of physics of and by beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 696.08,
    "end": 697.781,
    "text": "The two of you are the first authors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 697.861,
    "end": 705.027,
    "text": "There's also Connor Hines, Magnus Kudal, Baron Millage, Lancelot da Costa, Brennan Klein, and Carl Friston.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 705.848,
    "end": 713.734,
    "text": "Any just overview notes on, again, like what led to this team or anything like that while we're on this first page?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 716.896,
    "end": 717.256,
    "text": "Well,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 719.002,
    "end": 727.013,
    "text": " From my perspective, Dalvin and I have been talking a lot about this kind of stuff for the last year, year and a half, two years.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 727.033,
    "end": 735.745,
    "text": "And yeah, I won't try to, I'll try not to be too,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 737.344,
    "end": 741.672,
    "text": " overly generous, Dalton, but like, I think, yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 742.474,
    "end": 749.347,
    "text": "So some of Dalton's work has, I think, changed the way that we think about the FEP",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 750.808,
    "end": 776.649,
    "text": " in particular um what what dalton did in this great paper towards a geometry and analysis uh for uh bayesian mechanics is to show that the free energy principle and the principle of constrained maximum entropy are actually uh dual to each other they are two sides of the same coin um and i i you know i i've been um i've been following this line of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 777.185,
    "end": 779.046,
    "text": " uh, work for, uh, quite some time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 779.107,
    "end": 783.89,
    "text": "And I think it, it foundationally changes the way that we think about the FEP.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 784.03,
    "end": 800.642,
    "text": "It moves it from like this, um, some might say exotic result from, you know, theoretical, uh, neurobiology to, uh, you know, it connects it back up to, um, the foundations of contemporary physics effectively by showing that, you know, uh,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 801.072,
    "end": 811.659,
    "text": " this thing that we understand and almost take for granted, you know, maximum entropy inference procedures turn out to connect up to this free energy literature in a non-trivial way.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 811.719,
    "end": 824.148,
    "text": "So I think the paper started out and it didn't end this way, but I think we started off trying to write a reader friendly companion to the work that Dalton had done.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 825.369,
    "end": 828.351,
    "text": "But by the end of it, realized that this was more",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 829.946,
    "end": 843.012,
    "text": " I think Dalton's paper towards the geometry and analysis for Bayesian mechanics, Hiller's, I think it stands on its own as a piece of mathematical reasoning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 843.092,
    "end": 849.515,
    "text": "So it is an exercise in maximum entropy inference math, and it shows that you can recover",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 850.795,
    "end": 856.558,
    "text": " some of the really core results of the free energy formulation, just using the language of constrained maximum entropy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 856.578,
    "end": 866.744,
    "text": "In particular, Dalton approves the approximate Bayesian inference lemma that had, you know, caused so much discussion in our literature for the last bit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 867.825,
    "end": 871.326,
    "text": "And so, you know, I think the paper grew out of that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 872.007,
    "end": 877.55,
    "text": "And yeah, the team is something of a who's who of like the,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 878.373,
    "end": 905.369,
    "text": " know the the core contributors to this literature and just from a strategic point of view it was important for us to have like you know alliance da costa uh carl friston you know connor heinz and folks that had been uh i think contributing to this core formulation and in particular to the development of uh you know this new framing of the free energy stuff a bayesian mechanics um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 906.727,
    "end": 908.909,
    "text": " So yeah, I think that the paper grew out of that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 909.069,
    "end": 925.682,
    "text": "And if Dalton's paper is this Dalton's stent towards the geometry and analysis for Bayesian mechanics is a kind of standalone piece of mathematical reasoning, this is more about how this actually fits into the free energy principle literature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 925.702,
    "end": 929.245,
    "text": "So this is very much more a free energy principle literature paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 931.712,
    "end": 936.196,
    "text": " And yeah, we were hoping to do as reader-friendly an introduction as we could.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 936.956,
    "end": 941.299,
    "text": "There are actually two whole kind of introductory sections in the paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 942.18,
    "end": 948.424,
    "text": "But we ended up doing a lot of, I think, important work in that paper connecting up to the free energy principle.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 949.144,
    "end": 950.385,
    "text": "I hope that helps answer me.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 951.806,
    "end": 952.727,
    "text": "Great answer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.867,
    "end": 954.108,
    "text": "And welcome, Lars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 954.228,
    "end": 960.332,
    "text": "Would you like to give any overviews or notes before we jump into the sections of the paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.884,
    "end": 963.705,
    "text": " Hey, thanks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 963.825,
    "end": 967.407,
    "text": "Thanks for sending me the link there, Maxwell, and allowing me on here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 968.068,
    "end": 969.249,
    "text": "No, nothing really to add there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 969.289,
    "end": 970.75,
    "text": "I'm just here as a spectator.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 970.77,
    "end": 974.232,
    "text": "I have a few questions as we go down along, and maybe I can throw into the conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 974.473,
    "end": 975.834,
    "text": "But yeah, thanks for having me on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 976.556,
    "end": 1002.245,
    "text": " awesome all right so the abstract begins with a really clear aim the aim of this paper is to introduce a field of study that has emerged over the last decade called bayesian mechanics and we're going to be unpacking that claim so suffice to say the abstract's very clear and summarizes some of the core points that we're going to delve into now we're looking now at the contents so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1003.743,
    "end": 1028.381,
    "text": " what led to the sections the paper being this way and in this order what did you feel like it was important to include what did you feel like it was important to introduce and why well so if you look i'll actually pull it up in front of me so that we uh we're all talking about the same thing um give me one second",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1032.406,
    "end": 1035.048,
    "text": " And it's viewable in large size on the live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1035.228,
    "end": 1040.171,
    "text": "So yeah, feel free to have your own copy up, but I'll have whatever section we're looking at will be very visible on the live stream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1041.092,
    "end": 1047.135,
    "text": "While Maxwell is grabbing his copy, I'll just give a couple of contextual remarks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1047.676,
    "end": 1050.378,
    "text": "So like Maxwell described, I mean, originally,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1051.659,
    "end": 1066.653,
    "text": " I had released this set of results about what we call approximate Bayesian inference and the sort of mathematical basis for some of the key ideas in the FEP literature, up until that point anyway.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1068.777,
    "end": 1092.477,
    "text": " And originally it was meant to be a much shorter paper that just dissected some of those results and related them back to the FEP in a way that was a little more concrete and a way that people who actually work on the FEP might care a little more about, because of course the stuff that I wrote about is a little far removed from the FEP, even though it's an object of inspiration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1092.837,
    "end": 1101.609,
    "text": " for the results in that paper, there is a reading of that paper where it's formally pretty distinct from the FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1102.77,
    "end": 1106.575,
    "text": "So originally, that was the goal, is just give it some extra...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1107.691,
    "end": 1113.073,
    "text": " physics, intuition, and some extra connection to the actual FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1113.713,
    "end": 1131.82,
    "text": "It became something a little bit different as we were building this out and we realized, okay, there are a whole set of new results, not only mine, but also from Carl's TNB group and from other folks, and they all really should be tied together nicely.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1132.321,
    "end": 1133.101,
    "text": "And part of that is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1133.661,
    "end": 1137.524,
    "text": " the connecting the geometry and analysis paper to the actual FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1137.985,
    "end": 1144.31,
    "text": "Part of it is actually talking about what we would think of the FEP as today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1146.411,
    "end": 1157.24,
    "text": "That shaped the table of contents a little bit because a lot of what we then wanted to go and say is, okay, we have this theory of the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1158.602,
    "end": 1166.884,
    "text": " One of the key ideas in the way that we're viewing the free energy principle today is that it is just a bit of physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1167.144,
    "end": 1171.084,
    "text": "It is much like classical mechanics or statistical mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1172.345,
    "end": 1179.566,
    "text": "It has a set of mathematical results that sort of hang around it, that give it a nice foundation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1180.006,
    "end": 1183.707,
    "text": "And it applies to specific systems and describes them in a specific way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1185.387,
    "end": 1195.993,
    "text": " And that was why we began with both an overview of what is mechanics, what do we talk about in physics when we say mechanics, and also section three is what is the free energy principle?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1196.673,
    "end": 1198.694,
    "text": "What have we talked about so far in the literature?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.334,
    "end": 1202.456,
    "text": "And what might we define as Bayesian mechanics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1203.076,
    "end": 1205.898,
    "text": "So what is the physics of beliefs or systems that carry beliefs?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1207.558,
    "end": 1213.641,
    "text": " So that sort of shaped the first maybe 20 pages of the papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1214.121,
    "end": 1217.462,
    "text": "It's just building out the theory and the context for the theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1218.243,
    "end": 1228.827,
    "text": "Afterwards is a bit of a sort of change in our line of attack, but you'll see it does remain very similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1228.867,
    "end": 1231.128,
    "text": "So I won't get too far ahead of myself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1232.789,
    "end": 1233.009,
    "text": "Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1233.948,
    "end": 1236.57,
    "text": " Any other notes, Maxwell, or we can carry on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.59,
    "end": 1240.433,
    "text": "I think that's a great summary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1240.594,
    "end": 1248.86,
    "text": "I think we try to keep this as self-contained as possible as a paper.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1249.941,
    "end": 1255.346,
    "text": "The two introductory sections are meant to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1256.757,
    "end": 1266.745,
    "text": " provide some kind of visual intuition for a lot of the more formal results that are discussed in the paper and in the papers that it builds on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1267.365,
    "end": 1278.113,
    "text": "We have the artistic brilliance of Brennan Klein that's added to this paper, so I think the illustrations help.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1279.054,
    "end": 1303.047,
    "text": " um the idea was that you know this based on dalton's work we are formulating basically a geometry and analysis for the core results in the free energy principle literature so we thought let's leverage uh the geometric nature of a lot of these intuitions to really illustrate them and so yeah that i think explains a lot of the structure",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1303.467,
    "end": 1318.635,
    "text": " And the paper ends on some philosophical considerations and hopefully clarifies some of the confusions or misunderstandings, understandable misunderstandings that have arisen.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1318.655,
    "end": 1322.978,
    "text": "Yeah, so I think that does really address.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1323.578,
    "end": 1326.52,
    "text": "I guess the last thing to point out is we introduced this",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1327.76,
    "end": 1348.799,
    "text": " field of study in the last section that we called G-theory, which is, I think, the direction that we're going to be moving in for a while, which is formulating the free energy principle in the Bayesian mechanics in terms of maximum caliber.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1348.859,
    "end": 1352.062,
    "text": "So extending this duality",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1352.722,
    "end": 1368.813,
    "text": " between the density dynamics formulation of the free energy principle in terms of probability densities over states and constrained maximum entropy to path-based formulation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1368.893,
    "end": 1371.795,
    "text": "So path entropy is called caliber.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1372.315,
    "end": 1378.759,
    "text": "And you can, Dalton is one of the few world specialists in maximum caliber.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1380.48,
    "end": 1384.381,
    "text": " And, yeah, maximum caliber is maximum path entropy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1384.401,
    "end": 1389.263,
    "text": "So it's the same idea as maximum entropy, but you're considering the entropy of paths.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1390.163,
    "end": 1397.266,
    "text": "And we have had, you know, the free energy principle started off as formulated in terms of paths.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1397.366,
    "end": 1401.367,
    "text": "After all, it is a version of the principle of stationary action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1401.867,
    "end": 1404.828,
    "text": "It leads us to write down paths of stationary action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1405.329,
    "end": 1405.809,
    "text": "And so the...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1406.909,
    "end": 1435.082,
    "text": " the ambition now is to connect these things up much more formally so that uh we can uh we can handle really genuine non-equilibria uh things like wandering uh markov blankets and uh yeah moving attractors and all that kind of stuff which find uh you know a home much more naturally in the language of maximum caliber did you did you want to add anything to that belton you're really the max cal expert",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1436.692,
    "end": 1445.857,
    "text": " No, I think that's a good account of one of the key future directions is we spend the first half introducing Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1446.517,
    "end": 1460.745,
    "text": "We spend the second half talking about where Bayesian mechanics fits into the rest of statistical mechanics and high energy physics by connecting it to MaxEnt and to gauge theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1461.605,
    "end": 1463.806,
    "text": "And this is where some of the geometric stuff comes in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1464.887,
    "end": 1472.393,
    "text": " And then the very last thing we do, we sort of cap it off by saying, OK, now we've talked a lot about Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.833,
    "end": 1476.076,
    "text": "We've talked a lot about maximum entropy Bayesian mechanics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.857,
    "end": 1481.961,
    "text": "But there is, in some sense, a much more natural formulation of Bayesian mechanics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1482.541,
    "end": 1483.662,
    "text": " in terms of dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1484.122,
    "end": 1492.085,
    "text": "Because ultimately, that's what we're thinking about, is dynamical systems and the way that they evolve in time, the way that they flow over their state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1492.946,
    "end": 1503.43,
    "text": "And there's a sense in which not only is it much more natural, mathematically it just works easier, it looks prettier, it's much nicer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1504.091,
    "end": 1509.993,
    "text": "There's also a sense in which it's meaningless to talk about states of a process which is constantly in flux.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1511.474,
    "end": 1524.646,
    "text": " So limiting ourselves to densities over states as exists in the last couple of years of the literature, which has in fact not always been the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1525.146,
    "end": 1534.234,
    "text": "Some of the early stuff is written in terms of generalized coordinates of motion, which are nothing but a particular way of talking about dynamics and therefore paths.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1536.53,
    "end": 1546.337,
    "text": " So there's a sense in which the recent detour into states is very limiting, not only mathematically, but conceptually limiting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1547.377,
    "end": 1550.059,
    "text": "And we can see that directly in the way that it is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1551.52,
    "end": 1559.145,
    "text": " handling things like non-Markovian processes or processes that change with statistics that are out of equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1559.866,
    "end": 1562.868,
    "text": "So at the very end, we say, you know, we've done all this work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1564.129,
    "end": 1568.052,
    "text": "The best next step is to take all of this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1568.892,
    "end": 1574.719,
    "text": " and all of the stuff that we've just done about maximum entropy Bayesian mechanics, and put it in dynamical terms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1575.079,
    "end": 1582.068,
    "text": "And this necessitates passing to what we call maximum caliber, which is also due to James originally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1582.148,
    "end": 1584.05,
    "text": "It's the principle of path entropy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1585.812,
    "end": 1585.972,
    "text": "But...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1587.498,
    "end": 1591.379,
    "text": " Eventually, you know, the goal is we would be able to write all of this stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1592.439,
    "end": 1598.26,
    "text": "And in particular, we'd be able to generalize what we have written into a language that's much more dynamical.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1599.061,
    "end": 1609.643,
    "text": "And Max Cal, we already know, has demonstrated an immense success in treating non-equilibrium processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.143,
    "end": 1614.484,
    "text": "So mathematically, I mean, there's reason to be very optimistic about what we will gain",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1615.157,
    "end": 1617.921,
    "text": " when we generalize the duality that we've talked about previously.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1618.822,
    "end": 1622.968,
    "text": "And so it really does seem like it's the ideal thing to do in the very near future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1625.549,
    "end": 1625.849,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1626.69,
    "end": 1628.772,
    "text": "Let's jump into the sections.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1629.733,
    "end": 1631.874,
    "text": "So section one is the introduction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1632.955,
    "end": 1638.86,
    "text": "And just one part that I wanted to highlight that the footnotes are so informative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1639.241,
    "end": 1646.086,
    "text": "There's some of these motifs like we set out to make it as simple as possible and four pages was our limit, but then we ended up innovating this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.166,
    "end": 1647.668,
    "text": "So that's one funny motif.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1647.728,
    "end": 1653.292,
    "text": "And then the other funny motif that I see is the super informative footnote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1654.293,
    "end": 1668.104,
    "text": " often because maybe it's possible to just make the claim stand alone and in direct response to somewhere else so that's very exciting and interesting like footnote one covers a lot of the prerequisite",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1668.973,
    "end": 1675.118,
    "text": " fields like dynamical systems theory, calculus, probability, and information theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.218,
    "end": 1683.224,
    "text": "So I found that to be very interesting because it helps understand where we can come from and what kinds of backgrounds we'd want to be learning about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1683.825,
    "end": 1689.689,
    "text": "And then also a very important distinction of the two meanings of the word belief",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1690.49,
    "end": 1718.95,
    "text": " in the probabilistic sense of bayesian statistics or the propositional or folk understanding as you write from philosophy and cognitive science so um just thought those were two interesting footnotes and and reflected like part of the process and the discourse around the primary text and how that can be clarified in this format feel free to make any overall comments on that or that's just getting to page three",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1721.658,
    "end": 1731.044,
    "text": " Well, about the prerequisites, it's a difficult balance to achieve in some sense, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1731.084,
    "end": 1734.286,
    "text": "Because we don't want to be academic gatekeepers.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1734.666,
    "end": 1736.327,
    "text": "No one benefits from gatekeeping.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1736.748,
    "end": 1739.149,
    "text": "But these are also highly technical fields.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1740.62,
    "end": 1759.024,
    "text": " so you know i i've been joking for you know the last few months if you've never taken a derivative you're gonna have a bad time in this literature it's just not the kind of thing that lends itself to um you know surface engagement in some sense like it's very and especially with these um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1760.646,
    "end": 1771.671,
    "text": " These new developments, I mean, there's Dalton's work that basically shows that the free energy principle is dual to maximum entropy, maximum caliber.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1772.071,
    "end": 1779.094,
    "text": "So there's this kind of deep connection to, I mean, effectively the core of contemporary physics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1780.555,
    "end": 1790.139,
    "text": "And there are these new results that show that the free energy principle is asymptotically equivalent to the principle of unitarity from quantum mechanics",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1792.15,
    "end": 1796.678,
    "text": " There are these new quantum formulations of FEP that have popped up.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1797.5,
    "end": 1798.782,
    "text": "So yeah, I mean,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1800.359,
    "end": 1823.532,
    "text": " navigating the space comfortably presupposes a lot um and the good news is that it's hard for everyone so uh there's uh there's something to learn for everyone uh you know i'd spent the last uh three years of my life teaching myself like category theory and gauge theory and stuff which turned out to be very useful uh you know connecting up with dalton and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1824.843,
    "end": 1830.246,
    "text": " doing all of this work, but now we're launching ourselves into quantum theory, which I'm less familiar with.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1830.306,
    "end": 1833.387,
    "text": "So there's something to find difficult for everyone.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1834.028,
    "end": 1841.651,
    "text": "But yeah, I really do think that the fully appreciate going on here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1843.729,
    "end": 1846.551,
    "text": " Some technical prerequisites are important.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1847.452,
    "end": 1851.034,
    "text": "Otherwise, we're led to making false assertions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1851.414,
    "end": 1862.041,
    "text": "I see this circulate a lot that dynamical systems approaches are contradictory to information theoretic approaches, which is just nonsense from a formal point of view.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1863.522,
    "end": 1885.915,
    "text": " yeah information metrics naturally re-emerge when you're considering for example uh how do you measure distances and state space effectively it's just yeah so the the more uh mathematical background one comes with i think the easier it is to integrate into this um yeah",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1887.383,
    "end": 1887.603,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1888.063,
    "end": 1897.63,
    "text": "Well, indeed, there's a lot of encouraging and good news and hopefully a community that also values participation and accessibility as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1897.87,
    "end": 1898.931,
    "text": "So, agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1899.071,
    "end": 1900.952,
    "text": "Important general points there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1900.972,
    "end": 1906.136,
    "text": "Yeah, before we move on, I'll say something really quickly about this second footnote.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1907.116,
    "end": 1910.437,
    "text": " just because it's a remark that's actually pretty important to me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1910.737,
    "end": 1927.082,
    "text": "In fact, Maxwell is the one who wrote it, but I didn't even realize, but it is an important clarification that when we talk about beliefs and inference, it's much more general than just an agent or a cognitive agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1927.342,
    "end": 1927.702,
    "text": " object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.744,
    "end": 1949.315,
    "text": "The manner in which we talk about inference and we talk about carrying beliefs is this much more general sense of just two random dynamical systems that are coupled and therefore reflect the statistics of each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1950.716,
    "end": 1956.32,
    "text": "Generically, this is a system estimating the statistics of an embedding environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1958.251,
    "end": 1966.117,
    "text": " The very important point is any system with any noise, and in fact systems with no noise, have statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1966.737,
    "end": 1972.082,
    "text": "And so any system that estimates or couples to another system with statistics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1972.802,
    "end": 1975.523,
    "text": " can be interpreted as mathematical inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1975.984,
    "end": 1978.205,
    "text": "One system performs inference about the other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1980.066,
    "end": 1984.828,
    "text": "The sort of content that you place on that idea of inference is very case dependent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1985.048,
    "end": 1987.89,
    "text": "So it's not the case that stones, for instance, are cognitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1988.41,
    "end": 1997.237,
    "text": " But it is very much the case that stones reflect the statistics of their environment simply because these two systems are coupled and their statistics reflect each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1997.537,
    "end": 2000.96,
    "text": "And so this is what we mean in the sense of talking about agents that carry beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2001.461,
    "end": 2003.662,
    "text": "Simply, it is about objects",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2004.423,
    "end": 2008.764,
    "text": " that do this kind of statistical estimation, which we would think of as inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2009.084,
    "end": 2017.126,
    "text": "But it's certainly much more general than simply something like a reinforcement learning agent that actually stores representation of its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2017.886,
    "end": 2021.366,
    "text": "It is a representation, but in a much more trivial sense in the general case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2023.247,
    "end": 2028.508,
    "text": "I mean, I would add to that by pointing out that Dalton was saying that we",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2029.958,
    "end": 2036.77,
    "text": " There were disadvantages to focusing on the density dynamics formulation, which features Markov blankets and the like.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2037.692,
    "end": 2040.056,
    "text": "So Markov blankets are great and we like them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2041.135,
    "end": 2057.198,
    "text": " But I think focusing on them so much in the literature over the last several years has obscured the fact that the free energy principle is at core a statement about how, you know, as Dalton was saying earlier, random dynamical systems couple to each other.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2057.818,
    "end": 2067.94,
    "text": "So, you know, the Markov blanket is not some, I often hear and read in the literature, the Markov blanket secludes the organism from its environment, but it's not, that's not,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2068.311,
    "end": 2069.392,
    "text": " That's not the idea at all.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2070.573,
    "end": 2077.179,
    "text": "The Markov blanket is the set of states via which the organism and its environment are coupled.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2077.28,
    "end": 2085.087,
    "text": "And in fact, we made this case in a paper on a variational approach to niche construction several years ago.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2086.428,
    "end": 2089.391,
    "text": "You can basically swap the sensory and active states",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2091.649,
    "end": 2095.41,
    "text": " of your organism and you get sensory and active states of an environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2095.79,
    "end": 2102.072,
    "text": "It is fundamentally a story about how systems couple and synchronize with each other.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2102.092,
    "end": 2109.534,
    "text": "It's not a story about how things that exist are somehow secluded from an environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2109.814,
    "end": 2111.815,
    "text": "It's really a story about how, yeah,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2114.253,
    "end": 2123.299,
    "text": " we become a model of our environment, meaning that we are in tune with, engaged with, and reflecting the structure of that environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2123.58,
    "end": 2128.143,
    "text": "This becomes very clear, by the way, when you look at the quantum formulations of the free energy principle.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2129.164,
    "end": 2140.292,
    "text": "If you take the asymptotic limit of the free energy principle, so its behavior as time tends towards infinity, for classical systems that have space-time individuation,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2140.672,
    "end": 2161.254,
    "text": " what you get is something like the good regulator theorem so i become as much as possible as i can like my environment uh you know modulo this space time separation i can't be my environment because i'm here and it's there in some sense and then what you get in that context is statistical mirroring",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2161.752,
    "end": 2170.916,
    "text": " But in the quantum context, when there is no space like separation between systems, the FEP tends towards entanglement.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2171.797,
    "end": 2178.14,
    "text": "So systems that are related in an FEP theoretic way at the quantum level become entangled.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2178.2,
    "end": 2180.501,
    "text": "That is precisely what the FEP does.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2181.161,
    "end": 2184.583,
    "text": "Conforming to the FEP means that systems become maximally entangled.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2185.844,
    "end": 2188.805,
    "text": "So it really is not a statement about, you know,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2189.477,
    "end": 2192.058,
    "text": " how organisms are separate from their environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2192.578,
    "end": 2205.182,
    "text": "It's a statement about how organisms are things in general, self-organizing systems, individuate and couple simultaneously to their environment and how that's not a contradiction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2206.946,
    "end": 2207.307,
    "text": " Excellent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.268,
    "end": 2215.018,
    "text": "So as we rush through section one and head to section two, I just wanted to pull out two really key quotes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2215.579,
    "end": 2221.307,
    "text": "You wrote, in this paper, we discussed the relationship between dynamics, mechanics, and principles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2222.108,
    "end": 2231.674,
    "text": " And then later on page five, you write Bayesian mechanics is specialized for particular systems that have a partition of states and go on to describe it more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2232.154,
    "end": 2245.502,
    "text": "So as we head towards section two, an overview of the idea of mechanics and indeed Bayesian mechanics, could you unpack a little bit by what you mean, dynamics, mechanics, and principles?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2246.604,
    "end": 2247.304,
    "text": " Sure.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2247.664,
    "end": 2264.331,
    "text": "So Nell Andrews, as everyone I think in the literature knows now, wrote this great paper, The Math is Not the Territory, which challenged us to be very clear about what we meant, really, when we're talking about the free energy principle and active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2264.371,
    "end": 2264.831,
    "text": "And in there,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2266.071,
    "end": 2284.855,
    "text": " I think Mel makes a number of contributions, but one of their most important contributions is to differentiate between the FEP as an uninterpreted formal structure and the FEP as it might figure in applications to model specific kinds of systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2285.735,
    "end": 2287.676,
    "text": "And Mel points out that, you know,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2288.959,
    "end": 2309.754,
    "text": " A lot of the confusion in the philosophical literature has to do with the fact that the primary FTP literature often doesn't differentiate between just the mathematical structure of the theory and then these models interpreted as representing certain features of a target system that we want to make sense of.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2310.515,
    "end": 2317.94,
    "text": "And that's important because falsification or empirical validation, more generally,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2318.599,
    "end": 2321.562,
    "text": " Um, applies to one kind of thing, but not the other, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2321.582,
    "end": 2331.652,
    "text": "So, uh, the, the free energy principle in so far as it is a mathematical theory, I like a formal statement is no more falsifiable.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2332.116,
    "end": 2335.278,
    "text": " or subject to empirical verification than calculus would be.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2336.319,
    "end": 2339.441,
    "text": "You wouldn't try to falsify the axioms of calculus.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2339.521,
    "end": 2342.603,
    "text": "They do or do not apply informatively to certain kinds of systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2342.963,
    "end": 2348.166,
    "text": "So there's a level at which the core formal results of the FPP have that status.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2348.887,
    "end": 2350.568,
    "text": "They're mathematical results.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2352.189,
    "end": 2357.693,
    "text": "And we can use this to do some interesting empirical stuff.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2358.638,
    "end": 2371.626,
    "text": " So what we wanted to do is to differentiate between three kinds of formal things in the first class of tools that Mel was outlining.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2373.227,
    "end": 2378.31,
    "text": "Namely, we distinguish between dynamics, mechanics, and principles.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2379.03,
    "end": 2381.03,
    "text": " So the dynamics are descriptive.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2381.05,
    "end": 2385.071,
    "text": "They are basically a formal description of some systems behavior.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2386.131,
    "end": 2391.852,
    "text": "You might say that like Galilean mechanics is almost entirely dynamics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2395.653,
    "end": 2404.835,
    "text": "You needed someone like Newton to come around and say, well, there are general equations of motion that one can write down to account for",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2406.741,
    "end": 2412.885,
    "text": " sort of how this description plays out in some sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2413.986,
    "end": 2426.234,
    "text": "So we move from dynamics to mechanics in the same way that we move from description to explanation, from a target phenomenon that is formalized in a certain way",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2426.861,
    "end": 2435.549,
    "text": " that we would like to have an explanation for to a set of equations of motion that really account for how those dynamics come to be.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2436.33,
    "end": 2441.895,
    "text": "And then principles, if mechanics tell you how, principles tell you why.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2443.076,
    "end": 2451.965,
    "text": "So usually in physics, we appeal to some symmetry or conservation principle in order to derive",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2452.443,
    "end": 2456.746,
    "text": " the mechanics or the mechanical theory for the systems in question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2457.487,
    "end": 2463.511,
    "text": "So what we're left with is principles, mechanics and dynamics, all of which are formal theories.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2464.212,
    "end": 2470.176,
    "text": "And once you have a mechanics, you can apply it to study specific kinds of systems empirically.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2471.217,
    "end": 2473.979,
    "text": "And that's where empirical verification would come in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2474.339,
    "end": 2476.34,
    "text": "So principles are not falsifiable.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2476.4,
    "end": 2477.441,
    "text": "They're just bits of math.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2478.122,
    "end": 2481.384,
    "text": "And you use them to write down mechanical theories.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2481.86,
    "end": 2491.018,
    "text": " which when interpreted in the right context and when the variables are mapped onto things that are of interest target systems, then they become subject to empirical evaluation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2492.26,
    "end": 2493.483,
    "text": "So hopefully that,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2494.901,
    "end": 2500.803,
    "text": " you know, clarifies a lot of the model around the FEP.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2501.004,
    "end": 2508.907,
    "text": "One of the reasons why we spent so long, you know, outlining the idea of mechanics and physics is that this isn't some exotic way of thinking about things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2509.427,
    "end": 2516.05,
    "text": "This is really just physics, just straight vanilla reasoning from physics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2518.03,
    "end": 2519.051,
    "text": "Yeah, I'll stop there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2519.071,
    "end": 2521.452,
    "text": "Delphin has probably some interesting things to add.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2525.064,
    "end": 2526.925,
    "text": " No, I think you've covered it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2528.425,
    "end": 2540.509,
    "text": "Yeah, it's just that there are important formal differences in physics between what we would call a mechanical theory for some object and a dynamical description of some object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2541.85,
    "end": 2546.932,
    "text": "And so in this tower of things, you get...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2548.092,
    "end": 2568.815,
    "text": " ideas you get theories that sit at different layers in the tower this hierarchy ends up being useful in clarifying uh this host of different results in the fep and where one fits into the other so it was important to take the time to discuss it uh but um that was that and that's the whole point of section two",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2570.302,
    "end": 2570.622,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2571.102,
    "end": 2580.627,
    "text": "So to also move quickly through section two on page nine, you write, we are concerned here with what we have called Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2581.348,
    "end": 2591.113,
    "text": "And then you launch into an example of mechanical theory, operationalizing a mathematical principle, and you provide some classical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2592.253,
    "end": 2614.843,
    "text": " statistical formulations on page 10 so could you give us an overview of what the equations on page 10 are showing like what they do for classical physics and what is the analogy or what is the connection that this is preparing us to make with bayesian mechanics yes uh well in fact i have an entire paper uh",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2615.686,
    "end": 2619.81,
    "text": " that's about to come out about this, just like building on the analogy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2620.591,
    "end": 2624.095,
    "text": "So I'll leave that as an Easter egg for the audience.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2624.195,
    "end": 2627.659,
    "text": "Watch out for a classical physics for the Bayesian mechanic paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2628.159,
    "end": 2629.32,
    "text": "So I think- Instant classic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2630.129,
    "end": 2631.45,
    "text": " It might be some interest, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2632.191,
    "end": 2633.051,
    "text": "Might be of some interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2633.252,
    "end": 2640.377,
    "text": "But yeah, so on page 10, we are just giving an example of this kind of formal difference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2640.437,
    "end": 2645.441,
    "text": "So you have some kind of principle in classical physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2645.581,
    "end": 2651.266,
    "text": "It is the principle that systems are kind of lazy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2651.746,
    "end": 2652.627,
    "text": "There is some kind of...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2654.068,
    "end": 2682.487,
    "text": " an amount of energy that it takes to get from a to b and systems don't waste that energy so they take precisely the shortest path from a to b or the path of least energy in in the more technical sense of the transfer of potential energy into kinetic energy so if you have some amount of stored energy the transfer of that into energy of motion is minimized along the path that's a very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2684.261,
    "end": 2685.142,
    "text": " abstract statement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2685.422,
    "end": 2688.385,
    "text": "And there's not a lot that you can actually do with that computationally.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2688.705,
    "end": 2697.174,
    "text": "All you can say is systems try and get from A to B using the shortest amount of motion possible, no extra motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2697.234,
    "end": 2703.099,
    "text": "So if you see in figure one, for instance, there are these paths that fly off into",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2703.88,
    "end": 2706.002,
    "text": " sort of these very strange fluctuations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2706.542,
    "end": 2715.369,
    "text": "In the classical world, those fluctuations don't exist because classical systems take this energy-minimizing parabolic path in the dark of blue.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2716.812,
    "end": 2733.223,
    "text": " What is computational about that is that principle of stationary action, so the principle that you don't waste energy, results in a mechanical theory, a law of motion for the mechanics of classical objects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2733.583,
    "end": 2737.426,
    "text": "This is what we would call Newton's law, Newton's second law in particular.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2738.266,
    "end": 2740.008,
    "text": "Everyone knows F equals ma.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2740.068,
    "end": 2743.01,
    "text": "It's force equals mass times acceleration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2743.67,
    "end": 2745.631,
    "text": "So the idea is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2747.173,
    "end": 2752.992,
    "text": " If you are such a system, if you minimize the amount of energy that you take, then you're",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2753.658,
    "end": 2759.461,
    "text": " the acceleration of you must obey precisely the force being applied to you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2760.781,
    "end": 2763.823,
    "text": "And so this is your law of motion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2763.843,
    "end": 2764.843,
    "text": "This is a mechanical theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2765.444,
    "end": 2775.168,
    "text": "The dynamics that come out of that are able to be discussed when you start putting in actual details, when you plug in whatever force being applied.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2775.188,
    "end": 2777.589,
    "text": "Sorry, that's a dog.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2777.669,
    "end": 2778.33,
    "text": "You probably heard it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2779.49,
    "end": 2781.691,
    "text": " What is the force being applied to the system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2782.031,
    "end": 2783.912,
    "text": "What are the initial conditions for the system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2783.952,
    "end": 2785.032,
    "text": "What is the mass for the system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2785.372,
    "end": 2787.873,
    "text": "All of this extra data starts giving you trajectories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2788.193,
    "end": 2793.415,
    "text": "So an actual model of the system, which is less explanatory and more descriptive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2793.936,
    "end": 2798.837,
    "text": "And this is at the very bottom of the hierarchy where you get this dynamical theory that's got all this extra data in it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2799.958,
    "end": 2805.48,
    "text": "So this is very quickly an account of that hierarchy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2807.375,
    "end": 2807.695,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2808.376,
    "end": 2811.457,
    "text": "Let's move into section three and figure two.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2812.398,
    "end": 2816.019,
    "text": "So the caption is three faces of Bayesian mechanics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2816.82,
    "end": 2821.322,
    "text": "What are the three faces of Bayesian mechanics and what is this figure showing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2822.903,
    "end": 2831.427,
    "text": "Well, it's often been suggested that there are like 17,000 versions of the free energy principle.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2832.952,
    "end": 2837.153,
    "text": " And that it's not very clear what the current version is and all that stuff.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2837.533,
    "end": 2840.154,
    "text": "And some of this is fair and some of it isn't.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2840.274,
    "end": 2855.258,
    "text": "I think some of it is fair because it is true that often in the technical papers, not sufficient care has been given to making very explicit which assumptions we're making about the systems that we're interested in modeling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2857.298,
    "end": 2868.084,
    "text": " So what we tried to do in section three is to provide a comprehensive survey of all of the ways that the free energy principle has been articulated in the literature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2869.745,
    "end": 2877.169,
    "text": "And so it turns out that there are basically three main ways in which the FEP has been applied, which we're representing here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2878.194,
    "end": 2880.915,
    "text": " So we've already alluded to the first distinction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2880.935,
    "end": 2899.801,
    "text": "The FEP can either be formulated in terms of a probability density over states directly or as a probability density over paths, so over trajectories of states that we write in so-called generalized coordinates.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2901.55,
    "end": 2902.911,
    "text": " And those are importantly different.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2903.471,
    "end": 2917.638,
    "text": "So the literature over the last, I guess, circa 2012 to 2019 focused almost exclusively on the density over states formulation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2917.978,
    "end": 2918.918,
    "text": "And this is where you get",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2920.942,
    "end": 2927.025,
    "text": " The approximate Bayesian inference lemma that's played a pretty critical role in a lot of these investigations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2927.065,
    "end": 2933.287,
    "text": "This is also where you get states that play the role of Markov blankets effectively.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2935.896,
    "end": 2941.319,
    "text": " Whereas the original formulation of the FEP was in terms of a probability density over paths.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2941.419,
    "end": 2951.826,
    "text": "So you're not really so much interested in the dynamics of a system just in terms of how probable its states are.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2951.846,
    "end": 2957.95,
    "text": "What you're actually interested in is entire trajectories that unfold over time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2958.903,
    "end": 2969.799,
    "text": " And the most general paths formulation doesn't make a lot of the assumptions that have been criticized over the last little bit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2970.922,
    "end": 2977.245,
    "text": " Importantly, we don't assume that the systems being described are stationary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2978.565,
    "end": 2985.628,
    "text": "We don't assume that, and accordingly, we don't assume that the system has a non-equilibrium, a steady state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2987.369,
    "end": 2996.933,
    "text": "And we're now returning to this formulation because it's less restrictive for reasons that Dalton could probably detail better than I can.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2999.052,
    "end": 3017.451,
    "text": " So then within the density over states formulation, what you get is this kind of mode tracking or mode matching behavior where, I mean, essentially what we're saying is that a system that conforms to the free energy principle",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3018.012,
    "end": 3028.458,
    "text": " is such that it looks as if the average internal state is tracking the average external state or matching it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3029.078,
    "end": 3042.485,
    "text": "And the relevant difference in that density over states formulation is that the external mode that the system is tracking can have dynamics to it or can also not.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3043.958,
    "end": 3055.914,
    "text": " And it was important to distinguish these cases because a lot of the formal analysis, so for example, our colleagues at Sussex released this great paper, How Particular Are the Physics of the Free Energy Principle?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3056.675,
    "end": 3057.997,
    "text": "And they come to the conclusion that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3059.005,
    "end": 3064.93,
    "text": " The FEP doesn't really have anything interesting to say about the class of systems that they examined.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3065.591,
    "end": 3067.653,
    "text": "What is the class of systems that they examined?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3068.574,
    "end": 3075.161,
    "text": "They are looking at linear systems that undergo dissipation, effectively.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3075.201,
    "end": 3079.205,
    "text": "So physically, these are dampened springs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3080.782,
    "end": 3091.946,
    "text": " So to restate, if you take away the mathematical baggage, what they're saying is the FEP doesn't have anything particularly interesting to say about the behavior of dampened springs.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3092.547,
    "end": 3094.647,
    "text": "So what does a dampened spring do?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3094.707,
    "end": 3099.849,
    "text": "Well, it starts off and then it dissipates back to a fixed point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3102.09,
    "end": 3103.931,
    "text": "Like just due to friction.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3105.011,
    "end": 3106.812,
    "text": "So the mode...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3107.935,
    "end": 3110.757,
    "text": " towards which the system is flowing has no dynamics to it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3110.797,
    "end": 3111.658,
    "text": "It is a fixed point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3112.038,
    "end": 3113.9,
    "text": "It just dissipates back to a fixed point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3114.04,
    "end": 3120.945,
    "text": "And what they're showing is that there's nothing interesting to say from an FEP theoretic perspective about those systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3121.466,
    "end": 3130.072,
    "text": "But I mean, the counterpoint is sort of that there isn't anything interesting FEP theoretically to say about those systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3130.453,
    "end": 3137.238,
    "text": "There isn't any interesting external dynamics that the internal dynamics would be matching.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3138.236,
    "end": 3151.039,
    "text": " And a lot of these null results where we use FVP technology to say stuff about a system and there's nothing interesting to say, look at systems that have fixed external modes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3151.179,
    "end": 3160.581,
    "text": "And so the idea is that the FVP applies vacuously to those systems because there's nothing interesting to say.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3161.742,
    "end": 3166.023,
    "text": "So yeah, to summarize my rant,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3169.039,
    "end": 3173.361,
    "text": " We tried to summarize the main applications of the FEP in the literature.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3173.401,
    "end": 3174.402,
    "text": "We identified three.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3175.623,
    "end": 3185.709,
    "text": "And strategically, we point out where some commentators may have been led astray by focusing on one rather than the other.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3185.729,
    "end": 3187.49,
    "text": "So in particular, a lot of this",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3188.715,
    "end": 3197.239,
    "text": " These ideas that the FEP can't handle things like systems with moving attractors and systems that don't have like a single mode.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3199.52,
    "end": 3211.265,
    "text": "These are understandable characterizations given that basically from 2012 to 2019, we mostly focused on this middle class of systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3211.345,
    "end": 3217.468,
    "text": "So systems that we're describing in terms of the density over states that have a dynamic mode.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3217.924,
    "end": 3222.033,
    "text": " So it's understandable why people would focus their attention on that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3223.095,
    "end": 3229.428,
    "text": "But the FEP in its most general form doesn't make perhaps problematic assumptions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3230.424,
    "end": 3239.251,
    "text": " like stationarity and it, yeah, it also applies interestingly to systems that have interesting external state dynamics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3240.472,
    "end": 3244.075,
    "text": "So strategically, I think that's what we were going for in this section.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3244.956,
    "end": 3250.18,
    "text": "And I believe this is the only place in the entire literature where",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3251.224,
    "end": 3274.718,
    "text": " this is reviewed so comprehensively in terms of this tripartite distinction um so you know i i don't mean to be disingenuous and to suggest that you know the confusions that have arisen are only due to um you know just uh a lack of paying attention these things have not been expressed very clearly the assumptions have not always been stated very clearly and yeah it",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3276.47,
    "end": 3281.298,
    "text": " the form of the path of least action in each of these things looks very different.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3282.059,
    "end": 3289.331,
    "text": "So we can also understand why it might seem like there are 17 versions of the free energy principle, but there aren't.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3291.271,
    "end": 3291.992,
    "text": " Thank you, Maxwell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3292.832,
    "end": 3303.102,
    "text": "As we speed through this section, I'll just note that formalism one on page 15 is familiar and has to do with the flow of states in the particular partition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3303.823,
    "end": 3310.789,
    "text": "And we've also seen the Helmholtz decomposition shown in figure three in terms of a decomposition on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3312.791,
    "end": 3318.892,
    "text": " into the vertical and the horizontal, the gradient pursuing and the solenoidal isocontour aspect of flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3319.252,
    "end": 3322.033,
    "text": "Those are reviewed in the citations that are provided here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3322.493,
    "end": 3324.793,
    "text": "So let's get into the newer stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3326.953,
    "end": 3334.395,
    "text": "In section four, you're discussing some mathematical preliminaries on the maximum entropy principle, gauge theory, and dualization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3334.435,
    "end": 3335.475,
    "text": "But first, yes, Lars.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3338.955,
    "end": 3341.896,
    "text": "Moving on to section four, because I thought section three was...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3343.109,
    "end": 3348.573,
    "text": " incredibly illuminating for me personally, and I think the literature in general, having the separation out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3348.713,
    "end": 3354.416,
    "text": "And there was a question that arose for me in working through this that I just wanted to throw out there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3354.436,
    "end": 3358.259,
    "text": "I don't want to distract the journey through the paper too much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3358.379,
    "end": 3372.468,
    "text": "But in moving to this, you talk about on page 19, when the FEP is applied to density over states as opposed to path, we assume non-equilibrium steady state density.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3373.376,
    "end": 3389.202,
    "text": " And then on the next page, page 20, you see, we can view this NAS, non-equilibrium steady state density as providing a set of prior preferences, which lead the particular system to look like it attempts to enact and bring about these preferences through action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3390.222,
    "end": 3400.906,
    "text": "If you then move to the path-based formulation where there is no NAS assumption, how do you recover these preferences in",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3402.903,
    "end": 3404.225,
    "text": " in that formulation?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3404.385,
    "end": 3410.17,
    "text": "Or can you not use that formulation to describe systems that are doing actions that look like they have preferences?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3410.471,
    "end": 3411.992,
    "text": "Or is there a piece that I'm missing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3412.012,
    "end": 3413.133,
    "text": "Does that make sense?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3416.336,
    "end": 3417.357,
    "text": "I can take that one.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3418.467,
    "end": 3426.338,
    "text": " So one of the key deliverables of this third section is this three faces type thing, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3426.618,
    "end": 3432.886,
    "text": "So the idea of the free energy principle and the mechanical theory that arises from it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3433.527,
    "end": 3442.453,
    "text": " is we would want a mechanical theory, a law of motion for Bayesian inference or for systems that do Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3443.034,
    "end": 3445.375,
    "text": "And what it ends up being is approximate Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3445.656,
    "end": 3449.778,
    "text": "And this comes in three flavors, mode matching, mode tracking, or path tracking.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3449.899,
    "end": 3451.179,
    "text": "This is the three-faces thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3452.12,
    "end": 3470.194,
    "text": " So that I mean just like you have different flavors of classical mechanics you have things that move continuously like satellites in orbit or you have things that move and then stop moving like a bowl thrown through the air eventually returns to the ground and things that sit on the ground don't move unless they're acted upon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3470.654,
    "end": 3477.579,
    "text": "So there are very different flavors of approximate Bayesian influence and these three are in particular the kinds of things that we're thinking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3478.14,
    "end": 3478.26,
    "text": "So",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3479.295,
    "end": 3485.337,
    "text": " The reason why I give that context is because we can still imagine preferences on the paths of a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3485.937,
    "end": 3493.219,
    "text": "A system must evolve in such a way that it avoids certain areas of the state space, given that it remains a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3496.491,
    "end": 3503.399,
    "text": " a human can't evolve in such a way that it dips too far away from its allostatic bounds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3503.739,
    "end": 3513.171,
    "text": "There are certain set points and certain bounds around those set points in which I can oscillate, but too far outside of those bounds and I'm in trouble.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3514.453,
    "end": 3515.193,
    "text": "Likewise, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3516.283,
    "end": 3521.626,
    "text": " I can have something like a stone that kind of evolves through a state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3522.227,
    "end": 3527.089,
    "text": "The stone doesn't have preferences per se, but it has a definition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3527.83,
    "end": 3539.597,
    "text": "And so we can read not preferences, but definitions about what a stone looks like in the same sense as we understand what a human looks like as certain preferences that guarantee cohesion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.177,
    "end": 3546.007,
    "text": " So things that are definitional of a stone guarantee that same kind of cohesion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3547.95,
    "end": 3550.494,
    "text": "There's a type error if you would identify them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3550.594,
    "end": 3553.859,
    "text": "But mathematically, they end up looking very similar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3554.887,
    "end": 3562.674,
    "text": " And what's interesting about that is now you can talk about preferences or you can talk about definitions along the path of evolution of a system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3563.054,
    "end": 3565.796,
    "text": "A stone must stay roughly together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3565.836,
    "end": 3568.138,
    "text": "It must stay in this sort of crystalline structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3568.819,
    "end": 3573.022,
    "text": "If you start hammering away at it, you turn it into a powder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3573.042,
    "end": 3574.924,
    "text": "And this is something that we wouldn't think of as a stone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3575.985,
    "end": 3577.887,
    "text": "So in the same sense, if a human...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3579.688,
    "end": 3584.251,
    "text": " doesn't eat for too long and maybe starves to death.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3584.351,
    "end": 3588.434,
    "text": "It's a really grim example, but unfortunately, it's one of the better ones.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3588.914,
    "end": 3604.284,
    "text": "You can imagine you're drifting too far away from this state of being satiated or having sufficient energy to maintain cellular processes and the chemical reactions that sustain life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3605.004,
    "end": 3610.589,
    "text": " And as a result, you know, the preference along your set of paths has been violated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3611.489,
    "end": 3630.645,
    "text": "So I think, yes, there is a sense in which even though we have forgone a nest density per se, we still have a density over paths, not over states, that this density still expresses something of a definition for the system or a set of preferences for the system without which we don't have a conceptualization of that system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3632.416,
    "end": 3635.838,
    "text": " That's a very long answer to your question, but maybe it satisfies you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3636.438,
    "end": 3637.519,
    "text": "No, that's great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3637.599,
    "end": 3638.099,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3638.119,
    "end": 3639.579,
    "text": "That was really useful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3639.619,
    "end": 3640.14,
    "text": "That makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3641.48,
    "end": 3641.901,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3641.921,
    "end": 3654.787,
    "text": "You can kind of think about it as these constraints force systems to basically pick trajectories that are at the trough of a preference landscape or a constraint landscape, if you want to think about it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3655.127,
    "end": 3657.548,
    "text": "So you get the same kind of thing, as Dalton was saying.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3657.568,
    "end": 3660.589,
    "text": "But the systems aren't assumed to be stationary.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3662.421,
    "end": 3667.683,
    "text": " you know, non-equilibrium steady state distributions per se.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3668.704,
    "end": 3670.044,
    "text": "But there is something analogous.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3670.965,
    "end": 3680.029,
    "text": "And a lot of the future work in G theory is precisely about using the technology of maximum caliber to really make sense of this formally.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3684.117,
    "end": 3708.267,
    "text": " let's move into section four so in section four as noted and as referenced to the previous publication there's a discussion that the fep is dueled to the constrained maximum entropy principle and then one of the ways that that's pursued in this section is through the lens or at least related to gauge theory so we're looking at figure four",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3709.247,
    "end": 3738.35,
    "text": " what is gauge theory what is category theory dual and how is it being deployed in this situation um i guess i'll take that one as well uh figure four you said yes okay illustration of fiber bundles sections oh yeah okay yeah uh well mega fig i i recognize that name i believe that's how we refer to it internally",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3739.328,
    "end": 3764.895,
    "text": " Yeah, well, so if you ask me, because I am a mathematician primarily, if you were to ask me or if you were to ask a mathematician, what is a gauge theory, you would probably get a response roughly like, well, gauge theory is the study of a particular geometric space called a fiber bundle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3765.975,
    "end": 3769.298,
    "text": " So there is a type of space called a fiber bundle in geometry.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3770.379,
    "end": 3772.46,
    "text": "It looks exactly like that figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3772.5,
    "end": 3779.225,
    "text": "It's a bunch of fibers pasted onto something on the bottom, what we call a base manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3780.146,
    "end": 3792.575,
    "text": "And studying how do things behave in a space like this, how do they behave in the sort of fibers, and how does that reflect some kind of behavior on the base manifold?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3793.776,
    "end": 3801.182,
    "text": " These are interesting geometric questions that arise in the study of fiber bundles and hence in what is called gauge theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3801.722,
    "end": 3810.829,
    "text": "If you're a physicist, I mean, it turns out that fiber bundles are the natural space for talking about classical gauge theories.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3810.969,
    "end": 3814.252,
    "text": "So the theory of certain high energy particles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.893,
    "end": 3817.674,
    "text": "But it's a little bit more general than that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3818.775,
    "end": 3821.257,
    "text": "And so if you're a physicist, this is what you think of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3821.297,
    "end": 3821.817,
    "text": "You think about...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3823.178,
    "end": 3835.851,
    "text": " like gauge bosons uh but but this is only because fiber bundles are a very natural way of talking about these things and so it is a little bit more general what we're talking about in the figure four is this idea that uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3836.954,
    "end": 3848.864,
    "text": " in this space of fibers, you can kind of trace out surfaces and that these surfaces are like probability densities over the base manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3848.904,
    "end": 3852.187,
    "text": "And in fact, they aren't just like probability densities, they are.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3852.647,
    "end": 3858.272,
    "text": "So you can formulate probabilities over a state space as an object in a fiber bundle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3858.912,
    "end": 3871.534,
    "text": " And therefore, if you have all the technology available to you, you can draw this very nice gauge theoretic interpretation of what it means to be a probability density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3872.174,
    "end": 3887.017,
    "text": "And therefore, because the object of Bayesian mechanics is systems that do inference, and so systems that estimate probability densities, there is a nice gauge theoretic interpretation to Bayesian mechanics that hinges pretty much on this picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3888.879,
    "end": 3895.543,
    "text": " What we would call the gauge in this situation is the choice of this J function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3895.863,
    "end": 3907.131,
    "text": "So you see you have several different surfaces, three of them, each of which comes with a different choice of J. So the idea of choosing a function in the fibers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3908.852,
    "end": 3912.615,
    "text": " and therefore choosing a shape for your surface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3913.355,
    "end": 3915.817,
    "text": "This is what we would think of as a gauge theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3916.318,
    "end": 3931.549,
    "text": "And that's why I went down this route in the geometry and analysis paper, because it ends up drawing a very nice picture of what it might mean to engage in constrained inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3934.235,
    "end": 3934.515,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.095,
    "end": 3960.947,
    "text": "And could I give a pedestrian or so the, the bystander, the, yeah, the, the more, the less technical version of it is, um, so gauge theories and Dalton track me whenever I say something that's wildly or even not so wildly inaccurate, but gauge theories are basically how one would, um, how one articulates, uh, symmetries or conservation laws and contemporary physics, uh,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3961.287,
    "end": 3972.068,
    "text": " So most physics relies on the idea that some transformations that are of interest, like the ones described by Maxwell's equations,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3973.522,
    "end": 3976.366,
    "text": " have some kind of symmetry or that concern.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3976.406,
    "end": 3985.857,
    "text": "I think a slightly better way of going about it would be to say that modern physics is broken up roughly into stuff and forces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3986.979,
    "end": 3992.185,
    "text": "And forces act on stuff, and stuff gets acted on by forces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3993.827,
    "end": 4007.619,
    "text": " So the interesting thing in gauge theory is you can talk about how a definition of some stuff, the shape of some stuff, is intimately dependent on the forces acting on the stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4008.584,
    "end": 4015.027,
    "text": " And so this is where we get this idea of we have a particular shape to our surface.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4015.547,
    "end": 4025.351,
    "text": "We have some probabilities over our states, but that this is actually defined by the choice of gauge, this J function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4025.411,
    "end": 4034.775,
    "text": "So our assignment of probability to states is actually determined not by probability, but it's determined by the constraints on those states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4035.235,
    "end": 4037.216,
    "text": "Certain states are preferable, certain states are not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4037.916,
    "end": 4040.117,
    "text": " Unpreferable states get low probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4040.717,
    "end": 4042.378,
    "text": "Preferable states get high probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4042.758,
    "end": 4051.021,
    "text": "And our notion of preferability is encoded in the choice of J. It's a function that constrains different states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4051.441,
    "end": 4053.382,
    "text": "So constraints in this case are like penalties.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4054.042,
    "end": 4059.964,
    "text": "So our assignment of penalties, so our choice of force, is actually what shapes our assignment of probability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4060.544,
    "end": 4061.345,
    "text": "That's ultimately...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4062.805,
    "end": 4073.027,
    "text": " I think, well, that's a slightly different way of viewing the geometry of the situation is gauge theory is all about these kinds of what we would call covariance relationships.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4073.527,
    "end": 4076.387,
    "text": "Covariance meaning literally two things varying together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4076.707,
    "end": 4080.528,
    "text": "If I choose a force, I'm forced to choose some stuff.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4081.468,
    "end": 4086.789,
    "text": "And likewise, if I choose some stuff, that necessitates an underlying choice of force.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4087.709,
    "end": 4091.93,
    "text": "So gauge covariance ends up being very helpful in situations like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4094.861,
    "end": 4118.086,
    "text": " thanks let's see if we can touch on some of these last figures in figure five we see a vector field on a curve that's reminding us of that sort of baseball diamond shape from earlier with a path of least action and in figure six a probability density is generated by level sets of the constraint function",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4118.846,
    "end": 4128.07,
    "text": " J. So either figure five or figure six, whichever you feel fits in best here, what is being shown and where were you going with it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4128.21,
    "end": 4130.832,
    "text": "How is it connected to alternative phrasings?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4131.952,
    "end": 4137.074,
    "text": "Yeah, I guess I'll just cut to figure six, which is kind of about this covariance thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4137.455,
    "end": 4146.319,
    "text": "So if I choose a particular functional form for J, in this case, it's a penalty that is proportional to distance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4147.359,
    "end": 4153.585,
    "text": " I would expect my assignment of probability to fall off roughly like a distance function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4154.786,
    "end": 4159.49,
    "text": "So probability of a state should decrease as the penalty on a state increases.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4159.89,
    "end": 4167.557,
    "text": "So in this case, the probability of a state should decrease as I go away from some central point, and it should do so symmetrically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4168.458,
    "end": 4171.6,
    "text": "And so we would expect a Gaussian density from this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4172.661,
    "end": 4182.364,
    "text": " And it is indeed the case that you can understand the covariance as a kind of projecting down and then lifting back up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4183.404,
    "end": 4185.405,
    "text": "And what do you get when you do that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4185.845,
    "end": 4196.848,
    "text": "Well, the stuff in the equation, the probability, ends up being defined by, we take all of the sort of rings on the J function, you project them down.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4197.819,
    "end": 4199.859,
    "text": " you get circles on the base manifold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4200.299,
    "end": 4202.62,
    "text": "When you lift them back up, they're rings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4202.72,
    "end": 4210.781,
    "text": "And so we know a symmetric probability density with a whole bunch of rings is just a Gaussian probability density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4210.861,
    "end": 4216.862,
    "text": "So this figure is kind of capturing what does this covariance relationship actually look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4217.242,
    "end": 4220.003,
    "text": "How do we actually build stuff out of forces?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4220.543,
    "end": 4225.264,
    "text": "And it ends up being the case that it's this very simple recipe of you push everything down,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4226.052,
    "end": 4227.253,
    "text": " And then you lift it back up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4227.873,
    "end": 4235.256,
    "text": "And the lift is e to the j. So you place j onto x. That's the first step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4235.616,
    "end": 4238.237,
    "text": "Your second step is then you hit it with this exponential function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4238.597,
    "end": 4243.44,
    "text": "And e to the minus x squared is, of course, a Gaussian density.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4244.1,
    "end": 4246.081,
    "text": "So that's all that figure 6 is depicting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4246.141,
    "end": 4249.922,
    "text": "It's just zooming in on one of the objects in figure 4.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4253.029,
    "end": 4253.289,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4253.409,
    "end": 4271.606,
    "text": "And I thought on page 34 also, the striking result that the splitting of the flow of a system into vertical and horizontal components under the constrained maximum entropy principle is isomorphic to the Helmholtz decomposition of the flow of the autonomous partition of a particular system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4272.327,
    "end": 4298.896,
    "text": " so for those who are caught up with the way that the helm holds decomposition was used for example in the papers that we discussed in live stream 32 with uh markov blankets and chaos stochastic chaos this is augmenting it or transposing it into another formalization um and moving on again quickly um it's worth pointing out that there's um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4299.773,
    "end": 4304.734,
    "text": " there are some significant advantages to reformulating things in terms of maximum entropy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4306.915,
    "end": 4322.52,
    "text": "I'll let Dalton speak to the more technical parts of this, but I guess one thing that pops out to me more politically is that maximum entropy and constrained maximum entropy",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4323.519,
    "end": 4327.422,
    "text": " I mean, they are just core parts of the physicist's toolbox.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4328.843,
    "end": 4340.751,
    "text": "So the fact that we are able to reproduce the Helmholtz decomposition in terms of the way that flow splits up in the gauge theoretic formulation I think is quite significant.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4341.692,
    "end": 4346.635,
    "text": "It gives us an entirely independent line of reasoning arising at the same results.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4348.499,
    "end": 4361.844,
    "text": " So especially due to some work by Martin Beal and colleagues a few years ago, we were no longer sure whether some of these results obtained.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4363.244,
    "end": 4370.667,
    "text": "There had been doubt thrown onto the derivations of the approximate Bayesian inference lemma in some papers.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4371.787,
    "end": 4375.329,
    "text": "Life as We Know It from 2013, I believe, is the paper that they targeted.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4376.397,
    "end": 4397.2,
    "text": " One way of reading this is that independent of all these analyses and independent of whether Beale and colleagues are correct about their criticism of the 2013 paper, this is an independent derivation that just follows from uncontroversial mathematics, and we're able to re-derive basically the main core",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4398.383,
    "end": 4402.545,
    "text": " uh, portions of the formal results, uh, that Carl had derived.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4402.605,
    "end": 4406.426,
    "text": "So the approximate Bayesian inference lemma, the Helmholtz decomposition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4406.446,
    "end": 4415.99,
    "text": "Um, and I mean, in some sense, the magic is that we understand now why these arise to begin with.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4416.81,
    "end": 4421.052,
    "text": "Uh, there's, uh, yeah, I think the, um,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4422.822,
    "end": 4438.716,
    "text": " The maximum entropy interpretation in some sense, especially in the gauge theoretic formulation, in some sense tells us, well, why does approximate Bayesian inference work just full stop?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4439.317,
    "end": 4444.241,
    "text": "And these sets of results explain effectively why this has to be the case.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4446.203,
    "end": 4449.666,
    "text": "Only my facilitator hat prevents me from being that excited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4451.594,
    "end": 4472.188,
    "text": " um section 5.4 also explored more in the previous citation so the four things that i wanted to just touch on as briefly as people wanted as we close are the three philosophical areas that are introduced in section six and then of course just the appetizer of g theory so in page 38",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4473.777,
    "end": 4489.945,
    "text": " section six the philosophy of bayesian mechanics 6.1 addresses clarifying the epistemic status of the fep so what were you aiming to bring people's attention to and address in 6.1 with this philosophical question",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4491.104,
    "end": 4496.886,
    "text": " Well, I think this basically summarizes the point about dynamics, mechanics, and principles that we were making earlier.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4496.906,
    "end": 4506.809,
    "text": "You know, so the FEP has been described variously in various and sometimes very different ways, even by like its core proponents.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4506.829,
    "end": 4516.872,
    "text": "So Carl introduced the FEP to the world as a theory of cortical function circa 2005, and then as a unified brain theory in 2010, which",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4519.618,
    "end": 4533.643,
    "text": " led a lot of people, and I think not to, like, this isn't bad faith, it led a lot of people to say, well, okay, so this is a theory, and so it should be making predictions, and therefore it should be empirically verifiable.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4534.464,
    "end": 4545.368,
    "text": "So I think, you know, the way that we talked about it led to a lot of confusion, and it's been described as, you know, a framework, whatever that means, by myself included, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4546.403,
    "end": 4552.308,
    "text": " So mea culpa, we called it the active inference framework for a long time without really being specific as to what that meant.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4552.348,
    "end": 4563.537,
    "text": "We kind of met all of this, this cluster of results that kind of agglomerate around the FEP, um, um, Raja and colleagues have called this a, uh,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4564.238,
    "end": 4585.94,
    "text": " a trick uh kind of like the variational auto encoder trick in machine learning so it's a it's a trick if you can write a markov blanket for a system then you can make you can write down a model that looks as that says that the system looks as if it's performing bayesian inference it's also been called a physics a physics of sentient systems a formal ontology",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4587.708,
    "end": 4589.97,
    "text": " So the point is to say, well, everyone is kind of right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4590.291,
    "end": 4594.075,
    "text": "You know, these are all, in some sense, valid assessments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4594.155,
    "end": 4605.249,
    "text": "And Mel is really the one who clarified things initially, I think, by distinguishing formal structures from interpreted empirically evaluable models.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4606.432,
    "end": 4627.112,
    "text": " and um yeah i think that the first part here is to say well we can make sense of this model by appealing to this tripartite distinction that we've outlined so by distinguishing dynamics which are descriptions formal descriptions of some behavior that we want to get to mechanical theories that explain how then principles that explain why",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4627.648,
    "end": 4643.518,
    "text": " And then what we're calling, I think, empirical applications, which are basically these formal models plus an assignment or an interpretation or evaluation of these models in terms of the features of target systems that we want to explain.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4645.373,
    "end": 4652.897,
    "text": " Yeah, so when they're applied in that way, mechanical theories become empirical theories, as we write, in the ordinary sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4654.658,
    "end": 4663.062,
    "text": "But yeah, so hopefully this kind of clarifies everything around falsification, how this thing is used, and importantly, why this is just standard physics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4663.122,
    "end": 4672.266,
    "text": "I mean, this isn't all that spooky in terms of the use of mathematics to make sense of physically relevant aspects of our universe.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4674.4,
    "end": 4677.121,
    "text": " So that's what we were trying to do in that section.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4678.382,
    "end": 4678.602,
    "text": "Great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4679.262,
    "end": 4680.042,
    "text": "Really clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4680.062,
    "end": 4687.646,
    "text": "6.1, it reads to me like it's the tip of an iceberg with a nice landing and takeoff strip.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4688.086,
    "end": 4693.588,
    "text": "And yes, it's a big iceberg, but it is an iceberg and there is a tip that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4693.608,
    "end": 4696.349,
    "text": "6.2 on page 39, Ilan Vital and the FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4701.519,
    "end": 4705.481,
    "text": " What does this French linguistics have to do with the FEP, Maxwell?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.742,
    "end": 4729.393,
    "text": "Well, Dalton might have some pretty interesting remarks to make, but just briefly, I mean, I find it kind of ironic that the people who are most critical of FEP right now, like folks from the inactive tradition and folks from the ecological tradition, sometimes frame their own research as trying to struggle against dualism in some sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4730.494,
    "end": 4731.334,
    "text": "But our belief is that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4731.823,
    "end": 4735.211,
    "text": " They are intrinsically dualistic frameworks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4735.392,
    "end": 4737.136,
    "text": "So is a French term.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4741.553,
    "end": 4756.944,
    "text": " Vitalism, I don't know how familiar you are with the history of biology, but before the 20th century and the discovery of DNA, most serious physicists believed in something like Aristotle's entelechy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4757.364,
    "end": 4762.168,
    "text": "So you had to have some kind of physical mechanism for purposiveness.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4762.848,
    "end": 4775.355,
    "text": " And so Elan Vital was this kind of vital force that they believed, the vitalists believed, animated living systems and differentiated them from non-living systems like stones and rocks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4776.156,
    "end": 4788.883,
    "text": "And we believe that one of the consequences of the perspective that we're adopting here and building on, you know, especially the work of Mike Levin, who's done amazing, made amazing contributions in this field, is that it",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4792.882,
    "end": 4804.276,
    "text": " Self-organization and cognition and life and these things that we like to point out as being distinct from inert matter actually are more on a continuum.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4804.296,
    "end": 4809.162,
    "text": "The Bayesian mechanics says that basically anything that's a thing...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4810.219,
    "end": 4814.361,
    "text": " will exhibit some features of what we think of as cognition.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4815.882,
    "end": 4824.708,
    "text": "So it is a massively deflationary and absolutely, resolutely monistic perspective that we're advancing here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4824.728,
    "end": 4835.434,
    "text": "Yeah, which says that trying to look for the boundary between living and non-living systems is bound to fail in some sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4836.411,
    "end": 4837.511,
    "text": " There is a continuum.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4837.851,
    "end": 4845.933,
    "text": "These processes that we're interested in are also events by rocks and by tornadoes and by crystals.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4846.373,
    "end": 4855.015,
    "text": "And it is a question of degree to which systems act as cognitive systems.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4858.036,
    "end": 4858.216,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4859.396,
    "end": 4861.457,
    "text": "I'm sure Dalton has more interesting things to say about that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 4862.472,
    "end": 4865.075,
    "text": " Yes, on 6.2, what else would you add there, Dalton?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4865.475,
    "end": 4870.52,
    "text": "Well, maybe not more interesting, perhaps more interesting things to say.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4873.443,
    "end": 4881.471,
    "text": "Well, yeah, I mean, I think this section is mostly just a recapitulation of footnote two, in a sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4883.174,
    "end": 4896.037,
    "text": " Meaning we made this statement that inference, per se, representation of some statistics of something else is this very broad, very general thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4896.557,
    "end": 4901.298,
    "text": "And any system that is not a closed system does inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4902.018,
    "end": 4904.999,
    "text": "So what that means is under the free energy principle,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4906.119,
    "end": 4918.816,
    "text": " And at least what we've written in that paper, what we've worked out so far, there isn't a way to talk about cognition versus non-cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4919.436,
    "end": 4922.34,
    "text": "It's more of a spectrum of cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4923.061,
    "end": 4926.065,
    "text": " There are certain systems that are more cognitive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4926.105,
    "end": 4930.37,
    "text": "This is something that Carl might call temporal depth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4930.831,
    "end": 4934.155,
    "text": "So there are systems that are very good at planning and executing actions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4934.556,
    "end": 4935.677,
    "text": "And there are systems that are not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4936.138,
    "end": 4939.221,
    "text": "So there's a very clear difference between humans and stones, for instance.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4939.862,
    "end": 4941.284,
    "text": "But that difference isn't in...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4942.405,
    "end": 4944.145,
    "text": " one does inference and another doesn't.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4944.486,
    "end": 4946.766,
    "text": "It's that one does a bit more complicated inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4947.246,
    "end": 4954.148,
    "text": "It has better or more accurate representations or more representations, full stop maybe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4954.848,
    "end": 4958.589,
    "text": "And it's better at using those representations to do action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4959.129,
    "end": 4967.791,
    "text": "But both stones and humans are estimators of the statistics of the processes around them simply by mathematical construction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4968.491,
    "end": 4969.492,
    "text": "And so there's this very...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4971.332,
    "end": 4987.609,
    "text": " uncontroversial statement, or at least it shouldn't be a controversy, that systems, things in the very most general sense, exhibit this kind of representation-based inference that we would typically identify as cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4989.072,
    "end": 4991.795,
    "text": " So that was the motivation for talking about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4991.895,
    "end": 4999.3,
    "text": "And then Maxwell tied a very nice bow on it with this great history of a debate around very similar questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5000.221,
    "end": 5003.023,
    "text": "But yeah, it was this idea of a spectrum of cognition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5004.364,
    "end": 5004.705,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5005.005,
    "end": 5010.189,
    "text": "And citation 92 there is the 2018 paper answering Schrodinger's question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5010.209,
    "end": 5010.249,
    "text": "So...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5011.843,
    "end": 5021.909,
    "text": " many years ago, the other Maxwell at all, who raised that question and sparked really a phase transition in the discourse.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5021.969,
    "end": 5028.354,
    "text": "And that was also like one of the papers that really drew me in and got me excited.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.414,
    "end": 5033.017,
    "text": "And so it's amazing to see what other questions and answers have been risen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5034.691,
    "end": 5056.683,
    "text": " 6.3 and then g so 6.3 is a slightly longer section and it's on maps and territories so yeah what is that i'm really glad i'm really glad that we were able to write this so um i i never found this particularly confusing but i i it it has led to a lot of confusion um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5058.075,
    "end": 5066.238,
    "text": " So in particular, there's this entire paper by Thomas Van Ness that just is just confused about this issue.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5067.078,
    "end": 5068.058,
    "text": "I forget what it's called.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5068.219,
    "end": 5072.78,
    "text": "It's living life model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5073.84,
    "end": 5085.244,
    "text": "Anyway, so folks have said, well, is the free energy principle just a description that we are?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5087.71,
    "end": 5093.195,
    "text": " a model that we are using to describe interesting features of the world?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5093.875,
    "end": 5102.863,
    "text": "Or is it saying that self-organizing systems actually are models of the world?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5105.645,
    "end": 5112.23,
    "text": "And so I never particularly found this problematic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5114.278,
    "end": 5120.586,
    "text": " Because this phrase in the paper, I think, sums it up correctly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5121.648,
    "end": 5127.796,
    "text": "The free energy principle is, in some sense, a map of that part of the territory that looks as if it is a map.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5129.525,
    "end": 5138.847,
    "text": " And so Thomas Metzinger actually retweeted our paper and pointed, called this nested representationalism, which I found interesting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5140.327,
    "end": 5156.871,
    "text": "So yeah, there are these kind of two distinct levels at play, but there's no foul play here because the FEP model is very explicit about which parts of the formalism pertain to our map of the territory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5157.512,
    "end": 5165.435,
    "text": " And which parts of the formalism pertain to the map that self-organizing systems are constructing according to our map?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5167.055,
    "end": 5172.017,
    "text": "Yeah, so I think it's important to point out that there isn't a contradiction here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5173.538,
    "end": 5179.0,
    "text": "There are just these two probability densities that are at play in the construction, the Q density and the P density.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5179.5,
    "end": 5185.042,
    "text": "And you can understand the generative model or the P density as basically",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5185.666,
    "end": 5199.282,
    "text": " uh our model of uh the self-organizing system in terms of uh yeah joint probability density uh over uh it's it's state space or potentially it's a",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5200.586,
    "end": 5201.386,
    "text": " space of paths.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5202.767,
    "end": 5212.692,
    "text": "So in that sense, the self-organizing system being its own best model really means we have a model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5213.732,
    "end": 5215.373,
    "text": "We can explain the system's dynamics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5215.453,
    "end": 5226.819,
    "text": "And the system's potential is formalized as a generative model, as a joint probability density.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5228.826,
    "end": 5246.499,
    "text": " It just so happens that part of the variables that are described by that joint probability density play the role of parameterizing additional probability densities over another subset of variables described by the generative model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5246.519,
    "end": 5255.066,
    "text": "So there are really these two, I think, unambiguously different senses of being a model that are at play.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5258.26,
    "end": 5264.465,
    "text": " And yeah, I don't think this is a sleight of hand and hopefully we have clarified.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5266.767,
    "end": 5267.047,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5267.348,
    "end": 5270.69,
    "text": "What, what exactly is at stake here?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5270.71,
    "end": 5275.915,
    "text": "I think there are some nice connections to the maximum entropy formulation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5275.935,
    "end": 5283.822,
    "text": "So as Dalton articulated in the paper, at least, you said, you said as much in discussion today.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5284.709,
    "end": 5296.379,
    "text": " I think by flipping to the perspective of maximization of entropy, we effectively recover our own position as modelers trying to model the system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5296.399,
    "end": 5304.887,
    "text": "So the prism through maximum entropy adds this additional clarification that",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5305.627,
    "end": 5331.276,
    "text": " uh yeah we can entirely recover the perspective of a modeler using maximum entropy modeling to model a free energy type system by invoking this duality of perspectives um and i think that's really important um then there's this other piece here which says that the the maps that we construct in fep and in max end uh both adhere to a kind of epistemic minimalism",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5332.168,
    "end": 5343.301,
    "text": " So maximum entropy inference is basically saying I'm going to, well, given some data set, the probability density that most, that is,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5344.352,
    "end": 5347.496,
    "text": " the one that best explains the data set is the one with the highest entropy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5347.516,
    "end": 5357.048,
    "text": "What this means is that we are building in to that probability distribution as little prior information as possible.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5357.168,
    "end": 5363.716,
    "text": "It's like starting from the point of view of maximal ignorance, given a few constraints, what is the underlying probability density?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5364.887,
    "end": 5370.879,
    "text": " Um, the FEP has a similar starting point for maximal ignorance, which says I can't go beyond the blanket.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5371.259,
    "end": 5375.227,
    "text": "Like I am stuck with the data that I'm generating and.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5375.992,
    "end": 5381.193,
    "text": " with the way that I probe the world, the data generating process to generate my data.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5381.673,
    "end": 5383.794,
    "text": "And there is no going beyond that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5383.934,
    "end": 5388.635,
    "text": "You can't go beyond the blanket unless you break the blanket, but then you're just introducing a new blanket.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5388.675,
    "end": 5392.595,
    "text": "So for example, I can't see in your brains.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5393.436,
    "end": 5405.338,
    "text": "I could put you in an fMRI machine and break the blanket, but then I'm really introducing another blanket, which is this new set of data that I have to continue making inferences from",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5406.05,
    "end": 5430.739,
    "text": " Um, so I mean, the, then the, the FEP and Maxent kind of emerge as, uh, these epistemically, um, minimalistic or, um, you know, they kind of emerge as the way that you would construct a map of the part of the territory that acts as a map from a perspective, from, from a starting point of maximal ignorance.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5432.383,
    "end": 5432.623,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5433.043,
    "end": 5440.248,
    "text": "And I think that's connected in the Active Inference textbook to figure 9.1, the meta-Bayesian perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5441.009,
    "end": 5447.774,
    "text": "And there it's not described in the context of maximum entropy, but it's something very similar with this nested representationalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5449.014,
    "end": 5452.677,
    "text": "Any other philosophical notes before we go to section seven?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5453.838,
    "end": 5454.798,
    "text": "Yeah, that's exactly right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5455.599,
    "end": 5456.66,
    "text": "That's exactly right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5457.18,
    "end": 5457.48,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5457.52,
    "end": 5458.201,
    "text": "I love this book.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5463.205,
    "end": 5467.648,
    "text": " Yeah, Dalton, anything to add before we launch into G-theory?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5467.668,
    "end": 5470.731,
    "text": "No, I think you raised an interesting point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5471.371,
    "end": 5486.643,
    "text": "So we can talk about, you know, when we use the FEP to model a system, what we're doing is forming a model of the system where the system forms a model of its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5487.804,
    "end": 5490.967,
    "text": "And so there is this nested representationalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5491.724,
    "end": 5499.488,
    "text": " What's interesting about the maximum entropy point of view is you can kind of dualize it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5499.528,
    "end": 5509.253,
    "text": "You can take this sort of mirror image of this thing and you can ask, okay, well, we're not interested in a model of the system modeling something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5509.813,
    "end": 5511.414,
    "text": "All we want is a model of the system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5511.814,
    "end": 5515.076,
    "text": "So what does the system look like when it's creating that model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5515.436,
    "end": 5517.757,
    "text": "Not what does the system's model look like?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5518.909,
    "end": 5521.552,
    "text": " So this is the dualization aspect of things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5521.913,
    "end": 5532.025,
    "text": "And so you can talk about... And when you dualize, you can talk about things like constraints on agent states rather than the predictions and actions of the agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5532.425,
    "end": 5534.027,
    "text": "So it's a bit of a different viewpoint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5534.308,
    "end": 5536.43,
    "text": "It's just emphasizing different...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5538.268,
    "end": 5560.308,
    "text": " levels of the nest, so to speak, which is kind of interesting because you do get both of these perspectives for free as soon as you commit to this relational symmetry of an observer in an environment and an agent in an environment and how those two things do model each other.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5561.249,
    "end": 5563.991,
    "text": " And that's what you get when you dualize things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5565.052,
    "end": 5567.234,
    "text": "But yeah, that's it for me on that section.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5567.274,
    "end": 5570.496,
    "text": "I think Maxwell pretty much covered a lot of the important points.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5571.877,
    "end": 5589.811,
    "text": "I mean, I will say that, you know, this probably is not obvious until you really look at the mathematical formulation and notice that there are two, you know, as I wrote in that paper from a few years ago, the FEP is a tale of two densities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5591.092,
    "end": 5602.135,
    "text": " And you really need to, like, take a look at the math to understand that there isn't a, this isn't like a case of reification.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5602.155,
    "end": 5605.336,
    "text": "This is just formulated.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5605.356,
    "end": 5612.698,
    "text": "So it isn't so simple that you could just put it in a directed acyclic graph and say, hey, look, here are these two.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5614.439,
    "end": 5619.34,
    "text": "But definitely, if you take the time to work through the formalism,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5620.129,
    "end": 5632.155,
    "text": " There are clearly these two different senses of being a model that are at play, that are cleanly distinguished, and I think are actually not all that problematic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5634.516,
    "end": 5634.877,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5635.097,
    "end": 5644.902,
    "text": "It's almost like thinking through other minds highlighted some of the social consequence and theory of mind and behavioral aspects of certain types of cognitive entities, but systems",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5645.865,
    "end": 5661.744,
    "text": " Thinking of, through, about other systems or infers, thinking through other infers, infer ants, that type of dual view from the inside, view from the outside is again, what you're suggesting is enabled by that kind of a commitment to these foundations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5662.725,
    "end": 5662.825,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5663.86,
    "end": 5688.907,
    "text": " of course it could be a whole nother guest stream and perhaps should be on g theory but as we close here what can we say today on 6 13 2022 about g theory and what is exciting you all about how you're going to continue forward do you want to take this one dalton uh yeah sure uh so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5690.031,
    "end": 5706.923,
    "text": " I mean, like I mentioned earlier on, there's already a lot of really promising stuff in the literature about path integrals and path entropy and the kind of power it has to deal with systems that we would normally kind of balk at.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5708.584,
    "end": 5710.505,
    "text": "And so it's already very promising.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5710.525,
    "end": 5715.769,
    "text": "There's reason to be optimistic about how this extension will benefit us in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5717.908,
    "end": 5731.735,
    "text": " So G-theory itself is... Maxwell coined this term to describe the extension of this duality from mode matching and Max-Ent, Max-Cal, which will involve precisely this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5731.755,
    "end": 5742.721,
    "text": "We'll try to formulate the free energy principle in its full generality as dual to entropy in its full generality on paths and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5743.581,
    "end": 5743.902,
    "text": "And so...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5745.1,
    "end": 5761.031,
    "text": " The reason why this is so exciting is because already there's a very clear path towards talking about systems that are non-stationary, so systems whose statistics change, more complicated forms of inference, more complicated forms of constraints and preferences.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5761.931,
    "end": 5774.6,
    "text": "And so it seems like already it's a much more faithful description of the kinds of systems that we want to talk about and extends to things like more complex systems, things like humans potentially,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5776.501,
    "end": 5796.611,
    "text": " So this is really, I guess, the end goal, is to do this dualization, to now build an FET dual model of something like a brain, which we know models its environment in this very complicated way, and so the kinds of representations it does are very complicated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5796.972,
    "end": 5798.472,
    "text": "So how do we model that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5800.967,
    "end": 5806.373,
    "text": " that should arise out of maximum caliber and therefore out of G-theory.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5807.073,
    "end": 5815.862,
    "text": "And in principle, eventually we'll have a very faithful, very foundational picture of complex systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5816.263,
    "end": 5818.685,
    "text": "But this is a very long-term goal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5819.306,
    "end": 5821.368,
    "text": "In the short term, we just want to get the maps to work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5824.288,
    "end": 5832.37,
    "text": " To connect that a bit to Lars's question earlier, what does it mean to have a non-stationary density over paths?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5833.09,
    "end": 5838.071,
    "text": "Well, I mean, what we're interested in is the way that the density changes as a function of the dynamics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5838.652,
    "end": 5844.653,
    "text": "So that you really have like these moving surfaces over a space of paths or a space of states.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5845.153,
    "end": 5848.694,
    "text": "And to really capture all of that kind of time dependency and",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5849.698,
    "end": 5873.213,
    "text": " um yeah requires moving from uh maxcent to maxcal uh from states to paths and um all of these kind of more fine-grained uh you know wandering blankets and moving attractors and all that good stuff uh should fall fairly naturally out of uh yeah g theoretic formulation of this stuff",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5877.677,
    "end": 5899.518,
    "text": " i like how within fep as we know it we have variational free energy f and then expected free energy takes us into the future and planning and that's g and then we see a little bit of like free energy principle f and then g is the next letter so that's a funny little would know dual analogy um well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5900.532,
    "end": 5904.273,
    "text": " If anybody has any closing thoughts, it would be a great time for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5904.393,
    "end": 5909.655,
    "text": "But just wanted to say that there's a lot of appreciation in the chat and a lot of excitement around this work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5909.715,
    "end": 5915.057,
    "text": "So we hope that you just continue acting and inferring and serving.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5915.997,
    "end": 5917.257,
    "text": "That's kind of you to say.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5918.878,
    "end": 5921.779,
    "text": "Thank you very much for the invitation to discuss our work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5923.706,
    "end": 5949.264,
    "text": " this has been great uh and yeah we uh we look forward to uh you know exploring the future uh with this whole community and um thanks for your time your attention your energy uh very very positive always a pleasure to be on active lab and uh yeah thanks for the guest stream yes i can only echo that uh it's been a real pleasure so thank you",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5950.213,
    "end": 5953.536,
    "text": " Thank you, Maxwell and Dalton et al.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5953.696,
    "end": 5956.378,
    "text": "Thank you, Lars, for joining and until the next time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5958.039,
    "end": 5958.279,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5959.44,
    "end": 5961.742,
    "text": "May the gradient descend ever in your favor, my friend.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 5963.103,
    "end": 5964.625,
    "text": "And with yours slash ours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5964.645,
    "end": 5967.347,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5967.367,
    "end": 5967.687,
    "text": "Take care.",
    "speaker": "SPEAKER_00"
  }
]