[
  {
    "start": 30.447,
    "end": 45.698,
    "text": " okay it's december 23rd 2021 nice sarah cool ceremonial lighting it's the end of 2021 paper review stream so welcome to active inference lab",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 46.874,
    "end": 53.14,
    "text": " We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.46,
    "end": 56.303,
    "text": "You can find us at some of the links here on this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 57.484,
    "end": 63.83,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.092,
    "end": 70.377,
    "text": "All backgrounds and perspectives are welcome here, and we'll be following good video etiquette for livestreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 72.369,
    "end": 89.106,
    "text": " This page shows a snapshot of our website, which I'll also put in the YouTube live chat and head over there if you want to participate in 2022 and check out this CODA site if you want to see more information on our past and upcoming live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 91.223,
    "end": 94.708,
    "text": " Today, the ACT-INF 21 paper review.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 95.388,
    "end": 102.638,
    "text": "We're gonna just be reviewing and reflecting some of the fun times and interesting things that we've talked about this year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.755,
    "end": 108.0,
    "text": " And just like a dot zero is just an introduction, not a review or a final word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 108.02,
    "end": 115.949,
    "text": "This is going to be just even more so because we're going to spend like literally two to three minutes, two to three memes per paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 116.83,
    "end": 118.833,
    "text": "And we talked about them for several hours.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 119.213,
    "end": 120.495,
    "text": "So this is just going to be kind of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.736,
    "end": 126.837,
    "text": " an off the cuff thought per paper, not a total rehearsal of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 128.077,
    "end": 130.698,
    "text": "And this should be really fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 130.798,
    "end": 133.678,
    "text": "So Sarah and Dean, thanks a lot for joining.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 133.758,
    "end": 145.78,
    "text": "Maybe if each of you would like to say hello and just what made you excited to participate today or what would be one kind of overall thought to to lead us in here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 148.521,
    "end": 149.101,
    "text": "Go, Sarah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.042,
    "end": 172.207,
    "text": " oh man the pressure okay i haven't been around for a while so like my brain is not fully dialed but um i i actually was just reviewing some michael uh michael levin videos and um oh boy my brain is about as exploded re-watching them as it was the first time so um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 175.294,
    "end": 194.712,
    "text": " you know like looking at life through like an agential point of view versus looking at it through this like homeostatic i'm just my brain cannot hold it all that's where i'm starting oh yeah my name's sarah by the way cool dean uh yeah hi uh i'm i'm dean",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.294,
    "end": 223.611,
    "text": " The reason why I wanted to do this is because when I was doing programming pre-retirement, one of the things I found to be really, really, really helpful was what we call the learning exhibition, where there was a timeline, a chronological review, and there was a lot of time given over in front of what we described as a significant audience to be able to give people a chance to take",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 224.534,
    "end": 239.173,
    "text": " the entire breadth of what they've done and sort of go through it themselves and pick out the highlights and then a lot of light bulbs went off in the learner's mind and so for me even though I haven't been participating throughout this year I've only",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 240.477,
    "end": 250.622,
    "text": " been about maybe 30 to 40% of the live streams, I still find that review process to be really, really helpful in terms of getting me some sense of where I am.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 250.642,
    "end": 257.725,
    "text": "Because as we said in the, I think it was the 34 paper, yes, I think it was the 34 paper, it matters where you came from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 258.266,
    "end": 264.829,
    "text": "So this gives me a chance to kind of look at that and give myself some sense of where the directions are going next.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 266.36,
    "end": 266.64,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 267.281,
    "end": 269.965,
    "text": "Yeah, we don't have any papers at all selected for 22.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.006,
    "end": 273.972,
    "text": "So it'll be like a fun, fresh start.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 275.509,
    "end": 297.671,
    "text": " yeah for each of the papers well first we're gonna go just look at the videos that are not paper live streams and just see if any we wanted to recall uh but then for each of the papers we're gonna just talk about like what were our memories if we read the paper or if we went to the discussion or listened to it how did our perspective or generative model change from that discussion or the paper and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 298.755,
    "end": 306.38,
    "text": " And then third question, what ideas or themes happened in the paper that came up later or touched upon something we went into later?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 306.4,
    "end": 314.666,
    "text": "And then also the last question, how does the paper or the concepts in it or the claims change how you thought about something or did something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 316.187,
    "end": 322.651,
    "text": " So we'll start with just looking through the non-livestream videos.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.151,
    "end": 329.695,
    "text": "Either you can bring up one of these if you want to highlight one of these guest streams that you liked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 330.295,
    "end": 333.577,
    "text": "We had 13 guest streams or just total.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 333.757,
    "end": 336.399,
    "text": "We can both pass, but the guest streams are just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 337.299,
    "end": 360.338,
    "text": " uh research related to active inference and so we hosted a really global range in many different sectors of one-off guest streams from 13 different people and these are like always open if somebody wants to do one themselves or wants to recommend that somebody do one so uh do either of you want to highlight one of these streams",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 362.179,
    "end": 369.443,
    "text": " Danny, can you remind me, who is the gentleman from Australia that was talking about sort of the... Philip Garen's.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 370.324,
    "end": 371.024,
    "text": "Philip Garen's.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 371.404,
    "end": 371.785,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 372.365,
    "end": 375.267,
    "text": "Depersonalization and Cotard syndrome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.087,
    "end": 376.407,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 376.608,
    "end": 376.928,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 377.328,
    "end": 385.173,
    "text": "That one I found particularly interesting just because he brought up things that I wasn't even aware existed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 385.193,
    "end": 385.433,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 388.214,
    "end": 388.415,
    "text": "Sarah?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 388.835,
    "end": 389.075,
    "text": "Sarah?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.351,
    "end": 392.633,
    "text": " Okay, we're past, no worries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 393.194,
    "end": 393.394,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 394.416,
    "end": 398.401,
    "text": "We had the model streams, which are math and technical,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 399.898,
    "end": 421.987,
    "text": " walkthroughs or uh expositions so the first four 1.1 through four was ryan smith and christopher white that was awesome i mean it's like a 10-hour series so it's kind of a fun course there and then a few others so these were really fun and we hope to have more of those and then the last category was the org stream we had one of those with richard barlett",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 422.947,
    "end": 442.95,
    "text": " about any kind of organization and then we had three math streams sarah we had great times in math streams i think it was maybe even your idea to do the first one so it was different for me yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.632,
    "end": 443.772,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 444.313,
    "end": 444.853,
    "text": "Fun times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.434,
    "end": 449.097,
    "text": "So we're here to talk about really the live stream series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.317,
    "end": 454.242,
    "text": "And so in the live stream series, we met once per week, basically every week.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 455.223,
    "end": 458.646,
    "text": "And we spent about two weeks per paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.006,
    "end": 462.89,
    "text": "So a dot zero video would happen at some point before live.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 464.519,
    "end": 467.04,
    "text": " the dot one, and that was background and context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 467.58,
    "end": 473.762,
    "text": "And then at the regular weekly times, we had a dot one and a dot two, which were group participatory discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 474.522,
    "end": 477.143,
    "text": "Sometimes the authors joined, other times the authors didn't join.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.723,
    "end": 484.104,
    "text": "And we had a few dot threes or higher where we really made an extended series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 484.745,
    "end": 485.945,
    "text": "And this allowed us to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 487.776,
    "end": 490.077,
    "text": " have a lot of time to go into different ideas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 490.157,
    "end": 493.699,
    "text": "So again, today we'll just kind of take one favorite meme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 493.919,
    "end": 508.025,
    "text": "This is like the haiku form of the papers, but it's just awesome how many perspectives people brought and the papers that we got to read and just exploring it as a new format.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 508.105,
    "end": 510.226,
    "text": "So cool times there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 510.306,
    "end": 513.748,
    "text": "Any other comments before we jump into the marathon?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 516.334,
    "end": 518.235,
    "text": " Just one quick one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 518.315,
    "end": 528.357,
    "text": "In the previous slide, I really like Richard Bartlett's coming in and the idea of that work stream, because I think he really wasn't sure what we were on about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 528.597,
    "end": 531.738,
    "text": "And I think we brought a lot of things to his attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 531.938,
    "end": 537.42,
    "text": "That felt like a very reciprocal conversation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 537.5,
    "end": 540.581,
    "text": "And the other thing is, when we had the 012 and when we had authors with us,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 546.192,
    "end": 561.54,
    "text": " I think, I can't speak for them, but I think that, again, when we had those kind of interactions with people and they got a sense that they weren't just sort of writing to the clouds, but they were writing to real people who were really wanting to have a real conversation with them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 562.06,
    "end": 570.404,
    "text": "I thought that was, as the year went on, I think maybe we're gaining a little bit of a reputation for, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 571.829,
    "end": 580.48,
    "text": " sort of making these things a little bit more available and a little bit more interesting because we can have a conversation about it, not just leave it in the script.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 582.844,
    "end": 583.164,
    "text": "I agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 583.905,
    "end": 584.886,
    "text": "That'd be awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 584.946,
    "end": 587.089,
    "text": "Anyone who wants to come on and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 588.137,
    "end": 591.361,
    "text": " visit or discuss their paper or share their perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 591.442,
    "end": 594.726,
    "text": "So we're going to jump in to the papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 595.207,
    "end": 600.774,
    "text": "So either of you or anyone in the live chat, just totally feel free to just",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 603.283,
    "end": 629.327,
    "text": " ask a question or to give an observation and all of the papers if you want to follow along then go to the coda which i'll put into the youtube live chat again at the coda you'll see the link to all the papers but also we'll have each paper will be seen with um like the title and the authors okay so here we go rewind your clock spin your",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 630.603,
    "end": 654.221,
    "text": " arrows of entropy and time it's now january 2021 early yonder and we started with the paper in 13 integrating cybernetic big five theory with the free energy principle a new strategy for modeling personalities as complex systems and that was by adam saffron and colin de young",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 655.273,
    "end": 665.173,
    "text": " So the aims and the claims of the paper were essentially connecting FEP, Free Energy Principle, and AI, Active Inference, with another",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 666.351,
    "end": 667.372,
    "text": " on a clade of theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 667.972,
    "end": 676.378,
    "text": "And that was the fusion of cybernetics, the goal-directed systems, and Big Five, like the psychological descriptive features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 676.738,
    "end": 687.905,
    "text": "So CB5T had already integrated cybernetics with Big Five by seeing the Big Five axes of trait variation as being part of cybernetic systems rather than some other kind of system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 688.646,
    "end": 694.71,
    "text": "And then this paper extended that into the free energy principle and ACDIMF domain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 696.301,
    "end": 707.982,
    "text": " and just to show one figure which or table which we'll do from each paper this was table one and it just makes a very uh clear laying out of the correspondences between the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 710.362,
    "end": 736.634,
    "text": " traits and the terms that are used in cb5t and then the the terminology and the ontology of active inference and how those terms exist so it was a fun beginning of the year because it had to do with personality dynamics and about the connections of domain specific and domain general fields and how active inference could play a role in all of them so either of you want to add a thought on this paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 740.208,
    "end": 741.596,
    "text": " Okay, so that was paper 13.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 744.468,
    "end": 770.351,
    "text": " paper 14 was the math is not the territory navigating the free energy principle by mel andrews so this was a single author philosophy paper so a very different format than some of the ones that we read other times in the year and this paper um does an awesome job with the memetics of the title but it really makes awesome historical contributions",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 771.616,
    "end": 784.655,
    "text": " and also there was latter versions of this paper that were updated after our discussions and through other interactions in the community and also other works by mel so just like many things it's kind of part of a bigger",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.734,
    "end": 808.715,
    "text": " picture but here the project is to trace out the historical and the philosophical threads that constitute free energy principle and active inference and so it's kind of interesting because i know these terms will come up in later papers thinking about for example the helmholtz decomposition of a gradient field into a solenoidal curl component",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 809.505,
    "end": 811.286,
    "text": " and an irritational divergent component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 811.947,
    "end": 823.035,
    "text": "So this idea came up in the historical antecedents and the philosophical threads that play into the free energy principle, but it was being approached from a philosophy perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 823.595,
    "end": 825.037,
    "text": "So it was a fun discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 825.177,
    "end": 830.18,
    "text": "We talked about the history and philosophy of FEP, about what is science,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 831.381,
    "end": 860.03,
    "text": " and about how does the work of scientists and discourse with that of philosophers so it's a fun paper any comments on this paper i got a question for you daniel can you give me a spoiler alert did you resolve the second bullet on slide on this slide here and when you guys were discussing this this one certainly not like anything like a theory a law a hypothesis or a research program yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.507,
    "end": 862.927,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 863.388,
    "end": 870.693,
    "text": "So I think, I forget the terminology of the paper, but it's like target models versus targetless models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 871.954,
    "end": 884.502,
    "text": "And there was some discussion about how it's a source of hypotheses in a different way than research programs of the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 886.223,
    "end": 888.905,
    "text": "And yeah, it was a cool paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 890.831,
    "end": 900.733,
    "text": " Kind of feels like the only thing my brain can retain about that was that it was like free energy principle is like an API and how you apply it is how you apply it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 903.493,
    "end": 903.793,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 904.194,
    "end": 908.934,
    "text": "I think this introduced a lot of like the API isn't the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 909.054,
    "end": 911.735,
    "text": "It's an interface agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 911.995,
    "end": 917.076,
    "text": "And for other domains, how do philosophers interact with this object, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 917.574,
    "end": 922.057,
    "text": " What is their intellectual API for all of this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 922.077,
    "end": 923.478,
    "text": "What does API stand for?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 924.538,
    "end": 925.979,
    "text": "It's a programmatic interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 926.64,
    "end": 928.641,
    "text": "Application protocol.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 928.661,
    "end": 929.842,
    "text": "Yeah, something like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 929.862,
    "end": 930.162,
    "text": "I don't know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 930.342,
    "end": 930.542,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.902,
    "end": 933.304,
    "text": "Let's look it up because that's... Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.624,
    "end": 935.005,
    "text": "Application programming interface.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 935.425,
    "end": 939.868,
    "text": "It calls so you can call a certain function from a different program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 939.888,
    "end": 940.889,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 942.682,
    "end": 944.063,
    "text": " Okay, so 14.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.684,
    "end": 949.009,
    "text": "We've moved from personality to history and philosophy of thermodynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 950.63,
    "end": 961.721,
    "text": "We then had a very important discussion in 15 with Free Energy Principle, Computationalism, and Realism, a Tragedy by Thomas Van Ness and N.S.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.761,
    "end": 962.242,
    "text": "Hippolito.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 963.583,
    "end": 964.424,
    "text": "So this paper...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 965.529,
    "end": 971.231,
    "text": " differentiated what they called a realist approach and an instrumentalist approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 972.011,
    "end": 984.754,
    "text": "And it's actually amazing that these terms came into play and heard from stage left very early in the year, but it was a theme that certainly came out again and again during the year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 986.275,
    "end": 990.476,
    "text": "And to get to their figure, here's their conclusion of their paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 992.028,
    "end": 1001.057,
    "text": " In this paper, we have defended the instrumentalist take on the FEP, arguing that the realist approach is a non-starter regardless of whether it is representationalist or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1001.877,
    "end": 1009.685,
    "text": "So they kind of make this two by two, which is in a table in their paper, but we illustrated it as a quadrants here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1010.465,
    "end": 1013.508,
    "text": "And so the left to right is realist versus instrumentalist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1014.289,
    "end": 1022.713,
    "text": " Like, we're really talking about the real state of the system versus we're using a statistical instrument to measure and model systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.633,
    "end": 1030.216,
    "text": "And then there's an orthogonal axis with representation and non-representation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1030.976,
    "end": 1039.86,
    "text": "And this paper comes out ambiguous or neutral or system-specific on the representation axis, but it...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1043.086,
    "end": 1049.291,
    "text": " disfavors the realist side and says that the instrumentalist side is going to be possibly very productive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1049.751,
    "end": 1063.581,
    "text": "So, in other words, some of the claims that the FEP and ACT-INF make might be consistent with us using them as statistical instruments or models, but not necessarily describing, quote, real features of the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1064.702,
    "end": 1067.463,
    "text": " So that was definitely a theme that came up again and again in the year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1068.383,
    "end": 1070.143,
    "text": "And one of your favorite themes too, Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1071.503,
    "end": 1071.723,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1072.524,
    "end": 1073.164,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1073.364,
    "end": 1077.345,
    "text": "So again, I'm going to go back and look at this one because I didn't know that you'd done this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1079.185,
    "end": 1089.907,
    "text": "But so question for you, when they talked about realism, are they saying that, what are they saying there?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1090.627,
    "end": 1092.988,
    "text": "How are they describing what is real?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1095.58,
    "end": 1099.761,
    "text": " I think the realism in instrumentalism was in respect to the term generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.482,
    "end": 1106.224,
    "text": "So the generative model is literally implemented by a human brain to calculate the potential states of the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1107.044,
    "end": 1118.368,
    "text": "So that's kind of like brains are doing active inference or brains are doing predictive processing versus it could be just a insightful statistical description",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1119.747,
    "end": 1123.748,
    "text": " that doesn't need to be the same as the basis of the underlying process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1124.468,
    "end": 1129.79,
    "text": "So like you could use a linear regression on brain data without the claim that that's what the brain is really doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1129.85,
    "end": 1131.63,
    "text": "It's not really doing linear regressions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1131.95,
    "end": 1133.511,
    "text": "It's just that we use that statistically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1134.111,
    "end": 1141.313,
    "text": "So when we use an active inference model to describe data, is that what the system is really doing, realism?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1141.973,
    "end": 1144.854,
    "text": "Or is it just a clever statistical tool that we're applying?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1145.174,
    "end": 1146.094,
    "text": "And that's instrumentalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1147.005,
    "end": 1150.327,
    "text": " So can I ask you one more quick question, because I know we've got a lot of papers to go through here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1150.947,
    "end": 1152.808,
    "text": "Have you seen the movie Sully?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1153.648,
    "end": 1153.829,
    "text": "No.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1154.749,
    "end": 1169.777,
    "text": "Okay, well, if Sullenberg had to land the plane on the Hudson River, and he had to make a calculation when the bird strike hit, so how would these authors view his calculation in terms of picking a place where he had to land?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1169.817,
    "end": 1170.998,
    "text": "Would they say that that was...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1172.28,
    "end": 1180.125,
    "text": " Because he was using instruments, and he did land, didn't land in New Jersey, and he didn't land back in LaGuardia.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1180.185,
    "end": 1186.169,
    "text": "So how would, how do you think they would, how would they play that scenario out in terms of their argument in this paper?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1187.751,
    "end": 1196.395,
    "text": " So the idea of using instruments, it's related to extended cognition and humans using technology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1197.395,
    "end": 1201.577,
    "text": "And instrumentalism can still be approached when there's real lives on the line.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1202.598,
    "end": 1215.744,
    "text": "So let's just imagine that the pilot was using some sort of heuristic and some sort of back-of-the-envelope calculation based upon a falling parabola.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.685,
    "end": 1231.241,
    "text": " That's instrumentalism because it's being used just as an insightful statistical description rather than necessarily a description of the system itself, which is like realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1232.816,
    "end": 1234.958,
    "text": " So maybe I need to see the movie though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.418,
    "end": 1236.399,
    "text": "Yeah, no, you should.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1236.419,
    "end": 1244.144,
    "text": "A, it's a great movie, and B, I actually used it in my program because I actually thought that it was some combination of the two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1244.764,
    "end": 1249.768,
    "text": "There's the real situation, and then there's the instruments that tell you how far you can go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1250.188,
    "end": 1251.029,
    "text": "So I'm just curious.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1251.069,
    "end": 1252.39,
    "text": "I'm going to go back and look at the paper now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1253.097,
    "end": 1257.56,
    "text": " Briston and others, I believe, have called that kind of a structural realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1258.121,
    "end": 1263.664,
    "text": "Like there's not a denialism that there is statistical regularities in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1264.825,
    "end": 1267.547,
    "text": "So it's not like a sort of pan-denialism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.168,
    "end": 1276.533,
    "text": "It's just a qualified recognition that we're only going to be able to use observations and we're not going to be able to map hidden states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1277.134,
    "end": 1282.418,
    "text": "And there might be special cases where we can, but we need to prepare for the situations where we can't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.359,
    "end": 1290.621,
    "text": " And in the chat, in respect to Sully, Sid wrote, his decision was mostly intuitive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1291.242,
    "end": 1295.764,
    "text": "Instrumentalism over years of internalization is indistinguishable from realism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1298.265,
    "end": 1299.145,
    "text": "Very wise by Sid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1299.225,
    "end": 1299.726,
    "text": "So let's go to 16.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1302.253,
    "end": 1319.272,
    "text": " 16 we switch gears to um wanja visa and carl friston's paper and wanja joined us in these discussions on the neural correlates of consciousness under the free energy principle from computational correlates to computational explanation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1320.493,
    "end": 1339.622,
    "text": " so this was another example it's kind of like 13 of taking a topic that's an important debate or an ongoing area of development in some area like personality sciences or neuroscience here and then see what can be gleaned or added by fusing it with fep",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1340.902,
    "end": 1359.554,
    "text": " so the neural correlates of consciousness is people looking at how different anatomical and functional and informational aspects of systems are associated with their capacity for awareness and it's a a big area we kind of reviewed a few different ideas about it in the videos",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1361.758,
    "end": 1383.468,
    "text": " To summarize up the argument and the contribution of this paper, they wrote, in short, it may be more useful to consider the system from the point of view of the extrinsic information geometry probabilities encoded by internal states than from the point of view of the intrinsic information geometry, the probabilities of internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1384.488,
    "end": 1387.61,
    "text": "So we talked about what that meant and what the implications were.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1388.777,
    "end": 1399.042,
    "text": " about whether the systems with conscious awareness were those that had potentially some kind of informational signature in how they worked.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1399.562,
    "end": 1404.465,
    "text": "Like a slot machine, there's going to be some sort of statistical description of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1405.145,
    "end": 1411.808,
    "text": "And is there something that might differentiate a slot machine's actions from a human pretending to be a slot machine?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1413.029,
    "end": 1413.469,
    "text": "Are we just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1415.191,
    "end": 1444.046,
    "text": " in a world where we can never tell or might there be some sort of way that with the right statistical analyses there'd be some feature and of course that um leads us to questions like what is alive what is awareness what is Consciousness suffice to say they were unanswered but we had really cool discussions and explored how a few different formalisms from active and FEP could play into this basically eternal discussion so any thoughts about this paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1450.349,
    "end": 1465.639,
    "text": " Okay, 17, we stayed in the kind of trippy and interesting science domain with the paper of Fields and Glazebrook called Information Flow in Context Dependent Hierarchical Bayesian Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1467.06,
    "end": 1473.004,
    "text": "So Chris Fields came on for 17.1 and it was really a memorable discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1473.084,
    "end": 1475.945,
    "text": "And 17 was also where we met Shauna Dobson,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1477.022,
    "end": 1478.182,
    "text": " Chris Fields, his collaborator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1479.143,
    "end": 1494.067,
    "text": "And this paper was really using active inference more in the discussion as sort of like a concordance or a harmony and less of a fundamental building block of the paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1495.268,
    "end": 1504.551,
    "text": "And they, in this paper, used the concepts of quantum contextuality and category theory and Bayesian inference",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1506.107,
    "end": 1512.67,
    "text": " to put them all together into a new way of modeling systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1513.15,
    "end": 1525.195,
    "text": "It doesn't look like I pulled out a second image for this one, but they had the cones and the co-cones, and it was all about frames and meaning and semantic flow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1525.535,
    "end": 1528.817,
    "text": "And it was just a very interesting discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.617,
    "end": 1531.598,
    "text": "Any memories from those discussions?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1531.638,
    "end": 1532.058,
    "text": "Yeah, Sarah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1533.325,
    "end": 1543.571,
    "text": " Yeah, this was the first time, and this was in my first year of this graduate program that I'm in, philosophy of science, where I learned about the frame problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1544.392,
    "end": 1550.356,
    "text": "And it's really like, it's like once you see it, you cannot unsee it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1550.696,
    "end": 1555.178,
    "text": "And now it's like, I see that constraint in everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1555.359,
    "end": 1561.542,
    "text": "And I'm not sure if I'm thankful or if I hate him for bringing that up because it's like, it's terrible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.602,
    "end": 1562.223,
    "text": "It's a tyranny.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.81,
    "end": 1591.89,
    "text": " what if you like were to summarize the frame problem or why it matters or how it relates to acting what would you say um i mean really kind of a layman way of putting it but it just you it's like contextuality you can only get so much information you like with a particular perspective you only the information versus context ratio in some sense is fixed is how it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1592.938,
    "end": 1620.875,
    "text": " kind of like a woo-woo way of putting it but um you know and i think about it even with the paper we'll cover later um like 11th problem like you can slice the problem on the time axis or the state space axis or like but you you're always slicing it you can never get the full picture is what it feels like dean what does that make you think well i i walked in out of the wilderness on this paper this was my first encounter with with you folk and uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1623.186,
    "end": 1629.566,
    "text": " I'm still putting my head back together because my head blew up and I pick up all the pieces and reconstruct it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1631.42,
    "end": 1634.701,
    "text": " So again, I always try to bring it back to the simplest examples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1634.761,
    "end": 1636.502,
    "text": "And I agree with Sarah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1636.722,
    "end": 1641.564,
    "text": "For me, this speaks to why there's such a thing as change blindness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1642.144,
    "end": 1648.087,
    "text": "Like why you can't count the passes, the basketball passes and see the dancing bear at the same time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1648.627,
    "end": 1652.568,
    "text": "But no matter how much you try to take in, there are upper and lower limits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1653.409,
    "end": 1658.471,
    "text": "And this just, as soon as I saw this, I was like, oh my goodness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1660.14,
    "end": 1661.501,
    "text": " Sarah said, you can't unsee it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1661.521,
    "end": 1669.706,
    "text": "I was just like, well, I don't know if you're going to be a slide here with the moth to the flame, but I just flew right into the flame at this point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1669.766,
    "end": 1670.746,
    "text": "That was it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1670.786,
    "end": 1671.307,
    "text": "It was over.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1671.387,
    "end": 1677.15,
    "text": "Cause I was, I didn't realize that people were talking about this stuff and it was really cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1678.07,
    "end": 1681.452,
    "text": "I just pulled one of the slides just so we can kind of recall that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1682.313,
    "end": 1686.135,
    "text": "So it was like about these graphical images.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1687.456,
    "end": 1688.817,
    "text": "And then there was the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.327,
    "end": 1694.768,
    "text": " It's kind of like a way of looking at programs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1695.089,
    "end": 1700.412,
    "text": "It's a structure that represents programs, but also other things, too, with the two spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1700.472,
    "end": 1701.912,
    "text": "Now it's a whole discussion, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1701.932,
    "end": 1702.873,
    "text": "Like, what is the scope?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1702.913,
    "end": 1704.454,
    "text": "What kind of systems are we talking about here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1705.114,
    "end": 1708.816,
    "text": "And then there's like the sort of coherent system in a given perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1709.617,
    "end": 1713.879,
    "text": "And then there's the case where like two perspectives are looking at a given structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1714.338,
    "end": 1743.464,
    "text": " set of classifiers the a sub letters and so that could be like the person at one point and the same person at a future time point but like if the memory is in a different frame and it doesn't have the same semantics then like the memory changed but if memory does have the same semantics there was some invariance so then what is the structure of that invariance and then this isn't the math review stream but with shauna dobson this is where we were going the whole time crystal diamond",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.679,
    "end": 1773.825,
    "text": " infinity perfection diamond sheath um area which was like i was just like glad to have heard it from i hope that we can like fill in some of the structure underneath that as individuals and as a group to better approach those ideas because they were interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1775.842,
    "end": 1778.444,
    "text": " Okay, so on to 18.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1778.484,
    "end": 1790.993,
    "text": "All right, so 18, we met back up with Christopher and Ryan who had done the model stream one, four part model stream on the step-by-step",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1792.804,
    "end": 1815.164,
    "text": " guide to active inference and here they joined us for more of a research discussion on their paper the predictive global neuronal workspace a formal active inference model of visual consciousness so this was fun because it was uh some colleagues that we knew christopher and ryan and they kind of knew how we operated a little bit and then we were talking about consciousness",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1816.274,
    "end": 1819.975,
    "text": " but in a very operational or instrumental way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1820.515,
    "end": 1830.438,
    "text": "Whereas the previous VISA and Friston paper was much more about like the metaphysics of consciousness, even though that was also being approached in somewhat of an operational way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1831.238,
    "end": 1833.219,
    "text": "But this paper was very much focused on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1834.469,
    "end": 1853.74,
    "text": " neurophysiological observables and the specific access consciousness which is specifically just the parts of consciousness that we can report on and then they kind of like paper 13 took a big idea in neuroscience which is the global neuronal workspace the gnw model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1854.62,
    "end": 1866.289,
    "text": " And the predictive anticipatory, predictive processing paradigms kind of took the fusion previously of those two ideas, like cybernetic big five, and then combined that with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.869,
    "end": 1879.699,
    "text": "So we're kind of like seeing some scaffold structures, Madlib structures by which people are contributing to active inference research and also staying integrated or bridging with other fields.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1881.423,
    "end": 1888.587,
    "text": " And one of the figures that really summed up this paper was figure three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.127,
    "end": 1895.931,
    "text": "This is a Bayesian network description of the generative model with arrows showing the dependencies between the hidden state factors and outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.832,
    "end": 1900.794,
    "text": "So each one of these nodes is like a variable of different types.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1901.935,
    "end": 1907.018,
    "text": "So the level one outcomes are visual on the left side,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1908.021,
    "end": 1911.943,
    "text": " And then on the right side, there are things that you say, verbal report.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1912.863,
    "end": 1916.645,
    "text": "I see a square or I didn't see anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1917.445,
    "end": 1922.588,
    "text": "It's kind of like a linguistic state machine for action and then like a visual state machine for input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1923.608,
    "end": 1930.372,
    "text": "And then there's this attention modulating precision about how the visual level one outcomes",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1931.371,
    "end": 1955.682,
    "text": " get mapped through that a matrix to the level two outcomes and so the sense states of level two the outcomes are the hidden factors relative to level one so that's like very much the kind of hierarchical bayesian modeling that we've been talking a ton about and then this is like the inference combining the level two factors as well as information about the trial number",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1956.562,
    "end": 1967.631,
    "text": " And then that is what kind of allows the model to swing back from sensing like a square and red, and then making inference on it being like a red square or whatever it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1968.372,
    "end": 1973.876,
    "text": "And then that arcing back into the inference on linguistic structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1975.398,
    "end": 1981.923,
    "text": "So it was a very integrative paper and a cool paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1983.362,
    "end": 2006.332,
    "text": " topics that we had brought up even already like consciousness and visual awareness and using specific models to test hypotheses and make unique predictions and experiences so any thoughts on that i think what i took away from this was because this was the second paper that i",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2007.281,
    "end": 2024.932,
    "text": " participated in, and I realized very quickly that in order to be able to get some traction and be able to show how things are working, there were really, really, really, really small windows that the researchers were looking at it over really short, relatively really short timeframes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2025.533,
    "end": 2027.054,
    "text": "Otherwise, you don't get any traction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2027.634,
    "end": 2033.738,
    "text": "So I quickly understood that if you're going to",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2035.974,
    "end": 2061.978,
    "text": " going to be able to do something with this you have to take it one piece of the puzzle at a time you can't take all thousand pieces at once um if you if you want to be able to say something that you can actually defend otherwise you're you're you're inferring instead of being able to show the empirical evidence yeah it's almost like yeah you can infer you can predict you can even look 20 miles ahead but you got to take one step at a time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2063.447,
    "end": 2070.509,
    "text": " with your body and that can be like slow and painful because it's easy for your mind to race out way in front.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2071.309,
    "end": 2075.57,
    "text": "Oh, I could have been here already if only this had happened or I can imagine myself at the top of the mountain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.03,
    "end": 2077.671,
    "text": "Yeah, but you got to act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.071,
    "end": 2083.692,
    "text": "And so this was sort of the kind of work that we love to see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2084.633,
    "end": 2089.054,
    "text": "So paper 19, this was",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.114,
    "end": 2109.706,
    "text": " deeply felt affect the emergence of valence in deep active inference by casper hesp smith parr alan friston and ramsted so 2021 paper and this was kind of like fun because we were just discussing papers weeks after they were published like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.882,
    "end": 2129.754,
    "text": " fun to just be in the loop at that speed and i kind of remember that for this paper because it um combined a few different things that people had said about active inference for a long time which was first off it can deal with affect and anxiety and metacognition and the second one that um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2130.805,
    "end": 2132.566,
    "text": " there could be a deep temporal planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2133.187,
    "end": 2146.036,
    "text": "So not just instantaneous gradient minimization, like moving your eyes to the dimmest or most uncertain part of the image, but like moving to the part of the image that wasn't the most uncertain now, but was predicted to be the most uncertain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2146.456,
    "end": 2149.098,
    "text": "That is what is called temporally deep active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2150.239,
    "end": 2151.98,
    "text": "And this paper did that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2152.56,
    "end": 2158.365,
    "text": "They had some beautiful images and they specified",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.585,
    "end": 2174.728,
    "text": " and encoded generative models for affective, where anxiety was an affect, active inference, where this beta and the gamma are like the precision and the inverse of that, which is like the ambiguity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2175.069,
    "end": 2177.009,
    "text": "They're like kind of one over each other, beta and gamma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2177.489,
    "end": 2180.93,
    "text": "So whether it's high precision or low ambiguity or vice versa,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2182.338,
    "end": 2192.722,
    "text": " how that uncertainty variable plays into the free energy minimization given C, the preferences and E, the affordances on Pi policy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2193.962,
    "end": 2197.383,
    "text": "And that's what allowed the organism to do these temporal rollouts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2198.464,
    "end": 2203.766,
    "text": "So it's like at time point one, it was doing prediction on time point one, two and three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2204.446,
    "end": 2207.267,
    "text": "At time point two, it was still doing it on one, two and three.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2208.416,
    "end": 2218.065,
    "text": " And that could be either it like doing kind of retradiction or it could just be doing some time horizon of forward looking or some combination thereof.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2218.725,
    "end": 2221.728,
    "text": "But they showed some really provocative patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2222.429,
    "end": 2234.199,
    "text": "Like when there's a deep temporal rollout with a high variance and possibilities, like things could go like 90% of the time go well, 5% of the time they're amazing and 5% of the time they're just like deathly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2235.14,
    "end": 2241.125,
    "text": " that can lead to anxiety because every path will have some lethal possibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2241.685,
    "end": 2242.986,
    "text": "But that's like walking in a city.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2243.507,
    "end": 2247.85,
    "text": "Like you can't do the every possible rollout.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2248.531,
    "end": 2258.559,
    "text": "And so that's a theme that came up, which was when we're applying active inference, how do we do principled rollouts so that we can do computation that's effective",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2259.813,
    "end": 2268.439,
    "text": " whether that's because we're more on the affect management side or whether because we're on the computational efficiency angle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2268.819,
    "end": 2272.762,
    "text": "In either case, having adequate rollouts is really important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2274.123,
    "end": 2275.384,
    "text": "So it was a cool Pape.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.045,
    "end": 2277.746,
    "text": "Dean or Sarah, any thoughts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2280.543,
    "end": 2281.164,
    "text": " I got a quick one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2281.184,
    "end": 2295.132,
    "text": "I think where this was really interesting for me is that even though things were laid out in a step-by-step, like a step-word way in order to be able to explain what Casper and the other authors were looking at, it introduced the idea that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2296.184,
    "end": 2301.107,
    "text": " as you mentioned already, Daniel, that there was availability factor as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2302.148,
    "end": 2311.453,
    "text": "Feelings determine what you made yourself available for, not just how precise or how much attention you could give over to something.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2312.25,
    "end": 2329.719,
    "text": " So although the way that they showed the model was step, step, step sequentially, the affect piece of it said, so what, even if you're present, and even if you're counting out the number of time steps, what else is going on here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2329.739,
    "end": 2334.301,
    "text": "And talking with Casper about that was, I thought, quite enlightening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2334.902,
    "end": 2335.142,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2336.703,
    "end": 2337.323,
    "text": "Awesome discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2339.167,
    "end": 2350.817,
    "text": " So paper 20, we discussed The Emperor's New Markov Blanket by Jelle Brunberg and Christoph DeLega and Joe Dewhurst and Manuel Baltieri.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2351.797,
    "end": 2353.559,
    "text": "So this paper was cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2353.739,
    "end": 2365.769,
    "text": "It was on our Markov Blanket theme, as well as our qualified criticism and improvements of ACT-INF and FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2367.813,
    "end": 2370.014,
    "text": " This paper did two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2370.134,
    "end": 2381.077,
    "text": "As they lay out, they also did something similar to paper 14, Andrew's paper, with a bit of a history of science recap of kind of how we got here, which came up in Axel's paper, 34.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2381.617,
    "end": 2385.918,
    "text": "But this is more of a philosopher's how we got here history story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2386.818,
    "end": 2395.861,
    "text": "And they traced the development of Markov blankets from Bayesian statistics through to where they got to where they are in active inference, even though the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2396.761,
    "end": 2407.754,
    "text": " actual citation history i believe well much more will be learnt that we know at this point and then they talk about the philosophical implications of different",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2408.823,
    "end": 2411.324,
    "text": " perspectives on what Markov's blankets are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2411.864,
    "end": 2427.327,
    "text": "So they conclude, either you stick to the original innocuous but metaphysically uninteresting formulation of blankets, or it's bolstered with novel metaphysical and probably also perception and control theoretic premises.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2428.607,
    "end": 2432.628,
    "text": "As we saw, some of those premises were indeed fulfilled in 2021 with paper 26 and paper 32.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2437.811,
    "end": 2453.257,
    "text": " some but not all of the criticisms are still really important though and we talked about the um distinctions between like a generative process the actual causal structure of the environment that gives rise to observations like that's the actual ecosystem where it's raining",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2454.397,
    "end": 2461.122,
    "text": " Then there's the generative model, which is the agent's generative model of that ecosystem, for example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.083,
    "end": 2472.851,
    "text": "And then also the difference between a posterior density and a variational or recognition density, which we're not gonna go into, but this plays into the difference between using inference with a model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2474.141,
    "end": 2475.903,
    "text": " versus within a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2476.843,
    "end": 2488.574,
    "text": "So like the scientist is applying the linear regression that's doing inference with a model, but then like the universe that they're in, if you're thinking of that, it like is the model itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2488.634,
    "end": 2491.637,
    "text": "So it is also related to a little bit like realism and instrumentalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2492.778,
    "end": 2499.944,
    "text": "So it was a great philosophical and important socio-historical critique paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2500.925,
    "end": 2507.869,
    "text": " Also Yele was the first person who I ever heard about FEP from him and Tobias in the summer of 2015.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2507.909,
    "end": 2520.656,
    "text": "So that's kind of cool that he was able to join and that we were able to reconnect and that he's still working on those topics and sharing his important perspective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2523.677,
    "end": 2524.378,
    "text": "Any comments on this one?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2525.41,
    "end": 2536.842,
    "text": " Yeah, so the with and the within part is really interesting because if you inference with, that kind of lends itself to the traditional sort of academic perspective of a framework.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2537.283,
    "end": 2545.551,
    "text": "But if you're within a model and you're trying to see yourself not just within the sort of your...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2547.455,
    "end": 2552.32,
    "text": " your focal limits, but knowing that you're embedded, how that changes things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2552.7,
    "end": 2569.877,
    "text": "At the time that we took this paper up, I wasn't really paying much attention to this, maybe because I already kind of was thinking of active inference in both ways, being sort of inside and also framing something, so I was selecting out what I wanted to pay attention to, but...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2570.788,
    "end": 2575.57,
    "text": " One of the things I will say about Yelly is I've read three of his other papers because we made them available.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2576.351,
    "end": 2580.073,
    "text": "And not just a prolific author, but brings up really good ideas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2581.694,
    "end": 2581.974,
    "text": "Agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2582.974,
    "end": 2584.595,
    "text": "So on to 21.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.435,
    "end": 2588.257,
    "text": "So 21, this was a fun series.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2588.317,
    "end": 2589.518,
    "text": "This was with John Boyk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2590.258,
    "end": 2593.56,
    "text": "So John Boyk, who will be like a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2594.645,
    "end": 2616.048,
    "text": " active lab advisory board member in 2022 and got more involved in the dot tools organizational unit and like really contributed a lot like it was awesome just to get involved with him this way so he had written a three-part science-driven societal transformation series it's really like a three-part small book but in these three papers",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.149,
    "end": 2623.611,
    "text": " And they talk about applying active inference across multiple scales and socio-technical structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2624.371,
    "end": 2635.254,
    "text": "And I picked out this slide because this one, instead of a regular dot zero, where like a few of us will kind of collaborate and do just a quick run through of the paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2637.287,
    "end": 2639.688,
    "text": " he and I did a four part dot zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.808,
    "end": 2658.192,
    "text": "It was dot zero one zero two zero three zero four with this long jam board sequence where he really broke down the whole paper and we walked through the whole jam board and just did a really long lead up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2659.872,
    "end": 2659.972,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2662.25,
    "end": 2677.443,
    "text": " he talked about social transformation and about how active inference plays a role in that in multiple different capacities from the integrated systems modeling to how we think about social systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2678.043,
    "end": 2686.03,
    "text": "I don't even think we can go into the sub details, but also it was cool because it was like a work in progress.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.319,
    "end": 2692.425,
    "text": " as any proposed R&D slash transformation platform would have it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2693.205,
    "end": 2699.432,
    "text": "So this was a fun discussion with John Boyk, and it's cool that we got to work with him a lot this year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2702.515,
    "end": 2702.936,
    "text": "Any comments?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2704.958,
    "end": 2705.038,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2705.058,
    "end": 2705.919,
    "text": "Wasn't part of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2706.44,
    "end": 2706.52,
    "text": "No.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2707.182,
    "end": 2708.503,
    "text": " That was fun though.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2709.064,
    "end": 2710.025,
    "text": "Okay, so 22.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2711.366,
    "end": 2714.689,
    "text": "I think I remember, if not both of you, then certainly you were there, Dean.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2715.029,
    "end": 2723.157,
    "text": "So 22 was with Alex Kiefer's single author paper from 2020 called Psychophysical Identity and Free Energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2725.259,
    "end": 2729.043,
    "text": "So this paper had a target thesis that biological systems...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.834,
    "end": 2738.579,
    "text": " are those whose internal states come to encode statistical models as a result of spontaneous self-organization in response to environmental pressures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2739.92,
    "end": 2744.643,
    "text": "So that kind of like adaptive self-organization, it's not a FEP only take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.284,
    "end": 2759.934,
    "text": "However, this is where the real FEP hypothesis comes into play, which is that those systems learn and make use of their models by minimizing their physical free energies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.953,
    "end": 2766.114,
    "text": " So that brought us to a discussion about minimization of free energy and life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2767.174,
    "end": 2777.017,
    "text": "And so we talked about there's systems that are at equilibrium, and then there's systems that are sort of infernos, and then there's the controlled burns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2778.197,
    "end": 2782.958,
    "text": "And all of these systems are kind of playing the free energy minimization game.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2784.138,
    "end": 2787.659,
    "text": "So we talked about what kind of equilibrium",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2788.661,
    "end": 2812.243,
    "text": " is living versus non-living what is the boundary that we're looking for order or disorder to be shaped within what time scales phases temperatures metacognitive processes matter and alex was a very willing converse ant and um do either of you have any memories from this discussion",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2815.839,
    "end": 2839.106,
    "text": " other than the fact that he was bringing identity in, which I think sometimes we can focus in on the continuation aspect of it, where we can, what he brought up was how can we see identity playing along or playing nicely with the free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2842.233,
    "end": 2842.414,
    "text": " Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.436,
    "end": 2844.579,
    "text": "So is a good peep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2846.605,
    "end": 2873.553,
    "text": " right 23 so this is in kind of the middle of the year so this paper was a 2021 paper in synthese called embodied skillful performance where the action is by ines hippolito manuel balteri carl friston and maxwell ramstead so dean why don't you just describe the paper well no because that's it's not because you know as a parent you're not supposed to pick your favorite children oh but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2874.053,
    "end": 2876.075,
    "text": " But it's pretty obvious what my favorite was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2876.095,
    "end": 2880.9,
    "text": "So rather than be biased, I'll let you talk about it a bit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2881.261,
    "end": 2882.442,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.163,
    "end": 2884.664,
    "text": "I'll give the bad cop version.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.704,
    "end": 2887.768,
    "text": "No, it was a great, obvious paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.588,
    "end": 2890.33,
    "text": "Really brought a lot to the lab in the discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.37,
    "end": 2896.036,
    "text": "So what they did was they talked about control theory and several historical frameworks for control theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2897.068,
    "end": 2907.239,
    "text": " including what they called instructionism, the idea that motor commands are passed like kind of telegraph messages to the motor plant, which is kind of the operative physical actuator.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2908.48,
    "end": 2910.582,
    "text": "They also talked about theories of optimality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2910.642,
    "end": 2914.626,
    "text": "So that was kind of theories of information transmission and control.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2915.487,
    "end": 2919.792,
    "text": " And they tied that to theories of optimality, specifically like optomotor control theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2920.793,
    "end": 2928.602,
    "text": "They then contrasted those traditional or at least non-active inference models of control with active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2929.202,
    "end": 2933.227,
    "text": "And they argue that active inference does not need to posit the instructionist assumption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2934.457,
    "end": 2939.978,
    "text": " Rather, it can be interpreted as an interactionist account, which was something we went a lot into.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2941.099,
    "end": 2955.123,
    "text": "And just to dig one layer into detail before Dean would love to hear more, we talked about how active inference challenges optimal motor control theory and the way that it frames sensory motor behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.138,
    "end": 2971.155,
    "text": " And just one cool meme that I think stayed with us was traditional OMCT accounts of behavior can only specify performance using a single number, a scalar that is defined and consequently tracked by a value function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.856,
    "end": 2974.88,
    "text": "So here is the greedy hill climbing robot",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2975.641,
    "end": 2977.882,
    "text": " on the just trying to find out the gradient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2977.922,
    "end": 2985.906,
    "text": "But of course, if you just go up the gradient, then you get trapped in local maxima and how do you balance reward and learning and development?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2986.346,
    "end": 3000.172,
    "text": "And so yes, reinforcement learning, reward learning, they have all kinds of heuristics and totally functionable things that they do to get around some of those traps like local maxima and learning bias.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.813,
    "end": 3000.953,
    "text": "But",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3002.031,
    "end": 3025.704,
    "text": " What was very fascinating in this paper was to take an embodied, skillful, and cultured perspective and combine that with a different way of thinking of this surface, that landscape, and the agent doing inference on the landscape, thinking about it in terms of the irrotational curl-free component and the solenoidal divergence-free component, aka the Helmholtz decomposition,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3026.806,
    "end": 3043.7,
    "text": " And then thinking about what that decomposition meant and did in the context of this interactionism that active inference brings, rather than the instructionism, which is implicit and explicit in these optimization-driven optimal motor control theories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3043.72,
    "end": 3045.642,
    "text": "What do you think about that, Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3047.119,
    "end": 3057.002,
    "text": " Yeah, I can remember going back through the paper and just like cheering them on because I think that they laid out a really good argument.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3058.363,
    "end": 3070.827,
    "text": "At the end of the day, what this paper, for me, asked, without getting into sort of the technical parts of it, was how soon do you bring the material together",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3071.562,
    "end": 3073.423,
    "text": " into the interaction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3073.663,
    "end": 3084.205,
    "text": "So when I say the material, it's something pre-designed or something pre-formatted or already somewhat organized.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3084.825,
    "end": 3094.028,
    "text": "And even when we talked to Carl in June, and he was talking about the EDU aspects of active inference, there was still some question around",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3095.296,
    "end": 3106.584,
    "text": " Are there consequences for bringing plans forward too quickly in terms of what that means in terms of a cost if we are building a generative model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3107.545,
    "end": 3110.167,
    "text": "How does that affect things?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3110.988,
    "end": 3124.338,
    "text": "Are we helping people by making things in finger quotes simple or are we in some ways manipulating them instead of allowing them to be the manipulators of what's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3125.154,
    "end": 3126.056,
    "text": " what happens next.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3126.917,
    "end": 3136.413,
    "text": "So again, if the way that we, this year, or the parts that I participated in, which included a point zero and a point one and a point two,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3137.808,
    "end": 3145.636,
    "text": " emphasized the part of interaction as opposed to just simply somebody preaching and another person being in the choir.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3145.656,
    "end": 3156.306,
    "text": "I thought that this paper was reinforcing some of the methods and some of the ways and processes that we've enacted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3156.987,
    "end": 3158.889,
    "text": "So I was really, really appreciative of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3159.827,
    "end": 3170.758,
    "text": " Yeah, a lot of the discussions about education and about the course and about onboarding and accessibility and learning of active inference and the ontology development, we really brought this idea back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.458,
    "end": 3176.964,
    "text": "Like, are we interacting with people who know different or less or more?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3177.584,
    "end": 3178.365,
    "text": "Or are we instructing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3179.526,
    "end": 3179.626,
    "text": "And...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3180.805,
    "end": 3183.606,
    "text": " How does that change the system's design?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3183.846,
    "end": 3186.226,
    "text": "And hint, hint, it changes everything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3186.986,
    "end": 3187.226,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.307,
    "end": 3192.468,
    "text": "Oh, I thought we said no spoilers for the... Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.068,
    "end": 3193.668,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.708,
    "end": 3193.888,
    "text": "So, 24.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3194.748,
    "end": 3201.69,
    "text": "This was a paper by Dmitry Markovich and Stojic, Sarasvobol, Stefan Giebel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3202.45,
    "end": 3206.991,
    "text": "The paper was called An Empirical Evaluation of Active Inference in Multi-Arm Bandits.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3208.092,
    "end": 3213.216,
    "text": " So Dimitri and Sarah joined for the discussions, and that was really awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.017,
    "end": 3220.082,
    "text": "What this paper did, it was a lot more like a traditional machine learning paper in its structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3221.123,
    "end": 3233.693,
    "text": "They provided an empirical comparison between active inference and two other state-of-the-art machine learning algorithms, the Bayesian Upper Confidence Bound, UCB, and Optimistic Thompson Sampler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3234.878,
    "end": 3260.88,
    "text": " And they applied these three different algorithms, the ACT-INF and the two other machine learning algorithms in two different challenges, the stationary and non-stationary multi-armed bandit problem, which kind of maps on to like basically being at a casino and figuring out which slot machine has the best return through time, kind of like investing type problems, but also it maps onto a ton of different other domains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3261.901,
    "end": 3273.589,
    "text": " And here's a representative figure five, where they were looking at those different algorithms, the Thompson sampler, Bayesian confidence bound, and the approximate active inference agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.65,
    "end": 3278.973,
    "text": "And then they were looking at the case of the switching multi-armed bandit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3279.033,
    "end": 3282.295,
    "text": "So the rewards were changing and the difficulty was non-stationary.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3283.096,
    "end": 3284.117,
    "text": "And so, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3285.239,
    "end": 3295.985,
    "text": " listen to the discussions and read the paper for more, but there were certain cases, not every single case, but certain cases where the Act-Inf agent did really well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3296.685,
    "end": 3313.774,
    "text": "So that was cool because it just sort of showed a path for a kind of paper, which I hope we have 100,000 of these papers and frameworks that make these kinds of results more accessible, because it was like, hey, if you're working on this kind of problem,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.71,
    "end": 3317.092,
    "text": " maybe try this kind of model out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.293,
    "end": 3320.214,
    "text": "So that could be kind of cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3320.855,
    "end": 3332.103,
    "text": "And this discussion, we talked a lot about the technical aspects and some of the code side, because we had talked a lot about philosophy, metaphysics, and activism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3332.723,
    "end": 3335.866,
    "text": "We had talked about some of the math and the analytic modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3336.606,
    "end": 3342.23,
    "text": "And this is where we talked about some of the numerical and computational elements of active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3343.972,
    "end": 3344.072,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3344.092,
    "end": 3344.192,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3346.798,
    "end": 3348.359,
    "text": " Sarah's back for 25.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3349.299,
    "end": 3359.983,
    "text": "So 25 was the computational boundary of a self-developmental bioelectricity drives multicellularity in scale-free cognition by Michael Levin.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3360.743,
    "end": 3367.606,
    "text": "Sarah, do you want to maybe summarize the paper or give just your overall thoughts on it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3369.667,
    "end": 3373.448,
    "text": "I don't know that I could ever do justice on a summary, but I think the thing that I took away...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.305,
    "end": 3402.047,
    "text": " from it or the thing that felt like a novel kernel of thought that was like, in the name of brain conservation, the only thing I wanted to take with me was this idea he had of a cone as a kind of a conserved quantity between different ideas of the individual or different species or cell level, like however you want to construe the individual that this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3403.985,
    "end": 3411.812,
    "text": " this creature living form of some sort has an ability to imagine versus an ability to enact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3412.833,
    "end": 3423.063,
    "text": "And that those two kind of opposing or orthogonal considerations are somehow possibly conserved between different levels of organism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3423.243,
    "end": 3425.105,
    "text": "And I just thought that was brilliant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3425.405,
    "end": 3426.907,
    "text": "So that was like the big thing for me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3428.499,
    "end": 3428.779,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3429.4,
    "end": 3436.326,
    "text": "So there was the one figure with a bunch of different, there was the aliens and the ant and the flea and the human with the different cones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3436.526,
    "end": 3437.647,
    "text": "And we talked about time cones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3438.427,
    "end": 3441.91,
    "text": "And then here was a slide from questions for 25.2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3442.651,
    "end": 3445.593,
    "text": "And so there's this example of the ant colony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3446.534,
    "end": 3455.384,
    "text": " And it's like, which one of these levels is alive or scales or however you want to call them, like a cell, the nest mate, the ant, the colony.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3455.404,
    "end": 3460.87,
    "text": "And it's like, well, the cell will survive if you put it in the right media for this amount of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3461.431,
    "end": 3464.313,
    "text": " But the nest mate will survive if you put it in this media for this amount of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.774,
    "end": 3469.918,
    "text": "Okay, but then the colony survives lifted from its environment only for this amount of time with this kind of stability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3469.958,
    "end": 3472.159,
    "text": "It's like, where are you going to stop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3472.219,
    "end": 3476.062,
    "text": "Are you going to just pull out New Mexico and put that into a test tube?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3476.523,
    "end": 3478.784,
    "text": "So what is the living system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3479.685,
    "end": 3485.269,
    "text": "And how do we talk about systems that have radically different cognitive architectures?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3486.25,
    "end": 3490.734,
    "text": "What is the role of bioelectricity in rapid,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3491.684,
    "end": 3499.446,
    "text": " basal cognition, the kind that might be influencing the formation of cancer and development and biofilms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3500.146,
    "end": 3501.746,
    "text": "So just, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.006,
    "end": 3506.067,
    "text": "And so you and blue did an awesome job on these streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.047,
    "end": 3508.307,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3508.567,
    "end": 3511.528,
    "text": "Blue did an awesome job, but I really enjoyed it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3511.628,
    "end": 3512.168,
    "text": "Oh my God.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3512.448,
    "end": 3517.909,
    "text": "His ability to like extrapolate from a thousand different points of view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3518.91,
    "end": 3519.75,
    "text": "Just wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3520.13,
    "end": 3520.63,
    "text": "It was great.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3521.365,
    "end": 3532.713,
    "text": " And I really like that he doesn't, you know, he's not, it might seem in the paper that he's like making a commitment to what an individual is or whatever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3532.773,
    "end": 3546.083,
    "text": "But in fact, the way he's, what he's trying to propose or how he's trying to think about it is resisting that temptation to commit to, you know, this is living, that's not, and things like this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3546.524,
    "end": 3547.164,
    "text": "It's wonderful.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3547.224,
    "end": 3550.867,
    "text": "It's a good way to jump into a different paradigm, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3551.957,
    "end": 3565.315,
    "text": " also maybe at this point a little bit more than halfway through the papers um thinking of multi-scale individuality like everyone who came on was awesome people did like really well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3566.676,
    "end": 3569.938,
    "text": " No one had any massive unforced errors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3570.739,
    "end": 3572.56,
    "text": "So that's like one low bar to clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3572.841,
    "end": 3576.443,
    "text": "Like that didn't really happen because that could be devastating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3577.064,
    "end": 3579.225,
    "text": "I had literally only two hours sleep that night.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3579.325,
    "end": 3581.027,
    "text": "I mean, it was like the worst night of my life.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3581.107,
    "end": 3588.853,
    "text": "No, not of my life, but I was really, and so I was actually looking at that video, the old video, and I'm like, did pretty well for two hours.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3589.473,
    "end": 3589.713,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3590.013,
    "end": 3595.638,
    "text": "So, but beyond just no blundering, people really showed up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3597.322,
    "end": 3602.106,
    "text": " And blazed way in a different kind of format.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3603.087,
    "end": 3605.009,
    "text": "Where were these journal clubs five years ago?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3605.309,
    "end": 3605.99,
    "text": "I don't remember them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3606.73,
    "end": 3611.194,
    "text": "So everybody who really stepped up and did it is amazing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3612.055,
    "end": 3615.197,
    "text": "And I hope that they inspire others and that everybody else feels like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3616.246,
    "end": 3620.671,
    "text": " Maybe being on a public recorded live stream is not the exact affordance for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3621.311,
    "end": 3622.693,
    "text": "That's totally fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3623.694,
    "end": 3629.039,
    "text": "But if you think it is the affordance for you, then you should do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3630.921,
    "end": 3633.123,
    "text": "I just want to put a plug in for getting more...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3637.139,
    "end": 3641.24,
    "text": " If I could get Michael Levin and this guy, Scott, I can't remember his name.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3642.44,
    "end": 3643.701,
    "text": "I'm sure he knows about him.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3644.401,
    "end": 3646.582,
    "text": "But he's actually doing termites.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3646.742,
    "end": 3647.882,
    "text": "He did studying termites.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3649.442,
    "end": 3656.164,
    "text": "And the relationship between these living forms and versus how they, you know, niche construction, how they affect their environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3657.825,
    "end": 3662.786,
    "text": "I just want to, I have this dream of like getting people that have these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3663.342,
    "end": 3670.687,
    "text": " complimentary or even a little bit opposing views in a room and then doing live streams with those people, like more than just one person.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3670.728,
    "end": 3672.889,
    "text": "So they're not just inundated with just their point of view.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3673.81,
    "end": 3674.891,
    "text": "We'll facilitate that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3675.131,
    "end": 3677.232,
    "text": "We'll help anyone design that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3677.513,
    "end": 3682.576,
    "text": "And then we'll make the email thread and make that event happen if the people want to participate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3683.577,
    "end": 3685.278,
    "text": "So 28 or 26, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3685.318,
    "end": 3691.223,
    "text": "So 26, nice, you know, A through Z, good number.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3692.003,
    "end": 3692.584,
    "text": "So this was...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3694.022,
    "end": 3703.105,
    "text": " Bayesian Mechanics for Stationary Processes by Lancelot da Costa, Carl Friston, Connor Heinz, and Gregorios Pavliotis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3703.885,
    "end": 3718.891,
    "text": "So this paper, as well as 32, which we'll talk about soon, it was kind of like this left-right one-two punch of two very impactful papers that were submitted in mid-2021",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3721.485,
    "end": 3722.768,
    "text": " like June ish.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3722.988,
    "end": 3728.019,
    "text": "And then it kind of came out in the end of the year, but these papers, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3731.86,
    "end": 3753.773,
    "text": " let's see in the future looking back how much they changed the game or in what ways they changed the game because of course there's so much more to be done and so much different too so it's not about like evaluating which ones were super impactful or not but suffice to say that 26 and 32 took a big step forward by taking a big step back",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3754.954,
    "end": 3765.676,
    "text": " And they took a first principles look at internal and external states and did some very important work to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3767.898,
    "end": 3786.749,
    "text": " formalize, if not prove to the nth degree and demonstrate in every system and tighten every bolt and everything, but give a unifying formalism and way of talking about this idea of the sigma or the mapping function between internal and external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3787.549,
    "end": 3808.294,
    "text": " Because just the sort of blanket concept alone, as we heard from several very important guest streams and other critical papers in the community, just having statistical installation of states, of course, does not entail that one side of that blanket or the other is living or doing inference or cybernetics or doing anything interesting like at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3809.794,
    "end": 3809.914,
    "text": "And",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3811.024,
    "end": 3820.368,
    "text": " Those who didn't think that were very optimistic, but also they didn't think through some of the basic implications of just mere statistical insulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3821.488,
    "end": 3836.874,
    "text": "And in 26, the mapping function, the sigma, brings in the idea that even though the Bayesian graph representation might have statistical insulation between internal and external states, in fact, that's their definition, there still may exist",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3837.998,
    "end": 3864.468,
    "text": " for certain classes of systems, a map, sigma, that means that internal states could be at least acting like they're doing some sort of inference on external states, which is one of the big pieces that's required for the active formalism to have any sort of, not just biological validity or realism, we kind of burnt that bridge back in the Hippolyto days, but just to be like statistically coherent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3865.208,
    "end": 3874.733,
    "text": " So it's like, if the linear model doesn't have internal coherence, like the program doesn't run, it's not like we're having the debate, is the economy a linear model or not?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3874.813,
    "end": 3878.475,
    "text": "We're saying it's not, or it could be, but we're not going to use a linear model to make that claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3879.196,
    "end": 3882.557,
    "text": "But this is just like at the level of the linear model working.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3883.318,
    "end": 3888.06,
    "text": "So this is getting the theory working in a way where it wasn't previously.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3889.441,
    "end": 3890.962,
    "text": "So that was a fun discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3891.462,
    "end": 3892.483,
    "text": "Dean, any thoughts on 26?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3892.523,
    "end": 3892.743,
    "text": "Did you...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3896.263,
    "end": 3917.259,
    "text": " I don't know if you remember when we had Connor back in the 32-3 and I asked him straight up, I said, so when you're looking at this mapping thing now, are you looking at a sort of a tight focal point or are you looking at the big picture?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3917.279,
    "end": 3918.9,
    "text": "And he said, we're looking at averages.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3920.481,
    "end": 3923.223,
    "text": "This was what I was asking because this paper here,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3924.639,
    "end": 3927.002,
    "text": " This paper, you said game changing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3927.222,
    "end": 3929.886,
    "text": "I think what this did is it brought high definition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3932.759,
    "end": 3933.959,
    "text": " I think the game is the game.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3933.999,
    "end": 3935.56,
    "text": "I think the game is still being played out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3935.62,
    "end": 3939.421,
    "text": "There's still some uncertainties, thank goodness, because that's why we're here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3940.001,
    "end": 3959.447,
    "text": "But I think the definition and the high definition and the contrast that this paper and then the 33 paper, both of those, just the level of detail they were able to sort of pull through in those formalisms and try to speak to what that synchronizing map",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3960.871,
    "end": 3964.633,
    "text": " what they believe it is mathematically, that's what I appreciate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3965.393,
    "end": 3972.958,
    "text": "With the funny and the high res and the game changing, it makes me think about like watching tennis and then the TV is better.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3973.218,
    "end": 3976.82,
    "text": "So it's like, nope, that tennis ball is just fuzzy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3982.162,
    "end": 3982.743,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3982.823,
    "end": 3984.344,
    "text": "Can't eat your way out of that one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3985.184,
    "end": 3986.025,
    "text": "Right, right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3986.165,
    "end": 3988.246,
    "text": "And I think that matters because I mean,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3989.208,
    "end": 3994.952,
    "text": " There's a part of me that wants to explore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3995.752,
    "end": 4000.836,
    "text": "And there's also things that we don't need to go over again and again and again just to prove that we can.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4001.076,
    "end": 4006.359,
    "text": "And I think that in some of the papers, we had the good fortune of having authors come back and say,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4009.013,
    "end": 4011.695,
    "text": " I think we can lock this part of it down, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4011.715,
    "end": 4028.063,
    "text": "They're not saying that the whole thing is done and complete and go to bed now, but there are aspects of this that we can be pretty confident that we have now, of course, a housekeeping rule was introduced, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4028.123,
    "end": 4033.146,
    "text": "So it's not completely locked down either, but there's certain parts of this now",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4034.446,
    "end": 4038.536,
    "text": " That we don't have to guess so desperately, I guess, is how I would describe it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4039.078,
    "end": 4039.238,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4040.241,
    "end": 4040.401,
    "text": "So, 27.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4043.356,
    "end": 4047.699,
    "text": " Here was another single author paper of a quite different type.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4047.919,
    "end": 4062.487,
    "text": "This was active inference applicability to different types of social organization explained through reference to industrial engineering and quality management by Stephen Fox, a researcher fearlessly unafraid of long paper titles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4064.328,
    "end": 4071.012,
    "text": "And this was a great set of discussions with Stephen on the streams and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4071.678,
    "end": 4081.283,
    "text": " So we talked about organizational active inference and some of his other later work was even on like autoethnographic active inference, which is really a fascinating topic for a lot of us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4082.464,
    "end": 4092.09,
    "text": "And we talked about the quality management system and about perception action in like these extended cognitive systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.25,
    "end": 4099.294,
    "text": "And lest anyone think that he was coming on to sort of speak for the factory farm approach,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4100.427,
    "end": 4126.756,
    "text": " There was a very interesting discussion about craft and about how do you have the mobile and flexible producing qualities in systems and have them be regenerative and participatory and bring kind of like the high reliability attributes of yes, car factories, but also like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4129.289,
    "end": 4144.544,
    "text": " organisms high reliability biochemical factories and then take that sort of a integrative perception cognition action approach like we do in active to this system so any comments on 27",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4145.905,
    "end": 4154.068,
    "text": " Yeah, I think it's time we mentioned two of our colleagues in particular because they really stepped up on this one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4154.108,
    "end": 4161.271,
    "text": "That's Stephen Sillett and Blue Knight because they both came in and they asked some pretty good questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4161.291,
    "end": 4172.636,
    "text": "And I think Stephen did a great job of talking us through his paper, but I won't forget Stephen Sillett's question around the scaling of dead things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4173.316,
    "end": 4174.617,
    "text": "And I thought that was like,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4175.728,
    "end": 4177.22,
    "text": " That was one of those moments where",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4180.111,
    "end": 4181.971,
    "text": " it got really interesting really, really fast.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4182.011,
    "end": 4194.755,
    "text": "So not to say that there is never drama in holding live streams, but that was a really, really good moment because not every one of these papers is there complete agreement on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4194.775,
    "end": 4206.298,
    "text": "And I think that was one of those times where a couple of our colleagues really stepped up and said, you know, rather than attacking, but just saying, please tell me more because I'm not really sure this is,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4207.435,
    "end": 4211.898,
    "text": " how we've sort of evolved the idea of active inference so far.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4212.779,
    "end": 4219.344,
    "text": "In some respects, it felt coming into it like there was a pre-forming in order to be able to make a case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4219.844,
    "end": 4224.087,
    "text": "But I thought this author did a really, really good job of saying, no, no, no, you mentioned this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4224.167,
    "end": 4228.891,
    "text": "It's not just on grand scales and mass production.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4228.931,
    "end": 4232.233,
    "text": "There's aspects to this that are very much craft-based.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4232.253,
    "end": 4234.635,
    "text": "And I thought he did a brilliant job of speaking to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4234.98,
    "end": 4238.783,
    "text": " He shared his screen and he brought up a lot of other resources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4239.043,
    "end": 4259.759,
    "text": "And yep, we can't name everyone who was on a live stream, go to the coded page to actually see everyone who was, but Stephen, Blue, Dave, Scott, David, many of you and others really like made it super fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.779,
    "end": 4260.459,
    "text": "Like we just had...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4262.712,
    "end": 4275.822,
    "text": " Many of you where we would have like other research meetings with very different tone, but like we had a ton of fun in the streams, but we also, I think, kept it kind of like on the rails, which is that balance, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4275.922,
    "end": 4278.224,
    "text": "Because it is recorded speech.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4278.805,
    "end": 4280.746,
    "text": "So 28, speaking of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4283.508,
    "end": 4283.708,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4283.748,
    "end": 4290.093,
    "text": "This was Lars Sandvitz-Smith with Hesp, Mittaut, Fristin, Lutz, Ramstead, and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4291.574,
    "end": 4293.537,
    "text": " A late 21 paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4293.617,
    "end": 4300.485,
    "text": "So this was just, again, kind of a fresh off the presses discussion with Lars who came on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.5,
    "end": 4321.657,
    "text": " the paper was towards a computational phenomenology of mental action modeling meta awareness and attentional control with deep parametric active inference so we had talked about the deep parametric inference previously deep active inference with the rollouts through time and about the anxiety and metacognition",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4322.503,
    "end": 4342.625,
    "text": " also had talked about attention with a smith and white paper about the visual attention so here we kind of combine those ideas and we talked about multi-level bayesian modeling of deep temporal systems time point one two and three and that same rollout structure and now we still have those uncertainties those variances",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4343.977,
    "end": 4366.863,
    "text": " also we have the second level the attentional level is now nested inside of a third level which is this meta awareness how aware am i of where my attention is so again that first level is like the perceptual level then the attentional on perceptual and then the meta cognitive on attention on perception",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4367.623,
    "end": 4395.502,
    "text": " so that was the probabilistic graphical model with the deep generative model and three hierarchical levels of state inference so this was just a um a fascinating discussion it just showed how the active inference structure even just the ones that we've seen now which are by no means all the structures we will have how it allows itself to be nested and composed",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4398.024,
    "end": 4404.248,
    "text": " here to make really recursive, strange loop agents.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4405.528,
    "end": 4409.311,
    "text": "And so this was a very interesting paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4410.359,
    "end": 4412.5,
    "text": " Yeah, we got into the statics and the dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4412.52,
    "end": 4424.268,
    "text": "And again, I don't know if I was the only one, but there was also some time given over to the, again, what am I paying attention to versus what am I available to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4424.828,
    "end": 4438.057,
    "text": "And not just focusing on all of the attention aspects of it, but what's maybe just slightly outside of that attentional frame, but it's still factoring in and influencing what",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4438.55,
    "end": 4441.792,
    "text": " what the go forward or not go forward move is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4442.612,
    "end": 4445.673,
    "text": "So again, this was Casper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4445.794,
    "end": 4451.896,
    "text": "Casper had a couple of pretty, pretty, I would say impressive papers last year or this year.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4451.916,
    "end": 4453.217,
    "text": "I guess we're not there yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4453.797,
    "end": 4454.638,
    "text": "It's still this year.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4454.698,
    "end": 4461.541,
    "text": "We'll do the little, the odd laying sign karaoke at the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.561,
    "end": 4462.742,
    "text": "If you're still there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4465.931,
    "end": 4466.191,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4466.671,
    "end": 4467.372,
    "text": "Paper 29.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4468.153,
    "end": 4477.521,
    "text": "So I'm 29 years old and we read my paper for 29 with Alex Chance, Maxwell Ramstead, Carl Friston, and Axel Constant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4478.382,
    "end": 4483.667,
    "text": "So the paper was Active Inference in Active Inference Framework for Ant Colony Behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4484.827,
    "end": 4494.732,
    "text": " In this paper, we adapted a model that previously had been used for visual epistemic foraging on culturally patterned pottery motifs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4495.532,
    "end": 4500.154,
    "text": "And we adapted that to the case of ants who could do stigmergy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4500.434,
    "end": 4503.436,
    "text": "So they could modify their local environment with pheromone",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4504.176,
    "end": 4511.762,
    "text": " And then they used their antennal senses to prefer pheromone and select actions that would realize those preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4512.483,
    "end": 4523.012,
    "text": "And then we simulated those ants in a multi-agent setting, the T-Maze test, which is like a common test used in all kinds of foraging paradigms in the lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4524.301,
    "end": 4541.69,
    "text": " And just like this paper 28 showed that it was possible to do these recursive composed nested agents, here we actually showed for the first time that it was possible to use active inference in a stigmergic context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4542.491,
    "end": 4547.293,
    "text": "So not just an embodied inactive agent or not just one that had a cognitive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4550.882,
    "end": 4558.288,
    "text": " policy selection element that was active inference, but multi-agent setting where there was also modification and feedback with the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4559.008,
    "end": 4569.076,
    "text": "So it was pretty cool to talk about the inference paper and Blue did an awesome job as the facilitator on this one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4570.317,
    "end": 4572.398,
    "text": "And yeah, anything you wanted to say on 29, Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4574.266,
    "end": 4579.869,
    "text": " Well, I was getting ready to go over to Europe, so I didn't get a chance to sort of be on the live stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4580.509,
    "end": 4582.83,
    "text": "I did watch the live stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4583.23,
    "end": 4585.151,
    "text": "You and Blue go through it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4586.091,
    "end": 4590.153,
    "text": "And one of the things, I'm glad you mentioned the recursive piece.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4590.213,
    "end": 4602.559,
    "text": "One of the things that I took away from this was not only was there a function that was looking back on itself, not only was there stigmergy, which was something new to me, there was also a kind of a...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4604.428,
    "end": 4605.809,
    "text": " a fractal element to this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4606.509,
    "end": 4622.336,
    "text": "And so, as I said, I didn't participate in the interaction aspect of this, but what I came away from, interestingly enough, is I wasn't really sure whether after reading your paper, whether active inference is actually a framework or if it's a process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4623.297,
    "end": 4626.718,
    "text": "And so maybe that's something that we'll revisit in 2022.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4626.758,
    "end": 4627.098,
    "text": "Cool question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4632.216,
    "end": 4633.137,
    "text": " All right, 30.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4633.498,
    "end": 4644.313,
    "text": "So for 30, we read a single author paper, which was by Matthew Sims, How to Count Biological Minds, Symbiosis, the Free Energy Principle, and Reciprocal Multiscale Integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4645.354,
    "end": 4645.915,
    "text": "So this paper...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4647.389,
    "end": 4654.194,
    "text": " did some philosophy of biology, and then had a case study of a squid bacteria symbiosis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4654.314,
    "end": 4658.277,
    "text": "So we'll just show that to get at the big idea of multiscale integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.937,
    "end": 4663.38,
    "text": "So multiscale integration is kind of like emergent systems, multiscale systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4664.241,
    "end": 4671.826,
    "text": "However, the author here makes the contribution of differentiating uniscale from reciprocal multiscale integration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4672.527,
    "end": 4676.97,
    "text": "So uniscale multiscale integration, or sorry, unidirectional is like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4678.757,
    "end": 4682.84,
    "text": " You have the entity, it's the user, and then you have the resources.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4682.94,
    "end": 4684.641,
    "text": "And the resources are like inanimate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4684.941,
    "end": 4694.468,
    "text": "So the user could be like some sort of emergent computational phenomena invoking dumber, deader computational elements.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4695.008,
    "end": 4705.116,
    "text": "So there can still be this multi-scale integration with emergence, but the sort of activity only flows one way, even if there's bi-directional causality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4706.383,
    "end": 4722.998,
    "text": " still there's like only a building up in one direction which is actually what makes these systems very easy to talk about in terms of like top-down emergent priors and bottom-up emergence and things like that and that's in contrast with these systems where kind of both ends",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4724.466,
    "end": 4725.846,
    "text": " are each other's user.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4725.907,
    "end": 4727.387,
    "text": "They're more like interactive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4727.807,
    "end": 4732.348,
    "text": "So this is a bit more of the interactionist instead of the instructionalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4732.989,
    "end": 4743.192,
    "text": "This is also challenging notions of just the unidirectional integration from sort of dumber and more particle-like to more abstract in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4743.612,
    "end": 4747.453,
    "text": "Well, that's how some systems are, the unidirectional integrators.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4747.873,
    "end": 4750.194,
    "text": "But the bidirectional reciprocal integrators",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4750.874,
    "end": 4757.437,
    "text": " It's kind of like, I don't know, a rainbow, but it's not just like anchored on both sides by something that's of one type.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4757.497,
    "end": 4759.478,
    "text": "It's kind of in a feedback in a different way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4760.278,
    "end": 4766.401,
    "text": "So that was a cool paper, a lot of philosophy and bringing some previous theories into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4766.441,
    "end": 4773.904,
    "text": "Like here, I remember that Dave brought up Gordon Pask and conversation theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4774.484,
    "end": 4777.185,
    "text": "And that was also a cool thread to hear about the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4779.295,
    "end": 4786.005,
    "text": " previous systems and cybernetics theories and about how ACTIV gives us like a new light on some of those topics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4786.566,
    "end": 4787.968,
    "text": "What did you remember from this paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4789.603,
    "end": 4796.989,
    "text": " I was watching you guys and really enjoying it because I had some barley courage.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4797.069,
    "end": 4801.593,
    "text": "I was enjoying sunsets in exotic places.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4802.713,
    "end": 4812.221,
    "text": "And what I really liked was the fact that, as you say, the reciprocal multi-scale integration isn't just feedback, it's feedback and feed forward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4812.962,
    "end": 4815.024,
    "text": "And I, you know, that whole parallel thing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4816.309,
    "end": 4826.754,
    "text": " process and bidirectionality piece, I think it was really important to sort of make that explicit and say, this is what sophistication means.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4827.294,
    "end": 4835.017,
    "text": "I mean, it can be less than that, but when it's at this level of bidirectionality, as you said earlier, that's a whole different game.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4836.078,
    "end": 4841.12,
    "text": "So kind of wish I was there, but I also was pretty happy with where I was.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4841.18,
    "end": 4842.521,
    "text": "You were in a good spot, my friend.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4845.813,
    "end": 4848.073,
    "text": " Okay, so home stretch.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4848.614,
    "end": 4848.834,
    "text": "All right, 31.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4850.474,
    "end": 4861.379,
    "text": "We read the paper from 2021 by Patricio Palacios and Matteo Colombo called Non-Equilibrium Thermodynamics and the Free Energy Principle in Biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4862.299,
    "end": 4874.521,
    "text": " So this paper was investigating the statistical, physics, historical and conceptual and dynamical systems, historical and conceptual bases of free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4876.803,
    "end": 4884.429,
    "text": " They focused on primarily the 2013 Life As We Know It, Carl Friston paper, which is kind of a big target.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4884.569,
    "end": 4886.39,
    "text": "It's like the Death Star of FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4887.191,
    "end": 4895.377,
    "text": "A lot of fighters have approached it, even though things have changed a lot also in the last eight years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4896.558,
    "end": 4903.303,
    "text": "And this paper approaches three areas that, as we kind of found out in the discussions, like they're not...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4904.312,
    "end": 4905.492,
    "text": " death nails for FEP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4905.512,
    "end": 4915.555,
    "text": "They're kind of like critiques where they're areas where it's good to have our attention, but it doesn't mean that they're lethal criticisms, nor that they've been solved either.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4916.496,
    "end": 4932.281,
    "text": "And that was basically the challenge of the pre-stated phase space for open-ended biological systems, the role of ergodicity in biology and the challenge of associating homeostasis and allostasis behavior with attractors in those phase spaces.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4934.113,
    "end": 4958.338,
    "text": " many of these terms like about the generality and the applicability of fep ergodicity a lot of themes that came up a bunch of times in the year and um some good discussions i remember maxwell came on this stream and was on others as well so um what do you remember about it or it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4959.668,
    "end": 4967.895,
    "text": " I was doing molecular testing and I wasn't really participating in this one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4968.496,
    "end": 4968.636,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4968.676,
    "end": 4968.836,
    "text": "Good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4969.337,
    "end": 4971.038,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4971.058,
    "end": 4971.038,
    "text": "32."
  },
  {
    "start": 4971.078,
    "end": 4971.899,
    "text": "So 32 was awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4972.039,
    "end": 4974.481,
    "text": "I'm sure it was one of our favorites.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4975.262,
    "end": 4975.482,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4975.802,
    "end": 4985.01,
    "text": "It was Stochastic Chaos and Barkov Blankets, 2021 paper by Friston, Hines, Oldshoffer, DaCosta, and Parr.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4986.266,
    "end": 4993.311,
    "text": " So this paper, we just had the .3 like a few weeks ago or like last week, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4993.851,
    "end": 4994.772,
    "text": "With Connor, I think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4995.833,
    "end": 4997.654,
    "text": "And it was just awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4998.535,
    "end": 5001.597,
    "text": "It got at that Kronos, Kairos difference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5002.258,
    "end": 5004.619,
    "text": "Like it's always .3 somewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5005.06,
    "end": 5006.501,
    "text": "That's the new 5 p.m.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5006.661,
    "end": 5009.022,
    "text": "Because it was like, we can always do...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5010.103,
    "end": 5036.1,
    "text": " another discussion and we could always have the author share their perspective or their how they're looking back at the work now or if anyone ever loved one of these papers they could just do another discussion on it or just share their view or it's like always possible to click that kairos up by one again and just build on the past like a blockchain a little bit and then um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5038.188,
    "end": 5049.116,
    "text": " There were so many figures that were fun in this paper, but it was about this same coupling that we've seen a bunch of times, but it did a few different things here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5049.456,
    "end": 5057.883,
    "text": "First, it introduced that unity is plural and at minimum two notion of the coupled systems in the internal and the external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5058.663,
    "end": 5067.27,
    "text": "And then took on the sort of granddaddy complex chaotic system, the Lorenz attractor, and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5068.459,
    "end": 5095.041,
    "text": " did some things with it I've never seen, which was to approximate instrumentally while retaining the chaotic signature in the Lyapunov and reframing this sort of vector field dynamic system into this decomposed and then recomposed and partitioned and reintegrated way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5096.047,
    "end": 5098.429,
    "text": " that was just really exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5099.47,
    "end": 5100.871,
    "text": "What did you think about it, Dean?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5103.313,
    "end": 5117.785,
    "text": "Well, I don't have the math background, and I keep bringing that up, but the thing that I found interesting is I learned about the Langevin, I learned about the Lorenz, I learned about the Laplace, and I was actually... After you... I'm going to pump your tires for a second here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5117.825,
    "end": 5122.228,
    "text": "After you sort of took the reins on this one and tried to...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5124.429,
    "end": 5129.457,
    "text": " in a way that was available for people who may have been watching that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5129.517,
    "end": 5134.745,
    "text": "It wasn't just for people who already have, you know, a solid foundation on the math.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5135.286,
    "end": 5137.469,
    "text": "You try to explain it in a way, and I think...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5138.895,
    "end": 5160.033,
    "text": " if there were two papers this year, if you wanted one on the philosophical piece, and if you wanted one on the explanation of what the math is telling us, I think the Hippolyta paper, and I think this one, I don't really have a favorite because I think each one of these papers brings out an important aspect of this whole active inference realm that we're diving into.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5160.053,
    "end": 5166.038,
    "text": "But this paper in particular, wow, I mean, in terms of its,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5167.165,
    "end": 5186.748,
    "text": " In terms of its trying to explain what the math formalisms are trying to tell us, if you don't get scared off by that, and it gets scared off by the kind of arrows going off in all directions piece, it's very informative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5187.168,
    "end": 5196.73,
    "text": "I don't know that it's a takeoff point, but if you've been looking at this now for as formally as long as I have, which is about six months,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5198.092,
    "end": 5208.64,
    "text": " Again, this was a really big moment in terms of sort of filling in a lot of the stuff that we're hypothesizing about and making it a little bit more tangible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5210.641,
    "end": 5210.902,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5211.822,
    "end": 5215.205,
    "text": "When I read papers like this, I think I don't have a math background either.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5215.225,
    "end": 5217.667,
    "text": "That's why we need a disclaimer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5217.687,
    "end": 5220.469,
    "text": "Yeah, but I was able to sort of have conversations with people and...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5222.146,
    "end": 5229.916,
    "text": " after going through this, I was like, no, this is the Laplace place and this piece, and this is the Lorenz piece, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5230.616,
    "end": 5232.719,
    "text": "It wasn't just a Langevin formula anymore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5233.08,
    "end": 5235.963,
    "text": "There was actually some, and I mean, I wouldn't be able to write it up myself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5237.028,
    "end": 5244.376,
    "text": " But actually seeing it now, it just didn't look like a bunch of squiggly lines or some kind of an abstract painting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5244.816,
    "end": 5246.418,
    "text": "There was actually some coherence to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5246.879,
    "end": 5256.048,
    "text": "Yeah, like looking at this and thinking, oh, this is like the chaotic flow and the arrows of the flow and the blue arrows that are pointing in different directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5256.829,
    "end": 5261.732,
    "text": " Here's like the flow on my strategy or on my approximation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5262.373,
    "end": 5266.675,
    "text": "Of course, if I were over here, it would be a similar flow to if it were very close.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5267.196,
    "end": 5273.3,
    "text": "And then how do we hold that highly operative chaotic real flow?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5274.651,
    "end": 5278.013,
    "text": " even one that's analytically defined so nicely like a Lorenz.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5278.053,
    "end": 5290.562,
    "text": "And then how do we have it be tractable yet retain its essence and not just sort of like, you know, cut up the cat and then just go, okay, well now cats don't move.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5292.043,
    "end": 5294.205,
    "text": " Well, I got a better sense of pullback attractors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5294.705,
    "end": 5306.956,
    "text": "I mean, while we were going through this, I was imagining things like, so maybe there's a math to desire lines, you know, out in the Serengeti, or maybe there's a math to the termite mound, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5306.996,
    "end": 5312.08,
    "text": "Not just in terms of how we can graph it, but in terms of how it...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5313.021,
    "end": 5337.774,
    "text": " it makes sense in terms of realizing those patterns in nature as well anyway this again this was a this was pretty i mean i i guess i'm on full geeks on display but if you if you like to geek out on this stuff this one was a really good paper yep it was a classic so fun paper thanks for connor also for that dot three",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5338.641,
    "end": 5338.881,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5339.442,
    "end": 5341.423,
    "text": "Paper 33, good old 33.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5342.183,
    "end": 5355.311,
    "text": "We turned to one of our lab colleagues to Serval, aka Avel, for his paper as part of like a really broad and creative research program.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5356.171,
    "end": 5381.091,
    "text": " into social and historical dynamics that he's a part of and the paper was thinking like a state embodied intelligence in the deep history of our collective mind so also as with many many other streams and papers blue did awesome work on this paper and presented on some work at some conferences so awesome job blue this paper is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5382.099,
    "end": 5399.189,
    "text": " made the argument from historical as well as sort of um conceptual bases that states are current i i don't even really need to describe them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5402.318,
    "end": 5408.819,
    "text": " that they can be understood as hierarchical control systems, essentially similar in their core physical architecture to brains.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5410.04,
    "end": 5417.181,
    "text": "And Avelle uses active inference to ground collective intelligence across different systems and scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5418.082,
    "end": 5423.603,
    "text": "And the paper hits on a few different topics, which is kind of outlined by this map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5424.557,
    "end": 5445.309,
    "text": " figure that we used in some of our presentations and it covered topics related to like multi-scale embodied intelligence some of the anthropology and historiography i guess about states and anthropology just like yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5447.034,
    "end": 5451.456,
    "text": " areas related to people, studies, and urban metabolism and the collective mind.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5452.237,
    "end": 5460.42,
    "text": "And the memorable moment for me was with Dave, Dean, and Steven, when we, in the DOT2,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5461.96,
    "end": 5467.863,
    "text": " we were just talking about like the cafe next to the park with a red light and the preference for light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5468.423,
    "end": 5473.405,
    "text": "And we just started walking through how we apply active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5473.625,
    "end": 5476.467,
    "text": "And so that was just a cool discussion.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5476.747,
    "end": 5489.953,
    "text": "And this is an example of like, yeah, like, you know, cities and states, the things that people care about, wouldn't it be useful if we had a better way or a different way",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5491.273,
    "end": 5493.114,
    "text": " to talk about them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5494.955,
    "end": 5497.956,
    "text": "So that it was just a fun experience with you all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5498.556,
    "end": 5500.677,
    "text": "And also it's clearly a very relevant topic.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5502.458,
    "end": 5502.638,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5502.658,
    "end": 5505.599,
    "text": "And you started, when you started doing some of that, um,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5507.168,
    "end": 5514.02,
    "text": " table manipulation stuff in that moment, sort of taking and manipulating and moving things around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5514.501,
    "end": 5515.743,
    "text": "I think that's active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5515.803,
    "end": 5520.551,
    "text": "And I think my big thing was I wondered if I was going to start",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5521.954,
    "end": 5531.96,
    "text": " some kind of a conflict around the idea of scale friendly, but I didn't, there are actually people who actually took that into, into their lexicon and, um, considered it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5532.16,
    "end": 5533.801,
    "text": "And I, here's the thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5534.101,
    "end": 5538.364,
    "text": "I think sometimes in this, this setting, one of the things that we've,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5539.977,
    "end": 5544.758,
    "text": " that the participants have evolved around is the idea of introducing new things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5545.758,
    "end": 5553.5,
    "text": "And I mean, if they're ridiculous things, I mean, we'll all give each other a hard time, but if we're introducing new things, it isn't just sort of shot down out of hand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5553.58,
    "end": 5557.401,
    "text": "People will try and find ways to incorporate it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5558.081,
    "end": 5559.942,
    "text": "And again, that is active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5560.702,
    "end": 5563.262,
    "text": "So that was my big takeaway from this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5563.342,
    "end": 5565.883,
    "text": "I was really kind of impressed with the idea that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5568.515,
    "end": 5578.239,
    "text": " bringing something in that isn't necessarily citable, but something I think has to maybe be included, kind of like a housekeeping rule.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5578.259,
    "end": 5590.124,
    "text": "And I'm no Carl Friston, but there were other people on those live streams who kind of went, oh, okay, well, maybe we need to consider that when we're talking in this context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5591.085,
    "end": 5591.305,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5592.245,
    "end": 5592.565,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5592.605,
    "end": 5595.887,
    "text": "Not mentioned during the stream was the symposium where we just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5596.755,
    "end": 5598.396,
    "text": " published the transcript with a DOI.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5598.436,
    "end": 5599.456,
    "text": "So that was very exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5599.656,
    "end": 5609.021,
    "text": "And yeah, I think scale-friendly, I liked it because it almost, it gives agency to the doer instead of passivity to the thinker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5609.521,
    "end": 5611.302,
    "text": "It's like, it's a scale-free framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5611.382,
    "end": 5612.282,
    "text": "It's like, oh, great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5612.322,
    "end": 5616.084,
    "text": "So it's in a museum and you pay money to see it and it just figures stuff out for you, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5616.124,
    "end": 5617.024,
    "text": "It's scale-free.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5617.164,
    "end": 5617.985,
    "text": "It's like, it's perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5618.985,
    "end": 5620.326,
    "text": "It's like, it's scale-friendly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5621.046,
    "end": 5623.047,
    "text": "You can use this actively to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5624.141,
    "end": 5635.319,
    "text": " but you gotta be friendly to it as well and use it like anybody else would use a dynamic resource or asset to, it's like, it's Mount Everest climbing friendly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5635.96,
    "end": 5639.044,
    "text": "As far as climbing pins go, it's the one you want.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5640.327,
    "end": 5643.268,
    "text": " So it just totally reframed that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5643.448,
    "end": 5645.869,
    "text": "Yeah, it's a Hudson River moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5646.009,
    "end": 5647.729,
    "text": "Honestly, it honestly is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5647.809,
    "end": 5653.691,
    "text": "I mean, that's not a landing pad, but I mean, it's friendly enough, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5653.991,
    "end": 5661.553,
    "text": "In a moment of crisis, that's an example, I think, of what we were at least entertaining.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5661.573,
    "end": 5665.294,
    "text": "It doesn't mean that we have the math for it yet, but we were entertaining it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5665.694,
    "end": 5665.874,
    "text": "Yep.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5666.534,
    "end": 5667.574,
    "text": "So, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5667.594,
    "end": 5669.135,
    "text": "And everyone else who brought in...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5671.055,
    "end": 5675.418,
    "text": " That was the fun of the participatory approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5675.458,
    "end": 5681.963,
    "text": "And I know that we're only beginning the voices and the perspectives that we'll hear about on the stream and the papers that haven't been written yet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5683.525,
    "end": 5684.665,
    "text": "That's what's fun.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5685.046,
    "end": 5694.713,
    "text": "The beginner's question and the domain specific criticism and the philosophical and the personal and the way that it can come together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5694.733,
    "end": 5699.577,
    "text": "And we can do that spontaneously and align with our values and also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5701.759,
    "end": 5723.718,
    "text": " just meet each other and help others who are learning it's really special that we got to do all these streams so 34 the last paper that we read this year which was the free energy principle it's not about what it takes it's about what took you there by axle constant so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5725.233,
    "end": 5727.735,
    "text": " What a paper to end the year with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5728.095,
    "end": 5735.179,
    "text": "So Axel is a long time collaborator with me on the inference paper and some other work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5736.02,
    "end": 5748.568,
    "text": "And so I love his writing and the way that he's talked about active inference and contributed to it in the philosophical and in the ecological aspects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5749.795,
    "end": 5777.257,
    "text": " and other areas and the writing was engaging the examples were clear the labeling of what was called the entailment problem was one of the center pieces of the paper what's the entailment relationship between minimizing free energy and life is the strong claim the sufficiency claim valid that if you're minimizing free energy then that's sufficient to say that the system is alive or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5778.635,
    "end": 5783.117,
    "text": " do systems that are alive, by what definition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5783.257,
    "end": 5792.061,
    "text": "But systems that are alive, out of necessity, must they have done something looking like minimize free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5793.461,
    "end": 5806.047,
    "text": "And just that nexus and the slide play and the discussions that came out of that just in the last few weeks with you and Steven and others were great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5807.105,
    "end": 5833.156,
    "text": " sid wrote the paper 34 did a number on me jk yeah um it was a very interesting paper so um any comments on 34 well i think the best compliment i can pay 34 is just to ask people to make sure that they get a chance to look at the paper agreed agreed all these papers i think are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5834.87,
    "end": 5862.709,
    "text": " read worthy and we hope that you'll raise up important papers to read next year so i'll just kind of close with this slide um yeah for 22 what are you looking forward to what papers should we read who we'd like to join in who can we invite what else could we do in dot coms or other units what other functions could the lab serve",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5864.238,
    "end": 5870.102,
    "text": " If anyone's looking to contribute or get involved, they really should.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5870.602,
    "end": 5880.288,
    "text": "All backgrounds and time zones, if you just want to show up for even one hour a month or more, there will be an awesome place for you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5881.028,
    "end": 5886.851,
    "text": "And if you want to interact, it would be cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5887.592,
    "end": 5892.595,
    "text": "So we had a great year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5894.261,
    "end": 5898.502,
    "text": " Dean, do you want to add anything about 22 or on any other point?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5899.482,
    "end": 5914.207,
    "text": "Well, I think I mentioned the other day that one of the things that I'm kind of looking forward to is, I hate the word reset because it implies that somehow something was already set, but it's not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5915.587,
    "end": 5918.128,
    "text": "Saying that, I think that as much as",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5919.464,
    "end": 5927.411,
    "text": " as we've had the privilege of learning this year and the privilege of having people come in and explain what their papers are and that sort of thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5928.012,
    "end": 5939.783,
    "text": "I hope that 22 reintroduces a little bit more naivete and a little bit more, I think I use the metaphor of adding another walnut shell",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5941.072,
    "end": 5949.075,
    "text": " I think it's the biggest thing for me is that everybody that has participated so far has come in with a really open mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5949.695,
    "end": 5953.397,
    "text": "They don't necessarily come in trying to show how much they know.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5953.417,
    "end": 5958.239,
    "text": "And I think that if we all sort of carry that forward into 22 and really, really...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5961.5,
    "end": 5990.065,
    "text": " appreciate that learning is about not knowing first and foremost and if you come into it even if even all the priors that you have and all the experiences and the backgrounds and the things you've been able to figure out and we seem to check a lot of that before we before we go live and our and our song begins to play and i think that's a really really healthy thing and i think in 22 um it will be the thing that will keep the band together",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5991.069,
    "end": 5992.81,
    "text": " for lack of a better way of describing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5992.83,
    "end": 6001.955,
    "text": "I think people will know that every single time they can show up, they can show up with whatever background they have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6002.315,
    "end": 6008.718,
    "text": "Because you keep saying it, but I think it's great in principle, and it's hard to overcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6008.778,
    "end": 6010.239,
    "text": "People need to see evidence of that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6010.419,
    "end": 6018.063,
    "text": "And I think, again, I'm not trying to pump your tires too much here, but as long as we can keep that front of mind and keep that culture alive,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6018.823,
    "end": 6031.6,
    "text": " on display I think 22 is setting up to be something really really amazing so congratulations to you for for doing this and like I said back in April of this year when I",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6033.464,
    "end": 6042.252,
    "text": " I don't want to get the name, kill the name, but I was at my cabin and I saw you guys talking to Chris White and I just was like, oh my goodness, oh my goodness, oh my goodness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6042.732,
    "end": 6043.353,
    "text": "What is this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6044.093,
    "end": 6045.835,
    "text": "Where did this come from?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6046.415,
    "end": 6048.237,
    "text": "So that's neat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6048.277,
    "end": 6059.587,
    "text": "Let's say it's not necessarily for everybody, but for those who it is for, I think it's only a matter of time before they're going to hear about this and they're going to want to get deeply involved in it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6059.647,
    "end": 6060.488,
    "text": "So well done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6062.398,
    "end": 6092.073,
    "text": " daniel larry it was a very fun year um so big thanks to all the organizers and just everybody who is part of this year's fun and epistemic and pragmatic value because it really was special so to 22 and beyond right great take it easy peace have a",
    "speaker": "SPEAKER_00"
  }
]