[
  {
    "start": 2.759,
    "end": 3.599,
    "text": " Hello and welcome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3.959,
    "end": 7.34,
    "text": "This is Active Inference Guest Stream 65.1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 7.94,
    "end": 10.221,
    "text": "It's December 6th, 2023.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 11.001,
    "end": 17.902,
    "text": "We'll be hearing from Phoebe Klett and Dan Simpson on Bayesian World Models for Explainable Transparent Reasoning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 18.322,
    "end": 21.423,
    "text": "There will be a presentation followed by a discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 22.023,
    "end": 24.163,
    "text": "So thank you for joining, Phoebe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 24.323,
    "end": 26.384,
    "text": "Very much looking forward to the presentation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 26.744,
    "end": 26.924,
    "text": "To you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 28.544,
    "end": 29.946,
    "text": " Awesome, thanks for having us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 30.647,
    "end": 40.218,
    "text": "Yeah, I'm really excited to chat with you all about how we might start to integrate today's state of the art language models into more probabilistic machinery and what that might buy us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.099,
    "end": 43.78,
    "text": " All right, let's get right into it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 44.781,
    "end": 63.376,
    "text": "All right, so some of the things that I'm hoping to discuss today include why we might use a language model for something that isn't long-form text generation and how we might do that, and then motivate a little bit kind of why we might need a world model, what simple self-organizing world models might look like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 64.797,
    "end": 70.6,
    "text": " And even in the simplest cases, how we might start to use those as effective recommendation engines in the wild today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.42,
    "end": 74.181,
    "text": "And then a little bit of discussion about kind of where this research is going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 78.023,
    "end": 78.363,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.834,
    "end": 82.656,
    "text": " So what are language models good at?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 83.617,
    "end": 88.121,
    "text": "Today's, especially large language models, are trained on next token prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 88.882,
    "end": 95.248,
    "text": "So this means given a sequence of tokens, we're going to estimate which token is most likely to come next.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 96.229,
    "end": 105.437,
    "text": "Maybe rephrasing that a little bit, we might also say that language models are trained to estimate which sequences of tokens or words are likely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 106.621,
    "end": 113.352,
    "text": " the caveat being likely to appear in the training set, but today our training sets are quite extensive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 117.045,
    "end": 126.789,
    "text": " So given this simple training objective, it's arguably surprising that we've seen language models do as well as they have in really impressive tasks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 127.369,
    "end": 137.734,
    "text": "So they start to demonstrate like really great language understanding, meaning like the semantics of language itself, not just the syntax of kind of like which sentences make sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.976,
    "end": 141.541,
    "text": " They've also started to demonstrate some world knowledge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 141.641,
    "end": 149.217,
    "text": "So implicitly learning kind of how the world works just through our own human abstraction and how we articulate that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 150.291,
    "end": 173.476,
    "text": " uh we start to see language models falter at tasks which look more like symbolic problem solving so math in particular we see this in programming although we're getting better at this and in general any kind of like long-term planning tasks which require abstract reasoning so we see this also in problems that look like this which are word problems but which are really about kind of like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.176,
    "end": 178.379,
    "text": " understanding abstractly how these kind of abstract objects relate to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.399,
    "end": 187.245,
    "text": "And again, this shouldn't be surprising that language models struggle to do things like this, since it's so far off from their original training objective.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.106,
    "end": 199.574,
    "text": "And in particular, even when we arrive at the right answer in some of these cases, it's really hard to know after the fact kind of the reasoning for how we ended up at the right answer in this particular case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.394,
    "end": 201.915,
    "text": "And maybe more fundamentally,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 202.976,
    "end": 209.323,
    "text": " If we don't know where the abstraction is happening or where the reasoning is happening, it's very hard to guide that process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 210.244,
    "end": 215.31,
    "text": "And so this starts to motivate the need for something that looks more like an explicit world model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.391,
    "end": 219.315,
    "text": "And now to start to borrow some words from Yasuo Bengio,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 219.855,
    "end": 232.46,
    "text": " This is one of the kind of biggest issues with today's language models is arguably that we're asking the language model to be both the inference machine and the world model implicitly when this doesn't quite make sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 233.0,
    "end": 243.945,
    "text": "And so some things that we might hope for in a world model are to model causal relationships, to be really adept at modeling using uncertainty, and to be modular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 245.466,
    "end": 247.408,
    "text": " Yann LeCun puts this in a similar way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 247.488,
    "end": 260.402,
    "text": "So we might kind of ask a world model to be able to distinguish between which details are important versus irrelevant, and to be able to make predictions that can be performed in sort of this abstract space of representations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.28,
    "end": 274.788,
    "text": " And so hopefully in the next following slides, we're going to motivate what it might look like to use language models as the inference machines in maybe like the simplest case of self-organizing world models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 275.829,
    "end": 285.576,
    "text": "And even in those most simple cases, how we start to get something much closer to the kind of explainable reasoning, which I think lots of us are grasping for right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 290.41,
    "end": 300.874,
    "text": " All right, so in a very simple case, we might think of a world model as simply a collection of hypotheses where we model confidence over each of those hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.175,
    "end": 304.676,
    "text": "And in particular, we care about predictive world models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 305.196,
    "end": 316.1,
    "text": "So given some evidence or data that we've observed in the world, we'd like to propose the world models which best explain the evidence that we've observed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 320.289,
    "end": 323.192,
    "text": " And if that language sounded leading, it was indeed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 323.772,
    "end": 333.421,
    "text": "We are proposing in this case to use Bayes' rule, which we all know and love, which tells us exactly how to update our beliefs given some new evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 333.921,
    "end": 344.791,
    "text": "And so when our hypotheses are kind of these Bernoulli random variables, this bottom term can simply be expanded into this equation on the slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.072,
    "end": 351.797,
    "text": " And so the real tricky part in this computation is the likelihood piece.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 351.817,
    "end": 358.303,
    "text": "So given that our hypothesis is true, what's the likelihood that we would have observed the evidence?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 359.804,
    "end": 371.09,
    "text": " And the claim that we're making is that language models are actually, this is like a natural task to ask of a language model, when our evidence and our hypothesis are both semantic objects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 371.751,
    "end": 378.094,
    "text": "As we discussed, language models are kind of trained exactly to understand which sequences of text are likely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 379.355,
    "end": 388.5,
    "text": "So asking it to, prompting it in a clever way such that we can extract this particular likelihood is actually really natural.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 391.107,
    "end": 391.847,
    "text": " So how do we do this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 393.068,
    "end": 402.272,
    "text": "So we come up with this kind of clever prompting scheme that allows us to extract again exactly how likely is this shift curve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 402.992,
    "end": 408.395,
    "text": "So given that our hypothesis is H in this setting and our evidence is this",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 408.955,
    "end": 432.172,
    "text": " uh curly e um we only need to change our evidence into the conditional form and then phrase the question like this to the language model so the input sequence of text uh goes like given that you know potentially our if our hypothesis is like walmart has been severely impacted by covet 19 pandemic would we have observed the evidence um that walmart laid off 10 of the material staff",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 433.499,
    "end": 450.326,
    "text": " And so either using something like few shot prompting or guidance or some kind of control generation technique, we can ensure that our language model outputs either yes or no, and then use the logits from its answer to estimate that probability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.835,
    "end": 466.101,
    "text": " And again, the claim here is that this is actually a really natural task to ask of a language model that leverages its innate reasoning engine better than just kind of allowing it to ramble using text sometimes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 471.752,
    "end": 477.916,
    "text": " And we can even make this updating scheme a bit more sophisticated using things like precision weighting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.697,
    "end": 489.944,
    "text": "So this will bias our posterior over hypothesis either towards our prior or our evidence that we've observed based on how confident we are in our prior and in our evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 495.668,
    "end": 496.048,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.47,
    "end": 501.532,
    "text": "So the world models that we've seen so far are fairly simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 502.834,
    "end": 506.016,
    "text": " In particular, we're modeling all our hypotheses as independent from each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 506.036,
    "end": 509.858,
    "text": "And this seems like a large simplifying assumption.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 510.458,
    "end": 515.241,
    "text": "So how might we support more complex world models where we condition our hypotheses on each other?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 519.355,
    "end": 537.891,
    "text": " All right, so another thing that hopefully will be familiar to this crowd, Bayes nets have been around for forever and are often used to model mechanistic failures in large systems and can be understood simply as a distribution where each variable depends on some small number of ancestor variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 538.251,
    "end": 541.735,
    "text": "Perhaps more intuitively, we can also think of these as directed graphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 542.635,
    "end": 553.748,
    "text": " um where we have edges between variables which are directed in the sense that the parent is conditioned on the child so let's see an example",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 555.785,
    "end": 560.289,
    "text": " All right, so now we have two different kinds of hypotheses.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 560.829,
    "end": 567.535,
    "text": "The ones which are kind of parents in our simple setup are kind of qualitatively more abstract than the children.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 568.455,
    "end": 573.119,
    "text": "So our two children nodes are similar to the hypothesis we saw before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.16,
    "end": 578.103,
    "text": "Market sentiment for Best Buy is poor or Walmart will grow its physical footprint this year.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 578.123,
    "end": 583.988,
    "text": "And then the more abstract hypothesis being retailers were negatively impacted by COVID-19.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 586.229,
    "end": 599.614,
    "text": " And so then we specify this conditional structure, either kind of in a classical sense by specifying all of the joint probabilities upfront or alternatively learning it given some healthy amount of training data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.414,
    "end": 608.377,
    "text": "And again, we're proposing that instead of doing that intensive process, we can use language models to extract those probabilities in a natural way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 610.45,
    "end": 615.836,
    "text": " And so one natural complaint at this point might be like, well, this space is gonna start to get very large.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 617.237,
    "end": 625.266,
    "text": "If we're trying to update these beliefs in real time, given some large data stream, this is gonna become intractable given our current framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 625.886,
    "end": 627.488,
    "text": "So how might we start to augment that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 629.468,
    "end": 638.411,
    "text": " Luckily, there's been a lot of work historically done on this problem, and we can start to use things like message passing to update our beliefs in an approximate way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.891,
    "end": 646.553,
    "text": "So as long as our Bayes net has a tree dependency structure, we can use things like the sum product algorithm to update our beliefs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 647.133,
    "end": 649.814,
    "text": "And I don't want you to worry too much about the equations on this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 649.834,
    "end": 653.335,
    "text": "If you've seen this before, this kind of recursive structure will",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 653.755,
    "end": 667.038,
    "text": " look familiar, but if not, the general kind of intuitive idea that we're going to compute these messages from all of the children or the neighboring nodes and use those to propagate through the graph to update each independent belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 668.538,
    "end": 669.558,
    "text": "But let's just see an example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.578,
    "end": 680.861,
    "text": "All right, so suppose we observed some new evidence and we'd like to know how should we update the probability over hypothesis A, which as you remember is the parent node in our graph.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 682.103,
    "end": 685.708,
    "text": " All right, so B here on the left-hand side is the belief.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 687.129,
    "end": 700.545,
    "text": "XA is essentially like just the variable representing the hypothesis A. And then the phi and the psi terms are specified by our language model or the Bayes net in the classical sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 702.026,
    "end": 709.029,
    "text": " And so we're summing over all of the variables, all of the values that the variables XB and XE can take, which in our case, of course, is just zero and one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 710.77,
    "end": 721.735,
    "text": "So you might recognize at this point that this is indeed the exact marginal probability for the hypothesis A, and that's because our graph is simply connected in this example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 722.395,
    "end": 726.497,
    "text": "So in general, this isn't true, but turns out to be the case in our example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 728.089,
    "end": 733.223,
    "text": " And again, we can compute these phi and psi terms using the language model itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.243,
    "end": 738.603,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.843,
    "end": 750.666,
    "text": "So because we're all lovers of free energy here, I'm going to walk through kind of how this is maybe the first example of a self-evidencing or minimizing free energy kind of model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.366,
    "end": 755.767,
    "text": "So as we noted, belief propagation isn't exact for more complicated graphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 756.107,
    "end": 766.129,
    "text": "And so it makes sense and might be useful to ask the question, you know, how far apart or when are our beliefs close to the exact marginals?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 767.149,
    "end": 772.716,
    "text": " And so we often use things like KL divergence to compare the difference between two probability distributions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 773.276,
    "end": 776.359,
    "text": "And that is explicated on the right hand side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.721,
    "end": 779.843,
    "text": "And then those of us who are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 782.924,
    "end": 786.026,
    "text": " like have a background in physics, might recognize Boltzmann's law as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 786.046,
    "end": 791.59,
    "text": "So this is just the idea that we might represent the probability of a given state using an energy function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.61,
    "end": 799.435,
    "text": "And we're not going to accept this as truth, maybe as some of us have done in the past, but we are going to just use it as a definition for this energy function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 800.275,
    "end": 810.822,
    "text": " such that when we plug in that term here and expand out, we start to see these first two terms look a lot like the kind of energy and entropy functions which we are used to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.842,
    "end": 816.566,
    "text": "And indeed, we can just classify those two terms as the Gibbs free energy function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 816.586,
    "end": 821.45,
    "text": "Yeah, which makes me happy to see this all coming together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 821.47,
    "end": 826.153,
    "text": "And in particular, it might make sense just to note at this point that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 826.986,
    "end": 838.224,
    "text": " Using world models which are self-organizing in this sense seems to be very compelling since the kind of world model which we want is one which promotes the evidence that we've seen so far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 844.032,
    "end": 850.279,
    "text": " Why is it useful to formulate this in terms of free energy, besides the fact that we all find it compelling here?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.299,
    "end": 856.726,
    "text": "Well, you can make a lot of progress by constructing analytically tractable approximations of Gibbs free energy often.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 858.287,
    "end": 863.713,
    "text": "I'm not going to go into the details here, but here are two examples where that's been fruitful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 868.669,
    "end": 879.696,
    "text": " Alright, so now I'm going to chat briefly about kind of how we might use recommendation systems like or how we might use these systems as recommendation systems and indeed in the world today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 882.918,
    "end": 889.822,
    "text": "Alright, so one like prime example for where a system like this might be useful is a situation where we have kind of lots of data incoming",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 891.403,
    "end": 902.773,
    "text": " at very high frequencies and we always want to have some set of naturally discrete hypotheses that we're modeling beliefs over, which are being kept up to date at a very regular cadence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 903.954,
    "end": 912.341,
    "text": "And so actually a lot of the muscle here is just reformatting documents or however our data comes in as evidences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.381,
    "end": 914.503,
    "text": "This is not always obvious or easy to do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.463,
    "end": 930.758,
    "text": " But once you've kind of figured out that part, and in particular, we've been using things like RAG, retrieval augmented generation, or embedding based systems to kind of figure out when data that's incoming is relevant to a given hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 932.218,
    "end": 940.241,
    "text": " Once you've kind of built up that machinery, the actual updating computations, as we've shown already, is actually pretty simple.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 940.761,
    "end": 951.624,
    "text": "So we do these likelihood computations, we update our beliefs, and then at any given time we can query that model for our marginal distribution over any given hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.305,
    "end": 957.806,
    "text": "And it turns out that this kind of setup has many practical applications.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 961.502,
    "end": 968.424,
    "text": " It's also noteworthy that even with very simple systems like these, these are like out of the box, controllable and explainable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.224,
    "end": 982.008,
    "text": "So just by storing the magnitude and the direction of the update to the posterior for each piece of evidence that we observe, we have a very natural built in explanation for our belief at any given time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 983.068,
    "end": 984.929,
    "text": "And that makes kind of like.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.789,
    "end": 1010.744,
    "text": " these applications where folks might really like to use a language model but really require like a robust like causal relationship between the outputs and the explanation which you don't get from a language model on its own a system like this can be very appealing in those situations all right so now on to further work",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.959,
    "end": 1022.59,
    "text": " So everything that we've discussed today is early work towards integrating language models into more probabilistic frameworks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.571,
    "end": 1028.217,
    "text": "And there's been a lot of exciting work done in this vein right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1029.479,
    "end": 1031.722,
    "text": "Some important questions which are especially interesting to me",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1032.432,
    "end": 1035.455,
    "text": " or which parts of the world model should be learned versus encoded?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1037.157,
    "end": 1038.878,
    "text": "And how do we want intelligence to scale?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1039.339,
    "end": 1051.93,
    "text": "So I mean that both in the sense of composing systems naturally, there should be some very natural way that we can compose to intelligent systems, and also such that we can scale them with compute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1053.192,
    "end": 1057.595,
    "text": " And I don't mean to restrict myself either to the kinds of compute that we have today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1057.615,
    "end": 1065.502,
    "text": "We're also working at some exciting new computing paradigms at Normal, which might be more compatible with software of this nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1067.223,
    "end": 1073.669,
    "text": "Also, the two folks that we referenced at the beginning of the talk, Jeff Pinton and Jan LeCun, have done really exciting work in this area.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.45,
    "end": 1103.413,
    "text": " which is yeah very inspiring and so in particular g flow nets are also probabilistic graphical models which i think folks will find um a natural next step in reading uh yeah if if you so desire and that's um that's it for me awesome thank you wow very cool",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.687,
    "end": 1109.469,
    "text": " Dan, do you want to give a first reflection or thought?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1109.609,
    "end": 1113.711,
    "text": "And then meanwhile, anyone who's watching live, please feel free to write questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1113.791,
    "end": 1114.772,
    "text": "I'll relay them in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1118.374,
    "end": 1118.855,
    "text": "Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1119.975,
    "end": 1121.516,
    "text": "So, hi, I'm Dan.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1121.556,
    "end": 1123.337,
    "text": "I work with Phoebe on this project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1124.518,
    "end": 1125.159,
    "text": "And yes, the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1126.713,
    "end": 1133.278,
    "text": " I think the thing that's most exciting about this for me personally is sort of twofold.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1134.059,
    "end": 1147.63,
    "text": "One of them is that it's a way of avoiding sort of having to trust a language model to understand and reason about text.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1148.731,
    "end": 1150.973,
    "text": "Because they're not...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1152.284,
    "end": 1178.216,
    "text": " not that they're bad the thing is that the extremely strange thing about language models is they're quite good at being almost good enough um but they're never quite what you could use you could never use a language model to i don't know um sort of triage like an important sort of situation where a bunch of different things are coming in you have to make a decision about which is important",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1178.749,
    "end": 1183.35,
    "text": " The reason you can't do that is you simply cannot understand the encoded biases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1183.851,
    "end": 1187.732,
    "text": "You cannot get it to reliably generate reasoning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1187.972,
    "end": 1194.554,
    "text": "You can ask it for reasoning, but the thing that it prints out is not the reasoning that it used internally because it doesn't reason.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1196.414,
    "end": 1203.096,
    "text": "Fundamentally, while these have input and output that are natural language, they are not artificially intelligent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1203.556,
    "end": 1205.357,
    "text": "They are just prediction machines.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1206.446,
    "end": 1209.768,
    "text": " And so we have to be very careful about not anthropomorphizing them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1210.249,
    "end": 1229.422,
    "text": "So this is a way of using those incredibly powerful prediction machines in a framework where we can make sure that we essentially keep a record of what we're doing so that a human can look at it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1230.023,
    "end": 1236.347,
    "text": " Because, I mean, there's a lot of talk in this world about sort of post-human AI and those sorts of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1236.387,
    "end": 1243.792,
    "text": "The idea that the machines will become intelligent enough or the machines will rise up in a slightly more alarming type of way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1245.933,
    "end": 1249.935,
    "text": "And that's all great and wonderful, but that's not particularly interesting to us at normal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1249.975,
    "end": 1259.021,
    "text": "We're much more interested in sort of having, you know, mimicking explicit decision processes so that a human can audit them and can make these things work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1259.582,
    "end": 1263.544,
    "text": " So that's kind of like the area that we're sort of coming from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1263.564,
    "end": 1267.285,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1267.626,
    "end": 1267.866,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1267.986,
    "end": 1269.647,
    "text": "I'll go to a question from the chat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1270.087,
    "end": 1272.468,
    "text": "So Josh asks, great talk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1272.848,
    "end": 1276.049,
    "text": "Where does hypothesis relevance enter the calculus?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1276.39,
    "end": 1277.91,
    "text": "Is it folded into confidence?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1278.27,
    "end": 1279.311,
    "text": "Not sure if it ought to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1279.791,
    "end": 1281.932,
    "text": "Just saw hypothesis relevance mentioned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1285.534,
    "end": 1286.654,
    "text": "Hypothesis relevance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1286.994,
    "end": 1287.615,
    "text": "Does that mean...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1289.122,
    "end": 1318.619,
    "text": " like which hypotheses are conditioned on each other is it possible to ask a clarifying question there maybe dan you have a better idea they can follow up but yeah like um i also wondered about this like you might know what was relevant maybe the temperature and the rainfall were relevant but then how does this approach help us understand when one of those relevant factors no longer is relevant or when a new relevant factor comes into play",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1320.859,
    "end": 1322.481,
    "text": " Yeah, these are great questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1323.482,
    "end": 1334.555,
    "text": "So I think in terms of understanding in an automatic sense, when two hypotheses are relevant to each other, we can leverage embedding type language models for this kind of thing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1335.095,
    "end": 1356.836,
    "text": " also um if we don't have a more kind of like structured human intuitive sense for when two hypotheses are are related uh in terms of like how those relationships evolve over time this is something that's really interesting to me and i think looking at the the theory behind structure learning or when we propose to add new nodes to the network",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1357.376,
    "end": 1380.783,
    "text": " or propose to add a new edge to the network or things like this uh is a really exciting research direction um although i i don't have like a silver bullet answer to how we should do that um just to like add a little bit more to that um it is like it is a really interesting research direction um like one of one of the things that phoebe mentioned in the talk is that there is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1381.878,
    "end": 1388.582,
    "text": " a difficult step that we're not talking about, which is actually translating this natural language into reasonable hypotheses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1389.043,
    "end": 1410.416,
    "text": "So there is a step in there where you take essentially a chunk of text and you have to decide if this is a hypothesis, if this is a hypothesis we've seen before, if this is a sub hypothesis or a clarification of a hypothesis that we've seen before and so on and so forth.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1410.797,
    "end": 1411.257,
    "text": "So that's,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1411.977,
    "end": 1414.519,
    "text": " in some sense, part of the data processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1414.559,
    "end": 1421.125,
    "text": "And it is an important step and one that we are sort of continuing to work on and refine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1421.846,
    "end": 1429.533,
    "text": "The other thing, like a different sort of interpretation of the question around relevance is around sort of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1430.897,
    "end": 1451.217,
    "text": " is the hypothesis relevant to the thing that you're looking at i mean we could have a hypothesis that the sky is blue uh but if we are deciding to deciding you know whether whether or not we need to check that cars oil like the the the truth or not of the color of the sky is very irrelevant",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1451.767,
    "end": 1466.226,
    "text": " And that then comes into the nice thing about having your world described as a collection of statements with truth values associated with them in that you can directly reason over them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1466.246,
    "end": 1469.911,
    "text": "So you can put a classical decision framework",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1470.915,
    "end": 1491.955,
    "text": " um over that to take into account both the sort of the knowledge you have of the world and also which parts of these worlds are uh sort of unknown so in that sort of situation the person using the world model to construct a um a a sort of decision or an output will be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1493.397,
    "end": 1522.937,
    "text": " responsible in some sense for assigning a weight or a cost to each hypothesis being true and for some of those hypotheses obviously it will be zero because again we do not care about the color of the sky if all i want to know is if i need to change the oil in my car um so that's the that's the sort of the other end of the answer so there's a version of the answer at the start of the information flow and there's a version of the answer at the end of the information flow but it is a tricky",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1523.922,
    "end": 1530.492,
    "text": " point and one that we are sort of continuing to iterate on to try and find sort of good ways on both ends of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1533.015,
    "end": 1535.018,
    "text": "Yeah, well, a lot there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1537.085,
    "end": 1561.671,
    "text": " It's very interesting how in that presentation and response, I heard both about probability distributions on rules and rules on probability distributions and like which one, whether it's the tail wagging the dog or the horse in the cart, how to design these synthetic intelligence systems that appropriately bring together",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1562.871,
    "end": 1578.846,
    "text": " aspects that are more symbolic more rule-like and then more probabilistic more embedding like so where does that land with you or how do you see the design of these systems with mixed symbolic and probabilistic components",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1580.256,
    "end": 1594.401,
    "text": " Yeah, yeah, that's a great point and I think this really gets it like which parts of the world model should be learned or should be represented in some like more discrete space versus like encoded based on our own human intuition for rules and structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1594.421,
    "end": 1597.642,
    "text": "And I think like maybe this is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1598.703,
    "end": 1602.484,
    "text": "Would be fairly represented as a cop out answer, but I think it depends a lot on the application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1602.504,
    "end": 1607.766,
    "text": "I think like when we're developing systems like this and and just trying to iterate through as many different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1609.639,
    "end": 1626.721,
    "text": " hypotheses as you can quickly, like choosing an application and benchmarking and testing and seeing like what actually works is a go-to strategy for us in terms of like, well, which parts should be fixed and are actually helpful",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1628.864,
    "end": 1640.451,
    "text": " to increase reliability such that we can use our human intuition for how this particular system is built versus like, well, this is something that we want uncertainty over.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1640.551,
    "end": 1646.235,
    "text": "That's like a really important part of the learning process for us in terms of, yeah, that kind of iteration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.875,
    "end": 1649.457,
    "text": "So I think it probably depends on the application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1652.219,
    "end": 1655.08,
    "text": "Yeah, it definitely depends on the application.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1655.16,
    "end": 1655.961,
    "text": "It's also like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1658.127,
    "end": 1672.527,
    "text": " depends on where the actual challenge points are so we've got like outside of this we've got sort of a few other things that we've released publicly that kind of look at this idea of there being",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1674.281,
    "end": 1680.945,
    "text": " external rules to the system and whether or not we can add those in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1681.366,
    "end": 1688.69,
    "text": "So one of them is something called constrained generation, where we sort of force the model to only produce something valid.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1689.51,
    "end": 1695.414,
    "text": "And that's sort of quite a useful way of removing one particular aspect of stress.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1696.218,
    "end": 1707.523,
    "text": " took from the model, which is that it may make sort of syntactically or sort of in somehow incoherent outputs that don't follow the rules.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1708.344,
    "end": 1711.585,
    "text": "And then we can then focus with the rest of our energy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1712.126,
    "end": 1718.929,
    "text": "We can then take that as given and focus with the rest of our energy on improving the bit that we don't have rules for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1720.007,
    "end": 1744.24,
    "text": " um so so those sorts of things and sort of a different version is trying to improve something by saying no you broke a rule we need to like go back and make this not sort of true so this kind of um sort of chain of thought prompting type of idea um so so yeah the uh the symbolic and the probabilistic um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1745.768,
    "end": 1753.073,
    "text": " I think in our minds, we're very closely together as two tools that don't completely solve the same problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1754.554,
    "end": 1768.403,
    "text": "And I think there's sort of in the world of, I'm not sure how familiar anyone in the audience is with language modeling, but like in the world of language modeling before this sort of explosion of neural networks and artificial intelligence type methods,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1769.288,
    "end": 1775.331,
    "text": " There was a lot of work on symbolics of language and grammars and all of that sort of stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1775.471,
    "end": 1777.933,
    "text": "And that work pushed quite a long way forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1779.053,
    "end": 1780.934,
    "text": "And this work is pushing quite a long way forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1780.954,
    "end": 1786.397,
    "text": "And I suspect the next thing is going to involve them joining up again because they each have good points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1786.437,
    "end": 1787.838,
    "text": "They each have bad points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1788.658,
    "end": 1794.481,
    "text": "And, you know, two wrongs don't necessarily make a right, but they can make a less wrong.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1796.027,
    "end": 1796.367,
    "text": " Nice.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1797.088,
    "end": 1797.308,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1797.368,
    "end": 1805.672,
    "text": "Recently we heard from Elliot Murphy and talking about the neuro linguistics and about how the statistics of language are not the rules of language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1806.192,
    "end": 1809.974,
    "text": "You can always come up with a new expression that's never been uttered.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1810.034,
    "end": 1812.876,
    "text": "That's not going to be in the training distribution or any distribution.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1814.056,
    "end": 1814.296,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1814.516,
    "end": 1817.618,
    "text": "I'll ask a question in chat from upcycle club.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1817.718,
    "end": 1824.942,
    "text": "They wrote, what are some of the key challenges associated with developing such Bayesian world models?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1828.436,
    "end": 1829.837,
    "text": " I think we've touched on a bunch of them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1830.337,
    "end": 1835.1,
    "text": "The ones that are most top of mind for me right now are the structure learning thing that came up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.3,
    "end": 1841.103,
    "text": "So how do we understand like when to propose new hypotheses and how to integrate those into the models?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1842.884,
    "end": 1845.465,
    "text": "And then, yeah, just figuring out like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1846.641,
    "end": 1850.363,
    "text": " Yeah, I guess this like proposal and evolution process of the nodes themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1851.384,
    "end": 1856.887,
    "text": "Since everything else, like the framework, like works pretty automatically and in a reasonable way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1857.808,
    "end": 1858.408,
    "text": "Thank you, Bayes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1859.309,
    "end": 1861.17,
    "text": "Thank you to the development of language models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1862.391,
    "end": 1874.578,
    "text": "But kind of moving from this like more discrete case into a continuous case, which like more fully represents the space that we're learning over can be challenging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1876.946,
    "end": 1883.651,
    "text": " Yeah, I would also say that it's a sort of a Maxism that... Maxism?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1883.851,
    "end": 1885.532,
    "text": "What on earth did I just say?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1885.933,
    "end": 1889.455,
    "text": "There's a common saying, let's go in that direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1889.475,
    "end": 1895.54,
    "text": "There's a common saying in this world that sort of no model ever survives its first encounter with data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1896.961,
    "end": 1899.483,
    "text": "And that becomes true here as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1899.583,
    "end": 1899.763,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1900.703,
    "end": 1911.653,
    "text": " there's lots of like, as we've been building these things and using them, we found lots of little spiky edge corners with sort of making sure that the language models are actually doing what we want it to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1912.073,
    "end": 1920.24,
    "text": "So there are a lot of questions in building these things around, how do you actually test that the components of it are actually working the way you want?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1920.82,
    "end": 1928.207,
    "text": "And then on like a broader level, how do you compare something that is fundamentally trying to solve",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1929.315,
    "end": 1933.236,
    "text": " a different problem to other methods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1933.836,
    "end": 1941.278,
    "text": "So we are solving a problem under the constraints that we want a fully auditable system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1942.378,
    "end": 1953.521,
    "text": "We could also solve all of these problems by a thing called in-context learning, which is basically putting the context into the prompt of a large language model and asking it the answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1954.362,
    "end": 1955.522,
    "text": "And that also works.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1957.233,
    "end": 1963.617,
    "text": " especially when you've got things like GPT-4, which are just wonders and glories, it works really well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1964.118,
    "end": 1971.282,
    "text": "So then we come to the question of how do we actually make the case for this from a bigger picture perspective?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1971.362,
    "end": 1984.49,
    "text": "Can it be more than just a... Can we find benchmarks that reflect the structural advantages of this approach over...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1985.476,
    "end": 2006.137,
    "text": " something like in context learning uh that don't come across as false so that's kind of like a a stranger answer because it's not really about like actually developing the world model it's about sort of convincing other people that it's a good idea um and that's you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2007.259,
    "end": 2012.383,
    "text": " That is a thing that is true of essentially all of the things on this slide as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2012.443,
    "end": 2022.59,
    "text": "They are all quite complex and odd little methods that there's a degree to which, well, we definitely can solve this an easier way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2024.929,
    "end": 2037.155,
    "text": " So what is the thing that, what is the application or the benchmark where we can say, no, if you do it the easier way, you will fail at this measurable thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2041.437,
    "end": 2042.498,
    "text": "Very interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2043.298,
    "end": 2048.281,
    "text": "So you mentioned the self-evidencing advantages of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2050.157,
    "end": 2068.576,
    "text": " using world models that are self-evidencing rather than reward maximizing for example so how do you see that playing out and i can connect it back to active inference of course but how do you see this self-evidencing centrality play out in the kinds of models described here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2070.242,
    "end": 2088.944,
    "text": " yeah i think there are a couple reasons why it's so compelling to me uh and the first just has to do with explainability right like it's really convincing to people to say like well why why did we predict this why do we believe this well this is the actual real world data that we've observed such that you know this is the impact that that's had uh and then i think like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2090.274,
    "end": 2105.989,
    "text": " I don't know, you hear a lot about designing these really complicated reward functions, which are often very clever, but which often I feel like are close to being a pitfall because they very easily become disconnected from the complex world that we're trying to model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2106.049,
    "end": 2109.212,
    "text": "And so you end up in weird local maximums or minimums.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2110.859,
    "end": 2117.003,
    "text": " Yeah, you start like just kind of solving the problem that you've designed versus like the problem which actually exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2117.623,
    "end": 2129.27,
    "text": "And so I just have always loved the idea that what we should be doing is kind of self-evidencing and from an intuitive sense that feels like what it feels like what an intelligence system should do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2129.29,
    "end": 2130.871,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2130.891,
    "end": 2136.514,
    "text": "Yeah, I actually don't have anything interesting to add to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2136.594,
    "end": 2137.775,
    "text": "I just agree with Phoebe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2139.884,
    "end": 2146.789,
    "text": " That explainability and the capacity to explicitly reference previous data, including like leave one out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2146.989,
    "end": 2154.175,
    "text": "So techniques from non-parametric statistics about the effect of adding in another piece of data or removing a piece of data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2156.076,
    "end": 2178.554,
    "text": " and then just like to bring it to like a homeostatic setting which is commonly considered an active inference like we're trying to be within a homeostatic temperature range of 37 yes we could propose reward functions but as those start to include open-endedness and exploration structure learning",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2179.455,
    "end": 2200.67,
    "text": " just like you described it, Phoebe, like we're solving the problem as designed rather than the actual question of the homeostatic temperature and the sort of path of least action, first principles, physics grounded, intelligence perspective from active inference is like, make it the kind of thing that measures itself at 37.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2201.491,
    "end": 2203.412,
    "text": "And then as long as it is, it is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2204.073,
    "end": 2205.734,
    "text": "And when it isn't, it's dead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2206.134,
    "end": 2208.316,
    "text": "And that's the kind of mortal computing thing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2209.036,
    "end": 2234.199,
    "text": " crossover which is like outside of its zone of surprise it it's not just that it's getting a bad grade in the class that is like a deeper failure signal than that and to understand okay when is it a yellow flag when is it a red flag in terms of the new scientific literature coming in those have plain",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2236.423,
    "end": 2262.118,
    "text": " straightforward ways to interpret that developing larger higher order apparatuses will never return to that kind of basal simplicity yeah couldn't agree more yeah i mean absolutely it also like the other thing that it can do quite well is deal with",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2266.443,
    "end": 2269.946,
    "text": " essentially outlier studies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2270.206,
    "end": 2284.457,
    "text": "So situations where you have a new piece of information that is strongly conflicting with all the previous pieces of information and trying to sort of work through what that really means.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2286.599,
    "end": 2293.365,
    "text": "And there's a degree to which we can even sort of extend this process",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2294.664,
    "end": 2303.911,
    "text": " to multiple agents that have these belief systems and then look at sort of consensuses of experts or weighted consensus of experts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2304.212,
    "end": 2312.638,
    "text": "So for instance, you could have like a weather vane type of situation where somebody really over indexes to every new piece of information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2313.847,
    "end": 2328.455,
    "text": " um and you would do that with you know technically you do that with maybe a power posterior type thing or you can have somebody who's built in strong priors in a particular direction um and you can then like take your consensus of artificial",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2329.749,
    "end": 2357.286,
    "text": " um sort of decision making all of which has within their universe well-reasoned updates to the data and then you can look and try and work out what that swarm of experts can tell you um and sort of do very empirical things like try and you know work out which of these experts is doing well at a particular moment in time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2358.431,
    "end": 2383.684,
    "text": " um because you know there could be there could be times when the world's very or the problem you're solving is very chaotic in which case the over indexing uh expert would probably be a pretty pretty solid bet um while there are other times where sort of things are pretty stable and you probably it would be possible that the um sort of the more conservative expert is more",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2384.944,
    "end": 2413.472,
    "text": " uh sort of empirically making good decisions and good recommendations so there's like a lot of ways that we can not just like incorporate these sort of homeostasis type ideas but we can also change what that means for different agents and artificial like do that artificially and then combine them together to try and get a almost like a um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2417.423,
    "end": 2426.186,
    "text": " I'm blanking on the word, but a forecast under a hypothetical set of situations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2426.626,
    "end": 2433.429,
    "text": "And we can actually bring those ideas of the world forward and see what happens when they meet with actual information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2436.124,
    "end": 2457.457,
    "text": " Yeah, this angle of mixture of experts, as it's sometimes called more in the language model space or ecosystems of shared intelligence or diverse intelligences in the active inference area, like that's very interesting, obviously has connections back to human teams and teams of beyond humans and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2459.598,
    "end": 2463.62,
    "text": "A lot of this is still text based.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2463.86,
    "end": 2464.041,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2465.194,
    "end": 2469.839,
    "text": " maybe you did or didn't mention what representation the base graphs are but they're",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2471.26,
    "end": 2482.063,
    "text": " plain text like, and there was a lot of discussion about bringing from natural language, scientific papers or however it is, into a structured form.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2482.183,
    "end": 2494.085,
    "text": "And then the explain method that you showed kind of taking the structured form and just giving a little syntactic fluency so it looks human readable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2494.525,
    "end": 2496.506,
    "text": "So how do you see that changing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2497.757,
    "end": 2515.098,
    "text": " essence coming into play with multimodal models and then with action in the world that isn't just developing the next text token but a robotic actuator or modifying some other control element of the world",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2518.154,
    "end": 2519.435,
    "text": " Yeah, that's a really good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2519.455,
    "end": 2532.74,
    "text": "I honestly haven't thought much about multimodal stuff in this particular context, but I think the framework is general enough at this point, such that it definitely could support lots of different modalities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2535.081,
    "end": 2539.142,
    "text": "Yeah, I'd be really curious to see how this did with something like audio in particular.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2539.162,
    "end": 2543.084,
    "text": "Yeah, and then to your point about like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.308,
    "end": 2569.003,
    "text": " uh yeah this maybe like discrete versus continuous um relationship i think i think that's like part of what we're we're learning is how to go from like these long natural text documents to a system which is appropriately discretizing um our hypotheses um such that we we have these like meaningful explanations like you mentioned um so i think yeah i think like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2570.652,
    "end": 2577.938,
    "text": " continuing to develop robust ways of surfacing those explanations is a big part of this as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2577.958,
    "end": 2582.421,
    "text": "Over time, we're going to observe lots and lots and lots of evidence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2583.122,
    "end": 2586.144,
    "text": "How do we make sure hypotheses don't get stale?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.304,
    "end": 2588.446,
    "text": "And how do we use evidence to know when they are?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2588.546,
    "end": 2591.768,
    "text": "And things like this are part of that also.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2591.788,
    "end": 2596.172,
    "text": "I don't know if that directly answered your question, but that's some of the stuff that I've been thinking about related to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2598.513,
    "end": 2599.074,
    "text": "So in the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2600.64,
    "end": 2628.045,
    "text": " I mean, in examples like sort of moving towards robotics and sort of tech video generation and image generation, other sort of audio, other sort of multimodalities, to be honest, I think of these processes in general as enabling, as like building a world model to enable a sort of sequential decision process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2630.871,
    "end": 2637.598,
    "text": " if that decision process happens to be should the robot turn left and that's what the sort of the decision process is it's it's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2638.721,
    "end": 2647.504,
    "text": " multimodal in like a very classical sense that you can put any type of decision framework over the top, but it's not sort of generatively multimodal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2647.584,
    "end": 2654.126,
    "text": "I'm not saying write me a song that sounds like Beyonce and a song that sounds like Beyonce comes out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2654.546,
    "end": 2662.849,
    "text": "I think this sort of Bayesian world model layer is blocking towards that sort of thing, but that's really not",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2663.536,
    "end": 2665.818,
    "text": " sort of the aim of what we're trying to do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2666.018,
    "end": 2685.033,
    "text": "It's also like within normal, like our almost, I don't want to say mantra or manifesto because that sounds culty and no one wants to sound culty, but like our basic aim is to always center like humans within our process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2686.675,
    "end": 2692.78,
    "text": "And so some of this multimodal stuff, it's less clear",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2693.926,
    "end": 2695.427,
    "text": " where the human lives.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2696.308,
    "end": 2700.17,
    "text": "So for instance, like a video generation type thing, where does the human live?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2700.57,
    "end": 2711.957,
    "text": "So keeping it at this abstraction of sequential decision making, then it's a decision that a human could do, you know, a human with their thumbs could be moving like a robot around and doing that sort of stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2713.718,
    "end": 2720.242,
    "text": "But yeah, it's really all about sort of controllability and auditability for us in sort of a sequential decision process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2720.282,
    "end": 2720.422,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2721.981,
    "end": 2730.125,
    "text": " To the extent that that sort of leads in its multimodal world, that's sort of part of what we're doing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2730.185,
    "end": 2736.348,
    "text": "And to some versions of multimodality, we're just not swimming in that particular space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2740.13,
    "end": 2742.151,
    "text": "Not a great answer, but a long one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2745.313,
    "end": 2747.174,
    "text": "Let them distill it down later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2748.712,
    "end": 2769.582,
    "text": " Um, in the auditability area, it almost falls out to me to be like a syntax of auditability and a semantics at the syntactic level, just tagging or versioning when a file comes in or when a given computation is executed, that is basically transfer across all settings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2770.202,
    "end": 2776.125,
    "text": "And then where I see you honing in on with, with this work is kind of the semantic",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2777.256,
    "end": 2806.087,
    "text": " auditability which is actually how we compose our accounts i would have driven but i decided to walk because this happened and so bringing that different kind of trace to to systems is going to make it um what will it open up in science or education or how do you see this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2809.184,
    "end": 2824.524,
    "text": " sitting at a console somebody is at now and making this different like over what timeline yeah i mean it's really quite nice for storytelling because as you said you can say things precisely like well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2826.394,
    "end": 2842.519,
    "text": " know because we observed this thing or because if we had observed something else you know like maybe you can even make statements which are um yeah conditional in that sense uh i think it does like empower whoever is sitting in front of this data to feel like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2843.119,
    "end": 2864.686,
    "text": " really sure about again like that the reasoning engine that like that went on which to me is is pretty different from what it feels like to sit in front of chat gpt even though it's quite useful often you know you you try the code and it works or it doesn't work or you like you know ask your friend is this really true and that feels pretty different to me from being able to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2865.686,
    "end": 2888.7,
    "text": " to look at the evidences themselves and say like oh well actually if this is the reason you think that i know that that evidence is is not true or you know like you can bring your own human intuition or world model uh in terms of validating or um yeah superimposing what you believe on top of what this system believes and that makes it really easy to make decisions um quickly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2891.152,
    "end": 2917.729,
    "text": " think there's also sort of a converse of this which is that it also makes it clear which evidence was not used to make a decision uh and that can be quite telling in these situations where you could be worried that a particular type of evidence isn't being weighted correctly or isn't being um sort of formatted correctly so again like if this is a sort of a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2919.017,
    "end": 2944.535,
    "text": " uh like a system that builds an assistant um that sort of does surfaces all this information and sort of makes a recommendation with reasoning for a person that person can then look and be like and they know what the data is they can look at the deck and say you know why didn't you consider the make of the car or why didn't you consider this or why didn't you consider that and they can then use",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2946.065,
    "end": 2966.805,
    "text": " their understanding of what's not being prominently used by the model to sort of sense test like it's it's sort of i mean in some sense that usage of it is a reformulation of what phoebe just said where you use your internal world model but it's like i think it's it's important to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2968.457,
    "end": 2971.278,
    "text": " know when evidence is being used.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2971.378,
    "end": 2980.061,
    "text": "And this is a thing you simply cannot get from a GPT type thing or any sort of prompting type method.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2980.361,
    "end": 2990.665,
    "text": "We know, for instance, that the order that you submit your evidence in is probably going to matter for a prompting-based method.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2991.761,
    "end": 2992.081,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2992.161,
    "end": 3005.19,
    "text": "That's obviously not true for a Bayesian update where we have this sort of this, this coherence principle, where if you shuffle your data and enter it in a different way, you will get the same posterior up to computational artifacts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3005.971,
    "end": 3015.798,
    "text": "Um, so, so, so all of that is like, in my mind is just as important to audibility as the ability to write a report that says I made this decision for these reasons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3018.939,
    "end": 3041.395,
    "text": " yeah well that makes me think about this kind of view from the inside interpretability where the rules help and also knowing what evidence is not used is important for compliance and knowing what information like in a healthcare setting was or wasn't used um what about thermodynamics we heard about free energy",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3043.322,
    "end": 3044.543,
    "text": " Boltzmann came up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3046.044,
    "end": 3051.228,
    "text": "How do you see the info-thermo nexus?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3052.289,
    "end": 3057.693,
    "text": "What have we learned from the last hundred years of thermodynamics and information theory and all of this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3058.634,
    "end": 3070.243,
    "text": "And on the software or hardware side, how is that kind of a free energy nexus being used?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3073.015,
    "end": 3077.616,
    "text": " Yeah, I mean, I'm really excited about how all of this seems to be coming together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3077.636,
    "end": 3082.838,
    "text": "I think free energy just keeps showing up in all of these exciting areas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3083.018,
    "end": 3087.739,
    "text": "To me, we have a book club for singular learning theory, and they talk all about free energy, too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3087.779,
    "end": 3089.62,
    "text": "And I think some of those ideas are really exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3091.56,
    "end": 3098.185,
    "text": " I mean, at normal, I think like the thing that I would highlight is like this idea of software hardware co-design, which is really special.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3099.106,
    "end": 3109.293,
    "text": "And so we're trying to do this hard and fun dance towards each other where we're like thinking about these new kinds of systems and how they might support each other and empower each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3109.313,
    "end": 3117.099,
    "text": "And and yeah, how to build full stack systems is really challenging and also really exciting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3118.139,
    "end": 3130.005,
    "text": " um yeah and i think like from like a first principles thermodynamics perspective like like we're all just uh yeah we're all kind of like mathematics and physics people at heart so like going",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3130.928,
    "end": 3156.08,
    "text": " taking like uh you know all of what people have learned in language modeling and all of that like um very much to heart as well like i think approaching whatever problem that we're facing from a first principles how do physical systems work in the world what do we really what are the assumptions we're really comfortable with uh and building up from there um is definitely our our natural mode so i think that makes it easier to start working together also",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.38,
    "end": 3180.135,
    "text": " It's also probably worth saying that we have a sort of a secondary, not secondary, a very different stream of interest in thermodynamics as well, which is the ways that we can use actual physical thermodynamical principles to build hardware that is specifically has sort of noise in it as a first class citizen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3180.716,
    "end": 3185.059,
    "text": "And because of that, it is particularly well suited to probabilistic tasks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3186.208,
    "end": 3207.126,
    "text": " um and so we've we've built if you if anyone wants to look we have a blog i believe the url is blog.normalcomputing.ai um and amongst other things that are on it uh there is the very first demonstration of using physical thermodynamic hardware to actually do computations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3208.528,
    "end": 3236.833,
    "text": " um is the computation the most vital computation that we will ever do it's inverting an eight by eight matrix so no we can do that other ways um but it it is sort of building up towards this idea that we can use them and it's not just in our modeling and our understanding of the world but also in our sort of low energy compute stack to actually realize these things um so i think i it's",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3237.722,
    "end": 3248.95,
    "text": " I think it would be challenging to find a group of people on this earth who have more investment in thermodynamics and don't work in a physics department.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3252.252,
    "end": 3261.879,
    "text": "Because we have investment all the way through from sort of active inference type things all the way down to this, like this, this hot thing goes there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3264.138,
    "end": 3264.998,
    "text": " which is kind of cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3265.098,
    "end": 3270.081,
    "text": "I'm not a physicist, so that's my understanding of thermodynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3270.901,
    "end": 3271.822,
    "text": "This hot thing goes there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3273.383,
    "end": 3278.505,
    "text": "Informative thing goes here, hot thing over there, call it a day.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3278.545,
    "end": 3278.786,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3279.906,
    "end": 3281.307,
    "text": "That it's",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3283.129,
    "end": 3309.896,
    "text": " a really cool fusion with the kind of parsimony and elegance and the aesthetic of math and physics and first principles and the different parsimony of pragmatism with the actual material basis like of a synapse the size of the synapse and the kind of stochasticity that that size alone",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3312.068,
    "end": 3335.999,
    "text": " entails with like membranes and all this those stochastic aspects are leveraged for the compute the synapse is not simply a variance reducing machine and so it's like both the platonic slash mathematical ish spirit",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3337.043,
    "end": 3349.704,
    "text": " finds a common home in these real simple physical demonstrations and um today it feels like there's a big gap between the um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3351.602,
    "end": 3373.323,
    "text": " mesoscale computational architectures that you described today that are very much running on the kind of von neumann architecture turing completeness paradigm and yet very tantalizingly close like to a physical object that has a constrained rule",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3374.534,
    "end": 3382.54,
    "text": " de facto, like only one thing can come out of this at a time, as long as the funnel is this wide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3383.721,
    "end": 3399.953,
    "text": "And so bringing the rules and the regularities of what we call physical things to bear with the fundamental and the imposed constraints on informational spaces",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3402.978,
    "end": 3405.74,
    "text": " It's very cool directions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3407.361,
    "end": 3418.549,
    "text": "One other note about just where active inference and action plays a role is, and also you mentioned like the hypothesis going stale or like sort of data being over relied on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3418.569,
    "end": 3427.074,
    "text": "In the proactive stance where we're using expected free energy or something like it to calculate",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3427.995,
    "end": 3445.34,
    "text": " future courses of action over observations that we haven't seen yet moves that haven't been made yet there's an explicit epistemic value and so that can be diagnosed and observed as a measure of where a given",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3446.32,
    "end": 3462.683,
    "text": " computation is on the continuum between purely pragmatic value, just constraint-satisfying and realizing preferences and expectations, and then the pure epistemic value where all outcomes are good and the more information gained, the better,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3463.894,
    "end": 3478.958,
    "text": " And then being able to take control of that balance and know amidst changing situations, again, taking probabilistic or rule-based approach there to when epistemic and pragmatic, like gas and brake, kind of come into play.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3479.398,
    "end": 3489.621,
    "text": "These are very basal control knobs or features in active inference that it's just...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3490.669,
    "end": 3497.674,
    "text": " not going to show up at the 50th layer of scaling is all you need.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3497.695,
    "end": 3501.097,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3502.778,
    "end": 3502.959,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3505.08,
    "end": 3505.461,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3505.621,
    "end": 3514.768,
    "text": "Well, do you have any other like, thoughts or things you want to add or questions or where things are heading for your works?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3518.177,
    "end": 3541.964,
    "text": " nothing to add at this moment but certainly uh excited to keep in touch with this community and yeah collaborating yeah absolutely um and we sort of share i mean we write papers and stuff but we mostly like we share most of what we do uh be it academic in the sort of machine learning space or be it in the um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3542.847,
    "end": 3548.129,
    "text": " sort of the physical hardware space on our blog, which is blog.normalcomputing.ai.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3549.609,
    "end": 3551.97,
    "text": "And yeah, thank you so much for inviting us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3552.05,
    "end": 3553.611,
    "text": "It's been very fun.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3554.611,
    "end": 3554.951,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3555.992,
    "end": 3556.352,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3556.732,
    "end": 3558.153,
    "text": "Hope to speak again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3558.553,
    "end": 3559.693,
    "text": "So peace.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3560.073,
    "end": 3560.293,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3561.314,
    "end": 3561.574,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3561.594,
    "end": 3561.814,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  }
]