[
  {
    "start": 3.49,
    "end": 6.634,
    "text": " Hello everyone, and welcome back to Active Inference Insights.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6.975,
    "end": 12.622,
    "text": "I'm your host, Darius Parvizi-Wayne, and today I feel extremely lucky to be able to interview two exceptional researchers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 13.323,
    "end": 22.936,
    "text": "Dr. Michael Levin is a distinguished professor of biology at Tufts University, serving as director of the Allen Discovery Center at Tufts and the Tufts Center for Regenerative and Developmental Biology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 23.417,
    "end": 29.245,
    "text": "His lab studies anatomical and behavioral decision-making at multiple scales of biological, artificial, and hybrid systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 29.765,
    "end": 37.334,
    "text": " Franz Kuchling is Mike's postdoc at Tufts with a special interest in the physics of life and how cells adapt to changes in their physical environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 38.175,
    "end": 39.377,
    "text": "Guys, welcome to the show.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 39.397,
    "end": 40.338,
    "text": "Thank you so much for joining me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 40.358,
    "end": 41.76,
    "text": "It's an absolute pleasure and an honor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 42.721,
    "end": 49.99,
    "text": "You're kind of, you know, everyone in Active Inference has a foray into theoretical biology, but I would say you guys are the first out and out biologists that we've had on the show.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 50.03,
    "end": 51.932,
    "text": "So I'm super excited to learn.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 53.314,
    "end": 57.679,
    "text": "But you may have to excuse some of my more layman ideas that come from the British schooling system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 58.722,
    "end": 66.595,
    "text": " What I want to decide is probably just putting in some groundwork for the audience who might be unaware of certain terms that get used in the papers that you guys write.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 67.537,
    "end": 69.24,
    "text": "I want to start with morphogenesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 70.822,
    "end": 73.186,
    "text": "What is morphogenesis?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 74.128,
    "end": 79.657,
    "text": "And in what kind of, you talk about morphospace, what is morphospace and how do those two things relate?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 80.779,
    "end": 80.879,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.899,
    "end": 81.861,
    "text": "I don't know who wants to take it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 82.735,
    "end": 85.88,
    "text": " I guess I'll start and then Frans can give his view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.14,
    "end": 87.462,
    "text": "So thanks for having us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.482,
    "end": 91.328,
    "text": "It's a pleasure to be here and to talk to you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 91.348,
    "end": 99.922,
    "text": "There's a fundamental fact of biology, which is that complex shape and functional structure are self-assembled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.322,
    "end": 102.986,
    "text": "So let's just think about embryonic development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.006,
    "end": 110.498,
    "text": "We all start life as a single cell, and eventually that single cell has to give rise to a complex organism of different types.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 110.478,
    "end": 132.823,
    "text": " and so this not only during development but also during regeneration so for example a salamander loses a limb those cells have to not only uh restore the entire structure but then also know to stop when it's done okay and uh there are other examples of this of course metamorphosis so when the caterpillar gets to a butterfly or something like that so there are numerous examples where the biological",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 132.803,
    "end": 136.89,
    "text": " the hardware is basically reconstructing itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 137.351,
    "end": 138.934,
    "text": "And so this is broadly conceived.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.954,
    "end": 140.477,
    "text": "This is the notion of morphogenesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 140.517,
    "end": 151.116,
    "text": "Now, one way to look at this is as a sort of open loop process, meaning that there are a set of rules that are executed in parallel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 151.096,
    "end": 154.722,
    "text": " lots of molecule cells and so on are following these rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 154.782,
    "end": 159.149,
    "text": "And then there's a process of emergence and something complex comes out the other end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 159.17,
    "end": 164.418,
    "text": "You know, this is the standard story of cellular automata or other ways to think about emergent complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 164.799,
    "end": 166.402,
    "text": "And that's true.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 166.422,
    "end": 167.443,
    "text": "I mean, that does happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 167.503,
    "end": 168.886,
    "text": "And then certainly part of the story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.926,
    "end": 170.809,
    "text": "But the more interesting part of the story",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 170.789,
    "end": 187.718,
    "text": " is that morphogenesis, whether developmental, regenerative, or in the context of cancer suppression or remodeling or any of those kinds of examples, one of the amazing things that it can do is get to its target morphology despite various perturbations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 188.119,
    "end": 191.565,
    "text": "So if you want to dig in, I can give you all kinds of interesting examples where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.545,
    "end": 201.662,
    "text": " Not only the environment changes, not only injury, but actually the components themselves, the amount of DNA, the type of DNA, the number of cells, the size of cells, all of these things can change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 202.243,
    "end": 207.772,
    "text": "And certain morphogenetic systems are amazing at getting where they're going despite all of these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 208.073,
    "end": 214.664,
    "text": "In fact, they will often take novel paths to do it, which is William James's definition of intelligence, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 214.704,
    "end": 216.507,
    "text": "Same goal by different means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 216.487,
    "end": 223.481,
    "text": " So then the question is, what conceptual tools can we bring to bear to understand this process?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 224.083,
    "end": 234.023,
    "text": "And what we have settled on, or at least what we've been pursuing for the last some years, is this idea of navigation, that what's actually happening here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 234.003,
    "end": 235.926,
    "text": " is that you have a collective intelligence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.006,
    "end": 242.054,
    "text": "It's basically a set of processes hierarchically organized from molecules to cells to tissues and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 242.475,
    "end": 246.08,
    "text": "And what they're all doing is navigating the space of all possible outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 246.44,
    "end": 253.129,
    "text": "So there's a huge space of diverse morphologies that they can achieve.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 253.73,
    "end": 258.877,
    "text": "And what they're doing is like any agent navigating its environment, they are trying to get to where they're going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 259.198,
    "end": 262.963,
    "text": "And sometimes they have interesting competencies to do it, even when things go wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.943,
    "end": 277.956,
    "text": " So now we can bring to bear all of the tools of behavior science of, of, uh, control theory, all this, you know, cybernetics, all this stuff that's used to design, um, autonomous vehicles, you know, all of these kinds of things to ask, how does the system know where it is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 278.237,
    "end": 279.698,
    "text": "How does it remember where it's going?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 279.898,
    "end": 281.9,
    "text": "And, uh, what competencies does it have to get there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 282.0,
    "end": 291.128,
    "text": "So that's, that's, that's why we use the notion of more for space because it allows us to make testable specific hypotheses about the policies that, that are involved in this process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 291.547,
    "end": 291.907,
    "text": " Wonderful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 292.028,
    "end": 295.491,
    "text": "That's a really nice background from which we can kind of explore these ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 295.551,
    "end": 304.681,
    "text": "Yeah, it seems, when you put it that way, very consonant with the ideas of active inference, which is obviously something that you guys have written about before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 304.741,
    "end": 306.183,
    "text": "So Franz, maybe I'll come to you now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 308.085,
    "end": 319.377,
    "text": "There's this idea in these, so people think of priors in sort of statistical space or more broadly about the organism as a whole, you know, what are the priors of the organism to be well fed, to eat and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 319.795,
    "end": 328.591,
    "text": " But we could also talk about a cell's prior and a cell's posterior and Bayesian unfolding, Bayesian processes within the cell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 329.253,
    "end": 335.845,
    "text": "In this idea of navigation and self-organization, what would you say the cell's prior is?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 336.286,
    "end": 340.133,
    "text": "Is it purely to reach a kind of target morphology or is there anything more than that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 341.53,
    "end": 353.143,
    "text": " I would say there's a lot more than that, but that's the simplest to kind of formulate because more of a space, like Mike was explaining, is something that we have much more access to as a developmental biologist, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 353.183,
    "end": 366.458,
    "text": "So the challenge is you can formulate all kinds of priors and belief expectations for a cell, but if you have no way to estimating how that's even being achieved, then that's hard to really put in any theory that's experimentally accessible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 366.826,
    "end": 381.601,
    "text": " But for one thing, kind of to point out that the idea of a morpher space or cells navigating spaces is only challenging for people that are not involved in this field because we are so used to spatial dimension as that being the space, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 381.621,
    "end": 385.465,
    "text": "But you can have all kinds of dimensions to a cell and we do this for humans all the time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 386.166,
    "end": 393.053,
    "text": "The idea of characters in the plot being multidimensional is something that is very much applicable to cells as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 393.286,
    "end": 404.707,
    "text": " To answer your question more succinctly, so what happens in terms of expectations of a cell it might have, you have to really go into what is it constantly achieving that has any relevance for future states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 405.248,
    "end": 410.518,
    "text": "So a lot of this can be transcriptional states, so what kind of genes are being expressed at any point in time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 410.684,
    "end": 425.149,
    "text": " And that is being informed not just by the structure of the DNA, so by millions of years of evolution, it's also being informed by past events, not just in that individual cell, but in its parent cells and going on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 425.169,
    "end": 426.972,
    "text": "So that's what we call the epigenetic landscape.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 427.052,
    "end": 435.747,
    "text": "So which genes are actually even accessible for the transcription machinery and which genes are being activated to really transcribe and make certain proteins down the line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 436.3,
    "end": 443.965,
    "text": " And so that really is something where a lot of the prior expectations are going into that we at least now in the lab are really investigating of.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 444.316,
    "end": 458.097,
    "text": " what kind of prescription profiles do we see, but then also in terms of its transmembrane potential, you know, in the lab that studies bioelectric potentials a lot, that's something that, of course, for neuroscience is much more familiar.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 458.117,
    "end": 459.759,
    "text": "We talk a lot about action potentials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 459.859,
    "end": 469.834,
    "text": "We don't have those in non-neuronal cells, but every cell has a memory potential, electric potential, and those are informative and they are causing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.814,
    "end": 478.79,
    "text": " a lot of downstream events that we can get more down to and online, but that's part of what I think is part of the prior belief and expectations that a cell is constantly having.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 479.852,
    "end": 480.232,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 480.252,
    "end": 480.873,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 481.034,
    "end": 491.292,
    "text": "I think there's a really important point there, which is kind of something that I noticed reading your papers, which is that morphogenesis, the very idea of physical space seems to be prioritized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 492.614,
    "end": 494.978,
    "text": "It's self-organization in space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 495.616,
    "end": 505.913,
    "text": " Is that the only way, just in terms of conceptualization, is that the only way that we could think of a cell reaching a posterior that aligns with its prior?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 506.094,
    "end": 509.66,
    "text": "Does it have to be in accordance with some kind of self-organization in space?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 510.301,
    "end": 514.688,
    "text": "Or is there another way that a cell could kind of reach a homeostatic set point?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 516.305,
    "end": 517.046,
    "text": " Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 517.066,
    "end": 519.309,
    "text": "It doesn't have to be just space, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 519.369,
    "end": 531.244,
    "text": "So even if you have a cell just somewhere in the body already differentiated, already kind of has its type of morphology achieved, it has to maintain that morphology, first of all, but then also it has to perform a certain function, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 531.264,
    "end": 536.731,
    "text": "Your kidney cells, your liver cells, they have very different functions, even though they're all fixed in space and physical space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 537.512,
    "end": 545.822,
    "text": "So prior beliefs are, you know, in this case, for example, for a kidney cell is what kind of changes in the blood am I being exposed to?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 546.207,
    "end": 547.509,
    "text": " parts in the liver, same thing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 547.809,
    "end": 550.652,
    "text": "If you have cells in the brain, it's different.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 550.933,
    "end": 552.795,
    "text": "I have expectations about action potentials.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.616,
    "end": 560.023,
    "text": "So that space and again, more space isn't just spatial dimension, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 560.744,
    "end": 563.788,
    "text": "It's also traversing because every cell in your body is an important point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 563.828,
    "end": 567.372,
    "text": "Every cell in your body has exact same DNA, more or less, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 567.672,
    "end": 571.396,
    "text": " But what's actually being expressed, that's the difference between all of them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 571.516,
    "end": 576.661,
    "text": "So they are vastly different in the actual proteins, but also in the genes that are being expressed constantly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 577.102,
    "end": 589.294,
    "text": "So when we say traversing and navigating the amorphous space, we really talk a lot, not just about that physical space, but how are they changing, which genes are being expressed, which genes are being turned on and off, which really makes the cell identity in the end.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 590.095,
    "end": 590.636,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 590.936,
    "end": 592.077,
    "text": "Yeah, that's absolutely",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 592.58,
    "end": 595.563,
    "text": " really, really useful to integrate function and space there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 595.583,
    "end": 610.858,
    "text": "And I guess those two, they, they feel to me inextricable, but actually perhaps I'm wrong there, Mike, is it how, so, so reading kind of the active inference account of morphogenesis, we talk about the external states of the Markov blanket for a cell being other cells.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 611.819,
    "end": 619.887,
    "text": "And in the case of developmental processes, it turns, they end up being other specific type of cells that they then joined together with in morpho space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 620.862,
    "end": 630.42,
    "text": " How necessary is the presence of specific other cells in the Bayesian unfolding for a particular cell?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 631.101,
    "end": 640.018,
    "text": "Or could you imagine that a cell's prior might be confirmed absent a specific collection of external cells?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 640.302,
    "end": 641.063,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 641.083,
    "end": 656.687,
    "text": "I mean, this is a great question and it's part of a very emerging research program because it really isn't super clear yet what precisely cells are paying attention to and what their internal models of the outside world are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 656.747,
    "end": 661.034,
    "text": "What we do know is that in, for example, let's just take early development.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 661.054,
    "end": 662.496,
    "text": "So you have a blastoderm and there are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 662.476,
    "end": 664.421,
    "text": " I don't know, 50,000 cells there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 664.823,
    "end": 671.281,
    "text": "And at some point, we as external observers will look at that and we'll say, well, there's an embryo, there's one embryo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 671.301,
    "end": 672.805,
    "text": "Well, what is there one of, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 672.925,
    "end": 677.498,
    "text": "And if you wanna think about an embryo, the thing you're really counting when you say one is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 677.478,
    "end": 683.228,
    "text": " you're counting the fact that all of the cells have bought into the same picture of the outside world and what their goal is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 683.609,
    "end": 686.754,
    "text": "So they are all going to cooperate to build a particular thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 686.774,
    "end": 696.111,
    "text": "What binds them together into being one larger scale emergent individual is commitment to a particular model of where they...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 696.091,
    "end": 721.71,
    "text": " where they belong where the boundary is between them and and some other embryo because you can you can make by putting in little little scratches into that blastoderm you can make twins triplets you know there are multiple individuals that can come from that blastoderm so every cell has to be part of some in that scenario has to be part of some network and that network has to make decisions about where it ends and where the outside world begins because that has to do with size control and and you know left right asymmetry and all kinds of things so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 721.69,
    "end": 730.789,
    "text": " it's really critical to understand what exactly the cells are paying attention to, what exactly the tissue is paying attention to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 730.809,
    "end": 735.76,
    "text": "So the cell network, because I actually think that there are agents here at every level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.08,
    "end": 739.227,
    "text": "So even actually, even to take a step back,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 739.207,
    "end": 741.49,
    "text": " even molecular networks within cells.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 741.53,
    "end": 751.823,
    "text": "I don't even think you have to get to the level of a cell before you can start talking about beliefs and expectations and so on, because as we see, even gene regulatory networks can learn from experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.984,
    "end": 756.71,
    "text": "They can do something like five or six different kinds of learning, including Pavlovian conditioning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 757.13,
    "end": 766.142,
    "text": "And so you can ask that question about what does the world look like from the perspective of a gene regulatory network before it's been trained or after it's been trained and so on, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 766.122,
    "end": 769.546,
    "text": " So this is all, of course, very, very active areas of investigation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 769.646,
    "end": 771.147,
    "text": "So so we don't know all the answers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 771.188,
    "end": 779.056,
    "text": "But but I think I think it's very important to start taking the perspective of the things that we are modeling and asking, what do they see and what are they measuring?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 779.076,
    "end": 780.137,
    "text": "What are they paying attention to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 780.157,
    "end": 788.466,
    "text": "How do they remap information into salient compressions for them, you know, and how that affects decision making and so on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 789.608,
    "end": 793.632,
    "text": "How does that then integrate with a kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 793.848,
    "end": 795.99,
    "text": " idea of telos or teleonomy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 796.931,
    "end": 809.185,
    "text": "Because you know, the way if we take the perspective of a cell, or a collection of cells that are parametricizing beliefs over external states, it sounds purposive, it sounds like, as you say, there's agency there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 809.885,
    "end": 813.73,
    "text": "And even the word beliefs people associate with propositional philosophical beliefs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 815.471,
    "end": 818.775,
    "text": "How far should we take that metaphor literally?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 819.633,
    "end": 820.976,
    "text": " Well, okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 820.996,
    "end": 825.706,
    "text": "So, so the first thing I would say about that is just this kind of a ground ground rules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 826.207,
    "end": 829.754,
    "text": "I don't believe in the dichotomy of literally versus metaphorically.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 830.115,
    "end": 830.255,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 830.275,
    "end": 837.27,
    "text": "I think all we have in science is metaphor and, and, and what, what, you know, when people talk about molecular pathways,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 837.25,
    "end": 838.734,
    "text": " I mean, talk about a metaphor, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 838.754,
    "end": 840.76,
    "text": "The pathway relative to what's actually going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.78,
    "end": 842.264,
    "text": "I mean, this is completely metaphorical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 842.324,
    "end": 844.049,
    "text": "So all of these things are metaphors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 844.089,
    "end": 849.424,
    "text": "The real question, of course, is what set of tools does that metaphor give you to make progress?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.484,
    "end": 850.567,
    "text": "What does it help you discover?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 850.607,
    "end": 852.272,
    "text": "What does it facilitate?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 852.252,
    "end": 863.883,
    "text": " So to me, all of this gets settled empirically to the point that if you have a particular metaphor, so maybe you talk about cells as having beliefs or maybe you don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 864.164,
    "end": 867.713,
    "text": "And the real question is, what does that worldview allow you to do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 867.693,
    "end": 869.236,
    "text": " I think that's the final judge of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.276,
    "end": 875.349,
    "text": "I don't really put a lot of weight into sort of philosophical pre-commitments about what goals and beliefs have to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 875.409,
    "end": 877.654,
    "text": "It's a question of portability of tools.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 878.135,
    "end": 884.368,
    "text": "So now having said that, so I think that these kind of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.348,
    "end": 907.639,
    "text": " uh these kind of tools are extremely useful and they're again not binary because even even as early as the 40s already uh wiener rosenbluth and bigelow gave us a um kind of a scale of different types of different goals of different complexity right so it's a very simple kinds of passive matter and then active matter and then their homeostatic various kinds of homeostats and second order metacognition and so you can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 907.619,
    "end": 908.8,
    "text": " You can sort of go up and up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 909.061,
    "end": 913.526,
    "text": "And it's an empirical question, which of these are the most useful for any of the contexts that you study?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 913.786,
    "end": 921.055,
    "text": "But I think it is absolutely reasonable to see all of these things as having some position on that scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 921.435,
    "end": 929.104,
    "text": "And it's important to say that back before, I don't know, let's say before the 30s and 40s,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 929.084,
    "end": 936.636,
    "text": " The problem with teleology was that we didn't have a way of thinking about machines with goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.218,
    "end": 943.487,
    "text": "Most people would assume that humans have goals, but other than that, we really had no idea how to cash that out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 943.627,
    "end": 946.952,
    "text": "But it's really critical to say that we're past that now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.192,
    "end": 952.08,
    "text": "We have a good rigorous science of what it means for mechanisms to have goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.18,
    "end": 952.521,
    "text": "It's fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 952.541,
    "end": 953.502,
    "text": "It's not magical anymore.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 953.562,
    "end": 956.627,
    "text": "We don't have to be afraid of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.607,
    "end": 961.675,
    "text": " And so I guess the last thing I want to say is the difference between teleology and teleonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 962.256,
    "end": 968.928,
    "text": "So one definition of teleonomy is apparent goal directedness, apparent teleology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.508,
    "end": 974.917,
    "text": "And a lot of times people use that as a hedge, as a way of softening the concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 974.978,
    "end": 976.66,
    "text": "They say, well, look, it's not real teleology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 976.68,
    "end": 978.123,
    "text": "It just looks like teleology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.403,
    "end": 981.248,
    "text": "And that's a way so we don't have to really",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.228,
    "end": 984.733,
    "text": " commit to be, to being teleologists, we're just gonna say, it just looks that way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 985.073,
    "end": 990.26,
    "text": "So, so I like the word teleonomy, but for the opposite reason, I, I am not trying to soften the concept.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 990.38,
    "end": 996.969,
    "text": "I, I, I'm, you know, not in, in, in no way, um, kind of, uh, hesitant about using teleology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 997.009,
    "end": 998.151,
    "text": "I think it absolutely works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 998.451,
    "end": 1003.658,
    "text": "What I think is, uh, useful about the concept of teleonomy is that by putting the word apparent in there,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1003.638,
    "end": 1008.102,
    "text": " What it does is it focuses on an observer's point of view, apparent to whom.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1008.462,
    "end": 1021.954,
    "text": "And I think that is a really critical question to ask in almost all of the stuff that we talk about here, which is not some sort of objective, universal truth about these things, but from the perspective of some particular observer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.995,
    "end": 1023.376,
    "text": "Now, that might be a human scientist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.416,
    "end": 1024.457,
    "text": "That might be a parasite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1024.697,
    "end": 1026.779,
    "text": "That might be a subcomponent of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1026.799,
    "end": 1029.461,
    "text": "That might be some sort of superset of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1029.481,
    "end": 1031.103,
    "text": "That might be the system itself, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1031.123,
    "end": 1033.645,
    "text": "We all, you know, systems observe themselves too.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1033.625,
    "end": 1046.066,
    "text": " And so what that says is that there is some perspective from which the system acts as a goal-directed agent, and then can be used with tools that belong to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1047.569,
    "end": 1051.917,
    "text": "So that's what I think is the most useful term of the sense of teleonomy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.838,
    "end": 1055.683,
    "text": "Franz, I was wondering what you thought about this, because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1056.423,
    "end": 1070.583,
    "text": " I think it's a natural inclination, maybe it's a romantic fiction that we want to ascribe some telos to smaller, let's say, or less complex entities like cells or processes within cells.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1071.384,
    "end": 1076.611,
    "text": "There's an interesting thing that Mike said that I wanted to pick up on, which is that basically everything in science is a metaphor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1077.352,
    "end": 1085.704,
    "text": "I guess where I might slightly push back on that is the science of lived experience and phenomenology, which we can't help...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1086.14,
    "end": 1112.721,
    "text": " we have to take in some ways literally because it's the one thing that we're intimately aware of and there's a lovely paper by Anthony Jack and Andreas Ropestoff ages ago 2002 I think where they argue that basically you can take sort of every psychological construct and say well every the way that we you know coalesce on what attention means or memory means really is because of what we how we experience it so I was wondering whether there's a kind of uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1112.971,
    "end": 1140.514,
    "text": " tie there i mean or an association between when we talk about ourselves beliefs ourselves attention ourselves memory is there any way we can think of that without bringing in our own phenomenal experience it's tough i mean um like especially initially when i earlier in my in my research when i you know wasn't as deep into a lot of the the metaphysics behind it and all that i tried to really avoid it and i tried to really focus the my audience on on just the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1140.815,
    "end": 1144.18,
    "text": " mechanical aspects, mechanistic aspects, the cellular aspects.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1144.801,
    "end": 1150.189,
    "text": "But I found that it was almost impossible to do that because all the words we use are so loaded with everything we have from psychology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1151.712,
    "end": 1161.827,
    "text": "But that being said, nowadays, I think really the important part is to do that transversion, that transversing those two fields.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1162.043,
    "end": 1170.211,
    "text": " in both ways, because the claim we're making, I think, is not that like a cell is doing the same thing on the same level, on the same scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1170.231,
    "end": 1174.755,
    "text": "Like, you know, Mike really mentioned, right, there's a certain gradient there as a human being.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1175.335,
    "end": 1187.967,
    "text": "But we're trying to understand where the origin of all these phenomena are coming from and are there, and more importantly, are the fundamental principles shared between a cell and a more classical act of differentiation like a human being.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1188.728,
    "end": 1190.329,
    "text": "So things like beliefs, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1190.95,
    "end": 1195.758,
    "text": " When you say that it's always a belief, people are like, oh, well, you're talking about having religious beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1196.118,
    "end": 1199.604,
    "text": "And then you get really fastly trapped into these loopholes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1199.624,
    "end": 1203.971,
    "text": "But nowadays, I try to counter this argument by saying, well, what is a belief?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1204.011,
    "end": 1204.933,
    "text": "And where does it come from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1204.953,
    "end": 1209.36,
    "text": "A human being has to come from certain expectations, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1209.4,
    "end": 1213.026,
    "text": "So you really have to then go down to how do you, once you have to define it, you have",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1216.313,
    "end": 1217.535,
    "text": " have to develop it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1217.676,
    "end": 1221.644,
    "text": "And so active inference is nice because there you have very precise definitions of what a belief actually is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1222.445,
    "end": 1238.136,
    "text": "And so once the kind of trick you can do is can people also, okay, let's talk about active inference, human being, you make a certain process, you know, you have a general model, general process, you define the Markov blanket, so separation between what's outside that you can't see, and then yourself, so an internal state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1238.386,
    "end": 1242.651,
    "text": " And then you have the separation of those two by the active and sensory inputs you can get.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1243.192,
    "end": 1250.942,
    "text": "You have sensory inputs and then you can act upon the environment to change what those sensory inputs, your eyes, your ears, are perceiving over time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1251.422,
    "end": 1252.984,
    "text": "That's actually what agency really is about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1253.004,
    "end": 1254.206,
    "text": "It's about controlling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1254.246,
    "end": 1256.649,
    "text": "You can't really control the environment if you can't perceive it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1257.029,
    "end": 1259.472,
    "text": "What you're actually controlling is how you perceive the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1259.813,
    "end": 1262.056,
    "text": "But of course, you're doing that by acting on the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1262.076,
    "end": 1263.077,
    "text": "That's what agency is.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.479,
    "end": 1263.799,
    "text": " Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1263.839,
    "end": 1274.133,
    "text": "Now, once you put it in such a formative framework, then I think transferring that to sales becomes much more, much more easier and much less controversial, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1274.153,
    "end": 1280.842,
    "text": "Yeah, I sense that that sort of less philosophically laden, more deflationary account of agency is definitely possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1281.102,
    "end": 1287.19,
    "text": "It's just control in line with prior expectations or, you know, self-organized principles of self-organization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1287.851,
    "end": 1288.592,
    "text": "I think one thing that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1288.994,
    "end": 1293.56,
    "text": " perhaps at active inference also hasn't got very clear on, but certainly isn't clear in psychology, is selfhood.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1294.481,
    "end": 1304.733,
    "text": "And in some ways, I feel like it's very fundamental to this question of morphogenesis and self-organization in biological space, because it's morphogenesis for who, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1304.753,
    "end": 1311.762,
    "text": "So, Mike, you sort of noted that in many ways, well, we're talking about that we have, it's all observer-relative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1312.231,
    "end": 1319.3,
    "text": " But also in some ways, it's also internal relative because they are self-organizing for the sake of their own integrity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1320.482,
    "end": 1327.611,
    "text": "So, well, again, that might be ascribing a telos that's unwarranted, but it could be described like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1329.454,
    "end": 1332.258,
    "text": "What is biological selfhood?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1333.479,
    "end": 1340.128,
    "text": "And I guess for people who think of the self as one monolithic thing, how does it",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1340.699,
    "end": 1347.469,
    "text": " How can it be distinguished from more complex forms of selfhood, like metacognitive selfhood or epistemic selfhood and so on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1348.775,
    "end": 1349.578,
    "text": "Um...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1349.761,
    "end": 1362.977,
    "text": " I think that the issue of morphogenesis for whom is actually really important because a really defective frog embryo might be a very nice zebrafish embryo.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1363.358,
    "end": 1374.952,
    "text": "And so this whole notion of mutation and just in general evolutionary change and what exactly is a birth defect is really important and interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1375.012,
    "end": 1376.634,
    "text": "Chemistry doesn't make mistakes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1376.654,
    "end": 1379.177,
    "text": "So there's no such thing as a mistake in chemistry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1379.157,
    "end": 1385.262,
    "text": " But there is potentially a mistake in carrying out developmental biology, depending on what perspective you're looking at.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.302,
    "end": 1390.807,
    "text": "So it's something very interesting is, you know, the ability to make mistakes is a hallmark of a cognitive system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1390.847,
    "end": 1395.151,
    "text": "Because because that suggests that you had certain expectations that were not met and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.171,
    "end": 1398.094,
    "text": "So just the very nature of a birth defect is interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.594,
    "end": 1404.139,
    "text": "So now now the notion of a self, of course, there are many ways to think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1404.199,
    "end": 1407.662,
    "text": "I'll give you what how I've been thinking about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1407.642,
    "end": 1422.048,
    "text": " One of the things that I really wanted to do early on is to come up with a framework to directly think about and compare agents of very diverse structure and provenance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1422.088,
    "end": 1426.476,
    "text": "So we're talking about conventional beings like us and animals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1426.536,
    "end": 1429.422,
    "text": "I mean, those are also, of course, collective intelligences, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1429.442,
    "end": 1430.764,
    "text": "We're all made of cells and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1430.744,
    "end": 1444.023,
    "text": " but also new synthetic things that are going to be created, robots, AI, hybrids, cyborgs, all kinds of mixed things, potential exobiological life and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1444.043,
    "end": 1445.365,
    "text": "What do they all have in common?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1445.585,
    "end": 1452.094,
    "text": "What do all agents have in common, no matter how they're made and no matter how they got here, what their origin story is?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1452.074,
    "end": 1457.467,
    "text": " So what I settled on, and so now you see, I'm super into the whole teleology thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1457.688,
    "end": 1462.52,
    "text": "So what I settled on is this notion of the size of their goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1462.981,
    "end": 1469.678,
    "text": "In other words, I define this notion of a cognitive light cone, which is, it's not the distance that you can sense or act.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1469.658,
    "end": 1472.362,
    "text": " It's the size of the goals that you're able to maintain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1472.382,
    "end": 1476.008,
    "text": "The biggest goal that you could possibly maintain is the size of your cognitive light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1476.269,
    "end": 1487.286,
    "text": "So, you know, so, so every, every agent has some degree of memory going backwards, maybe large, maybe small, some predictive of power forward and some spatial area of concern over which its goals play out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1487.967,
    "end": 1488.949,
    "text": "And, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1488.929,
    "end": 1496.306,
    "text": " And so so now now the thing about that is that that is the determination of a cognitive light cone by an observer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1496.627,
    "end": 1499.493,
    "text": "For example, here you as a scientist are given a new system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.513,
    "end": 1505.487,
    "text": "You don't really know how it works and you want to do some behavioral experiments and you find out that here are the things that it can possibly care about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1505.467,
    "end": 1509.893,
    "text": " That that is a third person investigation of its agency.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1509.953,
    "end": 1511.075,
    "text": "And we say this is an agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1511.916,
    "end": 1517.163,
    "text": "What I think of as a useful definition of the self is exactly that process in first person.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1517.543,
    "end": 1521.649,
    "text": "So a self is what how that process plays out for the system itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1521.969,
    "end": 1528.538,
    "text": "So the system itself also has to be able to coarse grain the outside world and not only tell agential stories about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1528.518,
    "end": 1530.883,
    "text": " things in its environment that do things, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1530.903,
    "end": 1533.588,
    "text": "Because no system can afford to track microstates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.029,
    "end": 1539.139,
    "text": "Laplace's demon isn't going to, you'll be eaten and dead long before you calculate anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.259,
    "end": 1544.67,
    "text": "So every agent in the real world has to coarse grain and they tell these stories about",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1544.65,
    "end": 1547.115,
    "text": " you know, agents, other agents doing things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.616,
    "end": 1550.743,
    "text": "But you also have to tell that story about yourself to some extent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1550.763,
    "end": 1559.14,
    "text": "You can't avoid it because if you don't have a compact self model, you are not going to be very good at controlling your own parts and making things happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.2,
    "end": 1559.702,
    "text": "It's just right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.742,
    "end": 1561.866,
    "text": "That's part of being effective in the real world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1561.846,
    "end": 1570.776,
    "text": " And so I think what we mean when we say self is the internal first person view of a system about its own.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1571.336,
    "end": 1575.14,
    "text": "So there's kind of a bundle of things you need to have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1575.201,
    "end": 1579.745,
    "text": "You need to have a sense of boundary between you and the outside world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1580.006,
    "end": 1583.429,
    "text": "So which are the things that I think are actually me versus not me?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1583.449,
    "end": 1587.634,
    "text": "You need to have some representation of some space that you think you're operating in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1587.614,
    "end": 1590.76,
    "text": " You need to have some sense of your own sensors and effectors.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1590.84,
    "end": 1592.082,
    "text": "What can I actually do?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.142,
    "end": 1593.144,
    "text": "What am I actually sensing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.164,
    "end": 1594.246,
    "text": "And so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1594.266,
    "end": 1601.559,
    "text": "We, as third person observer scientists, try to tell those stories about other things that we work with, but agents tell them about themselves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.82,
    "end": 1607.911,
    "text": "And so do parasites and conspecifics and various potential mates and prey and cheaters and all of these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1608.171,
    "end": 1609.774,
    "text": "Everybody's hacking everybody else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1609.754,
    "end": 1618.316,
    "text": " And in order to hack other agents, to hack yourself and your own parts, to have control over your own parts requires that sense of selfhood.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1618.336,
    "end": 1624.03,
    "text": "And it might be, as Francis said, the point isn't to say that every rock has human level hopes and dreams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.05,
    "end": 1624.692,
    "text": "That isn't the point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1624.712,
    "end": 1626.396,
    "text": "The point is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1626.376,
    "end": 1633.269,
    "text": " There's a huge range in how much processing is, how much sort of meta processing is done about all of this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1633.55,
    "end": 1645.192,
    "text": "You can roll all this forward in a very kind of minimal way, or you can have all kinds of loops where you're actually monitoring your own progress on certain goals and you have the ability to change your goals and to pick new goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1645.312,
    "end": 1648.418,
    "text": "I mean, you can layer stuff on and on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1649.798,
    "end": 1651.1,
    "text": " That's yeah, that's really great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1651.22,
    "end": 1652.902,
    "text": "That's a really lovely explanation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1652.962,
    "end": 1653.383,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1653.403,
    "end": 1660.973,
    "text": "It really deeply aligns with the way that I think about selfhood, which is fundamentally from a sort of Metzingerian, um, phenomenal self-modeling aspect.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1661.013,
    "end": 1670.345,
    "text": "And that's exactly what Thomas would say, which is that self-modeling is the capacity to recapitulate or re simulate the actual data structures of your own body in a kind of coarse grain space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1671.206,
    "end": 1679.637,
    "text": "So it's, you know, the one thing that came to mind is talking about the cognitive light cone is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1679.802,
    "end": 1683.848,
    "text": " in terms of the extent of your goal, yes, it's in space, but it's also in time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1684.889,
    "end": 1686.471,
    "text": "And that feels like a very relevant thing here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1687.152,
    "end": 1708.122,
    "text": "When I've spoken to Carl, and when I've seen the direction of active inference, it's very much going in time to in, you know, the direction of temporal planning, deep temporal planning, which arguably relates to the depth of your generative hierarchy, because the deeper your generative hierarchy, you know, the highest level is going to be tracking the most invariant and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1708.574,
    "end": 1711.278,
    "text": " long term fluctuations in the external environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1712.179,
    "end": 1715.504,
    "text": "So friends, I'm just curious if you're, I mean, this is just a thought experiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1716.325,
    "end": 1735.552,
    "text": "Is there a way where perhaps if you have a cyborg or tadpole, or you know, some entity that you're examining, and you're trying to get to the its cognitive infrastructure is looking, I don't know whether this would be behaviorally or anatomically is looking at its capacity for planning, which might well just be it's the depth of its generative hierarchy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1735.572,
    "end": 1737.855,
    "text": "Does that give us an insight into its actual",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1738.392,
    "end": 1743.058,
    "text": " know, existential or experiential life?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1744.78,
    "end": 1745.341,
    "text": "I think it does.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1745.401,
    "end": 1751.649,
    "text": "And it relates back to the, your question about what are its actual beliefs, you know, what, on what level are, are its beliefs being expressed?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1751.729,
    "end": 1753.351,
    "text": "And so I just gave you a couple examples.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1753.391,
    "end": 1757.696,
    "text": "What I've left out is, you know, that of course, like you just said, what's important is the hierarchy of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1757.736,
    "end": 1763.944,
    "text": "How are these different, different beliefs organized in a certain hierarchy of, of spatial and temporal scale?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1764.683,
    "end": 1769.649,
    "text": " And also to, I really like the point Mike made earlier about chemistry not making mistakes, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1769.709,
    "end": 1776.819,
    "text": "So what that means is the conclusion of that idea is that any purely chemical system is not going to change much.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1776.859,
    "end": 1778.321,
    "text": "It's going to be highly predictable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1778.781,
    "end": 1780.704,
    "text": "It's not going to push back on anything in the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1780.744,
    "end": 1785.37,
    "text": "It's just going to have a certain, it's going to come to an equilibrium pretty fast usually, and then that's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1786.051,
    "end": 1794.201,
    "text": "And so another way to form this question of how does a cell, how can we test agency, to answer your question, how do we test",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1794.62,
    "end": 1817.033,
    "text": " um having a certain certain ability to form a hierarchy and form beliefs we have to understand of how much pushback can it can it give you can it give to an environment over over long times and so the way i would probe this hypothetical cyborg or tadpole in terms of like what kind of um expectations what kind of planning is it doing is you have to really see how these different",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1817.603,
    "end": 1821.169,
    "text": " parts of that generative hierarchical model are interacting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1821.269,
    "end": 1829.342,
    "text": "So you will have a, you have a quick first response, which could be, you know, purely physical, but then very often on, it turns very active in most biological system.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1829.362,
    "end": 1833.709,
    "text": "That's the active inference part is really what makes life, life tick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1833.73,
    "end": 1838.557,
    "text": "You know, it's, it is entirely active and it's active very quickly, but also over long timescales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1839.279,
    "end": 1844.387,
    "text": "And so, um, what we're trying to show in this one paper about medical admission with Chris Fields and Mike,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1844.671,
    "end": 1848.918,
    "text": " was that that's a drive that got selected for very early on in evolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1849.078,
    "end": 1859.876,
    "text": "And so the way the profi system is really looking, having different reporters genetically, but also just having certain dyes in a system that will give you readouts of its active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1859.896,
    "end": 1860.858,
    "text": "Like what is it making?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1860.918,
    "end": 1861.759,
    "text": "What kind of proteins is it making?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.779,
    "end": 1863.062,
    "text": "Is it changing its later potential?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1863.743,
    "end": 1865.245,
    "text": "And then you try to relate those things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1865.405,
    "end": 1866.768,
    "text": "Are they completely independent?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1866.828,
    "end": 1870.594,
    "text": "Are they just, you know, in a non-living system,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1872.65,
    "end": 1876.517,
    "text": " very predictable dynamic reoccurrences of patterns.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1877.139,
    "end": 1880.906,
    "text": "But now living systems, they're going to change and they're going to change depending on the scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1880.946,
    "end": 1884.012,
    "text": "So one scale is going to affect the other one and it's going to continue to doing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1884.152,
    "end": 1886.777,
    "text": "And that's, I think, how the planning is achieved by that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1887.213,
    "end": 1915.228,
    "text": " temporal in the independent intent interdependence between those different aspects of a cell if they were independent there would be no planning but if they're dependent on each other then the cell is basically going to be using its long-term processes to redirect and inform its its active points at any moment in time nice yeah yeah and speaks to a kind of almost predictive coding hierarchy um where you have these kind of trickle-down predictions mike did you want to add",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1915.715,
    "end": 1926.736,
    "text": " Yeah, I just want to go back for a second to something you said before, which I think is quite interesting, about the non-metaphorical nature of our phenomenal experience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1926.756,
    "end": 1934.331,
    "text": "And I take your point, and I think phenomenal experience is really important, but there's the issue that we change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.311,
    "end": 1934.592,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1934.712,
    "end": 1944.972,
    "text": "And so and so how you so so I mean, for us, so let's say puberty is a is an example, right, where where a lot of valence changes and things that you thought were really important suddenly not important at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1944.992,
    "end": 1946.856,
    "text": "But all this other stuff is now important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1946.876,
    "end": 1954.952,
    "text": "And the example that I really find kind of meaningful for all this is the caterpillar to butterfly transition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1955.185,
    "end": 1966.964,
    "text": " So what happens there is you've got this soft-bodied creature that lives in a two-dimensional world, and it crawls around, and it has a particular controller for that kind of soft-body actuation, so it's got a certain kind of brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1967.445,
    "end": 1973.896,
    "text": "And then it has to be transformed into a completely different creature that's a hard-bodied kind of vehicle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1973.996,
    "end": 1974.637,
    "text": "It flies.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1974.677,
    "end": 1976.62,
    "text": "It lives in a three-dimensional world and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1976.6,
    "end": 1999.654,
    "text": " and so so it has a completely different brain and during that that process the brain is basically mostly broken down most of the cells are killed off um and then reassembled you know it grows it grows a new brain so so there's a there's sort of three levels of interesting things here the first level is that that aspect of phenomenal experience like what's it never mind what's it like to be a butterfly but what's it like to be a caterpillar becoming a butterfly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1999.634,
    "end": 2021.22,
    "text": " and how much of the right and how much of the um the metaphors the the how much of the things that the caterpillar took very seriously the butterfly things were total metaphors at this point right if it could i mean i'm not saying that's how it thinks about these things but but right thing things that were quite um quite concrete for the for the for the caterpillar are no longer so for the butterfly that's the first thing the second thing is that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2021.2,
    "end": 2040.745,
    "text": " um we know there's continuity so you know if you if you like um the stability of memories as a criterion for selfhood which a lot of philosophers like uh we know that the butterfly remembers things that the caterpillar learned so there is some continuity here even though the the brain the cognitive system and the body of all of that stuff is radically changed but there's some continuity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2040.725,
    "end": 2047.953,
    "text": " And so the next kind of question you think about is, okay, where the heck is this memory that survives total brain refactoring?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.233,
    "end": 2070.698,
    "text": "But the third thing that I find even more important about all of this comes from the simple fact that the way they test these memories is, well, one way to do it is you feed the caterpillar leaves on a particular color disc, and then what you find is that, so it forms the association, and then you find that the butterfly goes back to that disc to feed, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2070.678,
    "end": 2075.963,
    "text": " But the key thing here is that butterflies and caterpillars don't eat the same stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2076.365,
    "end": 2078.088,
    "text": " The caterpillar eats leaves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2078.108,
    "end": 2079.309,
    "text": "The butterfly doesn't care about leaves.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2079.329,
    "end": 2080.291,
    "text": "The butterfly wants nectar.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2080.711,
    "end": 2083.155,
    "text": "So now something very important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2083.195,
    "end": 2088.423,
    "text": "You cannot just persistence of the self in terms of memories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.683,
    "end": 2093.29,
    "text": "What you can't do is just keep the memories constant because you'll lose the salience.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2093.911,
    "end": 2096.214,
    "text": "Those memories will make no sense to the butterfly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2096.574,
    "end": 2098.397,
    "text": "And in fact, what you have to do is something very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2098.417,
    "end": 2100.34,
    "text": "You can't learn leaves on this color.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2100.58,
    "end": 2104.566,
    "text": "You have to generalize to the higher category of food.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2104.546,
    "end": 2107.417,
    "text": " And then you have to remap.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2107.438,
    "end": 2115.349,
    "text": "So this is the part that I'm super interested about in terms of moving memories around and transplants of memories and personal identity and all that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2115.599,
    "end": 2126.239,
    "text": " You have to take the deep lessons of your past life and sort of reinterpret them for your new life, which is, by the way, completely different anatomy and all of that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2126.599,
    "end": 2130.867,
    "text": "But there are some things you learn that are still pretty useful, just not exactly in the way, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2131.208,
    "end": 2132.871,
    "text": "It's not the details that matter now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2132.931,
    "end": 2134.975,
    "text": "It's the kind of the generic concept that matters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2134.955,
    "end": 2163.932,
    "text": " so so re remapping right remapping that information onto a new exp onto a new um embodiment for for for that for that being that's that's why i think the concept of metaphors is still super strong even for the phenomenal stuff because because you can't take any of it literally because you're not going to be the same later i mean you know as certainly for some animals it's more than more than so than others but you you have to understand the deep metaphor of what you learn not the not the specific details of your experience",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2164.705,
    "end": 2165.005,
    "text": " Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2165.986,
    "end": 2166.847,
    "text": "Yes, that's really good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2167.087,
    "end": 2167.668,
    "text": "That's really nice.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2167.808,
    "end": 2168.429,
    "text": "There's a lot there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2169.31,
    "end": 2171.952,
    "text": "Yeah, again, it's converging with some of the stuff that I've been thinking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2171.972,
    "end": 2188.949,
    "text": "I'm writing a little bit in draft, which is I'm kind of, I'm coming to this idea that the self in some ways is a is a relevance filter, a salience filter, such that because I think at a very deep phenomenal level, everything that finds its way into attention or awareness is relevant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2189.609,
    "end": 2190.53,
    "text": "It wouldn't really make sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2191.251,
    "end": 2192.232,
    "text": "And so",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2192.498,
    "end": 2202.332,
    "text": " I would say that the one non metaphorical thing that although you have the higher order concept of food is relevance, and relevant and meaning making to me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2203.253,
    "end": 2210.123,
    "text": "And maybe what I it's interesting, you say, you know, we're trying to go up in abstraction up the generative hierarchy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2210.844,
    "end": 2215.03,
    "text": "The one thing that the butterfly and the caterpillar share is the imperative for nutrition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2216.68,
    "end": 2224.812,
    "text": " And maybe that's maybe so when we can start linking things in some kind of map of similarity, maybe the thing that unifies them is preferences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2226.734,
    "end": 2234.005,
    "text": "So the caterpillar, and that maybe links us with the caterpillar and the butterfly, right, we have this unified goal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2234.065,
    "end": 2241.996,
    "text": "That said, the thing you said about the fact that they return to the same kind of leaf is very interesting, because it does seem to be a idiosyncratic maintenance of memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2242.364,
    "end": 2245.088,
    "text": " which I can't quite account for.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2245.549,
    "end": 2262.935,
    "text": "It made me think of Andy Clark's paper, Knitting Your Own Markov Blanket, where he talks about the metamorphosis of Markov blankets and how we can kind of get around this problem of when is one thing another thing by adopting a process ontology rather than a substance ontology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2263.817,
    "end": 2267.983,
    "text": "But friends, whoever's got an idea on this,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2268.385,
    "end": 2273.712,
    "text": " Is it possible that it's just a false move to say that the butterfly and the caterpillar are the same thing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2274.593,
    "end": 2276.395,
    "text": "That's the same organism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2276.415,
    "end": 2288.47,
    "text": "Could we not just say that there actually does become this division or this separation, and it's philosophically vague as to when it happens, but there was one thing and there now is another.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2289.007,
    "end": 2298.899,
    "text": " So I think the way to avoid these kind of philosophical traps is by being very practical and asking, why do you need to know?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2299.379,
    "end": 2309.431,
    "text": "So if the reason you need to know is because you want to predict how much crawling around there's going to be, then it's absolutely two different things because there's going to be zero crawling around afterwards.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.731,
    "end": 2315.638,
    "text": "But if what you're trying to predict is, so what color substrate will it like to feed on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2315.618,
    "end": 2322.847,
    "text": " then you need to understand that it's the same thing because you will have less predictive power if you don't understand that it keeps memories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2323.248,
    "end": 2331.278,
    "text": "So it's just, again, I think we're back to, again, the perspective of, you know, what question are you asking as the observer?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2332.439,
    "end": 2332.64,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2333.2,
    "end": 2334.362,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2334.422,
    "end": 2335.323,
    "text": "Let's park that there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2335.723,
    "end": 2342.913,
    "text": "I think something that you've worked on, Mike, but also, Franz, you mentioned and I want to pick up on is the difference between neural and non-neural structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2344.374,
    "end": 2344.815,
    "text": "There's a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2345.318,
    "end": 2350.928,
    "text": " There's a kind of neural bias in psychology, neuroscience, a cortico bias.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2353.072,
    "end": 2356.799,
    "text": "Franz, one, why is that the case, do you think?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2357.179,
    "end": 2359.523,
    "text": "And two, why should it not be the case?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2360.465,
    "end": 2361.968,
    "text": "If it shouldn't be the case, maybe it should be the case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2363.13,
    "end": 2363.23,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2363.25,
    "end": 2364.913,
    "text": "I mean, one...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2365.13,
    "end": 2377.329,
    "text": " We're human-centric because we are humans, but more fundamentally, the reason that we are so confined on the idea of neural circuits being the only one not doing any inference is because they're just very fast, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2377.369,
    "end": 2378.31,
    "text": "Action potentials are fast.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2378.33,
    "end": 2380.654,
    "text": "It's a highly optimal, optimized network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2381.796,
    "end": 2383.118,
    "text": "Optimized from what, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2383.138,
    "end": 2384.5,
    "text": "Neurons didn't come from nothing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2384.74,
    "end": 2386.303,
    "text": "Action potentials didn't come from nothing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2386.343,
    "end": 2392.352,
    "text": "Electric potentials were being used by cells way before the innovation of neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2393.007,
    "end": 2402.02,
    "text": " So that is, I think, the reason why now we're trying to look at what about in your organisms and just cells of having the same properties and more.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2402.301,
    "end": 2408.049,
    "text": "And I think other than just that being kind of transition was also really interesting is Mike and I both.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2408.37,
    "end": 2416.922,
    "text": "It's one of my favorite past daytime activities is asking neuroscientists what what about your theory is specific to neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2417.206,
    "end": 2424.674,
    "text": " And it's a question that none of us have gotten a good answer to yet because a lot of it, of course, you know, there are certain certain time periods it takes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2424.755,
    "end": 2428.599,
    "text": "If you're looking at MRI imaging, you're looking at the oxygenated blood flow in the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2429.14,
    "end": 2430.781,
    "text": "So you have to know those those time constant.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.821,
    "end": 2431.743,
    "text": "How fast does it take?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2431.783,
    "end": 2437.449,
    "text": "If you're looking at if you're actually measuring the neuron, you need to know all these transition times to really make your model tick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2438.05,
    "end": 2442.775,
    "text": "But if you change those time constants and you're compensated for that in your model, it will still work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2442.974,
    "end": 2448.062,
    "text": " So as far as we know so far, we're happy to get proven wrong on here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2448.082,
    "end": 2456.194,
    "text": "But so as far as we know, there's nothing that specific about neurons that you need to make any of those models, including actual inference, actually work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2456.214,
    "end": 2463.485,
    "text": "They are highly optimized and they have completely different behaviors, of course, because those timings do matter, but they're not necessary for it because they're not necessary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.505,
    "end": 2465.328,
    "text": "They're not in the actual inference framework, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2465.809,
    "end": 2468.393,
    "text": "It's not necessary to have a brain to have Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2468.413,
    "end": 2471.698,
    "text": "It's not necessary to have a brain to have generative model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2471.982,
    "end": 2480.177,
    "text": " So once all the actual assumptions that go into a model can be applied to any of those systems, then you're good to go and you should apply it to those systems as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2480.197,
    "end": 2485.566,
    "text": "Yeah, I guess another biased mapping here is between cognition and the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2485.626,
    "end": 2496.285,
    "text": "And I feel like there's been a movement towards, obviously in terms of embodied cognition and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2496.518,
    "end": 2504.828,
    "text": " the kind of dynamic, the agent arena dynamic that was happening, but also more recently, Mike, your paper with Anna, uh, the brain is not mental.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2505.408,
    "end": 2523.589,
    "text": "You sort of, I think you look at the immune system and sort of say how the immune system contributes as well as the neural system in subserving, um, adaptive control, self-organization, perhaps you could just speak to that and, and say, you know, well, I mean, it's a, it's a, it's a, guess it's a thought experiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2524.379,
    "end": 2526.529,
    "text": " What would it look like if we didn't have the immune system?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2526.831,
    "end": 2530.086,
    "text": "If we were just trying to self-organize purely in terms of neural dynamics?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2530.589,
    "end": 2540.141,
    "text": " Yeah, I mean, we certainly, there are knockout mice where the immune system is taken out and all that kind of stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.422,
    "end": 2544.066,
    "text": "And a lot of self-organization does happen before the immune system kicks in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2544.447,
    "end": 2557.744,
    "text": "I think the idea is simply that there are many, many different kinds of systems that go into this collective that we see when we say it's a human or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2557.724,
    "end": 2562.993,
    "text": " And all of them are potentially important contributors to the process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.514,
    "end": 2574.433,
    "text": "As Fran said, it's a really interesting experience to ask people what a neuron is and watch them list things that are basically every cell in the body does this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2574.413,
    "end": 2585.744,
    "text": " And then and then, you know, so I have another thought experiment that I sometimes do is like like back in the, you know, back in the day when when when the idea of neural networks was first being worked out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2585.764,
    "end": 2585.984,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2586.965,
    "end": 2597.996,
    "text": "I wonder if if if we had come along to to some of the some of the greats in that in that field and we said, oh, by the way, just just FYI, the biologists got it wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2598.056,
    "end": 2599.898,
    "text": "Thinking is in the liver, not the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2599.878,
    "end": 2629.665,
    "text": " so so there's two there's two ways they could have gone right one way is they could have said i don't care what you say we've got models of cognition and they require it to be to be neural so you guys must be wrong or they could say fine what do we care are this what you know the the basic calculus of you know mcculloch pits all that stuff the the basic calculus of it doesn't require it doesn't care what it is so fine it'll be liver right so so i i tend to think it would be i tend to think it would be the latter you know i don't see really anything in the in the deep in the deep lessons of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2629.645,
    "end": 2659.517,
    "text": " um behavioral neuroscience that's really about neurons per se you know it's about multi-scale control it's about active inference it's about all these kind of deep things that go far beyond brains and they're applicable to all sorts of stuff stuff but are there certain processes which are reserved for the brain i mean i think someone listening to this probably a psychologist or a neuroscientist will say well take the brain out good luck take the liver out you know i mean still good luck but you might have a better chance thinking",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2659.97,
    "end": 2660.27,
    "text": " Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2661.773,
    "end": 2663.716,
    "text": "For for a short amount of time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2663.756,
    "end": 2670.607,
    "text": "I mean, take the take the mitochondria out and and you're done for pretty much at the same rate as the brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.847,
    "end": 2676.677,
    "text": "Look, the bottom line, like nobody's arguing that the brain isn't unique and interesting in certain ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.717,
    "end": 2676.857,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2676.877,
    "end": 2679.261,
    "text": "Like we you know, as much as we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2679.241,
    "end": 2682.307,
    "text": " find protocognitive capacities elsewhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2683.068,
    "end": 2687.015,
    "text": "I've never made the claim that language or long-term planning is in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.035,
    "end": 2687.757,
    "text": "We've not found it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2687.837,
    "end": 2688.217,
    "text": "Could be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2688.738,
    "end": 2692.585,
    "text": "I wouldn't be terribly shocked if it were found, but we haven't found it, so we don't make the claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2692.605,
    "end": 2696.473,
    "text": "So clearly brains are interesting and they do interesting things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2696.613,
    "end": 2703.325,
    "text": "But I think it's important to make a distinction between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2703.676,
    "end": 2724.942,
    "text": " between having found unique features and told a very specific predictive story that that of why that is versus just this generic gut feeling that everybody has that that i have real you know real feelings and plans and this thing is a slime mold that i mean i don't know how many times people have said to me well that's a slime mold that's not a real decision it's just physics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2724.922,
    "end": 2729.813,
    "text": " And it drives me up a wall because you don't think we could tell a physics story about you?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2730.294,
    "end": 2730.896,
    "text": "Of course we could.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2731.698,
    "end": 2734.785,
    "text": "It wouldn't be a very good story, but neither is it about the slime mold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2734.825,
    "end": 2737.551,
    "text": "And the fact that you can tell that story doesn't mean anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2737.591,
    "end": 2740.197,
    "text": "There's always a physics story to be told about anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2740.177,
    "end": 2747.408,
    "text": " And so I think it's fine to have specific theories about what it is the brain that's doing differently than other structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2747.448,
    "end": 2747.829,
    "text": "That's great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2748.87,
    "end": 2756.582,
    "text": "But a lot of the resistance to the kind of continuum views that France and I are talking about comes from a kind of closet dualism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2756.562,
    "end": 2764.472,
    "text": " It's people really, you know, they just really feel they're different and and and they have to accept the fact that the physics are not different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2764.872,
    "end": 2766.134,
    "text": "So, well, now what is it then?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.154,
    "end": 2766.354,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2766.394,
    "end": 2766.995,
    "text": "It's like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2767.255,
    "end": 2768.556,
    "text": "Then there's something else.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.657,
    "end": 2771.3,
    "text": "And I think not even that I'm particularly against that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2771.34,
    "end": 2774.424,
    "text": "I just think it should be like, you know, dragged out into the light.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2774.444,
    "end": 2776.786,
    "text": "And let's just say, like, say what you think the difference is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2777.127,
    "end": 2778.629,
    "text": "You know, I think I think that's really critical.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2779.75,
    "end": 2780.791,
    "text": "See, I'm not sure the difference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2781.312,
    "end": 2785.557,
    "text": "I'm not sure the dualism really fundamentally is a brain body dualism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2785.958,
    "end": 2789.503,
    "text": " I think it's an awareness body dualism or consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2789.543,
    "end": 2792.907,
    "text": "I mean, like a traditional Cartesian dualism, I think is really at play here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2792.947,
    "end": 2797.032,
    "text": "It's just we've been persuaded that consciousness is rooted in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2797.873,
    "end": 2802.82,
    "text": "And so once you make that association, then you go, well, obviously my brain is special because it generates consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2802.88,
    "end": 2804.001,
    "text": "Consciousness is special.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2804.802,
    "end": 2809.228,
    "text": "I can, in principle, imagine myself being conscious without my liver, my leg, my arm, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2809.849,
    "end": 2812.152,
    "text": "And so that's the special part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2813.33,
    "end": 2815.714,
    "text": " What am I missing there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2815.734,
    "end": 2816.896,
    "text": "No, I think you're right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2816.937,
    "end": 2823.168,
    "text": "But I think what people are missing there is when they say conscious of my liver, that isn't the question here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.428,
    "end": 2835.049,
    "text": "So right now, your left hemisphere and my left hemisphere are having a delightful discussion about why consciousness is in the brain and how important the brain is for consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.069,
    "end": 2835.49,
    "text": "That's fine.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2835.993,
    "end": 2839.697,
    "text": " Then I will say, and I don't have a new theory of consciousness, by the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.737,
    "end": 2842.08,
    "text": "So I'm not like, I usually don't talk about consciousness at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2842.16,
    "end": 2854.994,
    "text": "But since we're here, I'll just say that I have said that for the same reasons we think that the brain can support consciousness, we ought to take seriously that other parts of bodies also support consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2855.014,
    "end": 2861.581,
    "text": "Now, at that point, people say exactly what you just said, which is, well, I don't feel like my liver is conscious, but that's a huge mistake.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2861.621,
    "end": 2862.141,
    "text": "Of course you don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.161,
    "end": 2865.645,
    "text": "But you also don't feel that I'm conscious, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2865.625,
    "end": 2867.087,
    "text": " That's exactly right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2867.147,
    "end": 2876.597,
    "text": "So it's nice that the left hemisphere is eloquent and it has language and it can tell stories to other left hemispheres about how conscious it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2877.058,
    "end": 2888.17,
    "text": "But that doesn't mean that what you don't have spread throughout different regions of your body is a non-verbal, non-linguistic consciousness that is not for us to access any more than we can access each other's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2888.911,
    "end": 2893.116,
    "text": "And the fact that you don't feel it is no surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2893.857,
    "end": 2895.058,
    "text": "There's no surprise there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2895.038,
    "end": 2900.087,
    "text": " um, you have to take its perspective and ask, what do you think that's going on in your brain?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2900.107,
    "end": 2909.264,
    "text": "And so, so literally, um, uh, a student and I have, have been, uh, we have this, um, we have this table that, that has rows for the main theories of consciousness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.845,
    "end": 2916.096,
    "text": "And for each theory, there is something specific, you know, so, so, so Stu Hameroff will say it's microtubules.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2916.116,
    "end": 2918.521,
    "text": "Somebody else will say it's, you know, my electromagnetic field.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2918.561,
    "end": 2919.342,
    "text": "Somebody else will say it's,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2919.558,
    "end": 2921.703,
    "text": " you know, integrated information, like whatever it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2922.265,
    "end": 2927.478,
    "text": "And then we just look and say, okay, given that, where does that occur in the body?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2927.518,
    "end": 2929.703,
    "text": "And the answer for almost all of them is everywhere.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2929.936,
    "end": 2934.321,
    "text": " And so none of these theories, as far as I can tell, can distinguish.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2935.622,
    "end": 2937.824,
    "text": "And some of them try to rescue it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2938.065,
    "end": 2945.132,
    "text": "So IAT has this postulate that says, okay, but we're just going to say there's only one, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2945.252,
    "end": 2948.235,
    "text": "That's a postulate you sort of add on to things, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2948.415,
    "end": 2953.721,
    "text": "So that's the issue is that it's not about you feeling your liver being conscious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2954.121,
    "end": 2957.665,
    "text": "It's the first person perspective, which may or may not be there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2958.556,
    "end": 2959.579,
    "text": " Yeah, there's plenty there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2959.759,
    "end": 2963.831,
    "text": "Yeah, I'm reticent to dive into consciousness because all my podcasts end up being about consciousness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2964.252,
    "end": 2966.438,
    "text": "And I have biologists on, you know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2966.96,
    "end": 2967.722,
    "text": "But...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2967.82,
    "end": 2969.784,
    "text": " Yeah, it's, it's, it's interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2969.804,
    "end": 2982.467,
    "text": "I mean, obviously, a lot of this has been, we have to take as a kind of axiom that, at least for this conversation, that consciousness is what generated in the brain, whether that's in a property dualist, or whether it's in a reductive way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2982.507,
    "end": 2988.018,
    "text": "And I also do just want to give a shout out to slightly more esoteric forms of idealism, conscious realism, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2988.619,
    "end": 2990.402,
    "text": "But it also makes me think about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2990.787,
    "end": 3020.558,
    "text": " let's if we just get away from consciousness in terms of first person perspective and just talk about basal intelligence in in terms of morphogenesis it also makes me think well it's this is a term for consciousness but people will talk about being where the conscious can be is multiply realizable has multiple realizability i.e if i put you know uh you know china you know if i had a chinese nation that blocks idea with exactly the same functions as my brain exactly the same synapses because there's the same you know those connections would be the same between the members of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3020.808,
    "end": 3023.672,
    "text": " the Chinese populace and my brain, would I have consciousness?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3023.813,
    "end": 3023.953,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3024.574,
    "end": 3036.292,
    "text": "If we get away from consciousness, I guess my question is, is morphogenesis itself, can it be, is it multiply realizable in the sense that we're now talking less about the human body?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3036.432,
    "end": 3040.799,
    "text": "Is there something sort of, or more towards like cyborgs or robots?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3041.68,
    "end": 3046.528,
    "text": "What, you know, people have this intuition, I think as well, that there is a life force and they land VTOW.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3046.762,
    "end": 3049.407,
    "text": " that leads maybe to this self-organization, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3049.427,
    "end": 3053.194,
    "text": "There's like, there's gotta be something that like, or else why, why are these things resisting entropy?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3053.234,
    "end": 3054.376,
    "text": "Why are they self-organizing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3055.198,
    "end": 3061.469,
    "text": "And I think the idea is like, well, if I just stuck some sort of priors in the robot, why on earth would that end up being self?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3061.489,
    "end": 3062.391,
    "text": "Like, why would that work?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3062.894,
    "end": 3064.377,
    "text": " to use very reductive language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3064.858,
    "end": 3078.844,
    "text": "Franz, I'm just curious, is there like an added ingredient, at least it might be a metaphor, but an added ingredient that we have to put into a non-carbon based thing in this case to give it the chance to self-organize?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3080.292,
    "end": 3084.118,
    "text": " Yeah, probably I would have to name would be Evolvability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3084.739,
    "end": 3086.041,
    "text": "That would be one part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3086.542,
    "end": 3093.914,
    "text": "And it doesn't have to be evolution of its actual components that can be evolution of its programming as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3093.934,
    "end": 3096.478,
    "text": "But that would be an important point to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3096.458,
    "end": 3108.876,
    "text": " The one thing I'd like to point out for that question is I've talked a lot about in this podcast about one of my biggest interests is really understanding of where that drive for an agency comes from.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3109.718,
    "end": 3114.565,
    "text": "But that's not just a kind of philosophical interest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3114.585,
    "end": 3122.837,
    "text": "It's actually really once you find sufficient evidence for that being a fundamental drive in evolution, then you have to accept the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3123.323,
    "end": 3149.567,
    "text": " to combine that fact with the idea that, well, if any part of your body or any robot that you're putting into this is going to strive to maximize its agency with respect to its environment, that is the real reason why, if it turns out the liver is not conscious right now, then the answer would be, if you accept the fact that, well, the driver is fundamentally an evolution, any life system is going to try to maximize its predictability and its agency over its environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3149.851,
    "end": 3152.977,
    "text": " then the answer would be, well, its environment isn't very interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3153.037,
    "end": 3157.506,
    "text": "So the liver probably didn't have any reason to maximize that drive.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3158.167,
    "end": 3166.763,
    "text": "If you were to put the liver or you were to put a robot into an environment that's very active, very much changing, very volatile, and you give it enough",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3167.266,
    "end": 3181.187,
    "text": " either enough time to evolve if you come out of the vulnerability or you just put in a high degree autonomy over its own beliefs, then over time with that drive, it should be able to to to maximize that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3181.207,
    "end": 3185.814,
    "text": "The problem right now is that the way we program robots is it's very much right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3185.874,
    "end": 3187.436,
    "text": "It's a very clear algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3187.717,
    "end": 3190.0,
    "text": "We don't allow any adaptiveness to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3190.25,
    "end": 3194.155,
    "text": " And so that's how you would have to go about it, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3194.175,
    "end": 3212.28,
    "text": "And you may not want to do that, just FYI, because the problem is, you know, we talk about one of my favorite examples of why, what differences between machines and the brain is that a calculator is infinitely better than you at calculating, you know, adding numbers together, multiplying.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3212.32,
    "end": 3214.203,
    "text": "I mean, you know, and it's the dumbest thing ever.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3214.223,
    "end": 3214.984,
    "text": "Like it's so simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3215.004,
    "end": 3217.287,
    "text": "And we've had these things for decades now.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3217.84,
    "end": 3222.505,
    "text": " But so if you want to have a predictable, reliable answer, it's always correct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3222.525,
    "end": 3225.449,
    "text": "You know, the human is not the best way to do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3225.849,
    "end": 3240.326,
    "text": "That is the reason why we're not, even if we had the theoretical framework to make a really intelligent system for what we want them to do, which is really make our lives easier by making the same thing every day reliably, you wouldn't want to do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3240.546,
    "end": 3247.594,
    "text": "But if your goal was to create a new intelligent cognitive agent, then you would have to go about it differently.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3248.502,
    "end": 3250.545,
    "text": " Yes, that's an interesting little paradox, isn't it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3250.565,
    "end": 3256.052,
    "text": "I mean, like the most robust thing in the world might be a calculator, but it's quite useless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3256.072,
    "end": 3260.018,
    "text": "It's like the more useful you become, the more precarious your existence is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3261.98,
    "end": 3266.486,
    "text": "Mike, I was wondering if you had any thoughts on that kind of multiple realisability question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3266.526,
    "end": 3276.72,
    "text": "And I guess what I'm going at with that is it is a philosophical question, but I think it's interesting for biologists, which is why would evolution",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3276.953,
    "end": 3279.597,
    "text": " would evolution prioritize self-organization?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3279.617,
    "end": 3282.662,
    "text": "I mean, there's just a fundamental question there in terms of entropy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3282.682,
    "end": 3285.928,
    "text": "I mean, why do we have these pockets of neg entropy entities?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3286.889,
    "end": 3294.181,
    "text": "Um, is there a biological answer to that beyond just, well, to be a biological entity, you are neg entropy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3294.201,
    "end": 3296.605,
    "text": "Is there anything, can we get anywhere beyond that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3297.647,
    "end": 3297.747,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.047,
    "end": 3314.054,
    "text": " A couple of things I think are interesting, and I wanna be careful here because I did a little while ago, I started writing a paper on what exactly is missing from our technology to provide true agency, because I think we can actually say what some of those things are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3314.074,
    "end": 3318.722,
    "text": "And it quickly sort of dawned on me that to whatever extent I was onto something,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3318.702,
    "end": 3325.451,
    "text": " that would actually lead to a massive creation of new beings that matter in the moral sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.872,
    "end": 3330.619,
    "text": "And I'm not too interested in being responsible for that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3330.659,
    "end": 3333.963,
    "text": "Some other people will do it, I'm sure, but I don't want to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3335.466,
    "end": 3337.909,
    "text": "But I can say a few things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3338.26,
    "end": 3351.78,
    "text": " I think when we make the distinction between life and robotics, even aside from all the hybrids and cyborgs that show us that it's like a continuum, but even aside from all that, when we make that distinction, here's what I hear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3352.441,
    "end": 3358.21,
    "text": "I think life is what we call things that are good at scaling up goals.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.19,
    "end": 3380.198,
    "text": " so so you know when you have very when you have a bunch of subunits that have very basal competencies you know maybe all they can do is follow least action laws or like like really simple things when when when you've got a pile of them and the pile has basically exactly the same cognitive light cone as the comp the components we say well that's not living that's a rock that's just you know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3380.178,
    "end": 3387.328,
    "text": " But life is what we call things where there are special... I've also called it a cognitive glue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3387.368,
    "end": 3396.36,
    "text": "There are these special policies by which the parts relate to each other such that the collective has a bigger cognitive lichen in new spaces that the parts couldn't have.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3396.58,
    "end": 3397.681,
    "text": "And that's what we call life.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3398.002,
    "end": 3403.189,
    "text": "Now, under that way of thinking about it, could you make that out of other things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3403.349,
    "end": 3404.31,
    "text": "I'm sure you could.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3404.671,
    "end": 3409.257,
    "text": "And I tend to think that in the wide universe, I tend to think that there's probably...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3409.237,
    "end": 3415.566,
    "text": " lots of extremely diverse examples, most of which we wouldn't even recognize of that happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.606,
    "end": 3433.473,
    "text": "And I think specifically, I think what happens is that the evolutionary process really, I don't really think it makes specific solutions to specific problems the way that we do when we do genetic algorithms and things like this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3433.753,
    "end": 3438.18,
    "text": "I think what biological evolution does is it makes problem solving machines",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3438.16,
    "end": 3450.516,
    "text": " And that's because if you over-train on your evolutionary priors and you really take seriously what expectations that you might have about what genes you have, what the environment is like, if you take that too seriously, you're done for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3450.936,
    "end": 3459.267,
    "text": "Because guaranteed, and this is why I also think that regeneration is not really about repair of physical damage, like external damage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3459.527,
    "end": 3464.033,
    "text": "I think fundamentally regeneration is about knowing for a fact that your own parts are going to change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3464.013,
    "end": 3470.2,
    "text": " Evolution just means the fact that you have some kind of a lineage that's subject to mutation, whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3470.28,
    "end": 3471.762,
    "text": "You know your stuff is going to change.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3472.022,
    "end": 3475.186,
    "text": "If you don't accept that, you're never going to survive long term.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3475.426,
    "end": 3488.322,
    "text": "So what ends up surviving are architectures that in particular are these multi-scale architectures where the individual components have agendas and then they make up systems that have other agendas and on and on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3488.822,
    "end": 3491.185,
    "text": "Our current robotics, by and large, is very flat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3491.165,
    "end": 3495.73,
    "text": " So you hope your robot is intelligent, but the parts it's made of are not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3495.77,
    "end": 3497.592,
    "text": "They don't really tend to do anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3497.612,
    "end": 3498.673,
    "text": "They don't have their own agendas.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3498.713,
    "end": 3501.717,
    "text": "And I've given a talk called Why Robots Don't Get Cancer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.137,
    "end": 3502.678,
    "text": "And this is why.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3502.958,
    "end": 3513.73,
    "text": "It's because they're made of parts that don't have their own little goals in other spaces, and there's no danger of them defecting, unlike biology, where it happens all the time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3513.71,
    "end": 3528.908,
    "text": " So I think what's happening here is that we end up with these architectures that are by virtue of cooperation and competition of parts that end up having a larger cognitive light cone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3529.268,
    "end": 3532.732,
    "text": "You end up with this kind of intelligence ratchet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3532.933,
    "end": 3541.843,
    "text": "And I could tell you stories about how that type of thinking explains planarian, the amazing facts of planarian regeneration and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3541.823,
    "end": 3554.732,
    "text": " This idea that what evolution, I think, really selects for is the plasticity to... And it works out in different types of animals to different degrees, but overall, the plasticity to deal with novelty.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.233,
    "end": 3557.959,
    "text": "This idea that when you emerge into the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3557.939,
    "end": 3585.297,
    "text": " uh into the world you don't know for a fact what you are what you have is your genome the same as it was are your cells the right shape or size do you have yeah you in the same environment you don't know any of these things you you have to um do your best in putting together a model of what that that's why life is so interoperable that's why we can make anthropobots and xenobots and interface living tissue with crazy nanomaterials and make these hybrids that are just sort of totally cobbled together it's because by and large",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3585.277,
    "end": 3596.091,
    "text": " It's already bought into, you know, the, the life we see today has already bought into the fact that, um, like, like, you know, everything changes, you know, and you don't, and you can't, you can't depend on these things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3596.111,
    "end": 3597.492,
    "text": "You have to figure them out in real time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3598.714,
    "end": 3599.335,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3599.355,
    "end": 3599.976,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3599.996,
    "end": 3600.256,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3601.317,
    "end": 3605.142,
    "text": "It, you know, when you mentioned the word cognitive glue, it made me realize that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3605.493,
    "end": 3612.221,
    "text": " there's one thing that we haven't even touched upon at all, I haven't even mentioned, which is electricity, and bioelectricity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3613.603,
    "end": 3620.211,
    "text": "So I think actually, you had a paper my day knew last year, two years ago, about bioelectricity being the glue of the cognitive mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3620.631,
    "end": 3622.814,
    "text": "So from physiology all the way up to the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3623.555,
    "end": 3634.568,
    "text": "And obviously, this is very much, you know, a seminal piece of your work is the processes of bioelectrical processes in cells and outside of cells and in terms of self organization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3635.069,
    "end": 3635.449,
    "text": "And I think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3636.172,
    "end": 3646.524,
    "text": " At least to my very layman biological is electricity almost has the, the kind of center of, uh, a kind of thing that, you know, animates things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3646.544,
    "end": 3652.211,
    "text": "And maybe, you know, I'm thinking about Frankenstein, um, either one of you, I don't mind whoever wants to start.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3653.632,
    "end": 3660.2,
    "text": "What, you know, actually friends, it was something that you mentioned, which is maybe one of these ways that we can conflate the neural non-neural dividers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3660.22,
    "end": 3663.664,
    "text": "The fact that both of them have for them a fundamentally electrical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3664.724,
    "end": 3690.023,
    "text": " what what is it about that electrical ontology that animates or might animate intelligence or morphogenesis so when i was writing my phd thesis i was trying to answer the introduction the question of where does where does a neuron even come from and the best paper i found that was answering that question was looking into this very small organism that had just a bunch of little cilia around its surface",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3690.222,
    "end": 3693.228,
    "text": " and it was a marine organism that was living on the bottom of the ocean.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3693.689,
    "end": 3700.141,
    "text": "And it was trying to center to environments and the database by small changes in electrical fields that they were having around it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3700.622,
    "end": 3708.417,
    "text": "And that was causing like many, I won't say actual potential, but it was causing basically many vibrations and could use that to change this movement.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3708.835,
    "end": 3720.128,
    "text": " So the reason I think why that would, you know, why the electricity is that so important here is very, it's a very simple mechanism to have that is physically a lot more accessible to all parts of the body.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3720.768,
    "end": 3724.853,
    "text": "That's actually the primary reason why I joined Mike's lab and why I'm become a biologist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3725.053,
    "end": 3726.054,
    "text": "I was a physicist before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3726.755,
    "end": 3732.902,
    "text": "So I was looking for something in biology that would be all these that would not be subject to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3733.321,
    "end": 3736.105,
    "text": " completely different mechanisms if you switch organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3736.125,
    "end": 3747.56,
    "text": "So like the molecular pathways we are typically investigating as a health anthropologist, they are, as they were before, they are now still very important and they're directing all these different functions of the cell and organisms.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3748.301,
    "end": 3752.907,
    "text": "But they're somewhat unsatisfactory for a physicist because it's just so messy, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3752.927,
    "end": 3754.729,
    "text": "You can't really make heads or tails of it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3755.189,
    "end": 3759.916,
    "text": "And there is no clear field of potential that is just one number essentially, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3759.936,
    "end": 3761.758,
    "text": "You want to use it to something very simple.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3762.295,
    "end": 3770.367,
    "text": " The beauty of using bioticity is that you can have one number, one potential, like a member potential that you can describe to a cell.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3770.807,
    "end": 3772.53,
    "text": "It's still made up of all the individual parts.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3772.55,
    "end": 3774.493,
    "text": "There's many ion channels involved in this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3774.633,
    "end": 3781.463,
    "text": "All the molecular properties are still making up, all feeding into that one number, that one member potential.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3781.963,
    "end": 3784.687,
    "text": "But what's more interesting is the readout part, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3785.348,
    "end": 3790.075,
    "text": "If you have to constantly compare the millions of different molecules in a cell, that's not going to be good",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3790.325,
    "end": 3801.88,
    "text": " good formulation for achieving consciousness, even doing any smart behavior, having something that comes from constantly having a surface, almost like a space they can read it, they can write onto and read out to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3802.561,
    "end": 3809.65,
    "text": "I think that was makes electric potentials so appealing that the only question then is like, why wasn't it out of the physical fields?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3809.933,
    "end": 3815.243,
    "text": " like mechanics, they are, of course, very involved as well in developmental biology and regeneration as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3815.884,
    "end": 3820.313,
    "text": "But mechanics don't have this neat feature where it's not as fast and it's not as localized.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3820.934,
    "end": 3830.372,
    "text": "So basically, the way I see it, the potentials have a beautiful trade-off between being physical, having a broad readability on a cell or even a tissue level,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3831.145,
    "end": 3840.864,
    "text": " but are confined enough that they can be modulated enough to actually form active behavior, which you can't say for most of the other physical fields that we would think about in this context.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3841.947,
    "end": 3842.187,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3842.888,
    "end": 3844.772,
    "text": "Mike, you want to add?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3845.954,
    "end": 3846.235,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3847.717,
    "end": 3848.718,
    "text": " Yeah, a couple of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.759,
    "end": 3860.096,
    "text": "One thing to add is that if you think about one of the really powerful things about bioelectricity is that imagine an ion channel, specifically a voltage-sensitive ion channel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3860.476,
    "end": 3866.565,
    "text": "So as soon as evolution discovers a voltage-sensitive ion channel, what you have there is an element with historicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3866.585,
    "end": 3867.126,
    "text": "It means that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3867.106,
    "end": 3871.454,
    "text": " uh, the current state is a function of what was going on before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3871.915,
    "end": 3876.643,
    "text": "And it means that what you really have is a voltage gated current conductance, AKA a transistor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3877.124,
    "end": 3881.292,
    "text": "And so, so, so, you know, we know once you have that, then you can do anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3881.352,
    "end": 3882.634,
    "text": "And so, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3882.614,
    "end": 3889.723,
    "text": " Electricity is really good for these kinds of feedback loops, right, both positive and negative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3889.743,
    "end": 3893.288,
    "text": "It's good for representing information across time and space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3893.368,
    "end": 3898.234,
    "text": "It's good for functionally integrating a system across distance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3898.294,
    "end": 3903.901,
    "text": "Some of the really cool early evolutionary data on this come from bacterial biofilms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3904.322,
    "end": 3906.985,
    "text": "And this is Gurul Soel's amazing work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3906.965,
    "end": 3912.755,
    "text": " Basically, he's got a paper called Brain-like Signaling in Bacterial Biofilms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.196,
    "end": 3926.34,
    "text": "And the idea is that already in a mat of bacteria, so like a really long time ago, evolution already hit on to this idea that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3927.029,
    "end": 3934.497,
    "text": " by using electrical signaling to integrate activity among competent subunits, you can get gains at the collective level.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3934.797,
    "end": 3940.363,
    "text": "So they take turns, it's used for nutrient sharing and things like this, but you get these collective dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3940.424,
    "end": 3948.813,
    "text": "And so I think it's a very convenient modality for it that was found a long time, long before neurons picked it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3948.833,
    "end": 3950.134,
    "text": "It was used for that kind of thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3950.114,
    "end": 3952.639,
    "text": " But no doubt there are other ways to do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3952.659,
    "end": 3958.069,
    "text": "Somewhere out in the universe, I'm sure there are other kinds of cognitive glues out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3958.089,
    "end": 3960.493,
    "text": "But here, electricity works really well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3961.375,
    "end": 3961.515,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3962.397,
    "end": 3964.721,
    "text": "And so I know we need to wrap up relatively soon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3964.761,
    "end": 3967.887,
    "text": "And I guess...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3968.508,
    "end": 3974.997,
    "text": " it's a kind of dark pun, but us wrapping up kind of soon makes me think about aging and death and decay and whatnot.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3975.718,
    "end": 3979.363,
    "text": "And there's a, there's a massive fuss about aging and longevity at the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3979.944,
    "end": 3986.473,
    "text": "Um, and David Sinclair and this notion of epigenetic scratches.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3987.294,
    "end": 3997.688,
    "text": "And it kind of makes me think of the inverse of that, which might be regenerative biology and the capacity to reestablish self-organization, reestablish, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3997.972,
    "end": 4013.432,
    "text": " the kind of priors that we've been discussing in terms of the functional priors, the preference priors, the ones that, you know, are seeking a certain sort of a external state or seeking a certain probability distribution so as to be able to fulfill its function, so to speak.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4013.452,
    "end": 4021.783,
    "text": "Um, what, Mike, what is the kind of lay of the land in your world as to aging?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4023.325,
    "end": 4023.405,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4024.094,
    "end": 4026.737,
    "text": " How seriously should we take this kind of epigenetic approach?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4027.098,
    "end": 4031.964,
    "text": "I won't ask about the moral aspect of it because it's a completely different question about whether we should live longer or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4032.825,
    "end": 4041.696,
    "text": "But having localized morphogenesis and self-organization is really the currency of biological systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4042.417,
    "end": 4049.005,
    "text": "How viable is it that we can reestablish that in something where self-organization is ailing and rather feeble?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4049.626,
    "end": 4063.507,
    "text": " Yeah, I think, well, the first thing is I do just want to say something about the moral question, because it also gets to the issue of regenerative medicine more broadly and beyond regenerative medicine, human augmentation and all of these kinds of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.527,
    "end": 4067.533,
    "text": "So the one thing I want to point out is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4068.526,
    "end": 4080.688,
    "text": " If it were the case that we were in some way optimized by some intelligence that shared our values, then one could make the argument, hey, let's not push too far off of that, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4080.748,
    "end": 4081.71,
    "text": "You're screwing up the planet.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4081.93,
    "end": 4088.061,
    "text": "And I get a lot of these emails from people saying, well, things are great, but you scientists better not mess it up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4088.422,
    "end": 4090.045,
    "text": "And I just want to be clear that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4090.025,
    "end": 4092.732,
    "text": " There is no basis for this view.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4093.193,
    "end": 4105.182,
    "text": "Our health span, our aging, our susceptibility to all kinds of dumb diseases and our lower back pain and astigmatism, all this stuff is not in any way...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4105.162,
    "end": 4107.628,
    "text": " optimized for any of the things we care about.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4107.829,
    "end": 4110.877,
    "text": "That's just where evolution happens to have dropped us off at this point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4111.057,
    "end": 4111.578,
    "text": "That's it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4111.939,
    "end": 4114.105,
    "text": "And so there's nothing magical about this lifespan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4115.669,
    "end": 4121.584,
    "text": "People who are worried about augmenting this lifespan, well, what if it had been 20?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4121.564,
    "end": 4144.804,
    "text": " or 30 you know then what and you say well you know that's too short why is that too short it could have been anything it's but my point is it's completely arbitrary and so and so let's not um base our decisions about what um what ought to be on where the process of random mutation and selection has has dumped us so that's the you know i kind of i think that's important to say um beyond that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4144.784,
    "end": 4157.267,
    "text": " I mean, we're certainly involved in some research on aging and the role of bioelectricity in aging and kind of the degradation of bioelectric patterning information with age and all that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4157.548,
    "end": 4159.992,
    "text": "But I think more importantly is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4159.972,
    "end": 4163.1,
    "text": " My weather vane for all of this stuff is planaria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4163.541,
    "end": 4168.153,
    "text": "So I think planaria basically, I think, hold the answer to all of life's big questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4168.193,
    "end": 4175.01,
    "text": "And so, I mean, the asexual form of planaria that we have, they do not age.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4174.99,
    "end": 4178.294,
    "text": " There is no evidence of an old planarian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4178.314,
    "end": 4180.457,
    "text": "They simply they can go forever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4180.477,
    "end": 4188.788,
    "text": "So these ideas that it's some sort of inevitable accumulation of errors or it's telomeres or it's clearly there are ways around it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4188.948,
    "end": 4193.894,
    "text": "That's the one thing that we have an existence proof that and then there's a few other animals that do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4193.914,
    "end": 4196.037,
    "text": "But planarian, I think, are the most interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4196.017,
    "end": 4199.302,
    "text": " Uh, th there, there is obviously a strategy that gets around it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4199.823,
    "end": 4202.166,
    "text": "And I think it's on us to figure out why that is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4202.266,
    "end": 4207.795,
    "text": "And I think it's absolutely not a coincidence that plenary are also extremely regenerative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.875,
    "end": 4209.978,
    "text": "In addition to being immortal, they're extremely regenerative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4209.998,
    "end": 4216.608,
    "text": "They're cancer resistant and they have an incredibly noisy genome because they don't clean their genome in every generation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4216.628,
    "end": 4218.671,
    "text": "Like we do, they write somatic mutations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4218.711,
    "end": 4222.817,
    "text": "Just if you, if it doesn't kill the cell, it just basically expands into the next generation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4222.797,
    "end": 4224.7,
    "text": " Blenaria can be mixed deployed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4224.72,
    "end": 4226.563,
    "text": "Every cell could have a different number of chromosomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4226.583,
    "end": 4227.524,
    "text": "They're just a complete mess.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4228.345,
    "end": 4232.692,
    "text": "And those are the animals that are highly regenerative, cancer resistant, and immortal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4232.912,
    "end": 4233.553,
    "text": "Isn't that amazing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4233.833,
    "end": 4234.454,
    "text": "Isn't that right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4235.075,
    "end": 4235.496,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4235.636,
    "end": 4248.315,
    "text": "And so finally, after years of feeling scandalized about this, the importance of the genome and all that, and why is the animal with the craziest genome also have all these amazing capacities?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4248.295,
    "end": 4251.859,
    "text": " I think we actually finally have a lead on what's going on there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4251.879,
    "end": 4256.863,
    "text": "But I think that's what we need to look at in terms of aging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4257.224,
    "end": 4263.87,
    "text": "I think if the question of regenerative medicine were solved, aging would be solved as a byproduct.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4264.971,
    "end": 4265.272,
    "text": "Excellent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4265.292,
    "end": 4265.692,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4265.712,
    "end": 4275.041,
    "text": "It makes me think in some ways, I don't know about the function of planaria worms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4275.061,
    "end": 4277.644,
    "text": "People can search up pictures of planaria.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4278.282,
    "end": 4284.952,
    "text": " But it makes me think that in many ways, let's just take ourselves, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4284.992,
    "end": 4294.487,
    "text": "What makes a human a human is in some ways the fact that the preference priors that we have or our functionality is limited.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4295.468,
    "end": 4301.978,
    "text": "I am not going to be at 39, 38, 37, and 36 degrees centigrade with equal probability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4303.055,
    "end": 4311.665,
    "text": " But it sounds to me like Polinaria able to sort of metamorphosize in some ways, some of their preferences, because as you say, their genome is shaping.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4312.185,
    "end": 4315.509,
    "text": "Is that kind of a misconstrual of what's going on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4315.569,
    "end": 4323.378,
    "text": "Is it that with the multiplicity of the genome, the messy genome, comes a multitude of function?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4324.4,
    "end": 4326.582,
    "text": "Or is it that the function is still constrained?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4328.198,
    "end": 4336.929,
    "text": " Yeah, I'm going to give you, and unfortunately we have to run in a couple of minutes, but I'll just give you a very quick story of what I think is going on in Planaria.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4337.931,
    "end": 4343.638,
    "text": "I think, and this is, Steve Frank told me an interesting analogy to this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4343.698,
    "end": 4357.176,
    "text": "Apparently, when RAID arrays became popular, so computer disks that make copies of themselves so that if something goes wrong, he basically said that when RAID arrays became popular, the quality of disk media went down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4357.156,
    "end": 4363.274,
    "text": " because it wasn't as important anymore to have your hardware be super reliable because you've got this system on top of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4363.615,
    "end": 4372.38,
    "text": "I think what's happened in Plenary in that lineage is that it has really come to grips with the fact that the hardware might be junk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4372.36,
    "end": 4376.204,
    "text": " and that all the evolutionary effort went into cranking the algorithm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4376.224,
    "end": 4384.271,
    "text": "Basically, the idea that we're going to assume from the beginning that you're full of mutations, you're unreal, it's unreliable hardware, and we're going to assume it's unreliable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4384.291,
    "end": 4393.259,
    "text": "And so what we're going to do is do our best to have a system that is so highly regenerative that no matter what's going on, we can we have stand a pretty good chance of making a good planarian.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4393.579,
    "end": 4401.827,
    "text": "The development of planarian is called chaotic mode, where it's a total mess and then it sorts itself out into a proper worm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4401.807,
    "end": 4407.857,
    "text": " I think, and here's why I think it happened, and we have computational models that show how this works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4408.538,
    "end": 4413.747,
    "text": "Imagine that you have certain competencies to fix defects.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4413.767,
    "end": 4420.357,
    "text": "For example, like in the frog, we know that if the mouth is moved off a little bit in development, it'll soon make its way back to where it needs to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4420.378,
    "end": 4422.14,
    "text": "It sort of fixes itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4422.201,
    "end": 4426.768,
    "text": "So in evolution, if you have a system that has a little bit of competency to fix itself,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4426.748,
    "end": 4432.16,
    "text": " When that individual comes up for selection and selection sees that, okay, this is a great individual.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4432.18,
    "end": 4438.373,
    "text": "What selection doesn't know is, is it great because the genome was amazing or is it great because the genome was actually so-so, but it fixed itself?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4438.975,
    "end": 4439.476,
    "text": "You don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4439.856,
    "end": 4443.725,
    "text": "Once you don't know, it becomes really difficult to reward for the best genomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4443.745,
    "end": 4447.052,
    "text": "What you can reward is for the best phenotypic fitness, for the best outcomes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4447.032,
    "end": 4451.962,
    "text": " And as soon as you do that, that makes the problem worse because then the competency goes up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4451.982,
    "end": 4454.086,
    "text": "Then it becomes even harder to know what your genome was.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4454.427,
    "end": 4457.834,
    "text": "So you start off with this ratchet, with this positive feedback loop.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4458.154,
    "end": 4460.138,
    "text": "And I think in planaria, it went all the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4460.198,
    "end": 4461.681,
    "text": "And in other species, not so far.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4461.721,
    "end": 4463.505,
    "text": "And in some like C. elegans, maybe not at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4463.485,
    "end": 4481.902,
    "text": " But that idea that the more competency of kind of reparative, regenerative developmental process, you can eventually, if you take it to its logical conclusion, you can say, fine, we're going to assume that the structural genome is going to be all kinds of noise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4482.482,
    "end": 4489.268,
    "text": "And we're going to come up with an algorithm that can keep the morphology clean, assuming that that's the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4489.288,
    "end": 4493.492,
    "text": "And I think Planaria just like crank that knob all the way and salamanders sort of do it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4493.472,
    "end": 4496.356,
    "text": " And maybe nematodes don't do it much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4496.977,
    "end": 4499.04,
    "text": "That is very, very cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4499.48,
    "end": 4500.702,
    "text": "It makes me want to be a biologist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4500.742,
    "end": 4508.813,
    "text": "Because the question, if we have more time, and I know we don't, is, well, where on earth is that regenerative mechanism coming from if it's not encoded in the genome somewhere?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4508.833,
    "end": 4509.815,
    "text": "But we won't go into it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4510.075,
    "end": 4519.969,
    "text": "It just sounds to me like there are other ways to maximize model evidence, to use these active influence words, to maximize model evidence or to return to an attractor state beyond genomic stability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4520.793,
    "end": 4530.904,
    "text": " And that's really fascinating because I think people think, well, the priors, the so-called phenotypic priors, are just what evolution has endowed us in terms of our DNA.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4533.007,
    "end": 4533.107,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4533.127,
    "end": 4541.736,
    "text": "And so if we wanted to have another discussion, this is where we would talk about xenobots and anthrobots and these things that have never been under selection at the organism level in the history.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4542.377,
    "end": 4548.724,
    "text": "I've also been, I'll finish up here, but I've been reading a little bit of Evan Thompson in Mind and Life, and he talks about how, well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4549.328,
    "end": 4555.539,
    "text": " the auto poetic coupled system is not going, you can't discover that dynamic in the genome.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4555.559,
    "end": 4564.895,
    "text": "Because there are things that are also selected over time, which, which refer to the external dynamic, and which refer to the world in which we are born and thrown into.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4565.316,
    "end": 4566.578,
    "text": "And that's really important as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4566.598,
    "end": 4571.206,
    "text": "And I wonder whether what that interplay means in terms of regeneration and, and morphogenesis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4571.787,
    "end": 4572.248,
    "text": "But as",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4572.397,
    "end": 4575.423,
    "text": " as you're all aware, and I'm aware, we're limited in time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4575.443,
    "end": 4577.567,
    "text": "So we should I'd absolutely love to do this again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4577.627,
    "end": 4578.89,
    "text": "I mean, it was absolutely fascinating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4580.273,
    "end": 4580.994,
    "text": "Guys, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4581.836,
    "end": 4590.193,
    "text": "Just if you have a minute, it'd be great to know where people can find your details and also like what you guys have got coming up in the pipeline that people can be aware of.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4591.295,
    "end": 4592.397,
    "text": "France, you wanna go first?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4592.63,
    "end": 4592.951,
    "text": " Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4592.971,
    "end": 4597.399,
    "text": "I mean, you can basically look at our names on Scola and get some of our papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4598.2,
    "end": 4602.528,
    "text": "We have a great website for the Levin Lab that has a bunch of our research come culminated.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4603.63,
    "end": 4609.801,
    "text": "My papers coming up will actually look at some of these questions in an annual organism in Wolvox.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4609.862,
    "end": 4611.224,
    "text": "That's going to be happening soon.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4611.344,
    "end": 4612.326,
    "text": "I'm very excited about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4612.762,
    "end": 4623.818,
    "text": " um because all the works published for me right now is a lot of the theoretical simulations and talking about the concepts where i'm so excited about most of my phd work was trying to apply this to an animal organism and see",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4624.507,
    "end": 4650.058,
    "text": " not there's anything there um fantastic mike yeah so so the lab website is at drmike11.org one word drmike11.org and so that's where all the peer-reviewed stuff the the papers the protocols um data sets software everything is is there and then kind of a little bit uh more uh out there some thoughts are at a blog called thoughtforms.life and that's just my that's just my personal one",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4651.051,
    "end": 4655.025,
    "text": " I'll make sure everything goes in the video description so people can check it out there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4655.105,
    "end": 4656.209,
    "text": "But guys, thank you again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4656.249,
    "end": 4657.473,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4657.674,
    "end": 4658.918,
    "text": "Yeah, great conversation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4658.959,
    "end": 4659.46,
    "text": "Thank you so much.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4659.701,
    "end": 4660.022,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4660.644,
    "end": 4660.825,
    "text": "Pleasure."
  }
]