[
  {
    "start": 2.343,
    "end": 29.397,
    "text": " all right welcome back cohort seven we're in our second discussion on chapter two so let's head over to two we can begin with anyone's thoughts or reflections or any question or idea or section of the text they want to begin with or curiosity from two or just some quote they want to go to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 30.558,
    "end": 33.963,
    "text": " Anyone can just raise their hand or type it in the chat.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 51.447,
    "end": 52.549,
    "text": "Okay, Axel, go for it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 53.66,
    "end": 81.996,
    "text": " sure so one thing that i found a bit interesting it's on page 26 of the book um it says the person can resolve this discrepancy in two ways it's talking about this thing of looking at um like expecting to see an apple when you look and then actually seeing a frog and it says first she could change her mind about what she's seeing so actually that it's a frog instead of an apple um or she can foveate the nearest apple tree and see something that looks very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 83.208,
    "end": 100.727,
    "text": " resolved the initial discrepancy but in a different way so she's kind of doing an action to make the world fit more her model and they do another example afterwards but I am kind of curious about exactly how this trade-off is done when would you choose to do one thing over the other when would you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.707,
    "end": 117.164,
    "text": " choose to do an action versus when would you choose to do a, like an update of your internal model, especially in a situation where you don't know, you know, perhaps if you've had this situation happen many times, you kind of learn that it's important to know that it's a frog.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 118.045,
    "end": 121.989,
    "text": "So you don't want to look away, you want to update your model, but what if you're meeting it the first time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 122.389,
    "end": 123.651,
    "text": "I was a little bit confused about that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 127.555,
    "end": 128.255,
    "text": "Great question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 128.355,
    "end": 129.837,
    "text": "Anyone have a thought on this?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 135.74,
    "end": 160.296,
    "text": " you're likely doing both in parallel much of the time somebody who's too fixated on one or the other that tends to be a neurotic problem or worse that's that's great um but it's a few few ways to take this first there's the secret third option which is neither",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 161.693,
    "end": 168.562,
    "text": " have to be resolved, but it is kind of like the equivalent of a ball on a shelf.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 168.582,
    "end": 172.187,
    "text": "It's like an unresolved potential energy or like an unburned candle.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 172.347,
    "end": 176.192,
    "text": "It's like an unresolved Gibbs free energy differential.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 176.733,
    "end": 181.018,
    "text": "However, it isn't the case that a discrepancy is resolved one of these two ways.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 181.139,
    "end": 188.308,
    "text": "However, these are the two ways that there can be the reduction of discrepancy or discrepancy can continue to increase.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 188.626,
    "end": 202.668,
    "text": " So then the question is like, okay, in what ways are or could be discrepancy resolved through inference and through action?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 205.973,
    "end": 207.135,
    "text": "There's different ways to take this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 208.337,
    "end": 210.28,
    "text": "In the particular partition,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 210.8,
    "end": 214.148,
    "text": " So that's splitting up into these four nodes.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 214.869,
    "end": 223.77,
    "text": "These two nodes that constitute the two directions of the blanket, and then the internal and external states that are partitioned off from each other from that blanket.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 224.752,
    "end": 227.037,
    "text": "Those are all happening simultaneously.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 227.607,
    "end": 233.317,
    "text": " So one answer is they're both separately in play.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 233.637,
    "end": 240.93,
    "text": "So you can have a situation where neither belief updating nor action updating were happening, like a rock.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 241.692,
    "end": 247.742,
    "text": "You can have a situation where both were concurrently updating.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 248.212,
    "end": 254.76,
    "text": " Sometimes it can be helpful to think about these kind of multiple timescales of what changing the mind can look like.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 255.441,
    "end": 265.092,
    "text": "The fastest timescale, which is kind of equivalent to the forward pass on a neural network, is just the forward inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 265.993,
    "end": 270.659,
    "text": "That's just all the kind of parameters are staying the same.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 271.48,
    "end": 275.805,
    "text": "And then new observation comes in, the Bayesian update cranks.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 276.055,
    "end": 289.75,
    "text": " Then at a slightly slower time scales, corresponding to attention and learning mechanisms, there's kind of like, those are corresponding to like weight updating in a neural network.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 289.77,
    "end": 292.834,
    "text": "And so those are like slower kinds of changing the mind.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 295.697,
    "end": 300.382,
    "text": "Changing the world through action also, like that's very dependent on what the kind of action is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 301.564,
    "end": 302.805,
    "text": "For example, here,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 303.933,
    "end": 306.436,
    "text": " the eyes were moved.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 306.877,
    "end": 313.024,
    "text": "So it was a muscular action to bring the observations into alignment with the expectations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 313.685,
    "end": 315.827,
    "text": "However, there wasn't a change in the world.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 316.488,
    "end": 327.001,
    "text": "So visual activity is kind of a special kind of action because it doesn't modify the world, but it is still a way to reduce discrepancy through action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 327.602,
    "end": 330.625,
    "text": "So it's kind of on the borderline, like, is that changing the world?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 330.646,
    "end": 332.708,
    "text": "I mean, your eye is part of the world, so that is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 335.337,
    "end": 336.722,
    "text": " any kind of latent state.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 337.807,
    "end": 346.039,
    "text": "Then there are the actions that have like a more turning on the air conditioner or the heater that actually modify",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 346.289,
    "end": 374.912,
    "text": " the world so short answer they're both happening uncoupled and then when you look at the specifics of the generative model then you can you could separately talk about like the proclivities of a model to update its beliefs if it has a fixed belief distribution then it's not going to update its beliefs if it has a very broad belief distribution prior then observations may update its beliefs a lot",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 374.892,
    "end": 391.078,
    "text": " and then similarly depending on like the efficacy and the agency of the actions that are being discussed then maybe taking actions to modify you know changing the temperature in the room if you have a really fixed physiological prior on body temperature",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 396.037,
    "end": 419.428,
    "text": " changing the world if there's no air conditioner or the agent doesn't know about it and it's able to like learn different physiological um temperatures or has a very broad temperature range that it could be okay in maybe that would be the behavior that you'd see here's like the temperature",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 422.092,
    "end": 427.242,
    "text": " Simply changing one's mind does not seem very adaptive, but acting to lower the body temperature... is.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 432.74,
    "end": 433.04,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 433.06,
    "end": 433.481,
    "text": "Thanks a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 433.561,
    "end": 447.397,
    "text": "And I think I was just interested in about, so that makes sense to us that we get more out of trying to actively change our body temperature than just believing, oh, I actually don't have this body temperature anymore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 447.698,
    "end": 448.779,
    "text": "But where are we learning that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 448.879,
    "end": 451.402,
    "text": "Is that through some kind of trial and error that we're learning this?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 451.482,
    "end": 455.507,
    "text": "Is this like an evolutionary prior or where did we get this from?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 458.17,
    "end": 484.92,
    "text": " yeah it's a it's a good question so um when you construct the model then you get to create whatever the distribution is then I see well but how how did that prior on body temperature come to be and that the evolutionary account is um you know in the 98 degree thermal bacterial Niche the bacteria that didn't have optimal growth that didn't expect",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 487.212,
    "end": 498.947,
    "text": " those have been swept off the table, so we end up seeing a phenotypic distribution that's the fitness distribution of the bacteria in the thermal vent that corresponds to a thermal gradient.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 500.369,
    "end": 512.585,
    "text": "Another kind of consideration is actions are being selected also from a probability distribution.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 512.745,
    "end": 514.047,
    "text": "Like, there's no...",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 514.33,
    "end": 518.356,
    "text": " proposal of some auxiliary reward distribution.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 518.576,
    "end": 522.542,
    "text": "We're updating our policy prior habit into the policy posterior.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 523.163,
    "end": 524.766,
    "text": "We'll look at that later in the chapter.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 525.507,
    "end": 527.289,
    "text": "So we're doing inference on action.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 527.79,
    "end": 529.933,
    "text": "We have inference on perception.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 530.073,
    "end": 532.878,
    "text": "That's the active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 533.358,
    "end": 538.566,
    "text": "So in terms of the belief distribution on perceptions,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 542.225,
    "end": 570.983,
    "text": " about the temperature in the room but also there's the beliefs about turning on the air conditioner so now which which um then the the um sort of liability of both is defined so if the distribution that one of these if the habit distribution is like um a hundred percent I turn it on zero percent heater you know 100 air conditioners zero percent heater then that is like it's like a deterministic action selection",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 571.655,
    "end": 576.562,
    "text": " versus one that's more spread out across the action possibilities.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 577.384,
    "end": 581.089,
    "text": "So you can kind of get that interpretability when you see the model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 581.991,
    "end": 590.203,
    "text": "And then that's why there's like, when you do specify models, like, and this comes up in chapter six, you kind of think more structurally about the model.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 590.555,
    "end": 598.625,
    "text": " And then there tends to be a lot of parameter sweeping and like investigation across different combinations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 598.645,
    "end": 608.817,
    "text": "Like you could try 10 different kind of widths of prior on the perception side from very tight to very loose.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 609.398,
    "end": 613.963,
    "text": "And then similarly on the action side, sweep across 10 by 10",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 614.77,
    "end": 621.88,
    "text": " and then look at, you know, coloring each cell by the probability of times that they turned on the air conditioner.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 623.162,
    "end": 644.473,
    "text": "So it's not always just about finding like one kind of specific parameterization, especially with these more intuition pump models, but often it's more about sweeping and then looking at like, oh, you know, there's kind of a, there's a manifold where on this side, this is the case, and on that side, this is the case.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 648.52,
    "end": 649.281,
    "text": " Thanks a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 649.301,
    "end": 650.141,
    "text": "Yeah, thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 650.642,
    "end": 656.447,
    "text": "Any other question or chat?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 656.467,
    "end": 659.27,
    "text": "Oh, also just to sort of... Yeah, yeah, go ahead.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 659.87,
    "end": 660.151,
    "text": "Andrew.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 660.971,
    "end": 670.54,
    "text": "Are you saying this, but the space could potentially be not smooth, right, if there are jagged jumps in terms of response to different probabilities?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 674.724,
    "end": 676.165,
    "text": "Does...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 677.95,
    "end": 682.255,
    "text": " I'm not trying to be too technical, but does that make sense?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 682.636,
    "end": 688.162,
    "text": "It could be a jagged space that has like piecewise squares or something.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 689.204,
    "end": 689.564,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 689.584,
    "end": 692.067,
    "text": "It could be a fully discreet space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 692.167,
    "end": 702.339,
    "text": "I mean, there, there could be a continuous space also with, with non-linearities, but also it could just be a fully non-linear or I mean a fully discreet space.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 702.36,
    "end": 704.362,
    "text": "Like it could be a checkers game or a chess game.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 705.924,
    "end": 706.084,
    "text": "Mm-hmm .",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 709.135,
    "end": 715.324,
    "text": " So then those sweeps would have sharp boundaries.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 720.532,
    "end": 721.554,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 721.574,
    "end": 721.994,
    "text": "Yeah, go ahead.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 723.316,
    "end": 728.444,
    "text": "Well, that just matches that it doesn't have to be nice.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 733.992,
    "end": 738.619,
    "text": "Because I was thinking, why would you do parameter sweeping instead of some type of optimization like...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 738.92,
    "end": 767.897,
    "text": " there may not be a nice you know smooth space to do optimization on so yeah yeah i mean you've explored that i know in a lot of areas sometimes when you fully like the fully synthetic when you fully get to specify it like we're playing connect four so it's a discrete space there's this discrete action space there's a discrete game play space or tic-tac-toe",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 768.923,
    "end": 783.675,
    "text": " then it's like well-behaved and discreet but then when you get into like discretized forms of systems that have continuous character then like then there's all these other issues that could come up",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 789.022,
    "end": 792.286,
    "text": " Also just want to make one kind of general comment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 792.306,
    "end": 796.011,
    "text": "Just chapters one and 10 are like bookends.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 796.172,
    "end": 798.154,
    "text": "It's like introduction and kind of conclusion.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 798.254,
    "end": 799.957,
    "text": "And they're similar chapters.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 799.997,
    "end": 801.879,
    "text": "They contextualize active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 803.001,
    "end": 808.368,
    "text": "Chapter four is where we're going to meet the actual generative model itself.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 809.229,
    "end": 815.738,
    "text": "The generative model is kind of like the transfer station or the midpoint on the high road and the low road.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 816.46,
    "end": 821.545,
    "text": " We're in chapter two, so we're talking about model architecture.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 821.605,
    "end": 823.267,
    "text": "So these are things that you can build.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 824.208,
    "end": 842.147,
    "text": "These are starting from Bayes equation and using Bayesian statistics to build up architectures that have a perception inbound sense-making element and an action outgoing control theoretic element.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 843.545,
    "end": 866.565,
    "text": " the high road is where we'll get to the free energy principle that's kind of like imperative for survival and some of those topics but in the low road it's kind of like tinkering and cobbling with different model architectures and motifs I have a question uh-huh so I'm",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 867.457,
    "end": 872.867,
    "text": " From the transitioning from free energy to expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 874.491,
    "end": 883.408,
    "text": "I mean, I guess it makes a lot of sense to actually take the expected value of the free energy, but is there like that derivation wasn't really that clear to me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 883.428,
    "end": 885.792,
    "text": "It was just like, here's the expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 886.794,
    "end": 890.241,
    "text": "Do you have any good resources of where you can actually see that derivation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 891.807,
    "end": 892.488,
    "text": " Great question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 892.508,
    "end": 897.012,
    "text": "Well, one is in Octopus's math work.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 899.976,
    "end": 904.701,
    "text": "I think tomorrow and continuing, it'll be drawn out a little bit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 905.521,
    "end": 912.629,
    "text": "Also over it, you can follow it, click on the little icon for the A. Here's equation 2.5.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 913.33,
    "end": 914.831,
    "text": "So a few things about the equation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 915.932,
    "end": 917.494,
    "text": "We have the screenshot.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 918.031,
    "end": 939.617,
    "text": " also there's there's the uh plain latex this can help if you are putting it into like a language model and and we have some of these experiments with like interpreting and asking questions about it not not saying they're all 100 like complete or anything but in the canvas for two point and then also for for many but not all the equations there's the",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 940.576,
    "end": 958.838,
    "text": " um natural language like pronunciation basically which could be helpful and so if it's missing people people can add it so that that can um we'll have to fix this because it looks like a lot oh I I know what happened here",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 970.563,
    "end": 971.265,
    "text": " There we go.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 971.285,
    "end": 971.986,
    "text": "So these are the lines.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 972.006,
    "end": 973.209,
    "text": "All right.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 973.329,
    "end": 975.554,
    "text": "In 2.5, there's a few resources.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 976.376,
    "end": 984.835,
    "text": "So let's just, how do we get to 2.5 and 2.6?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 986.478,
    "end": 989.044,
    "text": "These are some of the key equations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 992.095,
    "end": 996.263,
    "text": " Okay, equation 2.5 is variational free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 997.585,
    "end": 1000.631,
    "text": "Both VFE and EFE are functionals.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1001.312,
    "end": 1006.041,
    "text": "So there are functions that have the arguments that are other functions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1006.562,
    "end": 1008.906,
    "text": "The arguments can include other functions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1009.147,
    "end": 1010.83,
    "text": "So F is the functional.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1011.164,
    "end": 1034.488,
    "text": " q is the variational belief distribution q is the distribution that we get to control the form of so it is set by the modeler to have like an analytically tractable form like a gaussian approximation so even if the world is non-gal you know the world's bimodal and then the modeler's saying but i'm using a gaussian so that gives me",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1035.835,
    "end": 1036.476,
    "text": " nice methods.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1036.577,
    "end": 1049.405,
    "text": "Then also all the pathologies, like if the world's bimodal and you're fitting a Gaussian, you could, you know, potentially you fit only one hump, but not the other, or you end up blurring over both and fitting them.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1049.425,
    "end": 1053.253,
    "text": "So it's not, not, not that if, you know, if there's a mismatch on form, um,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1053.487,
    "end": 1065.783,
    "text": " then this will lead you downhill to not necessarily like the best of all possible outcomes, but given the selection of the form of Q, it will be the best possible outcome.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1066.684,
    "end": 1070.509,
    "text": "It's a functional of the belief distribution and one incoming data point.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1070.769,
    "end": 1071.01,
    "text": "Why?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1072.332,
    "end": 1080.422,
    "text": "So variational free energy is kind of like this real time check on like, how surprised am I with this data point?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1081.263,
    "end": 1093.946,
    "text": " Daniel Katz- variational free energy bounds surprise minimizing surprise is equivalent to maximizing model evidence if you were minimally surprised with a new temperature readings coming in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1094.767,
    "end": 1101.82,
    "text": "Daniel Katz- That would be equivalent to saying you had like the maximum likelihood model of the temperatures coming you're making the best possible predictions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1102.137,
    "end": 1104.239,
    "text": " is equivalent to saying that you were minimally surprised.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1104.84,
    "end": 1106.982,
    "text": "So this is bounding minimal surprise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1107.522,
    "end": 1114.309,
    "text": "Then it is only dealing with belief in a moment and one data point coming in.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1114.709,
    "end": 1119.334,
    "text": "So that's why it's this kind of like real-time sense-making indicator.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1120.415,
    "end": 1130.625,
    "text": "2.6 is when we start looking into talking about observations that haven't happened yet, the future, and action planning.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1131.297,
    "end": 1160.308,
    "text": " g expected free energy it's taking in pi which is this policy vector it sums to one it's a probability distribution over actions the policy prior is the habit distribution g is going to sharpen that policy prior into a policy posterior which then you could sample from like according to the probabilities or you could just select the likeliest action",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1160.828,
    "end": 1162.75,
    "text": " Okay, how do we get between the different lines?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1162.891,
    "end": 1167.897,
    "text": "Again, in this canvas here for 2.5 and 2.6, there's some useful resources.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1168.898,
    "end": 1172.002,
    "text": "Here's equation 2.5 walkthrough.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1175.506,
    "end": 1183.697,
    "text": "Ali Ramjoo, Yaqbs McCall, Jonathan Schock have all done, have contributed variously to these sections.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1184.257,
    "end": 1187.882,
    "text": "So that's one good PDF.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1189.567,
    "end": 1215.0,
    "text": " here i think this was jacob's the interesting thing for 2.5 and this is like again why there's so many dots to connect with the math is 2.5 actually um it's not that one you go to two and two you go to three",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1216.128,
    "end": 1224.92,
    "text": " Maybe there's a way to do that as well, but here's the derivation going from one to two and then one to three.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1226.983,
    "end": 1229.226,
    "text": "So these might be some useful resources.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1231.709,
    "end": 1241.342,
    "text": "Also here, let's see if this resource is still there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1245.338,
    "end": 1251.711,
    "text": " Professor Jonathan Schock has written up a sort of math overview.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1253.354,
    "end": 1253.975,
    "text": "August 12.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1254.336,
    "end": 1259.466,
    "text": "I don't know if that renders to the current date, just or if it was like actually edited this current date.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1260.308,
    "end": 1262.352,
    "text": "That also has a lot of information.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1264.171,
    "end": 1289.976,
    "text": " so that's something that that takes a lot of uh coats of paint i think but it it really is there and grounded and if we can pull out and help highlight like all those threads and show okay here's where this is grounded in the definition of shannon entropy or here's where this is grounded in the definition of surprise and likelihood that'll be cool",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1291.475,
    "end": 1299.328,
    "text": " One other thing I'll say is variational free energy is kind of more of a classic quantity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1300.069,
    "end": 1307.962,
    "text": "It's the quantity that's used in variational inference, like variational physics, variational autoencoders, and so on.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1308.803,
    "end": 1316.335,
    "text": "Whereas expected free energy is just one choice of a way to model futures.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1317.715,
    "end": 1321.439,
    "text": " For example, there's also, this is EFE, expected free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1321.899,
    "end": 1324.803,
    "text": "Also there's free energy of the expected future.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1325.543,
    "end": 1334.153,
    "text": "So there's several other future oriented approximators that have been proposed, but variational free energy is kind of the classic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1335.714,
    "end": 1335.874,
    "text": "Adam?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1339.979,
    "end": 1347.587,
    "text": "Yeah, like something that I'm wondering about, and I haven't really quite like understood yet, is that, so from,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1347.803,
    "end": 1369.424,
    "text": " like my, my own personal past and like where I'm coming from up until active inference, I had been reading quite a bit about like maximum entropy inference in like John Hart from Berkeley and Edward Thomas Janes and, uh, even like Pierre Laplace and, um, trying to think.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1369.764,
    "end": 1372.106,
    "text": "So anyways, definitely like ET Janes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1373.087,
    "end": 1377.051,
    "text": "He was really like a proponent of max and inference and, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.87,
    "end": 1403.654,
    "text": " Prior to active inference, I had been thinking about like the stability of systems in the maximum entropy state and the way that if the energy of the free energy equation is constant, then by the increase of entropy, it automatically minimizes the free energy, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1403.714,
    "end": 1407.898,
    "text": "So just that the min free energy is the equivalent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1408.891,
    "end": 1414.577,
    "text": " or not necessarily, but can be equivalent to the maximum entropy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1414.597,
    "end": 1423.968,
    "text": "And so I don't know if anyone else has been thinking about this or maybe if you like also, I don't know, any thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1425.589,
    "end": 1427.391,
    "text": "Yeah, that's a great question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1427.932,
    "end": 1435.32,
    "text": "It has not been fully fleshed out, but here's one kind of recent",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1435.79,
    "end": 1462.624,
    "text": " discussion where it came up and where they explicitly highlighted this okay so here was it um okay this is the active data sampling paper so observations um it's kind of this is kind of like like building on that discussion of the equation 2.5 vfe so that's where the variational free energy for data point and a prior are going to be described",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1463.735,
    "end": 1472.447,
    "text": " You could also look at a data point and your prior and describe what was the epistemic value of that data point coming in?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1472.467,
    "end": 1474.149,
    "text": "How much did we learn from it?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1475.911,
    "end": 1479.536,
    "text": "Here, they're in a clinical study setting.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1480.117,
    "end": 1489.59,
    "text": "So the real target uncertainty to resolve is about the efficacy of these different treatments.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1495.342,
    "end": 1504.793,
    "text": " They use max-ent sampling, and then they also compare that with the expected information gain-driven sampling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1505.754,
    "end": 1512.602,
    "text": "So there's a very... Okay, here we go.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1514.083,
    "end": 1520.691,
    "text": "Several of the examples would yield identical results had we adopted data sampling based upon max-entropy sampling.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1521.498,
    "end": 1526.405,
    "text": " the key differences emerge when variance around predicted outcomes is inhomogeneous.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1527.527,
    "end": 1548.417,
    "text": "So when there's equal variability profiles, like let's just say that we're interested in the temperature distribution in this room, and all of our sensors have equal sensor variability, then we can sample from the sections that we're least certain about the temperature,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1548.903,
    "end": 1552.347,
    "text": " And that's like a max-ent sampling strategy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1553.588,
    "end": 1561.897,
    "text": "However, let's just say that there was regions in the room that had different variability, and there were sensors with different variability.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1561.977,
    "end": 1567.823,
    "text": "So just to kind of simplify it, let's just say we had high and low variability sensors, and there's high and low variability areas in the room.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1568.684,
    "end": 1578.555,
    "text": "So if we were just going to sample based upon variability, period, measurement variability, like total variability,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1578.991,
    "end": 1592.989,
    "text": " then maybe we'd be ending up sampling from sensors that were highly variable, but regions where we actually were not that uncertain about the temperature at that location.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1594.872,
    "end": 1604.965,
    "text": "So in the case where the sensor variability we don't have to worry about, then these approaches are equivalent.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1606.126,
    "end": 1628.387,
    "text": " but there is actually an additional level of nuance possible so it's it's closely aligned with Max and I think again it would be it would be great to to draw this out better but um it's sampling from a total epistemic value which is able to kind of like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1631.27,
    "end": 1651.405,
    "text": " accommodate that case where there's variability in sensors and the variability in the temperatures parts of the room yeah i see that i'll have to look into that sounds interesting cool yeah the slides are there in the paper um and and we that's a interesting thing to keep on exploring",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1652.144,
    "end": 1680.784,
    "text": " what exactly what exactly um this is just on the website i can get to this yeah yeah um just here's the just like 57.0 that was the the background and then 57.1.2 um carl friston and thomas parr joined i forget which one of the weather it was down one or two but in one of them carl gave a very vociferous defense of epistemic value",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1681.068,
    "end": 1686.053,
    "text": " Because oftentimes people say, okay, epistemic value learning in service of pragmatic value, right?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1686.433,
    "end": 1689.396,
    "text": "Like learning is good for something when it's pragmatic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1690.096,
    "end": 1701.327,
    "text": "And he gives an extended thought on like how they're kind of like separate, but they're unified under the expected free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1701.367,
    "end": 1710.535,
    "text": "But like epistemic value is its own distinct kind of value from pragmatic value.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1711.257,
    "end": 1740.117,
    "text": " whether or not those learnings contribute to epistemic I mean contribute to pragmatic outcomes no sorry all over my hand okay yeah this the epistemic um like active data sampling like on the biological side it's really interesting because it describes for example isocades",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1741.244,
    "end": 1746.525,
    "text": " epistemic driven action selection, but then also they explore having a cost function.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1746.565,
    "end": 1751.625,
    "text": "So that could be like, how much, how much sense does it cost to make an API call",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1753.124,
    "end": 1762.542,
    "text": " And then that is the parameterization question is like how much epistemic value, how many bits of information are worth one cent of an API call?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1763.444,
    "end": 1775.908,
    "text": "Or in the case of the clinical trial, there's like you could have a cost associated with the number of times that sampling occurs or cost reflected by a preference for survival.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1776.412,
    "end": 1791.176,
    "text": " But if the preference is purely for survival and it was like some kind of extreme utility driven clinical trial, then a sampling algorithm would choose to sample nothing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1791.196,
    "end": 1794.321,
    "text": "So it'd be uninformative with zero observations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1795.062,
    "end": 1803.415,
    "text": "However, it would have achieved maximum preference satisfaction because it wouldn't have observed any sickness or death.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1805.69,
    "end": 1807.993,
    "text": " So they talk about a few of these kind of like interesting cases.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1811.699,
    "end": 1814.583,
    "text": "And they build it up very clearly.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1815.525,
    "end": 1820.452,
    "text": "Like how do you add in the cost and all these different things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1822.735,
    "end": 1826.621,
    "text": "And this is like a different graphical model than comes up in the textbook.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1826.701,
    "end": 1833.351,
    "text": "Again, it's the clinical trial setting, but to connect it with the textbook, like,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1834.833,
    "end": 1847.863,
    "text": " these are bayesian graphical models and so a lot of the the kind of structural analysis of a situation comes down to",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1848.232,
    "end": 1872.973,
    "text": " are the variables what are like the observable variables what are the environmental variables what are the there's there's not really like an agent like you kind of sense an action agent unless you chose to see like the clinical design teams observations and decisions in that light um what are the observations what are the environmental variables what are their influences upon each other",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1874.337,
    "end": 1876.739,
    "text": " that lays out like the skeleton.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1877.82,
    "end": 1897.318,
    "text": "And then there's the question of either generating synthetic data from that skeleton in the forward direction, or explored in chapter nine of the textbook is like, how do you go from observations to inference on those latent factors?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1897.338,
    "end": 1901.222,
    "text": "Like what is the efficacy of the treatment?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1915.377,
    "end": 1943.865,
    "text": " anyone else give it like a thought on chapter two or question or a page or we can look at some of the questions come on let's go for it yeah thanks um yeah i've been thinking a bit about like the distinction between free energy and expected free energy and sort of thinking about like so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1945.263,
    "end": 1964.512,
    "text": " like in a way aren't all actions requires planning or like is there actually a clean distinction in practice when we minimize F and when we minimize G or is it like a bit of a fussy line in between and in practice we're only doing the one or if you know what I'm getting at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1965.133,
    "end": 1965.433,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1967.476,
    "end": 1968.638,
    "text": "Great question.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1969.293,
    "end": 1972.717,
    "text": " So let's go to PyMDP documentation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1973.118,
    "end": 1977.704,
    "text": "This can clarify a few of those things.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1978.605,
    "end": 1991.942,
    "text": "One heuristic is if you're considering explicit planning, so more than one time step ahead, like policy sequences that have a time horizon that's not one.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1992.968,
    "end": 2006.116,
    "text": " If you want to do explicit planning, tree search, policy rollout, deep active inference, then you do need to use expected free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2006.918,
    "end": 2009.323,
    "text": "So if explicit planning is going to come into play,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2010.046,
    "end": 2012.729,
    "text": " then you go with expected free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2013.67,
    "end": 2023.443,
    "text": "If it's just single time step, then you can just sort of have that reactive updating.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2026.106,
    "end": 2027.868,
    "text": "Yeah, hands up.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2028.529,
    "end": 2033.876,
    "text": "That's in the equations.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2035.818,
    "end": 2036.439,
    "text": "Equation 2.5.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2036.499,
    "end": 2039.142,
    "text": "Put it in the chat.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2041.332,
    "end": 2047.01,
    "text": " Yeah, so if there's explicit planning, yes, EFE has to come into play.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2048.495,
    "end": 2052.608,
    "text": "If you have an agent that is not doing explicit planning,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2054.495,
    "end": 2080.283,
    "text": " it could do action selection using VFE so what that would look like and and is like you have um uh belief distribution on the temperature in the room and a belief distribution on your habits related to the air conditioner like I'm 50 likely to turn on the air conditioner or not new observation comes in it instantaneously updates the belief distribution that's the sense making element and it instantaneously",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2083.064,
    "end": 2086.448,
    "text": " policy distribution, which is then sampled from.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2087.569,
    "end": 2100.202,
    "text": "So there's not rollout or anticipation explicitly of future unobserved outcomes, which is what you would get with EFE, but you only get one time step there.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2109.732,
    "end": 2112.835,
    "text": "Here in PyMDP,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2113.237,
    "end": 2138.282,
    "text": " it's um they really especially in the um documentation make it pretty clear and declarative like there's only two actions here but here even for a single time step moving left and moving right there they are considered with expected free energies because there's actually like a question",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2141.215,
    "end": 2154.33,
    "text": " expect to see if i went right so that's kind of like you know there's a lot ways to shade that but that's kind of like the teleological aspect of action is when expected free energy comes into play which is like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2156.032,
    "end": 2168.906,
    "text": " I went left versus what would I see if I went right versus the sort of past pushing forward without an explicit teleology would be like, I have a 50% chance of left and right prior on policy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2169.868,
    "end": 2176.235,
    "text": "I just saw a light or a glucose gradient from the left that just bumped me to 60, 40.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2176.255,
    "end": 2182.942,
    "text": "I sampled from the 60, 40 and I go left, but it wasn't based around what would I see?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2183.883,
    "end": 2184.604,
    "text": "So it wasn't like based",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2187.807,
    "end": 2211.047,
    "text": " of these two alternatives that's the real policy like planning as inference versus more of like a reactive policy just habit unupdated or updated habit distribution and then just drawing from that without explicit consideration of the consequences",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2215.617,
    "end": 2217.62,
    "text": " And maybe just a short follow up question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2218.281,
    "end": 2228.735,
    "text": "So yeah, I guess you can make it like really clear when, when writing a program about it, but in the context of, of living organisms, when you, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2228.755,
    "end": 2239.67,
    "text": "So like, what is, what is one time step that could maybe like develop that discussion a bit on like specific for living organisms?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2244.657,
    "end": 2245.017,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2245.537,
    "end": 2257.93,
    "text": " Well, map and territory, how do we develop continuous and or discrete time models, maps of complex multi-scale systems?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2258.671,
    "end": 2265.298,
    "text": "Like there's not really a natural time click for a body per se.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2265.338,
    "end": 2267.06,
    "text": "It's not simply like the heartbeat.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2267.1,
    "end": 2268.521,
    "text": "It's not the seconds.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2268.541,
    "end": 2269.222,
    "text": "It's not the breath.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2270.263,
    "end": 2273.046,
    "text": "So then there's a lot of modeler degrees of freedom.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2273.836,
    "end": 2276.984,
    "text": " with how they model time.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2278.569,
    "end": 2290.039,
    "text": "And then to what extent the modeler chooses to test, here's some models I made where there's planning happening, and here's some models where planning isn't happening.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2298.372,
    "end": 2326.0,
    "text": " does anything plan or when does planning happen or like one old active joke was like active inference only works for one time step but then you can compress and make that one time step very complex so that you like it could be one multi like one nested time step that that would",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2329.439,
    "end": 2341.313,
    "text": " Like if, let's just say that we were talking about like financial decision-making or something like that, and we had a policy decision that was being made at the yearly timescale.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2343.155,
    "end": 2356.932,
    "text": "If someone only knew about day-to-day decision-making, that one timescale of the yearly model might look like it had been planned over many days, or there could be a map",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2357.148,
    "end": 2385.096,
    "text": " just said we have a single policy we make one decision per year but then that model wouldn't be able to make decisions day by day but it might look you know it this just gets into like how i mean and we can make many models from the biological phenomena and then that's kind of the interesting question like is there evidence for planning in isocades or is it simply markovian",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2385.667,
    "end": 2398.366,
    "text": " And we can totally account for eye saccades based upon location of the gaze at a moment, the incoming observation, and the belief distribution about what would be epistemically valuable.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2399.127,
    "end": 2409.822,
    "text": "Or is there a residual that that model is not accounting for that is suggestive of two-step saccade planning?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2410.143,
    "end": 2410.864,
    "text": "I don't know.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2411.333,
    "end": 2418.144,
    "text": " But those are like the kinds of research pathways where if you are looking for, where is their planning happening?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2424.273,
    "end": 2428.56,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2428.7,
    "end": 2429.241,
    "text": "Axel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.335,
    "end": 2430.716,
    "text": " Sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.736,
    "end": 2432.939,
    "text": "So I'm pretty new to active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2433.019,
    "end": 2440.269,
    "text": "I'm kind of trying to right now get a intuitive feeling for some of the equations, especially the one we were looking at before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2440.71,
    "end": 2447.34,
    "text": "I'm wondering if we could just talk a little bit about how the terms kind of relate to each other and how actually I might be able to send you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2448.501,
    "end": 2451.626,
    "text": "I just kind of cooked up something quickly before here in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2452.066,
    "end": 2456.713,
    "text": "I kind of tried to create a visualization of the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2457.217,
    "end": 2458.818,
    "text": " I don't know if you have access to it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2459.839,
    "end": 2460.46,
    "text": "I sent the link.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2460.48,
    "end": 2461.381,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2461.401,
    "end": 2463.463,
    "text": "So basically, let's see here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2463.863,
    "end": 2474.953,
    "text": "Yes, the idea is that you have like the Q of X and the P of X and Y. And as far as I understand, I might have made some mistakes, but as far as I understand, you minimize the free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2475.054,
    "end": 2478.236,
    "text": "We're looking at like the top version of the equation, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2478.277,
    "end": 2478.977,
    "text": "The first line.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2480.398,
    "end": 2483.882,
    "text": "So we have the Q of X, which is our belief distribution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2484.262,
    "end": 2485.283,
    "text": "Is that correct?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2485.702,
    "end": 2512.722,
    "text": " like our belief of the hidden states yep then we have the p of y and x which is just the probability of y and x happening as far as i understand when p of y and x and q of x are like exactly the same that minimizes free energy is that correct yeah well great work with this this is this is super cool and it'd be awesome to to continue to develop these",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2518.692,
    "end": 2546.792,
    "text": " um yeah like what variational optimization does is the modeler has chosen their family of variational distributions that they're going to be sliding the well-behaved knobs on so like we're going to be using a gaussian again that's not saying the world is gaussian it's saying the the modeler is choosing to to do optimization you know descent with this gaussian um",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2546.772,
    "end": 2557.484,
    "text": " and then the ball rolling downhill on that variational free energy landscape until it rests at the bottom, what is the bottom of that energy well?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2557.524,
    "end": 2570.839,
    "text": "It's where that observation coming in, given the belief distribution, is the least surprising possible, or it bounds surprise.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2570.887,
    "end": 2584.646,
    "text": " Now, that bound, if the generative process were Gaussian and the generative model is Gaussian, then you'll get, like, then it bounds surprise and kisses it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2585.827,
    "end": 2599.105,
    "text": "If the generative process were something different and you were doing a Gaussian approximation, you still would get the best possible Gaussian approximator, but then there would be still, like, a constant approximation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2601.329,
    "end": 2620.975,
    "text": " that that was like surprised they couldn't be reduced because you were fitting the best possible Gaussian but it still was being um because it was like not the same family as a generative process couldn't reduce all the uncertainty but yeah this is really cool",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2621.326,
    "end": 2623.674,
    "text": " This is just very quick.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2623.734,
    "end": 2627.667,
    "text": "But I do think it helps to kind of play around with it and get a feeling for how things change.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2627.687,
    "end": 2632.483,
    "text": "Because one thing I read in the book was that if you set the mean of both to zero,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2632.565,
    "end": 2661.019,
    "text": " um you can see that uh i have to add some kind of quick reset button as well but you can see that as the they say that if you have a little evidence which would mean that your p of x and y would be really really kind of broad right so if you turn the the bottom uh all the way up like the yeah you turn it up then you start getting a free energy that's higher but then actually as you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2661.674,
    "end": 2667.323,
    "text": " They say that you should, as far as I understand it, that when you don't have a lot of evidence, you should also be very uncertain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2667.483,
    "end": 2674.234,
    "text": "So if you, I'm seeing the P of X and Y distribution as being broad, as not having a lot of evidence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2674.835,
    "end": 2682.568,
    "text": "And then if you take the Q of X and take the standard deviation up on that, while the, or sorry, the standard deviation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2684.354,
    "end": 2694.846,
    "text": " you'll see that if the standard deviation of the P, X, and Y is also very, very broad, it does minimize variational free energy as well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2695.727,
    "end": 2700.412,
    "text": "Does that make sense with what the truth is?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2702.314,
    "end": 2702.835,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2704.196,
    "end": 2713.787,
    "text": "I'm really interested in this change from a single well",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2715.522,
    "end": 2733.594,
    "text": " to potentially, I mean, potentially some plateau and then here potentially like a symmetry break where if the first observation coming in were here, maybe it breaks to the right and then continues to follow the gradient and down to here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2734.575,
    "end": 2740.686,
    "text": "And then a future observation couldn't, even if it came from here, it'd be like, okay, now back to here and back.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2741.527,
    "end": 2761.476,
    "text": " then it's like trapped in an energy well so it's like what are these situations where even when we have a gaussian prior and a gaussian generative process like what is happening where we're getting a more like a um quartic like kind of two energy well",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2762.553,
    "end": 2763.894,
    "text": " Free energy distribution.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2764.415,
    "end": 2766.597,
    "text": "So I'm not sure if I'm illustrating it in the wrong way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2766.777,
    "end": 2781.451,
    "text": "And maybe like the blue graph is basically Q of X times the natural logarithm of P of Y and X before it gets kind of summed up into B. So that's kind of what that's showing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2781.472,
    "end": 2786.677,
    "text": "I don't know if that was the same thing you were referring to, but just so you know.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2787.237,
    "end": 2787.698,
    "text": "Yeah, cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2787.798,
    "end": 2788.138,
    "text": "Maybe.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2793.755,
    "end": 2799.394,
    "text": " post the repo that it comes from, but this looks cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2800.775,
    "end": 2801.956,
    "text": " So just one quick follow up.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2801.976,
    "end": 2815.672,
    "text": "So earlier in the beginning, you were talking about I mean, can I understand it in that way that when you're very certain because they say in the book that if you are if you have little evidence, then you should also not be so certain in your model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2816.312,
    "end": 2828.706,
    "text": "And I'm wondering whether that uncertainty is characterized by having a very broad question, for example, and whether the lack of evidence is also kind of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2830.07,
    "end": 2856.162,
    "text": " do you say represented by having a very broad gaussian if you're using a gaussian yes this kind of relates like you have to the standard deviation um what comes up later is this like learning by counting so let's just say we've observed one heads and one tails we might have um a distribution",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2860.04,
    "end": 2861.161,
    "text": " but it might be very broad.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2862.102,
    "end": 2868.888,
    "text": "Whereas if we had 1 million heads and 1 million tails observed, then we would have very sharp Gaussian around 0.5.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2870.65,
    "end": 2886.925,
    "text": "So there's different ways to kind of implement that, but broadly, when you're less confident, when there's more epistemic value on the table, then belief distributions come to look like uniformity.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2888.187,
    "end": 2892.633,
    "text": " And then as you gain precision, it gets more of a central tendency.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2893.034,
    "end": 2898.722,
    "text": "And then the extreme case is basically a Dirac delta function.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2898.742,
    "end": 2904.089,
    "text": "So it's just a spike at one location that might not even be learnable.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2904.87,
    "end": 2906.112,
    "text": "And then it's just like, it's here.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2907.113,
    "end": 2917.688,
    "text": "And then even if you have a spike at 0.5, then it doesn't matter what you observe because there's no probability mass outside of that one spike.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2920.672,
    "end": 2945.65,
    "text": " like discarded whereas the uniform prior um is which is kind of like the frequentest case interestingly is like the the i mean it's the least biased in terms of its sensitivity but then then you realize oh but then the but updating is the bias that is statistical bias",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2948.836,
    "end": 2950.278,
    "text": " Well, thanks a lot.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2950.318,
    "end": 2958.107,
    "text": "And if anyone else is interested in building these kind of tools or something, please reach out to me because I think it'd be pretty nice to have some more visualizations of how these things play together.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2959.729,
    "end": 2960.91,
    "text": "But thanks a lot for the explanation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2961.451,
    "end": 2962.692,
    "text": "Yeah, it'd be so fun.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2962.753,
    "end": 2976.649,
    "text": "For each equation, we could have natural language and translations, pseudocode, some different languages, some interactables.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2977.0,
    "end": 2982.648,
    "text": " Like, what are the kind of like different forms that we could interact with?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2982.708,
    "end": 3005.421,
    "text": "And also like where and when and how, like in theory and in the specific implementations, you know, the dozens of implementations, like where did the modelers choose to use the energy minus entropy kind of statistical mechanics decomposition of F?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3005.755,
    "end": 3030.177,
    "text": " where did they use a complexity minus accuracy kind of statistics basing information criterion type and then where is there like a divergence minus evidence like if they're equivalent then does it matter or like are one of these more computationally intensive to compute or is there",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3032.738,
    "end": 3035.743,
    "text": " one of these decompositions on F is better.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3035.803,
    "end": 3042.414,
    "text": "And then that really gets opened up in the policy selection for expected free energy.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3043.055,
    "end": 3047.402,
    "text": "Like we talk the most about epistemic plus pragmatic value.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3048.223,
    "end": 3052.57,
    "text": "That's a very interesting decomposition for policy selection.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3053.748,
    "end": 3081.24,
    "text": " it's equivalent to these two ambiguity plus risk kind of classic control theory-esque um investing type decompositions and then both of these are equivalent to the again energy minus entropy but then it's like but then are we even talking about planning if we're talking about energy minus entropy or how and then like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3083.043,
    "end": 3084.364,
    "text": " What if we had like a Venn diagram?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3084.384,
    "end": 3088.349,
    "text": "It's like, here's the total amounts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3088.469,
    "end": 3091.932,
    "text": "Here's the variance that's getting partitioned into epistemic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3092.353,
    "end": 3094.755,
    "text": "Here's the variance that's getting partitioned into pragmatic.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3095.476,
    "end": 3108.73,
    "text": "Now, I don't think the same variance is going to ambiguity and risk, nor to energy and entropy, because the terms are not equivalent to epistemic plus pragmatic value.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3109.52,
    "end": 3121.612,
    "text": " So it's like, so what loads on pragmatic value, then does that get, does that get loaded onto risk or onto ambiguity?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3123.073,
    "end": 3126.637,
    "text": "Does pragmatic value get loaded onto entropy or onto energy?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3127.958,
    "end": 3131.141,
    "text": "Again, is there a reason or how did different modelers do it?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3131.181,
    "end": 3136.827,
    "text": "The top line for G is the most common.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3138.106,
    "end": 3165.902,
    "text": " and the top line for for F is the most common I don't know though but those are like they're they're given as a first line because they're kind of like the classic form but it's it's an interesting topic the rule of four or more octopus yeah what is the rule the rule of four is an idea from teaching math that developed in the 90s that was",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3166.675,
    "end": 3171.642,
    "text": " Every concept you look at, you try to have at least four different representations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3171.922,
    "end": 3181.195,
    "text": "Usually they're verbal, numeric, symbolic, and verbal, numeric, symbolic, and visual.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3182.237,
    "end": 3193.032,
    "text": "And what you were saying about like, we have all these different representations and then we could add more was just echoed that for me.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3193.052,
    "end": 3193.392,
    "text": "Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3195.228,
    "end": 3225.133,
    "text": " yeah and here we have we have there's we have different words in like different natural languages different graphical um symbolic could include executable code and then there could be some some wild cards games and stuff like that but yeah it always pops up it seems maybe i mean for each of the equations we could have a column for like these",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3225.873,
    "end": 3233.786,
    "text": " And then that creates like, you know, if there's 50 equations, then it's just like, we can just say, okay, here's the empty cells.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3234.367,
    "end": 3236.811,
    "text": "Let's try to get something into each of these cells.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3241.239,
    "end": 3246.908,
    "text": "Yeah, that's I'll just delete this.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3247.109,
    "end": 3249.653,
    "text": "Um,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3250.747,
    "end": 3254.652,
    "text": " Yeah, I mean, this is cool and these are great questions.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3254.692,
    "end": 3259.278,
    "text": "That's what chapter two, again, we haven't even gotten to active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3259.879,
    "end": 3272.495,
    "text": "This is saying, okay, base optimality, probabilistic, probably approximate base, like PAC, probably approximately correct.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3273.917,
    "end": 3279.825,
    "text": "Here's the particular partition, splitting systems into these four parts.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3280.143,
    "end": 3306.218,
    "text": " nodes minimum of four that's another rule of four more kind of splitting into four two blanket states internal and external getting into what's basically a variational auto encoder here it is framed in the sense making setting and then extending that variational auto encoder into the decision making setting",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3307.328,
    "end": 3325.533,
    "text": " showing that that expected free energy unifies objective or imperative or kind of like loss function, a lot in common with loss functions, that the special cases of expected free energy fall out as other well-known heuristics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3325.973,
    "end": 3330.359,
    "text": "Like if you only consider pragmatic value, you get expected utility theory.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3331.401,
    "end": 3336.728,
    "text": "No epistemic value, nothing to learn, special case of G, expected utility.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3337.552,
    "end": 3349.207,
    "text": " In contrast, if all outcomes are equally preferable, so there's no pragmatic value on the table, then epistemic value yields InfoMax.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3351.991,
    "end": 3364.707,
    "text": "So it's kind of like saying, if you're gonna compose with these Bayesian Legos, either in the real-time inference, and then also extending out into the planning and the action selection,",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3365.227,
    "end": 3392.652,
    "text": " like anything any any any brick structures you build on the low road are going to be you're going to be able to approximate them with variational bayesian inference chapter three is gonna come in with with more of this physics flow based model and and say",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3392.767,
    "end": 3405.743,
    "text": " And for the organism observing itself, or for you observing something else, something will act as if it is bounding its surprise about something else.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3407.385,
    "end": 3413.854,
    "text": "So low-road is like saying anything you build, you're going to be able to approximate it and do variational inference with that surprise bounding.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3415.055,
    "end": 3418.099,
    "text": "And then here is more of the physics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3418.805,
    "end": 3425.193,
    "text": " saying, and you can model things such that it looks like that's what they're doing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3431.38,
    "end": 3439.69,
    "text": "And then in four, that's where the generative models actually get shown.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3439.75,
    "end": 3447.259,
    "text": "And it's like, this was built up on the low road, and it's kind of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3447.678,
    "end": 3474.816,
    "text": " compatible from the high road and that's why it's placed at the middle it's just that also four has like again some more mathematical background like jensen's inequality and properties logarithms um variables and their dependencies in graphical models but then figure 4.3 does bring us to the discrete and the continuous time generative models",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3478.222,
    "end": 3504.55,
    "text": " like many coats of paint like just kind of reading through it because there's not really just one order especially as everyone's gonna have different like questions about different parts um so it's kind of fun like what are the more the more pure background materials like putting this as figure 4.1 might make it seem like this is like finally we got to act in it's figure 4.1 it's like",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3504.766,
    "end": 3508.71,
    "text": " Well, no, maybe that that's just the generic property of logarithms.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3514.877,
    "end": 3515.077,
    "text": "Cool.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3515.477,
    "end": 3528.411,
    "text": "Um, well, so, uh, next week for seven, well, uh, it'll be later or",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3530.45,
    "end": 3554.955,
    "text": " join at this time next week and uh either andrew or i will revisit applying active again there's no there's no specific order so that that can be helpful like chapter seven goes into essentially the top half of figure 4.3 so it may be useful to to see it and um we can go into imdp",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3555.745,
    "end": 3562.793,
    "text": " Python-based, very imperative, pseudocode-like format for the programming.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3563.274,
    "end": 3568.58,
    "text": "Like, get the observation, update this, do that, calculate this, do that.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3570.062,
    "end": 3580.775,
    "text": "Or we could explore a little bit towards RxInfer, which has this declarative style, where it's more like you declare the base graph.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3582.717,
    "end": 3583.558,
    "text": "Full stop.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3584.095,
    "end": 3591.225,
    "text": " Then you declare a kind of like logistical scheduling of how do you update different parts of it?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3592.687,
    "end": 3607.949,
    "text": "So that has, there's a few more steps that are possibly initially unintuitive, but then in operation, it gives the RxInfer style of declarative programming a lot more performance and flexibility.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3611.494,
    "end": 3611.875,
    "text": "Okay.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3613.154,
    "end": 3622.228,
    "text": " Cool, I mean, with anything else in the times between, just make the notes on the chapter pages or just prepare them however.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3623.851,
    "end": 3626.555,
    "text": "Oh, I'll copy in Dave's fun note.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3632.004,
    "end": 3634.808,
    "text": "Rule of four in Tagalog linguistics.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3666.935,
    "end": 3668.88,
    "text": " They don't write abstracts like they used to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3674.213,
    "end": 3675.356,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3675.376,
    "end": 3675.717,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3676.338,
    "end": 3677.08,
    "text": "See you all later.",
    "speaker": "SPEAKER_04"
  }
]