[
  {
    "start": 8.131,
    "end": 13.556,
    "text": " Hello and welcome everyone to ACT-INF Lab live stream number 31.1.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 15.418,
    "end": 16.499,
    "text": "Yes, we are live.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 17.32,
    "end": 28.11,
    "text": "So today it's October 19th, 2021, and we're going to be having a discussion on the paper, Non-Equilibrium Thermodynamics and the Free Energy Principle in Biology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 29.761,
    "end": 32.023,
    "text": " So welcome to the Active Inference Lab, everyone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 32.784,
    "end": 39.289,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 39.889,
    "end": 42.311,
    "text": "You can find us at the links here on this page.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 43.512,
    "end": 49.237,
    "text": "This is a recorded and an archived livestream, so please provide us with feedback so that we can improve our work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 50.418,
    "end": 56.463,
    "text": "All backgrounds and perspectives are welcome here, and we'll be following good video etiquette for livestreams.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 57.89,
    "end": 87.314,
    "text": " this short link you can see the past and upcoming live streams here we are at the end of october 2021 in paper number 31 and today we're going to be having an awesome group discussion and then next week we hope to have one or both of the authors join us so we'll be taking a lot of notes today and bringing up good things to talk with them on and all of these are participatory live streams so if you want to join or if you want to co-organize with us just let us know",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 89.278,
    "end": 96.628,
    "text": " Today in 31.1, we're just going to be learning and discussing this paper of Palacios and Columbo.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 97.669,
    "end": 104.258,
    "text": "And we're just putting out some perspectives, giving some affordances for others to join in and...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 105.72,
    "end": 107.181,
    "text": " Hopefully learning along the way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 107.562,
    "end": 111.866,
    "text": "So we have a few questions that Blue and others have prepared.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 112.566,
    "end": 115.369,
    "text": "Maxwell also prepared some notes to talk about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 116.129,
    "end": 121.374,
    "text": "And we're just pretty much going to look through the questions that we have already written up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 121.634,
    "end": 122.295,
    "text": "We'll add more.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 122.916,
    "end": 127.76,
    "text": "Anyone in the YouTube live chat who wants to ask a question, they're more than welcome to do so.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 128.4,
    "end": 130.943,
    "text": "And we'll just hop around wherever we need to go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 132.912,
    "end": 134.993,
    "text": " we'll start off with the introductions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 135.493,
    "end": 146.378,
    "text": "So we'll just say hi and maybe something that we liked about the paper or something that stuck with us or something that brought us to this conversation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 146.738,
    "end": 153.682,
    "text": "So I'm Daniel, I'm a researcher in California and I think something I'm excited about today",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 154.582,
    "end": 164.368,
    "text": " maybe would be to look at this intersection of biology and thermodynamics and talk a little bit about the different ways we can approach that intersection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 164.869,
    "end": 168.611,
    "text": "This paper has some formalisms, but not all the formalisms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 168.871,
    "end": 175.636,
    "text": "There weren't figures, but there's so many graphical intuitions related to free energy landscapes and some other pieces.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 175.676,
    "end": 182.24,
    "text": "So it's just kind of cool to think about what are the different ways that we come to learn about the intersections of these cool ideas.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 182.64,
    "end": 183.861,
    "text": "And I'll pass to Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 185.865,
    "end": 188.868,
    "text": " Hello, yes, Stephen, I'm in Toronto in Canada.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 190.489,
    "end": 191.63,
    "text": "Pleased to be here again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 191.871,
    "end": 204.943,
    "text": "And I'm interested in this paper, the general topic of ergodicity comes up, and I'm interested to see, I often see these papers which are sort of free energy principle focused rather than, say, active inference focused.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 205.003,
    "end": 211.208,
    "text": "So just to see how when that tree gets shaken, how that helps or hinders",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 212.009,
    "end": 218.231,
    "text": " the more process theory work, which is probably closer to where I'm interested in.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 218.431,
    "end": 219.771,
    "text": "But this is all very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 219.831,
    "end": 220.112,
    "text": "Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 220.372,
    "end": 222.672,
    "text": "I'll pass it over to Maxwell.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 222.692,
    "end": 225.673,
    "text": "Hey, I'm Maxwell Ramstad.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 226.894,
    "end": 232.135,
    "text": "I'm the CEO of Nested Minds Network, an active inference AI startup.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 232.616,
    "end": 238.978,
    "text": "And I am a fellow at the Welcome Center for Human Neuroimaging at UCL in London.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 241.109,
    "end": 245.997,
    "text": " I'm looking forward to discussing this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 246.277,
    "end": 254.269,
    "text": "I think there's a lot to disagree with, and I'll try to be collegial in my criticism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 255.509,
    "end": 255.929,
    "text": " Beautiful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 256.169,
    "end": 258.43,
    "text": "What more could we ask for?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 259.11,
    "end": 262.711,
    "text": "Let's start with the big question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 262.972,
    "end": 281.978,
    "text": "And of course, other of you, if you have a different take or there's other big questions, but this big question, which is in this paper, as well as the broader literature, what fundamental ideas from physics are utilized in free energy principle and active inference and how?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 283.208,
    "end": 289.231,
    "text": " and just what are the implications or trade-offs associated with the use of this idea?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 289.731,
    "end": 293.713,
    "text": "Does it lend credibility to a theory to be grounded in physics?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 294.193,
    "end": 298.515,
    "text": "What does it mean to a theory for it to be grounded in a certain physical idea?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 298.595,
    "end": 299.736,
    "text": "Does it constrain?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 300.256,
    "end": 305.578,
    "text": "Does it prevent us from making the kinds of conclusions that we might want to draw about biological systems?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 306.179,
    "end": 309.0,
    "text": "So that's kind of the big question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 310.52,
    "end": 323.023,
    "text": " Do either of you have any other sort of big questions that this raises or what is the alignment of like the vector of this paper with the bigger ongoing threads in our research community?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 325.084,
    "end": 339.288,
    "text": "Well, I mean, I guess one outstanding question for me is what is the horizon of relevant literature in terms of time course that one needs to consider before, you know, trying to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 340.501,
    "end": 343.085,
    "text": " engage with and criticize this material.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 343.105,
    "end": 351.78,
    "text": "It's something that comes up, I think, and it might be useful to discuss",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 354.625,
    "end": 375.248,
    "text": " maybe before we go into the specifics there just when we're engaging in interdisciplinary or transdisciplinary scholarship or we're diving into fields where we might not have taken courses to the undergraduate or higher level just it's a really important question how do we make",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 376.334,
    "end": 404.307,
    "text": " appropriate claims you know how do you take a little bit of a dip into the rabbit hole and come out with something that's useful rather than just being more confused than when you made the initial search so these are big questions any thoughts or just how do we determine what literature are relevant like if we wanted to write a paper on something related to active inference or just in general what do we do do we do keywords do we only look at the last five years",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 408.271,
    "end": 411.154,
    "text": " Are you asking the question rhetorically or do you want us to chime in?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 411.775,
    "end": 414.557,
    "text": "Maybe Stephen first with a raised hand, but then just either.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 417.08,
    "end": 418.021,
    "text": "Unmute Stephen and then yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 420.503,
    "end": 421.885,
    "text": "Stephen, unmute and then continue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 423.769,
    "end": 426.41,
    "text": " I'm probably not the best person because I keep digging and digging and digging.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 426.45,
    "end": 429.87,
    "text": "But I think it's a good question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 429.89,
    "end": 445.254,
    "text": "I'm from a chemistry background a long way back, and I always find it interesting as well because, you know, a lot of stuff that's used or developed comes from chemistry, actually, and uses physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 445.434,
    "end": 450.295,
    "text": "But, you know, like you say, we're in this kind of –",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 451.195,
    "end": 471.053,
    "text": " need to approximate and an approximation like there's so many things that come up that are like new new ways of describing stuff which makes total sense like i i've read through the free energy principle and christen's work about the talk about approximation science and that science is is ultimately an approximation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 472.15,
    "end": 475.272,
    "text": " And then it takes me a couple of days to then get my head around that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 475.312,
    "end": 476.933,
    "text": "And it's like, yeah, that totally makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 476.993,
    "end": 479.634,
    "text": "But the implications of all of that are huge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 479.674,
    "end": 493.302,
    "text": "The implications of being in non-equilibrium states itself disrupts a lot of the accuracy of certain ways that you can roll out things from physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 493.362,
    "end": 496.985,
    "text": "And are you rolling it out into chemistry, which is normally equilibrium chemistry?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 498.05,
    "end": 500.451,
    "text": " Are we rolling it out straight into biology?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 500.491,
    "end": 504.473,
    "text": "Are we rolling it out into something slightly different with all this modeling?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 504.533,
    "end": 523.622,
    "text": "So I think it does cause some challenges in terms of discussions because it's easy for other people to start telling the free energy principle and active influence community what they are and then start telling them",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 524.802,
    "end": 546.373,
    "text": " framing what they're not and by which point it's kind of hard to have a discussion because it's like the straw man's been set up and I think that can be a little bit challenging for some conversations to move forward because now you've got a complex idea trying to first of all counter",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 547.611,
    "end": 549.953,
    "text": " the fact that other people's paradigms have been challenged.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 551.294,
    "end": 559.681,
    "text": "So I think that itself, I don't know if that's a literature thing or whether that's a cognitive thing, but I think that that is part of the challenge that seems to be faced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 562.059,
    "end": 562.779,
    "text": " I agree, Steven.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 562.799,
    "end": 563.679,
    "text": "Thanks for that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 563.879,
    "end": 578.203,
    "text": "And it's maybe a good segue, Maxwell, we can just start to hear some of your thoughts and I'll be typing some notes and maybe asking some follow-ups and unpacking because I know you'll have a lot to say on this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 578.743,
    "end": 582.984,
    "text": "So maybe just go for it and I'll just type along and we'll see where we go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 583.285,
    "end": 584.745,
    "text": "I mean, I guess that...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 586.654,
    "end": 600.324,
    "text": " probably the thing that I find most puzzling about the paper is that it claims to be the first in the literature, essentially to be looking at the connection between the physics of the free energy, well, physics and the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 601.385,
    "end": 615.696,
    "text": "And I find this puzzling because it seems to me that the connection between physics and the free energy principle has been really maybe the, the focus of active research in our community for like,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 616.314,
    "end": 617.315,
    "text": " four years or so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 617.335,
    "end": 629.743,
    "text": "Um, so I mean, you know, the, uh, Carl published or at least pre-printed his, um, particular physics monograph in January, 2019.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 630.063,
    "end": 638.529,
    "text": "Um, and, you know, prior to that, we had all been working on, I mean, effectively the connections to physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 638.549,
    "end": 645.674,
    "text": "So, uh, I find this problematic because the work that we're going to discuss today focuses on, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 646.906,
    "end": 652.748,
    "text": " older formulations of the free energy principle where the connections to physics were maybe less obvious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 654.969,
    "end": 666.452,
    "text": "I mean, as most of us in the community know now, the formal foundations of the free energy principle have been subject to extensive debate over the last three years or so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 668.593,
    "end": 673.554,
    "text": "Kind of Martin Beal and colleagues kind of started us off in this direction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 676.09,
    "end": 690.684,
    "text": " And, you know, since Martin and, you know, a few other groups have produced, you know, stimulated interesting discussion through their very interesting and technically rigorous critiques of the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 690.724,
    "end": 698.612,
    "text": "But really, it seems to me that this has been like a focus of our discussions for the last several years, the connections to physics and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 700.548,
    "end": 716.161,
    "text": " And where this has gotten us is the Bayesian Mechanics for Stationary Processes paper that was recently released, which accounts for the critical remarks that have been raised.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 717.362,
    "end": 729.772,
    "text": "So really where we're at now is that we have formulations that start from non-equilibrium statistical mechanics and information geometry and end up saying, well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 730.857,
    "end": 758.686,
    "text": " all systems that have stationary density dynamics in a markov blanket will look as if their internal states are uh you know modeling in a loose sense or in a more technical sense encoding the parameters of probability distributions or bayesian beliefs about external states that's sort of where we're left with and you get you get to this from the physics so i just found that the um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 760.049,
    "end": 769.857,
    "text": " The remark was a bit puzzling, and the choice of literature was also, I think, a little puzzling for the same reasons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 769.937,
    "end": 777.622,
    "text": "I mean, I have more specific thoughts, but I mean, you know, this is sort of for your first bullet point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 777.943,
    "end": 788.731,
    "text": "In response to the last one that we added, what's the relevant time horizon, I feel like a rapidly developing theory, like the active inference framework and the free energy principle,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 789.212,
    "end": 799.679,
    "text": " I mean, if you're going to be producing technical critical material, you should probably be working from the most recent versions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 800.22,
    "end": 814.97,
    "text": "I mean, I find it puzzling, for instance, that the authors spend so much time talking about ergodicity when the word ergodic doesn't appear or just about never appears in the particular physics monograph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 815.371,
    "end": 817.152,
    "text": "So anyway, I just find that there's a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 817.694,
    "end": 827.938,
    "text": " kind of disconnect between what's presented here and the actual work on the physics of the free energy principle that we have seen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 827.978,
    "end": 843.444,
    "text": "And I think that leads to several of the arguments being proposed being a bit missing their mark, to put it diplomatically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 845.077,
    "end": 847.538,
    "text": " Thank you for the concise summary, Maxwell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 847.658,
    "end": 850.439,
    "text": "So Stephen, with a raised hand, and then we'll continue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 853.76,
    "end": 856.562,
    "text": "Can I ask a little question as well that relates to this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 857.422,
    "end": 869.367,
    "text": "In the very first part of the abstract, it talks about the inevitable and emergent property of any ergodic random dynamical system at non-equilibrium steady state that possesses a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.487,
    "end": 871.467,
    "text": "So that's a quote from the paper from 2013.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 873.248,
    "end": 884.695,
    "text": " The thing is, it says before that, according to the free energy principle, life is an, and then it quotes, inevitable and emergent property, which is the quote.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 884.735,
    "end": 897.943,
    "text": "But I'm not sure that life is ever talked of as an inevitable and emergent property of any random dynamical system in terms of how it's referenced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 897.963,
    "end": 901.005,
    "text": "And I'm wondering if there's a bit of a confusion in the paper there where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.271,
    "end": 912.621,
    "text": " um, it talks about this, that quote, but makes it as if that's what life, that life is an emergent and emergent property.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 912.661,
    "end": 921.97,
    "text": "And I think it's, um, I think what we're talking about is, um, adaptive reduction of surprise, um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 923.739,
    "end": 936.105,
    "text": " um or bayesian um inference properties is an inevitable and emergent property but i don't know if that would be life i don't know what your thoughts are on that or whether i'm misreading that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 937.469,
    "end": 944.714,
    "text": " That reminds me of one of my favorite papers, What Is Life?, answering Schrodinger's question by Maxwell et al.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 944.754,
    "end": 949.998,
    "text": "in 2018, because maybe you could even say something to this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 950.138,
    "end": 953.921,
    "text": "What is the relationship between reducing surprise and life?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 954.662,
    "end": 958.044,
    "text": "And do these recent technical developments in FEP",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 959.065,
    "end": 965.927,
    "text": " help bridge the gap between inanimate and living cognitive or computational processes?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 966.407,
    "end": 967.687,
    "text": "And where does physics play into that?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 970.828,
    "end": 971.928,
    "text": "That's, that's very interesting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 971.948,
    "end": 981.25,
    "text": "I mean, I think the, the FEP itself, uh, is not a theory of life just in and of itself, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 981.29,
    "end": 985.151,
    "text": "What it, what it is, it's a theory to understand, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 987.076,
    "end": 993.857,
    "text": " systems that are able to maintain themselves in non-equilibrium regime effectively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 995.277,
    "end": 1003.079,
    "text": "So, or I mean more precisely, you know, stationary systems with a Markov blanket, which is to say the same according to the theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1005.739,
    "end": 1016.361,
    "text": "So I've gone on the record as saying that the free energy principle can allow us to construct a theory of life, but the claim isn't just that the free energy principle in and of itself",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1017.205,
    "end": 1018.246,
    "text": " allows you to do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1019.386,
    "end": 1029.552,
    "text": "I think, you know, the FEP needs to appeal to auxiliary hypotheses from, you know, biological and other sciences to really do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1029.652,
    "end": 1037.156,
    "text": "I mean, it's a theory of thing-ness in physical systems that interest us.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1038.997,
    "end": 1043.6,
    "text": "And a subclass of those systems are biological systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1045.69,
    "end": 1053.653,
    "text": " Um, so, I mean, it is an aid in the formulation and probably the foundation of a formulation of, uh, living systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1053.993,
    "end": 1058.535,
    "text": "So, so long as we agree that living systems are a subclass of persisting systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1058.555,
    "end": 1070.299,
    "text": "And I mean, there's some talk in this paper that maybe this persisters living systems as persisters might not be the right way to think about life, but yeah, I think it acts as a foundation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1071.239,
    "end": 1073.64,
    "text": "Um, I mean, but then you need to add a lot more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1074.656,
    "end": 1076.657,
    "text": " to turn that into a theory of life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1076.697,
    "end": 1083.659,
    "text": "I mean, if you read my Schrodinger paper carefully, for example, what we propose is a variational approach to neuroethology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1084.559,
    "end": 1089.321,
    "text": "We're not saying that the free energy principle in and of itself can just offer this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1089.481,
    "end": 1103.526,
    "text": "Like the free energy principle has to be used as a foundation from which you can build these variational approaches to neuroethology, to niche construction, to ecology, or what have you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1104.592,
    "end": 1125.693,
    "text": " um so i mean but you know that that might just be uh picking it nitpicking so like i um you know well i don't want to double down on that too much it's good points and it's almost related to the definition or the distinction between like a discipline and a trans discipline",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1126.701,
    "end": 1149.45,
    "text": " if fep is a discipline versus if it's connecting other disciplines variational neuroethology it's right there in the title we're connecting across different areas and the framework of thingness is one of those enabling features that helps it be an integrative theory but potentially it doesn't fulfill the disciplinary",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1151.647,
    "end": 1153.849,
    "text": " uses of theory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1153.969,
    "end": 1156.01,
    "text": "So that's one interesting idea.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1156.03,
    "end": 1161.773,
    "text": "I guess there's many other ways to go or things to ask.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1161.893,
    "end": 1168.197,
    "text": "I guess I'm just, I'm curious again, like Maxwell, what do you think in the last few years",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1169.761,
    "end": 1176.025,
    "text": " how have we clarified or learned more about where active inference and FEP are related to each other?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1176.826,
    "end": 1193.497,
    "text": "So how was that thought of in five years ago, maybe when you were in grad school, and then what do you think is sort of contemporary greetings blue in terms of the distinction between active inference and FEP and then welcome blue and you can add anything you'd like.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1194.544,
    "end": 1197.687,
    "text": " I know some people want to mark the difference between the two.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1197.707,
    "end": 1214.641,
    "text": "I think personally, I think it's more of a sociological thing because no one or just about no one is contesting the validity of active inference models of cognitive systems, but there's a lot of pressure from different circles on the free energy formulation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1214.681,
    "end": 1220.506,
    "text": "So, I mean, it might be a sociological thing where it's just easier to say, oh, I don't work on this more, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1221.494,
    "end": 1223.256,
    "text": " metaphysics-y sounding thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1223.316,
    "end": 1227.739,
    "text": "I just work on computational neuroscience and that's straightforward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1228.74,
    "end": 1232.363,
    "text": "I think there's no warrant for that from a mathematical point of view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1232.383,
    "end": 1237.607,
    "text": "You should just, for example, look at the way that things are derived in the Bayesian mechanics paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1240.73,
    "end": 1250.057,
    "text": "Yeah, I feel like active inference just falls out of the core Bayesian mechanics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1251.761,
    "end": 1255.882,
    "text": " I mean, I'd recommend everyone to read through that Bayesian mechanics paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1256.443,
    "end": 1257.703,
    "text": "It's really fantastic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1258.443,
    "end": 1259.224,
    "text": "It's very clear.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1260.244,
    "end": 1280.291,
    "text": "One of the big differences between it and previous free energy papers is that it's authored by, or at least there are two authors out of the four on the paper who are proper mathematicians working on, you know, the mathematics of non-equilibrium statistical mechanics effectively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1281.207,
    "end": 1310.508,
    "text": " uh you know that paper really uh i think uh meets the standards of rigor in mathematics you know you have an existence proof for the synchronization manifold that's sort of at the core of the whole formal construct the thing that links internal and external states uh and then you have a construction of it i mean it's very straightforward and having having established uh you know the kind of core",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1311.189,
    "end": 1340.327,
    "text": " formal apparatus it's unfolding and by the end you know you what you do is ask kind of well all right let's split the blanket states up into sensory and active states and active inference just falls out of you know making the active states subject to the dynamics that those are unfolded throughout the paper so in my view the connection is immediate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1342.203,
    "end": 1370.145,
    "text": " um yeah uh i i i will grant that you know they're some of the computational models that we're using are a bit more um they look a lot more like just vanilla you know computational neuroscience models uh you know they're palm dps and stuff like that but but what the math that underwrites it all is the math of the free energy principle so i don't really",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1372.278,
    "end": 1374.639,
    "text": " I don't really think the two can be separated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1376.12,
    "end": 1377.1,
    "text": "Thanks, Maxwell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1377.241,
    "end": 1382.343,
    "text": "And the Bayesian mechanics paper we discussed in live stream number 26.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1382.763,
    "end": 1388.506,
    "text": "So it is a lot to keep up with sometimes, but that was a very fascinating discussion.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1388.706,
    "end": 1390.707,
    "text": "So Blue, and then anyone else?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1392.508,
    "end": 1396.11,
    "text": "I was wondering if that was Bayesian mechanics for stationary processes, the one we did, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1396.13,
    "end": 1397.311,
    "text": "That's precisely it, yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1397.862,
    "end": 1420.996,
    "text": " Um, so I, sorry, I'm late on the scene, but, um, I am curious about whether is the FEP a theory of life or does it allow us to construct one and does it only apply to life or can we take it in this kind of panpsychic direction, um, where even molecules like want to minimize their free energy and self assemble to become structures?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1421.877,
    "end": 1422.938,
    "text": "That's a very good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1423.318,
    "end": 1423.418,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1424.355,
    "end": 1427.957,
    "text": " I would say that the free energy principle is not a metaphysics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1430.498,
    "end": 1432.399,
    "text": "So it's a physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1433.119,
    "end": 1442.504,
    "text": "So it's a formal framework that may or may not give us grip on the systems that we're interested in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1447.743,
    "end": 1454.908,
    "text": " I know there is some philosophical literature that presents it as more like a metaphysical statement about what life is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1457.21,
    "end": 1463.834,
    "text": "But I think it's more useful to think about the Bayesian mechanics as just an extension of mechanics effectively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1464.234,
    "end": 1473.961,
    "text": "The same way that statistical mechanics and quantum mechanics are flavors of mechanics, the Bayesian mechanics is also",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1475.466,
    "end": 1478.267,
    "text": " And I realize that it's a little deflationary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1479.247,
    "end": 1482.888,
    "text": "It's a more instrumentalist reading of the free energy principle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1483.228,
    "end": 1494.81,
    "text": "But it's not completely deflationary in the sense that the model says that the best model of living and other existing systems is as a model of their environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1495.79,
    "end": 1502.452,
    "text": "So there's a kind of double instrumentalism at play, I think, in the free energy stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1504.738,
    "end": 1510.961,
    "text": " To answer your question a bit more directly, I think the FEP can be used to construct the theory of life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1511.962,
    "end": 1516.404,
    "text": "In and of itself, it's a theory of thing-ness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1518.445,
    "end": 1522.227,
    "text": "Yeah, it's a great set of questions to discuss, and I mean, this is only my view.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1522.407,
    "end": 1532.792,
    "text": "I don't mean to settle this once and for all, but there are people who want to defend a more metaphysical view on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1534.161,
    "end": 1540.466,
    "text": " I guess the question is, how far do you want to take the commitment of the free energy principle?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1540.526,
    "end": 1544.569,
    "text": "I mean, you know, there are kind of two irreducible assumptions that go into the math.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1545.049,
    "end": 1549.432,
    "text": "There's stationarity, which, by the way, is not the same as ergodicity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1550.213,
    "end": 1556.197,
    "text": "So, you know, I think the whole section of this argument just doesn't apply at all anymore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1556.697,
    "end": 1558.758,
    "text": "The one presented by Colombo and Palacios.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1560.099,
    "end": 1561.02,
    "text": "And Markov blankets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1562.947,
    "end": 1579.914,
    "text": " So I mean, if you think that systems that exist at some scale have to be stationary, and you think that systems that exist really do have a Markov blanket, then you can be realist about the assumptions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1582.355,
    "end": 1591.039,
    "text": "But I kind of feel that it works whether or not you take the additional philosophical step of committing hardcore to the realist assumptions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1592.725,
    "end": 1601.067,
    "text": " You know, it works just as, it works as an, you know, an as-if theory, if you will.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1601.087,
    "end": 1615.61,
    "text": "I mean, the whole thing tells you like living, sorry, systems that exist at non-equilibrium steady state and have a Markov blanket will look as if they're inferring external states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1616.71,
    "end": 1622.391,
    "text": "And I mean, yeah, I think this looks as if stuff is really,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1623.01,
    "end": 1642.184,
    "text": " important um and i realized that you know for some of us it may be a little bit deflationary uh but i don't know if more is warranted from the math i think that you know there's a yeah we just need to be kind of careful um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1646.311,
    "end": 1649.473,
    "text": " Thanks for identifying those two key pieces.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1649.753,
    "end": 1653.755,
    "text": "And maybe we'll have more to think about with the stationarity and ergodicity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1654.375,
    "end": 1656.496,
    "text": "So Blue with the raised hand and then Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1658.872,
    "end": 1670.957,
    "text": " So just a couple of things, like when I say panpsychism, I wasn't trying to go into like the metaphysical realm, but because it's physics, because it's not metaphysics, can it then apply to life and non-life?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1671.197,
    "end": 1673.258,
    "text": "Like, can we just go all the way down?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1673.959,
    "end": 1684.083,
    "text": "And so in that kind of way, I wasn't really implying as metaphysical construct, but more in like the direct, does it broadly apply to non-life as well as life?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1685.104,
    "end": 1687.247,
    "text": " And then also, just a couple more things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1687.407,
    "end": 1693.054,
    "text": "So systems have a Markov blanket, like Maxwell, that's you being entirely realist.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1693.955,
    "end": 1697.44,
    "text": "Like, I don't have a Markov blanket, but can I be modeled with a Markov blanket?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1697.48,
    "end": 1697.9,
    "text": "Probably.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1698.801,
    "end": 1702.846,
    "text": "So I don't know, like, you know, I don't curl up in my Markov blanket at night when I go to bed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1703.527,
    "end": 1704.128,
    "text": " It's comfy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1704.368,
    "end": 1706.732,
    "text": "It's super comfy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1707.333,
    "end": 1718.949,
    "text": "And then just lastly, like going back to the paper, this like, so I don't know, that was one of the main questions that I have for the authors is this concept of, they say like systems are in dynamic equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1719.51,
    "end": 1719.671,
    "text": "Like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1720.631,
    "end": 1726.135,
    "text": " I don't think that the non-equilibrium steady state density is the same as dynamic equilibrium at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1726.175,
    "end": 1729.357,
    "text": "And that was one of the main questions that I raised.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1729.757,
    "end": 1735.681,
    "text": "And like dynamic equilibrium really is not, it's a chemical process like of a reversible chemical reaction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1735.701,
    "end": 1738.103,
    "text": "So I don't, I really kind of missed that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1738.123,
    "end": 1741.125,
    "text": "That was one of the key things in the paper that I just didn't understand at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1741.605,
    "end": 1741.865,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1742.105,
    "end": 1748.57,
    "text": "I, uh, I mean, I, I very much agree with you on the points that you're saying, uh, the points that you're raising here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1748.59,
    "end": 1748.63,
    "text": "Um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1749.65,
    "end": 1766.395,
    "text": " So, I mean, regarding the panpsychism thing, I mean, yeah, you can from physics now kind of say that any system that exists kind of looks as if it has a mind, you know, then you might not want to go full on the metaphysics of panpsychism, but it certainly warrants that kind of claim.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1766.755,
    "end": 1778.998,
    "text": "I mean, in my view, this paper is making a few critical mistakes and this is echoed a lot in, you know, a lot of the literature coming from more like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1779.517,
    "end": 1781.697,
    "text": " for e-people writing about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1782.278,
    "end": 1786.618,
    "text": "I'm just gonna cite two sentences from a paper pre-printed this year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1786.638,
    "end": 1792.279,
    "text": "I won't name names, but you'll see the style of what I mean.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1792.479,
    "end": 1801.001,
    "text": "To be as fair as possible, we'll do this as in criticize the FEP by attending to the more recent published versions and variants of these claims.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1801.401,
    "end": 1805.802,
    "text": "And then the next section starts literally the next sentence, the work presented in Frist in 2013",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1807.614,
    "end": 1812.535,
    "text": " essential to practically all the proposals comparing the FEP and inaction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1812.755,
    "end": 1814.236,
    "text": "And it just goes on and stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1814.396,
    "end": 1820.978,
    "text": "And it's, I sort of feel like, yeah, the physics foundation has moved forward, like, you know, blue, you're pointing it out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1822.338,
    "end": 1830.52,
    "text": "It's all about non equilibrium, steady states, and non equilibrium, steady state dynamics, and, you know, stationarity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1832.361,
    "end": 1834.742,
    "text": "That's importantly different from ergodicity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1835.342,
    "end": 1835.782,
    "text": "You know, the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1836.633,
    "end": 1844.596,
    "text": " One of the nice things about the Bayesian mechanics paper is that it abstracts away from those assumptions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1844.776,
    "end": 1853.12,
    "text": "I mean, to be clear, the free energy principle at its core never really required the systems that you're studying to be ergodic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1854.26,
    "end": 1866.345,
    "text": "We assume an ergodic density in some of the earlier publications because it allows us to finesse one step in the derivation, substituting the time average for the ensemble average in one of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1866.823,
    "end": 1868.124,
    "text": " really core derivations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1869.045,
    "end": 1880.292,
    "text": "Um, but you know, as, uh, Carl himself had been pointing out for a long time, uh, you could finesse the math into, you know, something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1880.352,
    "end": 1884.375,
    "text": "Like there's no reason why you have to stick with the ergodic assumption.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1884.535,
    "end": 1894.521,
    "text": "It was used to finesse one step of the derivation and, you know, what Lance DaCosta and, uh, Gref, Greg Paviotis and, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1896.172,
    "end": 1906.878,
    "text": " company have done in this Bayesian mechanics paper with Carl is precisely to do the laborious work of actually generalizing the math to non-ergodic systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1907.098,
    "end": 1909.819,
    "text": "So, I mean, I think that's really important.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1910.3,
    "end": 1918.984,
    "text": "The Bayesian mechanics paper and, you know, we're, we're in discussions with the people, active discussions with the people who've produced the critical material.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1919.044,
    "end": 1925.468,
    "text": "And I mean, at this point, I think everyone essentially agrees that Lance's new derivations respond to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1926.535,
    "end": 1953.245,
    "text": " uh you know the the critiques by agliera and uh colleagues that came out earlier this year and also the beale at all critique remember the the core of the beale at all critique is that uh for ou processes in general of the sort that carl was using you can't assume that uh the synchronization manifold will exist between internal and external states",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1954.445,
    "end": 1960.328,
    "text": " In fact, what Martin and company have showed is that for a generic OU process, it does not exist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1962.269,
    "end": 1969.073,
    "text": "But that doesn't mean that you can't find very broad conditions under which the synchronization manifold exists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1969.133,
    "end": 1972.354,
    "text": "And that's what Lance and company have done in this new paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1974.596,
    "end": 1982.26,
    "text": "Aguilera's critique, Aguilera et al, this is the Sussex group, also did a very interesting analysis of the math as it's figured in the...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1983.595,
    "end": 1995.022,
    "text": " particular physics paper, showing that actually the precise assumptions that Carl uses in the paper would restrict the scope of the FEP to a rather narrow class of systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1995.102,
    "end": 1998.224,
    "text": "But again, Lance just re-derived all of the equations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1998.304,
    "end": 2000.346,
    "text": "So the formalism is now effectively different.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2000.726,
    "end": 2008.351,
    "text": "And what you can really see from the math is that it applies to non-linear systems and to non-ergodic systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2009.232,
    "end": 2010.512,
    "text": "And this leads me to another point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2011.823,
    "end": 2017.248,
    "text": " I think the assumption of non-equilibrium steady state is often not understood in the way that it should.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2018.008,
    "end": 2022.332,
    "text": "So non-equilibrium steady state is a characterization of the density dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2022.693,
    "end": 2025.335,
    "text": "It is not a characterization of the system itself.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2025.515,
    "end": 2033.282,
    "text": "If I say that a system is at non-equilibrium steady state, I'm not saying that it is steadily in some state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2033.842,
    "end": 2034.743,
    "text": "What I'm saying is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2037.723,
    "end": 2044.608,
    "text": " The probability landscape that underwrites its dynamics is stationary or has stopped evolving.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2045.949,
    "end": 2049.072,
    "text": "Those are two very, very, very different claims.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2049.412,
    "end": 2055.637,
    "text": "So it doesn't follow from the fact that a system has a nest density that it is historyless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2056.117,
    "end": 2065.224,
    "text": "It doesn't follow from the existence of a nest density that there should only be one attractor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2065.731,
    "end": 2068.952,
    "text": " Like you can have metastability in an FEP system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2069.293,
    "end": 2072.414,
    "text": "You can have non-linearity in an FEP system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2072.594,
    "end": 2075.955,
    "text": "You can have non-ergodicity in an FEP system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2078.316,
    "end": 2089.241,
    "text": "So, yeah, I mean, I think, you know, that means, you know, that one of the three sections, the critical sections in this paper are just completely off the mark.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2090.201,
    "end": 2092.382,
    "text": "And, you know, there's this new paper,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2094.622,
    "end": 2122.286,
    "text": " some of the tenors of the inactive approach on precisely this kind of stuff as well and unfortunately the same mistakes are made you know ergodicity in in the context of the fep uh i mean it really just means that the the the quantities that you're uh observing are measurable um it means that you know all the average of your measures converges",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2123.306,
    "end": 2131.988,
    "text": " on average to a measure of the average, you know, or of the mean that you're actually trying to calculate in a heuristic sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2133.029,
    "end": 2141.491,
    "text": "So it never meant that systems don't have a history, it never meant that systems necessarily converge on one attracting set.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2143.251,
    "end": 2150.753,
    "text": "And so I really feel that that kind of takes the teeth out of most of the, you know, formal criticism in this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2151.774,
    "end": 2152.894,
    "text": "The other part of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2153.444,
    "end": 2161.446,
    "text": " The other critical parts of this paper talk about the challenges of modeling biological systems using state spaces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2162.046,
    "end": 2169.729,
    "text": "But those sections to me don't amount to much more than just saying it would be very difficult to do this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2172.569,
    "end": 2176.19,
    "text": "Therefore, it's not doable or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2176.69,
    "end": 2181.932,
    "text": "And I have a lot of friends who are computational biologists, and I speak to a lot of people doing this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2182.665,
    "end": 2200.393,
    "text": " It's sort of like, well, you know, some work would have to be done to write a paper to respond to this, but you know, what's the expression one person's modus tollens is another person's modest modus ponens or like, you know, I sort of feel like, all right, well, you know, you say this is impossible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2200.413,
    "end": 2209.237,
    "text": "I know that formally, you know, Alex, Alex Chen is a really cool guy and he's brilliant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2209.738,
    "end": 2216.341,
    "text": " he and the Sussex team have recently, recently, I mean, this is two years old, so it's not that recently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2216.381,
    "end": 2227.206,
    "text": "And I feel like this should be accounted for in this paper, but have recently automated state space construction in the free energy framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2227.306,
    "end": 2237.55,
    "text": "Like we have active inference models now that can kind of automatically assemble and can handle up to it's either 10,000 or a million states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2239.051,
    "end": 2239.391,
    "text": "So, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2240.508,
    "end": 2269.69,
    "text": " uh that's a lot of modeling power and i i find the example that they discuss in a footnote there uh you know however this is on page 11 however the size of the genotype space for a protein consisting of n residues chosen from an alphabet of amino acids the size m is m to the n and then they say oh well you know it's like 20 to the 100 or 10 to the 130 possible uh states if you wanted to model like you know amino acids",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2270.555,
    "end": 2296.046,
    "text": " they're not considering is the nested formulation and i i kind of feel like nested nest densities should have been at the core of this argument and figure nowhere uh yeah i mean of course if you think that you can just plot all of the states of the system across all the scales at which it exists in one you know homogeneous state space you're going to run into a problem but you're not if you carefully construct these state spaces",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2296.59,
    "end": 2321.686,
    "text": " in a kind of nested fashion um you know like a a friend of mine van de tower uh works on i pulled this paper up he has a really cool pre-print a deep learning approach to capture the essence of candida albicans morphologies um and i mean basically there what they do is start with a population of candida which is a fungus for those of you who don't know uh and then you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2322.264,
    "end": 2339.552,
    "text": " you randomly generate a CRISPR and you introduce it into the population and you see how the population develops and you plot each populational trajectory in a 30,000 parameter hyperparameter space effectively.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2339.953,
    "end": 2348.697,
    "text": "And you see the way that like the Candida self organized into pockets, depending on their, you know, the, the kind of CRISPRs that you put into them, uh,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2349.349,
    "end": 2351.99,
    "text": " I mean, this is not like fringe work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2352.09,
    "end": 2361.634,
    "text": "This is just routine computational biology where we're already, you know, plotting phenotypic expression in 30,000 dimensional spaces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2362.935,
    "end": 2368.677,
    "text": "You know, this isn't like forthcoming work to be done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2368.697,
    "end": 2371.739,
    "text": "I mean, it's really just standard work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2371.819,
    "end": 2375.761,
    "text": "It's interesting how, you know, I think they modified the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2376.041,
    "end": 2378.902,
    "text": "We had discussed this in a live stream before and they",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2379.577,
    "end": 2386.702,
    "text": " they nicely added some, uh, responses to some of the criticisms that I raised in discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2386.722,
    "end": 2405.415,
    "text": "Um, I'd have to pull it out, but, you know, I, I said, well, you know, we're, we're using this stuff in, um, studies of, uh, cancer dynamics and, you know, like, so, uh, I, I wrote in a, in a paper, you know, um,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2406.277,
    "end": 2413.959,
    "text": " We can think of a biological systems extended phenotype as the set of extracting, attracting states of a couple dynamical system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2413.999,
    "end": 2417.26,
    "text": "And this is supported by studies of cancer genesis and propagation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2417.28,
    "end": 2432.825,
    "text": "Uh, I can link the papers and, you know, they say, well, you know, these studies provide evidence that cancer can be fruitfully modeled and understood as an attractor and a damage dynamical system, but they don't provide us with evidence that all biological systems occupy an attractor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2432.845,
    "end": 2434.806,
    "text": "And I'm sort of thinking like, well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2435.808,
    "end": 2441.192,
    "text": " No, but this is a counterexample to your saying that it's not doable in a real biological system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2441.212,
    "end": 2448.659,
    "text": "So if I'm being snarky, I feel like this is armchair biology of the worst times.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2450.34,
    "end": 2453.843,
    "text": "You're telling me that what I'm doing is impossible while I'm doing it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2455.264,
    "end": 2462.67,
    "text": "And you're doing it by appealing to an old conception of the physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2463.628,
    "end": 2483.483,
    "text": " uh by talking about assumptions that aren't even part of the formalism anymore i mean i i just uh i find that there's a lot to object to in this paper both in terms of the substance and in terms of the general kind of strategy of kind of gotcha-ing uh now",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2484.285,
    "end": 2486.747,
    "text": " Does the free energy principle need to be discussed critically?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2487.187,
    "end": 2487.767,
    "text": "Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2488.107,
    "end": 2501.575,
    "text": "And, you know, I should have caveated all this by saying that some of the most interesting and stimulating intellectual exchanges that I've had in my life have been with, you know, the people creating critical material.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2503.155,
    "end": 2513.401,
    "text": "But, you know, the people that are generating this interesting critical material are actually engaging with the theory at its formal core.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2514.714,
    "end": 2525.549,
    "text": " And, you know, I sort of feel like some of these things would have just been cleared up with, you know, a few conversations and looking at the more recent material.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2525.589,
    "end": 2529.355,
    "text": "But now I feel like I'm just kvetching at this point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2531.052,
    "end": 2532.273,
    "text": " Thank you, Maxwell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2532.333,
    "end": 2537.577,
    "text": "That's what these discussions are for and hopefully bringing into the open.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2537.637,
    "end": 2541.48,
    "text": "It's just a multi-perspective scenario.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2541.74,
    "end": 2557.212,
    "text": "To give you a specific idea why this is problematic, if you focus on ergodicity and not on the nested nest densities, then you're going to say things like, well, first you have to show that there's an attractor, and then you have to show that the relaxation time is biologically plausible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2557.625,
    "end": 2567.21,
    "text": " And they claim that neither of these things are done in the free energy literature when literally, you know, the core 40, 50 pages of Carl's physics monograph deal with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2567.631,
    "end": 2572.573,
    "text": "And, you know, Dan, I know we've read it all together during the last year.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2572.613,
    "end": 2577.236,
    "text": "Like, I don't know how they could have missed this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2577.556,
    "end": 2580.137,
    "text": "I mean, it's the physics monograph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2580.498,
    "end": 2582.018,
    "text": "This is supposed to be their topic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2582.279,
    "end": 2586.661,
    "text": "The core of the physics monograph is all about, you know, information length.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2587.954,
    "end": 2588.795,
    "text": " effectively, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2589.215,
    "end": 2598.542,
    "text": "And relaxation times back to non-equilibrium steady state and how all these things kind of work in a nested way to get you biological dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2598.562,
    "end": 2612.653,
    "text": "So it seems to me like they are just completely missing their target, but both by, you know, working out on formulations that are out of date and that introduce assumptions that are no longer at play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2613.254,
    "end": 2617.377,
    "text": "And, and also by just really ignoring, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2618.433,
    "end": 2626.118,
    "text": " The physics stuff, the free energy physics stuff that they claim to be criticizing, you know, so.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2628.18,
    "end": 2640.428,
    "text": "We need to be just like if we were going to catch a baseball, we need to be performing anticipatory knowledge work, not merely reactive, especially to previous formats.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2641.169,
    "end": 2644.571,
    "text": "Or if it's reactive, I mean, you know, react to the recent stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.631,
    "end": 2646.993,
    "text": "I mean, you know, there's been a concerted effort",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2648.361,
    "end": 2657.544,
    "text": " to ground this in the physics of non-equilibrium systems, like non-equilibrium statistical mechanics, information geometry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2658.024,
    "end": 2666.206,
    "text": "I mean, if you're going to be writing a criticism of that stuff, then you should probably be writing about that stuff is sort of my point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2667.086,
    "end": 2670.267,
    "text": "And, you know, and by the way, this often goes really badly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2670.507,
    "end": 2676.729,
    "text": "When I point out that, hey, you know, you're working from a, you know, an outdated thing to say, oh, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2677.59,
    "end": 2705.582,
    "text": " free energy version 25 from this morning and blah blah but i kind of feel like you know my friend if you want to write a criticism of something like you should be as charitable as possible with the target of your criticism on the one hand and you should definitely not be working on versions of this that no one in the core community is still working on and there is a dimension of like if you can't keep up then i don't know you know i don't know who benefits from this it's sort of like my my",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2706.587,
    "end": 2712.406,
    "text": " questioning it's like okay so steven and then blue",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2714.58,
    "end": 2739.386,
    "text": " yeah i think thanks for the giving us a good good insight there i think the the psych the sociological psychological piece is is present in all of this as you're saying i think i've mentioned this before to you maxwell actually is the the danger of systems talking about systems i think even if you were talking to people in the international society of system sciences they often talk about systems system dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2740.166,
    "end": 2744.89,
    "text": " And everything else, things, complex systems kind of gets lumped into complexity, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2745.41,
    "end": 2751.856,
    "text": "So there's a danger, because I don't think Carl necessarily would say FEP system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2752.356,
    "end": 2759.862,
    "text": "And that term system, I think, gets you into a lot of challenges, because the folk psychology of what a system is, it's what we see it as from the outside.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2760.743,
    "end": 2767.869,
    "text": "And, you know, these non-equilibrium steady states, I'm wondering whether we say, he says blankets all the way up and down, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2768.129,
    "end": 2779.674,
    "text": " But I'm not sure if it's more like thingness all the way up and down is safer than systems all the way up and down, because things can have all sorts of, you know, and they can have states and they can be what they are.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2780.154,
    "end": 2790.418,
    "text": "And the question really becomes then within all that ergodicity, which unlike physics, which tends to be about getting things to a certain number of decimal points of accuracy, Jen,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2791.118,
    "end": 2792.318,
    "text": " It's a messy thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2792.478,
    "end": 2794.719,
    "text": "You know, I was talking about that thing about approximation science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2794.879,
    "end": 2798.5,
    "text": "I mean, again, that gets your head around what that makes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2798.84,
    "end": 2811.044,
    "text": "Suddenly you've got, well, the main thing is you just need enough of whatever this stationary extractable data is to be able to do something with it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2811.424,
    "end": 2816.726,
    "text": "And I'm kind of thinking that maybe, because in the same way that in chemistry, if you have a beaker,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2817.648,
    "end": 2823.235,
    "text": " and you stir it up and basically the thing will have its dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2823.295,
    "end": 2827.279,
    "text": "It will move based on the energy between the different things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2827.72,
    "end": 2830.203,
    "text": "And basically entropy is just basically the,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2831.598,
    "end": 2836.322,
    "text": " the force that's pushing it in a way that you don't expect it to.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2836.422,
    "end": 2838.364,
    "text": "We know it does this from this equilibrium state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2838.384,
    "end": 2841.687,
    "text": "We know that entropy is just the thing in the middle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2841.747,
    "end": 2844.029,
    "text": "Now, no one has a bloody clue why.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2844.049,
    "end": 2846.331,
    "text": "That's just a black box, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2846.371,
    "end": 2855.098,
    "text": "Now, when you go to these non-equilibrium, far from equilibrium chemistry states, and they're held,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2856.019,
    "end": 2861.92,
    "text": " which you don't do when you mix up a beaker and just go from A to B. Now, we don't know how many non-equilibrium states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2862.915,
    "end": 2865.958,
    "text": " these reactions go through, to be honest, in those cases.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2866.038,
    "end": 2869.101,
    "text": "Now, but you wouldn't call the beaker a system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2869.141,
    "end": 2870.943,
    "text": "You'd call it a solution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2870.983,
    "end": 2883.115,
    "text": "You'd call it, you know, you might call the vessel and the chemical plant in which it reacts a system, but you just sort of kind of a beaker of stuff or things that's doing stuff and things, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2883.155,
    "end": 2884.256,
    "text": "And then you sort of see what it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2884.816,
    "end": 2887.299,
    "text": "And then it's like, what can we do that's useful in that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2887.879,
    "end": 2890.581,
    "text": " And normally what's useful is what energy shifts.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2890.701,
    "end": 2896.486,
    "text": "But in this case, you've also saying the entropy can be useful, but not in the way most people would.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2898.567,
    "end": 2904.071,
    "text": "What we could say the folk systems thinkers would kind of tend to think about it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2904.091,
    "end": 2908.635,
    "text": "So I'm just wondering if there's a danger of using the word system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2909.235,
    "end": 2910.476,
    "text": "Yeah, I would agree.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2910.516,
    "end": 2910.937,
    "text": "I mean, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2912.009,
    "end": 2920.836,
    "text": " I think we use the term system just because all of this grows out of dynamic systems theory in some sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2921.657,
    "end": 2923.999,
    "text": "Carl talks of particles, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2924.199,
    "end": 2932.285,
    "text": "Like a system with a Markov blanket and does the free energy stuff is a particle in his account.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2933.626,
    "end": 2938.21,
    "text": "So yeah, there is a... So there's a linguistic...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2939.309,
    "end": 2944.011,
    "text": " danger here, because I agree with you, this is not what people think of when they hear the word system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2944.051,
    "end": 2948.833,
    "text": "A lot of our exchanges, as you pointed out, Stephen, have turned around that specific point.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2949.273,
    "end": 2963.858,
    "text": "I think the term is important because especially in the context of relating the FEP to like the four E approaches, I think it's not appreciated sufficiently that the FEP math is what happens if you take dynamical systems theory seriously.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2965.559,
    "end": 2965.779,
    "text": "You know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2966.189,
    "end": 2972.191,
    "text": " So when I was doing my undergrad, I was reading the four E guys and the 40 people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2974.112,
    "end": 2983.555,
    "text": "Um, cause it's not just guys and, uh, yeah, the, the 40 people were telling me, all right, well, you know, computer theory, you only get so far in the study of cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2983.735,
    "end": 2990.197,
    "text": "You have to do dynamical systems, learn DST math and learn this physics of complex systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2990.677,
    "end": 2992.878,
    "text": "So I did, and several of us did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2993.668,
    "end": 3003.095,
    "text": " But what happens is then if you continue asking questions along that direction, things arise like, well, how do you measure distances between states?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3004.215,
    "end": 3010.96,
    "text": "And if you start asking that kind of question, inevitably, information and entropy creep back into the picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3012.101,
    "end": 3020.306,
    "text": "Because that's how you measure distances between states effectively, is in NATS and other information theoretic units.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3021.357,
    "end": 3039.167,
    "text": " This is to me, the great irony of this whole, you know, FEP versus an activism confrontation, which is slowly turning into like one of the big discussions in contemporary philosophy is I don't think that the 4E people fully appreciate that the FEP stuff is just a prolongation of their thinking style.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3039.527,
    "end": 3049.212,
    "text": "That if you, if you really want to take seriously the core tenets of embodied cognition, then inevitably you are led back to information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3050.464,
    "end": 3051.345,
    "text": " There's no escape.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3052.305,
    "end": 3057.968,
    "text": "It's really, if you want to take their own framework seriously, there's no other place to go but here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3058.428,
    "end": 3060.81,
    "text": "I unfortunately have to leave now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3061.01,
    "end": 3061.73,
    "text": "Thank you, Maxwell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3062.351,
    "end": 3064.572,
    "text": "Thank you for listening to me rant about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3065.012,
    "end": 3066.213,
    "text": "I'll try to be there next week.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3066.713,
    "end": 3070.095,
    "text": "And yeah, I mean, keep kicking ass.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3070.155,
    "end": 3079.4,
    "text": "I mean, Dan Blue, I just love Active Inference Lab, and I'm so grateful for the awesome work that you do keeping this community alive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3079.906,
    "end": 3082.227,
    "text": " Steven, it's always a pleasure to talk with you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3082.267,
    "end": 3089.391,
    "text": "And I'm glad to see that, you know, there's so much, so much, yeah, you're just there all the time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3089.431,
    "end": 3094.434,
    "text": "And I just love your, you know, your contributions to the conversation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3094.494,
    "end": 3095.694,
    "text": "It's always a pleasure to talk to you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3095.714,
    "end": 3097.335,
    "text": "So big love to everyone.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3098.936,
    "end": 3101.378,
    "text": "And I will be in touch shortly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3101.998,
    "end": 3103.619,
    "text": "Apologies for the snarkiness.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3103.739,
    "end": 3107.701,
    "text": "It's just, you know, this is the kind of paper that really grinds my gears.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3108.303,
    "end": 3114.091,
    "text": " I thought it was good to just point out a few of what I think are the issues.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3114.872,
    "end": 3116.194,
    "text": "Thank you, Maxwell.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3116.654,
    "end": 3117.215,
    "text": "See you soon.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3118.256,
    "end": 3118.517,
    "text": "Goodbye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3120.322,
    "end": 3127.427,
    "text": " This, Blue, will go to you, but this is, you know, it's a key difference between being an organizer and a facilitator or a participant.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3129.068,
    "end": 3134.933,
    "text": "We're here to help scaffold individuals to participate in their perspectives.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3135.933,
    "end": 3138.795,
    "text": "And that's the second order cybernetics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3138.875,
    "end": 3143.259,
    "text": "So things will get more contentious than we can even imagine.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3144.438,
    "end": 3159.289,
    "text": " And someone just has to hold down the broadcasting, make sure that hands are being raised and that protocol is being respected because there are serious first level questions to resolve, but we can have precision in our second level policy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3159.87,
    "end": 3163.413,
    "text": "And that's going to return to a question in the live chat, but first blue with a raised hand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3163.433,
    "end": 3163.713,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3165.678,
    "end": 3177.566,
    "text": " So I just wanted to say that a lot of what both Maxwell was saying and what Stephen said just really underscores the need for consistent definitions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3177.626,
    "end": 3179.307,
    "text": "How do we define a system?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3179.767,
    "end": 3183.83,
    "text": "And also a consistent synthesis of the FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3184.01,
    "end": 3186.291,
    "text": "Historically, where did it start?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3186.611,
    "end": 3187.472,
    "text": "Where has it been?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3187.772,
    "end": 3188.713,
    "text": "Where is it going?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3188.733,
    "end": 3191.454,
    "text": "And where are the landmarks?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3191.534,
    "end": 3192.515,
    "text": "For example, this Bayesian",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3194.056,
    "end": 3198.298,
    "text": " Mechanics for Stationary Processes paper, you know, has revamped the math and physics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3198.438,
    "end": 3206.623,
    "text": "And when we're making a new paper or a new argument, are we working with the current version of the model?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3208.344,
    "end": 3208.864,
    "text": "Absolutely.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3208.884,
    "end": 3212.926,
    "text": "Nice foreshadowing of some work that we're involved in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3212.986,
    "end": 3219.55,
    "text": "But if anyone is interested in sort of scholarship and a history from an empirical perspective,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3220.658,
    "end": 3227.371,
    "text": " on fep and actin they should get in touch with blue or i because this is a project that we're super keen on",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3228.268,
    "end": 3230.009,
    "text": " but it's a very important point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3230.049,
    "end": 3236.575,
    "text": "And that's why in our dot zero, we had like this slide with the active inference lab, the working ontology.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3236.735,
    "end": 3244.881,
    "text": "So we're going in a participatory way and we're working through these terms and we're finding where it's quoted in the literature, how it's used in the literature.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3245.502,
    "end": 3250.485,
    "text": "And then we're adding notes and relevant resources and we'll be developing curriculum",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3251.266,
    "end": 3266.479,
    "text": " that helps make simple declarative uses of these terms so that we don't get lost and we'll have the terms and we'll have the specifics of literature and it'll be an awesome environment for learning, applying and communicating active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3267.019,
    "end": 3270.402,
    "text": "So before, Stephen, you want to go with the question and then we'll go to the live chat.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3271.963,
    "end": 3274.825,
    "text": "Well, I just add to that point you just made is I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3275.774,
    "end": 3279.515,
    "text": " it is really going to be important because we're seeing the confusions that can happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3279.555,
    "end": 3284.936,
    "text": "But also, it's likely that there's going to be a kind of a multi-ontology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3285.476,
    "end": 3299.859,
    "text": "There might be something in this whole field that speaks to how this changes, just in the way that Carl Friston talks about when something is regimes through an Infomax.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.959,
    "end": 3318.389,
    "text": " focus versus a Hamilton lease action focus versus you know a reward focus so there may well be this commonality and there may also be a way to process",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3319.542,
    "end": 3336.26,
    "text": " when things systems particles um become you know derivations and you know that's going to be interesting because there may be some nexus whether it's called metaphysics or whether it's it's something more",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3337.802,
    "end": 3357.438,
    "text": " you know less less out there maybe it can be grounded and i think that that's starting to come up as we we hit you know that's transdisciplinarity for you right it's gonna you're gonna want to know what's in the discipline piece so maybe there will be stuff which is kind of grounded in the biology world and grounded in the physics world and it's going to talk",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3358.118,
    "end": 3374.435,
    "text": " as best it can their language right and then there's going to be stuff which is in the applied world which ultimately starts to go transdisciplinary at some point as soon as you get out and get to any sort of scale um so i think that's going to be very very interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3375.035,
    "end": 3389.931,
    "text": " awesome and both steven and blue and many others join us weekly in dot edu where we talk about this so let me read a few of the awesome comments from the live chat and ask a question from the live chat and anyone else can continue to ask a question",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3390.712,
    "end": 3413.097,
    "text": " so there's a lot of discussion on the systems question and yvonne said maxwell subscribe to our systems thinking course we will discuss what the system is from the standpoint of systems engineering so that's really important thanks yvonne for sharing that and indeed two of the fundamental pillars or ontologies or trans disciplines of active inference lab",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3413.701,
    "end": 3416.982,
    "text": " are active inference and systems engineering.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3417.542,
    "end": 3442.387,
    "text": "So those are the perspectives that we draw on and seek synthesis and application of, and we're all learning a lot, and it will be updating our generative model in a way that changes our policy selection to be able to use words like system without going down the philosophy rabbit hole every time, and just having a way that we can talk about systems of interest, like in .coms, our system of interest",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3442.927,
    "end": 3443.729,
    "text": " is the live stream.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3444.25,
    "end": 3448.318,
    "text": "So how do we take a role-based approach that embodies the best of our values",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3449.657,
    "end": 3450.798,
    "text": " and uses the term system.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3451.358,
    "end": 3454.28,
    "text": "And we also get all these other pieces too, so good.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3454.82,
    "end": 3456.441,
    "text": "Thanks for sharing that, Yvonne.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3457.201,
    "end": 3466.286,
    "text": "Dave shared a lot of interesting information about life and about some of the history of a few different ideas related to conceptualizations of life.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3466.787,
    "end": 3476.472,
    "text": "But the question that I wanted to get to was from Michael NYC who wrote, how would you model this conversation using this model?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3478.638,
    "end": 3481.439,
    "text": " So that's a question we can think about.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3481.579,
    "end": 3489.162,
    "text": "And it speaks to almost like applying because online teams are certainly an application that's important for different kinds of modeling.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3490.122,
    "end": 3492.343,
    "text": "And I'll give a first thought on this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3492.943,
    "end": 3495.404,
    "text": "So one thing is when you said, how do we model it?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3496.184,
    "end": 3501.868,
    "text": " The question is beautifully phrased because it doesn't say, well, what does the theory say that this conversation is?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3502.609,
    "end": 3506.892,
    "text": "That's setting up for an absolute hegemonic realist answer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3507.693,
    "end": 3519.401,
    "text": "How would you model it is going to be inherently different perspectives because different individuals and different years are going to have access to different tools and ideas and people.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3519.782,
    "end": 3522.364,
    "text": "So they're going to model this conversation differently.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3522.924,
    "end": 3544.665,
    "text": " so that's the first piece and that's moving from that sort of absolutist modest realism into more of a multi-perspectival system now what are some ways that one could model this there could be a cyber physical depiction where one is very interested as we were in our 2020 vatkin et al paper",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3545.706,
    "end": 3564.879,
    "text": " in the information flows from a computational perspective like sense is the incoming states and actions are the upcoming states so in the context of a video conversation there's an audio visual feed in and there's an audio visual going out so we could use blankets and interfaces",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3565.84,
    "end": 3572.882,
    "text": " and sense and action states to talk about just the cyber physical dimensions of the conversation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3573.742,
    "end": 3588.567,
    "text": "Another approach would be the hermeneutic or computational conversationalist approach, which Dave has connected back to a long lineage of work related to 1970s conversation theory.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3589.067,
    "end": 3594.909,
    "text": "And he wrote, it provides a micro theory for nested mutual models, focusing on the evolution and incorporation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3595.549,
    "end": 3598.592,
    "text": " or rejection of predicates and their syntactic occurrence.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3599.433,
    "end": 3606.26,
    "text": "Active inference work provides a corresponding needed macro theory focusing on secular evolution of the interchanges.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3607.121,
    "end": 3614.429,
    "text": "So one could have a communication oriented model that focuses on the semantics of the conversation,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3615.45,
    "end": 3631.93,
    "text": " one could make also as discussed that kind of a cyber physical very computational model and there's other types of models that could be made and then there's a million different implementations so that's just the first pass but it's a really important question and it helps us connect",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3632.824,
    "end": 3643.373,
    "text": " the abstractions and the framework to the minute particulars, which are the system-specific realizations that ground us in transdisciplinarity and application.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3643.834,
    "end": 3647.236,
    "text": "So, Stephen, and then any other questions from the live chat or Blu?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3649.238,
    "end": 3656.544,
    "text": "Yeah, I think they're quite useful questions, though, because that question about how can I, I mean, it ties into a couple of things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3657.651,
    "end": 3659.833,
    "text": " My first interest would be to say, OK, why would I?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3660.914,
    "end": 3663.497,
    "text": "But the other thing is, how can I implicitly also link to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3667.927,
    "end": 3689.157,
    "text": " is available to me like what information is possible to interact with you know that idea this this so we can bring in we this modeling process sort of ties us in this sort of mid ground between how we actually want to talk about all of this which i think is where the um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3690.296,
    "end": 3712.672,
    "text": " systems engineering is really useful because ultimately you kind of have to bring it into a system of externalized knowledge which can be then communicated and moved around as in the papers and other things that can be done but it's also how can you start to understand say the processes going on in the moment so it could be measuring",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3713.172,
    "end": 3739.602,
    "text": " what we're doing in this real-time process and someone tracking that it could be a case of video in it and watching back the video with an interpretation thereof it could also be you know if we were wearing sensors you know there could be just trying to model the dynamics of us as things you know there's a just trying to say how could i know what i can even try and to feed into a system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3740.262,
    "end": 3749.428,
    "text": " So I mean, one of the classic cases that's recently there with Ryan Smith, their work on interception, they had to devise a method for recording.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3750.449,
    "end": 3753.091,
    "text": "First, they did it with the heart, and they changed the way the heart was measured.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3753.111,
    "end": 3756.313,
    "text": "But they also did some recordings of the stomach and the stomach region.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3756.873,
    "end": 3759.094,
    "text": "They had to find a way to get data",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3760.066,
    "end": 3761.927,
    "text": " to find out what could then be modeled.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3762.387,
    "end": 3769.329,
    "text": "And was that a system they were modeling, or was it almost the dynamics they were modeling of the things?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3769.369,
    "end": 3780.794,
    "text": "And I think in just seeing how the dynamics change over time, and I think this is where maybe there's a lot of challenges that's going to be faced.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3780.834,
    "end": 3783.955,
    "text": "Because we've had this conversation in this modeling world is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3784.815,
    "end": 3792.898,
    "text": " you know, jumping things into a system engineering world, which isn't only a non-equilibrium philosophical world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3792.918,
    "end": 3803.362,
    "text": "It's quite useful for applied work because it does that ability to make something a system in a way that's intentionally that, and it has system of interest, just like Daniel was saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3804.002,
    "end": 3812.665,
    "text": "And then you've got, but within that, our system of interest is about going beyond the systems of obvious interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3813.697,
    "end": 3824.159,
    "text": " presentation, you know, there's stuff going on under the hood, which is not necessarily intuitively available at all.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3824.179,
    "end": 3827.0,
    "text": "So I don't know what your thoughts on that, Daniel, but I think it's interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3827.7,
    "end": 3827.82,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3827.84,
    "end": 3842.443,
    "text": "The only short thing I'd say is like, even if the system of interest, for example, is the mind of someone being educated, for example, in the curriculum of Active Inference Lab or the audience who we're speaking to is our system of interest or even live stream.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3843.516,
    "end": 3850.398,
    "text": " Having your system of interest be the learner's mind or brain doesn't mean you're looking for the neuron level description.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3851.118,
    "end": 3859.281,
    "text": "Having the system of interest to be the live stream or the audience doesn't mean that we need to know every single person or how video encoders work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3860.201,
    "end": 3864.683,
    "text": "So it's an application oriented approach, perhaps even an action oriented approach",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3865.623,
    "end": 3871.826,
    "text": " that cuts through some of these questions or sidesteps or saves them for savoring.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3872.806,
    "end": 3884.792,
    "text": "After the project has been completed, after we've made the changes on the real world, it savors some of these truly excellent philosophical and important questions while also allowing us to act",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3885.658,
    "end": 3887.319,
    "text": " reasonably in the moment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3888.059,
    "end": 3896.461,
    "text": "And so it's always that north star of a unified model of perception, cognition, and action that's so motivating.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3896.901,
    "end": 3912.146,
    "text": "So even as some of the formalisms do evolve, we hope that we can respect the spirit and the inertia of the research that we've carried out and also know when we can modularly swap in new elements of the framework.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3912.426,
    "end": 3913.066,
    "text": "So blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3913.466,
    "end": 3915.087,
    "text": "And then of course, any questions in the live chat.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3917.293,
    "end": 3922.717,
    "text": " So as a modeler, how would I model this conversation?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3922.877,
    "end": 3925.039,
    "text": "Really like, let's talk about how to really model it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3926.22,
    "end": 3940.291,
    "text": "And not from a philosophical standpoint, like if this is my model of the FEP, I have a model of the FEP that exists in my brain, as does Daniel, Steven, Maxwell, we all have a model of what the FEP looks like.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3940.792,
    "end": 3943.494,
    "text": "Every time we read a paper, have a conversation,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3943.954,
    "end": 3947.456,
    "text": " take input from the action perception loop, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3947.476,
    "end": 3948.436,
    "text": "My model exists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3948.836,
    "end": 3950.117,
    "text": "It's in my internal states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3950.637,
    "end": 3963.163,
    "text": "Through my senses, I perceive, read, hear something that either confirms my model, provides evidence for my existing model, reduces my uncertainty about my existing model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3963.683,
    "end": 3967.205,
    "text": "So I have some evidence input through my senses.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3967.705,
    "end": 3974.009,
    "text": " then I update my model or if it doesn't jive or if it makes me realize something, I mean, always we're gaining information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3974.349,
    "end": 3982.255,
    "text": "So there's this epistemic value add through doing these conversations, these live streams, reading papers, having these discussions, et cetera.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3982.595,
    "end": 3985.277,
    "text": "So my model is updated through these conversations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3985.417,
    "end": 3988.499,
    "text": "And then holistically, we kind of come to a place where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3989.119,
    "end": 3997.767,
    "text": " our models either converge through this communicative process on something that resembles each other's models more similarly or not, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3997.787,
    "end": 4003.473,
    "text": "We might have this divergence and then we go away with like this uncertainty, like is my model wrong?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4003.653,
    "end": 4005.234,
    "text": "Or what was that argument about?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4005.294,
    "end": 4009.558,
    "text": "I mean, everyone's been in conversations or discussions or heated scientific debates where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4010.439,
    "end": 4013.243,
    "text": " you don't really come to a consensus, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4013.283,
    "end": 4016.247,
    "text": "There is no general agreement or understanding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4016.548,
    "end": 4022.636,
    "text": "And so then you walk away with maybe some, maybe my model is invalid and then do some more deep thought about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4022.656,
    "end": 4024.319,
    "text": "I mean, that's how I would model it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4024.379,
    "end": 4024.739,
    "text": "That's just me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4026.801,
    "end": 4028.562,
    "text": " In the Vyotkin et al.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4028.862,
    "end": 4039.226,
    "text": "2020 paper with active inference and systems engineering, systems thinking, we use this font framework, formal documents, ontology, narratives, and tools.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4039.866,
    "end": 4048.67,
    "text": "And so one kind of fun parallel or a way that conversation and the real dynamics that arise can be modeled in active inference is like agree to disagree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4050.083,
    "end": 4058.432,
    "text": " two individuals can have high precision and convergence on a narrative inference were agreeing to disagree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4059.585,
    "end": 4061.426,
    "text": " They can both be precise and agreed on that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4061.986,
    "end": 4064.827,
    "text": "And then at the first level, they can literally disagree.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4065.787,
    "end": 4066.528,
    "text": "That's the whole point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4067.308,
    "end": 4075.111,
    "text": "So that is modeled in Active Inference as nested models, just like Maxwell brought up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4075.871,
    "end": 4081.874,
    "text": "And so we have nested models and the second order matrix can be the same between two agents.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4082.834,
    "end": 4106.802,
    "text": " yet their first level matrix can be very different and none of those matrices are the system map territory mel andrews actin 14. so we've come back to these ideas and we'll continue to dance around them many many times because they're so fundamental that sometimes they're hard to see play out so stephen and then anyone else",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4109.173,
    "end": 4120.68,
    "text": " Yeah, I think we have to be careful to note that it appears as if information, what active inference tells us, it appears as if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4121.65,
    "end": 4127.432,
    "text": " knowledge is coming in and that it's being, we, we see it in our heads, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4127.692,
    "end": 4147.52,
    "text": "And, um, yet the, this conversation is, is we're, we're attuning through the action of our info niche, our semantic niche of talking, and we're aligning what our actions give us to,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4148.502,
    "end": 4171.868,
    "text": " in our externality, be it through the diagrams, be it through this document, the slides or whatever the boundary objects are that we can align to, given us, partly due to our own folk psychology over the last 150 years, the sense, and this is the thing, it's really hard to counter this because this is kind of the way we tend to think, you know, that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4172.887,
    "end": 4176.551,
    "text": " we have it in our minds, I, so to speak.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4177.111,
    "end": 4185.399,
    "text": "So it's true, there's like this generative model, yet at the same time, the generative modeling is also part of what we're doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4185.439,
    "end": 4191.125,
    "text": "We're generatively modeling each other's conversation and getting a sense of how I...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4192.765,
    "end": 4199.347,
    "text": " should say my actions of words, none of those sentences were pre-made in my head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4199.367,
    "end": 4206.628,
    "text": "It's an action policy that's close enough to my sense-making so that it feels like I'm on the right track.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4207.268,
    "end": 4211.229,
    "text": "And until someone looks at me really strange, I'll carry on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4211.249,
    "end": 4212.99,
    "text": "And I've been in these conversations a few times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4213.13,
    "end": 4216.371,
    "text": "I'm a bit more aware of how to keep doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4216.871,
    "end": 4221.552,
    "text": "But I think that's something that's quite useful to, when we talk about this modeling is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4223.1,
    "end": 4249.47,
    "text": " we're modeling the action policies that are externalized and our generative model is as good as it is at being able to enact through participatory sense-making what should happen next more than it is about having something that we've received in our generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4251.84,
    "end": 4252.64,
    "text": " Thanks, Steven.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4252.68,
    "end": 4256.943,
    "text": "That speaks to the interactionist versus instructionalism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4257.643,
    "end": 4271.39,
    "text": "Like, is the FEP model that Blue is describing, this generative model of the FEP that's in or embodied by all of us, is it like a skyscraper made of glass and piping and there's 90 degree angles?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4272.13,
    "end": 4272.611,
    "text": "Or is it...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4273.411,
    "end": 4292.107,
    "text": " some other type of metaphor that or even transcending metaphor and only realize through certain sequences of interaction so that's um really interesting and uh cool yeah there's great comments dave's uh thrown some biblical references in the chat",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4292.888,
    "end": 4295.71,
    "text": " And someone wrote, I'm here first time in the live stream.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4295.91,
    "end": 4299.192,
    "text": "It's so good to listen all the cutting edge discussion about FEP.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4299.632,
    "end": 4300.493,
    "text": "Keep up the good work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4300.613,
    "end": 4302.734,
    "text": "So nice work, Stephen and Blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4303.315,
    "end": 4305.256,
    "text": "But thanks also for joining.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4305.676,
    "end": 4307.977,
    "text": "You have tuned your regime of attention.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4308.738,
    "end": 4314.942,
    "text": "Hopefully you're having some questions and thoughts come to mind just as they are for us.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4314.962,
    "end": 4318.244,
    "text": "We're just on the other side of the video chat window.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4318.864,
    "end": 4321.086,
    "text": "And the participatory sense-making side is,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4321.926,
    "end": 4340.428,
    "text": " and how to mobilize that and enact it we can have participatory sense making with people on the video stream those who make asynchronous edits and improvements to these slides like we still have to go through blue's prior thoughts that were added to um this slide deck and then",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4341.42,
    "end": 4347.087,
    "text": " from a history of science perspective and sociology, like it's happening in a new way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4347.827,
    "end": 4359.24,
    "text": "One thing that was impressed on us, I guess, months to years ago, forever ago in crypto slash act-inf was like the timescale of these discussions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4359.861,
    "end": 4368.749,
    "text": " going from peer review and annual conferences in person, annual or multi-annual cycles to like the preprints.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4369.41,
    "end": 4372.873,
    "text": "And then we send a Twitter message to the author of the preprint.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4373.254,
    "end": 4374.515,
    "text": "Could you give a guest stream?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4375.235,
    "end": 4380.46,
    "text": "And then the authors can respond, like looking at what Maxwell wrote, which was very important or said.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4381.181,
    "end": 4384.003,
    "text": " Like Bayesian Mechanics, that was live stream number 26.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4384.043,
    "end": 4391.589,
    "text": "So we did a dot zero contextualizing video, respecting that people have many different backgrounds approaching the work from.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4391.609,
    "end": 4401.337,
    "text": "And then two of the commentaries, Beal and also Aguilara, were in guest stream number five and seven.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4402.037,
    "end": 4411.184,
    "text": " So it's like we've heard from many of the important perspectives and that's this participatory scientific sense-making.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4411.725,
    "end": 4416.568,
    "text": "We're all part of a bigger positive project that's transdisciplinary.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4417.169,
    "end": 4425.695,
    "text": "It's not even just happening in the scientific literature, but it has to a large extent been because these are research advances.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4425.735,
    "end": 4427.997,
    "text": "These are conceptual and theoretical advances.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4428.938,
    "end": 4431.239,
    "text": "And now we're all learning by doing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4432.04,
    "end": 4434.405,
    "text": " and increasingly doing and applying.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4435.186,
    "end": 4437.711,
    "text": "And so there's so much to learn and do.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4438.412,
    "end": 4442.34,
    "text": "So Blue, and then Steven, and then there's more great questions in the live chat.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4442.36,
    "end": 4442.701,
    "text": "So go ahead.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4443.905,
    "end": 4456.214,
    "text": " So you're like giving shouts out to us, but I just want to like thank Daniel for all the scaffolding that he's provided in the act and flab, like to give us the kind of the baseline for these discussions to take place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4457.215,
    "end": 4466.863,
    "text": "And also just to kind of go back to what Steven was saying about, you know, about modeling and enacting really like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4468.132,
    "end": 4470.353,
    "text": " I don't see knowledge as coming in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4470.373,
    "end": 4479.896,
    "text": "In the modeling sense, I don't know that what you have is knowledge or what Daniel has is knowledge or what the paper contains is knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4480.857,
    "end": 4484.138,
    "text": "All of that in my world is information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4485.218,
    "end": 4489.96,
    "text": " And I think that there's a difference between knowledge and information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4490.12,
    "end": 4501.703,
    "text": "And so like when I'm interpreting comments by Maxwell or Steven or Daniel, when I'm interpreting that, I take that information and transform it through my model, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4501.743,
    "end": 4506.064,
    "text": "Like, so some of like, take it or leave it or take what you want from this discussion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4506.364,
    "end": 4507.405,
    "text": "And it's always like that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4507.425,
    "end": 4508.345,
    "text": "I mean, we always do that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4508.665,
    "end": 4512.466,
    "text": "Whether people have to remind us, you know, to do it or not, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4512.526,
    "end": 4514.547,
    "text": "Like you take away the parts that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4514.967,
    "end": 4516.689,
    "text": " validate your model, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4517.21,
    "end": 4521.634,
    "text": "Or that improve upon your model or that you believe improve upon your model in some way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4522.075,
    "end": 4532.386,
    "text": "So then when I have it and I have transformed it, then maybe I can turn it into knowledge, but I don't see coming in, anything coming in as knowledge.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4532.846,
    "end": 4533.247,
    "text": "That's just me.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4534.409,
    "end": 4536.59,
    "text": " And with video chat, it becomes super real.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4536.61,
    "end": 4540.473,
    "text": "Like when there's lag, all of a sudden it's like you're at the semantic level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4541.093,
    "end": 4544.715,
    "text": "And then it's like, wait, just the syntax, I'm not hearing the words.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4545.116,
    "end": 4547.757,
    "text": "And so it's like we dip into this lower level.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4548.318,
    "end": 4554.362,
    "text": "And then imagine if the audio is working fine, you can totally hear non-equilibrium steady state.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4555.282,
    "end": 4557.064,
    "text": " But then conceptually, what does that mean?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4557.444,
    "end": 4560.748,
    "text": "So these nested and overlapping layers of meaning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4560.888,
    "end": 4562.39,
    "text": "So that's just very cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4562.57,
    "end": 4564.251,
    "text": "So Stephen, and then there's a question in the chat.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4566.354,
    "end": 4567.755,
    "text": "Yeah, this is a good point, Blue.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4567.875,
    "end": 4570.738,
    "text": "And I suppose there's also this sense that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4571.843,
    "end": 4575.766,
    "text": " there's always got to be some belief in what you think the other person is saying.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4575.966,
    "end": 4580.829,
    "text": "Like for instance, I believe the words mean X, Y, Z, because I know the English language, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.229,
    "end": 4582.911,
    "text": "If we're all speaking in the language, didn't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4582.991,
    "end": 4585.472,
    "text": "So I believe this word means this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4585.813,
    "end": 4589.235,
    "text": "I hear this word, these words together mean this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4589.795,
    "end": 4593.918,
    "text": "So there's, there's, there's, there's always, and I'm hearing it, seeing it, I'm feeling it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4594.038,
    "end": 4596.44,
    "text": "The fact that my chair is comfortable changes things, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4597.921,
    "end": 4607.426,
    "text": " So there is this sense that, you know, they talk about this in free energy principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4607.486,
    "end": 4618.993,
    "text": "It's like it can also appear like, you know, so things as well as there being Bayesian inference, it can appear like there's a Bayesian inference type process, which is what's happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4619.634,
    "end": 4621.015,
    "text": "My models can be updated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4621.055,
    "end": 4622.856,
    "text": "And I think what I'm really interested in is,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4623.976,
    "end": 4644.029,
    "text": " For some of these things to then to be capitulated as knowledge, I think there has to be, and this is where the 4E work comes in, is we bring this into some subconscious embodied practices, which we can re-tap into by sort of eliciting what they're like, maybe getting a metaphor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4644.049,
    "end": 4647.432,
    "text": "It feels like the knowledge is coming from around me and I'm grabbing it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4647.452,
    "end": 4651.755,
    "text": "For some other people, it feels like it's coming in as a sequence of very clear things that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4652.375,
    "end": 4667.325,
    "text": " so my way of assembling um the connections of my belief structure to the sensory information coming in will capitulate my modeling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4668.226,
    "end": 4673.589,
    "text": " And as best I can, I'm going to be then trying to attune to the way everyone else is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4673.669,
    "end": 4678.292,
    "text": "And we're all, I'm sure it'd be different if we were all standing up during all of these talks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4679.033,
    "end": 4682.315,
    "text": "We might actually interpret and process a bit different.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4682.335,
    "end": 4685.237,
    "text": "Or if we're all in a pool having a cocktail, you know, I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4685.577,
    "end": 4687.898,
    "text": "I think Blue's on a stationary bike about half the time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4689.259,
    "end": 4691.083,
    "text": " I have my stationary bike hidden out of view.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4691.643,
    "end": 4693.146,
    "text": "But let's ask a question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4693.266,
    "end": 4693.787,
    "text": "Yeah, exactly.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4693.847,
    "end": 4695.109,
    "text": "We could do a ride stream.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4695.129,
    "end": 4698.675,
    "text": "We could do a pull stream, but you got to come to my house.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4699.451,
    "end": 4700.832,
    "text": " Cool, I remember that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4701.452,
    "end": 4711.236,
    "text": "So let's ask a question from the live chat and then we'll return to some of Blue's previously phrased questions about the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4711.836,
    "end": 4713.037,
    "text": "And that's, what's kind of fun.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4713.097,
    "end": 4721.02,
    "text": "Like in the dot zero, we get a lot of the details and the bulk of the paper and all the key ideas and figures, if there are them.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4721.62,
    "end": 4725.042,
    "text": "And then in the dot one, there's so many directions to go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4725.882,
    "end": 4730.905,
    "text": " And I remember early, it's like, wait, two times two hours group discussion on a paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4731.546,
    "end": 4741.111,
    "text": "I'm used to academia papers being discussed for one hour, if ever, and people having very heterogeneous understandings or they did or didn't read the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4741.451,
    "end": 4741.572,
    "text": "So.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4742.432,
    "end": 4770.925,
    "text": " yet we find that there's always enough questions when we open the doors of the conversation to just like super fascinating direct directions for the discussion so again we'll ask a great question in the chat and then we'll kind of turn to some of these dot one questions because next week hopefully we'll have one or both of the authors to be talking with so joseph wrote how has active inference changed the way you view the world in daily life",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4772.23,
    "end": 4774.051,
    "text": " That's a big question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4774.711,
    "end": 4777.492,
    "text": "Do either of you want to go first or I'm happy to go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4782.615,
    "end": 4787.397,
    "text": "I can chip in if you go for one of the ways I've actually found it really helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4788.297,
    "end": 4793.34,
    "text": "And I sort of is changing the way I think about how I see the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4794.794,
    "end": 4800.058,
    "text": " Um, and also a bit change that I think about playing soccer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4800.939,
    "end": 4804.222,
    "text": "So, uh, so the first one is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4807.159,
    "end": 4813.162,
    "text": " there was this sense that, you know, I'm seeing the world, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4813.182,
    "end": 4815.943,
    "text": "And it's all a bit separate from me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4816.363,
    "end": 4829.308,
    "text": "With active inference, it can be quite nice to go out and think about actually perturbing the world and feeling the world as if you're feeling the world with your eyes, touching the world with your hands, seeing the world and touching the world with your eyes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4829.908,
    "end": 4830.389,
    "text": "And I think",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.369,
    "end": 4838.512,
    "text": " that actually can help bring me out of my head, so to speak, in a metaphorical sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4838.713,
    "end": 4847.517,
    "text": "So I found that useful, actually, just thinking about the world as being something that's out there and it's very much something I'm sensing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4847.857,
    "end": 4849.938,
    "text": "And so that takes a little bit of the...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4850.718,
    "end": 4852.719,
    "text": " modernistic kind of concreteness.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4852.739,
    "end": 4862.346,
    "text": "And then with soccer as well, it made me realise, I used to always think, you see those things on telly, like, you know, like someone's kicking a ball, you know, like the equations, a bit like Terminates, you know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4862.786,
    "end": 4866.129,
    "text": "But now it's like, well, actually, it's more like I'm just...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4866.977,
    "end": 4869.038,
    "text": " I'm just getting whatever my feeling is, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4869.098,
    "end": 4871.64,
    "text": "And that whole other stuff, it doesn't matter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4871.8,
    "end": 4881.665,
    "text": "So then you realize that all these really great sports players, the really ones actually, they've acclimatized the feeling for what it means.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4882.525,
    "end": 4885.267,
    "text": "Like Messi must have this feeling for what it means to kick.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4885.627,
    "end": 4888.889,
    "text": "He doesn't need to have the trajectory of the ball in his head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4889.449,
    "end": 4890.93,
    "text": "Anyway, I don't know if that helps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4890.95,
    "end": 4892.671,
    "text": "That goes through my crazy head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4894.352,
    "end": 4895.993,
    "text": " Lou, you want to go or I have a few?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4896.113,
    "end": 4896.333,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4896.674,
    "end": 4903.558,
    "text": "So there's a few angles and this could definitely be a worthy topic for another discussion, but just to give a few angles.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4903.598,
    "end": 4909.383,
    "text": "So first, thinking how we view the world, that was a visual illusion in the original question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4910.263,
    "end": 4916.329,
    "text": " And so it reminds me of the development of thought from seeing the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4916.89,
    "end": 4919.012,
    "text": "That's the signal processing paradigm.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4919.513,
    "end": 4924.458,
    "text": "Photons are pouring in and we're seeing, categorizing, classifying the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4925.038,
    "end": 4925.318,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4926.219,
    "end": 4928.301,
    "text": "Then we have predictive processing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4929.079,
    "end": 4935.701,
    "text": " And that's like, well, you know, our visual field for most individuals, they see color in their entire visual field.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4936.121,
    "end": 4944.524,
    "text": "And there's equal clarity in their visual field, even though there's an extremely heterogeneous distribution of resolution and color elements in the retina.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4944.984,
    "end": 4946.144,
    "text": "And we have a big old blind spot.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4946.725,
    "end": 4947.625,
    "text": "So color.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4948.345,
    "end": 4959.21,
    "text": " Clarity of vision and blind spot suggests that we're experiencing a generative model, a predictive model of vision, that's predictive processing, and it applies also to other sensory modalities.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4959.731,
    "end": 4965.954,
    "text": "And then that third step was where Stephen took it with the active vision, the epistemic foraging.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4966.574,
    "end": 4976.339,
    "text": "And we know that even though we don't directly experience these either, there's eye saccades, which move to the most informative part of the visual scene.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4977.159,
    "end": 4996.65,
    "text": " so to me it's about moving from signal processing 1.0 to predictive processing to active sensing and exploration as informed by epistemic and pragmatic value together you know eyes on the ball but you got to also see more than that generate more than that so that's one really important part",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4997.37,
    "end": 5005.395,
    "text": " Second one, I'll also parallel exactly what Steven said, which is like, it made me think, even though I don't know about soccer, I don't know about the telly, wrong continent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5005.876,
    "end": 5016.042,
    "text": "But it's kind of like the top-down, the video game model, where there's like, I see it more and more in sports replays, where it's like, it will pause and it will look like a video game.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5016.883,
    "end": 5021.046,
    "text": "But that's not the action model of the player on the field.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5021.926,
    "end": 5022.187,
    "text": "They're...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5023.334,
    "end": 5029.019,
    "text": " using much more of a personal flow and a feel and interactions and cues.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5029.9,
    "end": 5034.084,
    "text": "And so they don't need to be having this 30,000 foot view.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5034.644,
    "end": 5038.007,
    "text": "They need the peripersonal perspective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5038.427,
    "end": 5039.648,
    "text": "So that is one piece.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5040.109,
    "end": 5048.837,
    "text": "And then just a third one, but I think another, there's many more we could list would be like the reward oriented worldview, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5049.497,
    "end": 5077.232,
    "text": " so reward maximization is the paradigm reinforcement learning is how neurons associate utility maximization is what investing is about in contrast with an uncertainty reduction paradigm a precision optimization paradigm where qualified levels of precision of nested models allow a lot of flexibility and a lot more realistic phenomenology for different models",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5078.137,
    "end": 5084.099,
    "text": " because precision pursuit on an optimistic world model gets you utility.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5084.579,
    "end": 5093.643,
    "text": "So I just think we get utility from a precision-first worldview, but from a utility-oriented worldview, we don't always get precision, and that...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5094.483,
    "end": 5113.384,
    "text": " i personally connect to how if we have like a tetrahedral based geometry of nature we get cubes but if we start with cubic geometry we never get tetrahedra so that's sort of where i connect it utility is like bigger and a more general framework because utility falls out of precision on an optimistic generative model",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5113.925,
    "end": 5123.649,
    "text": " but merely having utility, it's always going to be ad hoc or secondary where it is curiosity and epistemic gain and all these other features of real decision-making.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5123.949,
    "end": 5128.631,
    "text": "So those are a few of the key pieces, how it changes, how I've seen the world blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5132.35,
    "end": 5153.379,
    "text": " so besides from like having integrated fully into like my daily vocabulary which is like you know we talk about things like the generative model like you know in completely unrelated offline conversations um so aside from like you know enhancing my vocabulary and building this new language of you know the fbp",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5155.173,
    "end": 5156.694,
    "text": " That's weird, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5156.734,
    "end": 5157.854,
    "text": "Like, okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5159.295,
    "end": 5166.7,
    "text": "But aside from that, you know, one of the things, one of the recurrent themes for me in Active Inference has been",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5167.997,
    "end": 5176.664,
    "text": " The idea, like we touched on it in the mental action paper that we did, like Daniel, you're going to have to pull it up for me because I can never remember.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5176.985,
    "end": 5178.246,
    "text": "You've got a better track.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5178.346,
    "end": 5184.851,
    "text": "Your model is updated and configured with all of the appropriate live stream numbers, more so than mine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5185.031,
    "end": 5185.151,
    "text": " It's 28.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5185.851,
    "end": 5185.971,
    "text": "It's 28.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5186.432,
    "end": 5189.033,
    "text": "And it's only because of my extended niche, but continue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5189.053,
    "end": 5189.353,
    "text": "That's it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5189.653,
    "end": 5191.894,
    "text": "And so can you also query your extended niche?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5191.934,
    "end": 5194.695,
    "text": "Because I can't ever remember the one where we talked about anxiety.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5194.735,
    "end": 5202.098,
    "text": "Like was it, if it was big five or sophisticated active inference, or I always ask which one that one was, but I can't ever, that was a long time ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5203.259,
    "end": 5218.316,
    "text": " But going back, you know, touching on mental action and meditation and the idea that we touched on way in the long ago livestream of anxiety representing, you know, trying to project too many time steps ahead into the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5219.076,
    "end": 5228.223,
    "text": " and having this relate to anxiety, and then depression is relating to fixating too many steps in the past behind you, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5229.003,
    "end": 5235.148,
    "text": "So this model of neuroatypical things, it just always reminds me to come back to the present moment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5235.188,
    "end": 5239.851,
    "text": "And I'm looking for an excuse to do that anyway, just because of my inclinations toward Eastern religion and so forth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5240.271,
    "end": 5250.442,
    "text": " So but but the reminder to stay in the present moment has now been like made through an appeal to my logical brain, like outside of a spiritual sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5250.823,
    "end": 5255.508,
    "text": "And so that that kind of is is a cool, you know, effect of of active inference, I think.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5256.405,
    "end": 5278.316,
    "text": " awesome there's so many fun questions in in the chat so i mean i'll i'll ask these and then we can we can we'll still have time to return to the paper so mihail asks okay one if you were to let your imagination roam freely where do you wish or see the best possible real life application so for that question",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5279.278,
    "end": 5284.82,
    "text": " That's a question for us and the community and beyond.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5285.741,
    "end": 5297.306,
    "text": "So we can maybe each just mention one thought that we're having, but if you see a possible future state, active inference of X,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5298.436,
    "end": 5300.159,
    "text": " let's act, infer, serve.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5300.799,
    "end": 5306.788,
    "text": "Let's act first, update our models and serve and make the impact that we want to see.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5307.048,
    "end": 5314.779,
    "text": "So this is actually an affordance of a question because if two people are like, wow, we should do this, or could this be useful?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5315.66,
    "end": 5319.482,
    "text": " If you can state it, you're like 90% of the way there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5320.163,
    "end": 5341.256,
    "text": "And we hope to develop the sort of transdisciplinary tools like active inference agent software and the expertise tools, people, and ideas and the education so that when somebody else who's not on this live stream, there's just three of us, has that insight or sees it being applied in a new way,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5342.176,
    "end": 5347.298,
    "text": " we want to help you scaffold that action trajectory but blue and then steven",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5349.781,
    "end": 5351.642,
    "text": " so I guess I always come back to this too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5351.903,
    "end": 5356.886,
    "text": "Something that fascinates me fully is how information is integrated across scales.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5357.266,
    "end": 5367.113,
    "text": "So how is the model of, of my, you know, DNA strands imported into my cells, imported into my tissues, imported into my organs, imported into my sense of self, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5367.233,
    "end": 5372.277,
    "text": "Like, so how does this, and how do I import into the organisms that I'm part of like the active inference lab and so forth?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5372.677,
    "end": 5373.678,
    "text": "So for me, really like,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5374.298,
    "end": 5400.426,
    "text": " concretely realizing a mathematical way to find information passing up and down like is it salience or what else what other way this emergence like for me that's like it like if active inference can nail that and this is like a fantasy daydream and i know people are working towards that but it's out there in the future but but if i could really wish one thing if i could you know daydream about my ultimate fantasy of active inference being fulfilled it's completely that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5401.59,
    "end": 5402.33,
    "text": " Okay, awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5402.59,
    "end": 5411.514,
    "text": "Modeling nested biological systems, something that we've seen qualitatively discussed in the literature, like Ramsted et al.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5411.534,
    "end": 5420.937,
    "text": "2018, answering Schrodinger's question, variational ecology, variational neuroethology, a lot of contributors to these works, but that kind of a model would be epic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5421.278,
    "end": 5421.538,
    "text": "Stephen?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5424.359,
    "end": 5425.639,
    "text": "Yeah, I'm really interested.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5425.659,
    "end": 5427.14,
    "text": "I think active inference...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5428.567,
    "end": 5431.609,
    "text": " It doesn't have to do everything to be really a contribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5432.449,
    "end": 5443.536,
    "text": "It can fill certain gaps as well or give certain mechanisms that can give an insight, either to tractably give a way to model or a way to just think about things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5443.556,
    "end": 5451.001,
    "text": "So what I'm curious about, and I'm working on something called conceptual action sociometry, which is an action method,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5452.542,
    "end": 5463.411,
    "text": " I'm really interested in how to work back from a high complexity context, which would be too many dimensions to model from first principles.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5464.231,
    "end": 5469.375,
    "text": "So rather than modeling the generative model per se,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5470.345,
    "end": 5481.092,
    "text": " I'm looking at how to create an instrument to track the info niche being scribed by the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5481.513,
    "end": 5483.414,
    "text": "So it's almost like a trace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5485.455,
    "end": 5486.836,
    "text": "So I'm...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5488.257,
    "end": 5506.829,
    "text": " really interested in how we can go both ways as well as the sort of general extractable sort of principled work that can be show how generative models are happening and being applied across things like context of autism and other areas where there's different types of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5507.95,
    "end": 5536.136,
    "text": " classifications i'm really interested in kind of contextual work which will be outside of the ability to do full research but might be able to do an inquiry process and how to sort of just get a grip on that inquiry so um be it people looking at their lived experiences and things like that and we're actually talking about that in the tools section people are sort of giving me some advice um or open to that once we get to the next phase",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5537.611,
    "end": 5539.873,
    "text": " Awesome, thanks for also sharing that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5539.893,
    "end": 5549.059,
    "text": "And then I think the system, just the one that I'll mention would be online teams or research, knowledge, inquiry.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5549.938,
    "end": 5567.867,
    "text": " and doing scholarship and just at this point in time just facilitating the reduction of our uncertainty on the history of active inference and free energy principle literature and a few other areas because um tools for research and sense making would be",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5568.607,
    "end": 5594.985,
    "text": " really awesome for a lot of different reasons so cool and then the second question um from the hill in that sequence was what if we model our group conversation where we as humans disappear and where we are not exploring the universe but the universe is exploring itself utilizing us a beautiful thought question and there's a lot to think about that so blue",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5597.518,
    "end": 5601.839,
    "text": " Yeah, I mean, I think that this is possible, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5602.08,
    "end": 5611.743,
    "text": "And, you know, we've talked about it in the computational boundary of the self, the Mike Levin paper, like ultimately it's like dissolution of the cognitive boundary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5611.863,
    "end": 5614.024,
    "text": "And is there some like meta organism?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5614.044,
    "end": 5620.286,
    "text": "This goes to like the Gaia hypothesis, maybe not the universe, but the earth, or maybe the earth is part of the universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5620.326,
    "end": 5626.588,
    "text": "Maybe there's some ultimate like super organism that with cognitive boundary contains all of us.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5627.408,
    "end": 5636.034,
    "text": " And so just in the same way that like our cells are working towards our optimal function, given the circumstances that they're presented with, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5636.114,
    "end": 5641.518,
    "text": "Like given that assumption, maybe we're also working toward the optimal state of the universe.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5641.578,
    "end": 5652.766,
    "text": "Like every interaction that occurs between all of us is working toward the optimal state of the active inference lab or the optimal state of the United States of America or the optimal state of scientific research or who knows, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5653.166,
    "end": 5655.087,
    "text": "So any kind of, you know...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5656.368,
    "end": 5661.27,
    "text": " umbrella category that we might fall into, maybe we're serving the optimal state of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5661.41,
    "end": 5667.232,
    "text": "And really, like, I think it's quite possible and a really cool way to model active inference for sure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5668.532,
    "end": 5678.676,
    "text": "Another take on that from Bucky Fuller is this function first mentality led him to ask, well, what is the function of human?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5679.596,
    "end": 5681.237,
    "text": "And are we local sensemaker?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5681.277,
    "end": 5682.097,
    "text": "What is our role?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5682.577,
    "end": 5684.198,
    "text": "So those are big, important questions.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5685.205,
    "end": 5701.971,
    "text": " Let's return to 31.1 and kind of prime ourself for our dot two, because in the dot zero, that's where like whoever's really excited about the paper, maybe whoever contacted the authors or maybe one of the authors themselves, or just a few people who want to learn by doing.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5702.351,
    "end": 5705.172,
    "text": "The dot zero, which was like blue and I for this one, 31.1, the previous video.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5707.366,
    "end": 5708.067,
    "text": " We go through the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5708.687,
    "end": 5710.569,
    "text": "The dot one, we unpack.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5710.609,
    "end": 5712.31,
    "text": "That's sort of the bathtub phase.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5712.77,
    "end": 5714.051,
    "text": "Everything is getting spread out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5714.411,
    "end": 5718.595,
    "text": "A lot of sociological criticisms or insights.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5718.615,
    "end": 5722.097,
    "text": "A few random questions from the guests of our stream.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5722.117,
    "end": 5723.959,
    "text": "A lot of different areas.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5723.979,
    "end": 5725.36,
    "text": "A lot of threads get pulled out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5725.54,
    "end": 5732.426,
    "text": "And then in the dot two, we try to have some synthesis because it's not the end of the discussion with the dot two, but...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5733.126,
    "end": 5735.247,
    "text": " we have to move on from a live stream perspective.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5735.268,
    "end": 5740.351,
    "text": "So the .2, especially when the authors can be there, we can get some more insights.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5740.391,
    "end": 5747.836,
    "text": "We can resolve some questions that arose during the .1 and .0 and the intervening times.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5748.236,
    "end": 5751.499,
    "text": "So questions that didn't arise before we enacted",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5752.239,
    "end": 5775.562,
    "text": " this process and then we get to ask those and then kind of use that as our jumping off point as we move on to our next phase so here in the dot one at the end it's kind of like a fractal dot two we're kind of trying to tie a few things together returning to the text as a strange attractor so that we'll have a whole week to read think sleep",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5776.463,
    "end": 5799.427,
    "text": " stationary bicycle mind and body relax maybe do our day job if we can find any time and um be here you know next week or whenever works to continue the discussion so blue um in this questions for 31.1 what were some quotes or some questions from the paper that you wanted to like learn more about or ask the authors about",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5800.319,
    "end": 5810.727,
    "text": " Well, just as I mentioned, you know, even earlier in this live stream today, like the dynamic equilibrium of living systems, like I'm not understanding that at all.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5810.827,
    "end": 5816.672,
    "text": "Like maybe that's homeostasis, but homeostasis is not, in my mind, dynamic equilibrium.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5816.712,
    "end": 5826.279,
    "text": "And I think that this, you know, Bayesian mechanics for stationary processes and the idea of a non-equilibrium steady state density kind of supersedes that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5826.559,
    "end": 5851.2,
    "text": " this concept of dynamic equilibrium because homeostasis is not equilibrium and so that's kind of a fundamental like it like bends in my brain a little bit when i when i've been reading over this paper um and also uh you know it says here we should pay closer attention to fundamental differences between physics and biology and how these differences interact with importing concepts from physics into the modeling of biological targets",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5851.64,
    "end": 5855.141,
    "text": " So, I mean, is it physics all the way down?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5855.301,
    "end": 5857.881,
    "text": "Because I always thought it was physics all the way down, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5857.941,
    "end": 5871.904,
    "text": "Like, so I don't know, that goes to, you know, like when I was in school, they always said like, you know, biology is not as precise as chemistry and chemistry is not as precise as physics and physics is not as precise as math, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5871.924,
    "end": 5878.265,
    "text": "Like, so there's this like tiered hierarchy of how, you know, fundamental your study can be, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5879.205,
    "end": 5879.625,
    "text": "And so-",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5881.161,
    "end": 5887.727,
    "text": " it, I think biology is based in the concept of physics, but, but also chemistry, I feel like was really omitted and left out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5888.027,
    "end": 5891.03,
    "text": "And like, in my heart, I'm a chemist, Stephen, I'm sure can relate to that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5892.251,
    "end": 5896.294,
    "text": "But really like, so, so that's kind of one other thing I wanted to explore.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5896.394,
    "end": 5897.215,
    "text": "And then I'm,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5898.078,
    "end": 5906.201,
    "text": " The other part of the questions that I have for the authors are, you know, in active inference, are the active states internal?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5906.701,
    "end": 5909.483,
    "text": "Because they said internal states include active states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5909.563,
    "end": 5917.766,
    "text": "But I've always thought of active states and sensory states as part of the interface between internal and external states as part of the Markov blanket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5917.806,
    "end": 5921.848,
    "text": "And so I just wanted to clear that up, maybe if that's a misunderstanding on my part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5922.548,
    "end": 5927.45,
    "text": "Or, I mean, I guess action can happen internally, like as we've seen in the mental action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5928.23,
    "end": 5934.996,
    "text": " So that's definitely possible, but not all active states are part of internal states, I thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5935.276,
    "end": 5939.139,
    "text": "So I don't know, maybe that's something that we can tease apart with the authors.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5939.179,
    "end": 5950.009,
    "text": "And I'm looking forward to having them here and asking them these three questions, which are the ones that kind of, for me, don't align with my current model of the FEP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5950.885,
    "end": 5951.685,
    "text": " They were salient.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5952.386,
    "end": 5954.987,
    "text": "They were different from your generative model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5955.007,
    "end": 5956.408,
    "text": "So it's a nice way to put it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5956.488,
    "end": 5958.328,
    "text": "And then I'll just show this one comic and then Steven.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5958.809,
    "end": 5962.77,
    "text": "So this is a classical XKCD comic.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5963.571,
    "end": 5965.091,
    "text": "The fields arranged by purity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5965.312,
    "end": 5965.532,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5965.712,
    "end": 5976.897,
    "text": "So it's a comic, you know, retweets are not endorsements, but you have, this is a classic disciplinary hierarchy slash Ponzi scheme, pyramid scheme, whatever, you know,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5977.637,
    "end": 5979.918,
    "text": " You have the physicists, let's just start in the middle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5980.278,
    "end": 5981.118,
    "text": "It's nice to be on top.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5981.158,
    "end": 5985.08,
    "text": "That's the common pinnacle of the pyramid in certain paradigms.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5985.72,
    "end": 5988.621,
    "text": "And then like the physicists can make claims about lower levels.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5989.361,
    "end": 5993.663,
    "text": "But then if the psychologist makes a claim about physics, hey, we need a sociology of molecules.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5993.683,
    "end": 5996.664,
    "text": "It'd be like, that's not science.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5997.364,
    "end": 6002.626,
    "text": "But then the physicist talking about sociophysics is like, wow, that's so modern and exciting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6003.046,
    "end": 6005.307,
    "text": "So there's a sort of linearity",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6006.267,
    "end": 6027.226,
    "text": " as well as potentially some sociological scaffolding that facilitates the diffusion of information and expertise and uh notoriety like one way but it's not always a two-way street and then the joke i guess in the xkcd is like the mathematician saying hey i didn't see you all from over here so again just a comic now",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6028.027,
    "end": 6057.687,
    "text": " playing with the media what does it look like to i don't know close the loop or have these learn about each other's perspective or there's a million ways that we could go counterfactual on this xkcd what if i mean that's the name of the xkcd's author's book which is kind of fun um but how does active inference challenge this either specifically or just how are broader ongoing sequences of actions like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6058.487,
    "end": 6069.014,
    "text": " decentralized science, DeSci, open science, open access, open source, global collaboration, transdisciplinary application, complexity science.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6069.134,
    "end": 6076.539,
    "text": "I mean, there's a million ways in which this is kind of funny because it speaks to an academic hierarchy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6076.979,
    "end": 6080.821,
    "text": "And maybe we've even met some characters who really embodied these archetypes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6081.181,
    "end": 6081.322,
    "text": "But",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6082.162,
    "end": 6084.603,
    "text": " What are the archetypes going to be going forward?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6085.123,
    "end": 6092.304,
    "text": "What are more accessible archetypes and ones that are more true to form and they can still be funny?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6092.664,
    "end": 6096.685,
    "text": "I'm sure we'll have acting memes just enough to warm the hearth.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6097.545,
    "end": 6100.806,
    "text": "But this is just one view that kind of speaks that disciplinary hierarchy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6100.846,
    "end": 6101.946,
    "text": "So yeah, Stephen, then Bloom.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6104.047,
    "end": 6107.707,
    "text": "Yeah, I think this is where this foundational shift is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6107.747,
    "end": 6110.288,
    "text": "This desire for purity, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6111.258,
    "end": 6123.084,
    "text": " um starts has been really challenging of course now we're in this post-normal science era where you know the reality is that we're gonna have to make decisions and not just wait for the purity of the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6124.521,
    "end": 6128.003,
    "text": " the random control trial or whatever it is to make choices.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6128.343,
    "end": 6133.925,
    "text": "So how can we be more systematic and rigorous?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6134.085,
    "end": 6141.589,
    "text": "And so then complexity comes in and the challenges that we are facing is that a lot of psychologists and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6142.449,
    "end": 6147.555,
    "text": " psychiatrists have also gone down the purity route in a way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6148.176,
    "end": 6155.705,
    "text": "The idea is they're all trying to be more pure, and the mathematician can be more pure than the others.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6155.906,
    "end": 6157.888,
    "text": "But that question about being more pure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6158.877,
    "end": 6165.106,
    "text": " I think this is what Blue's points make a really good, you know, they come into question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6165.287,
    "end": 6173.599,
    "text": "Like physics comes into question, chemistry comes into question when you talk about far from equilibrium states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6174.56,
    "end": 6198.527,
    "text": " um even the idea of it in chemistry they call it far from equilibrium chemistry in physics they call it non-equilibrium states right um because they can actually math and the mathematicians would call it lorenzo tractor states right and but in either case you know you only have to look at lorenzo tractor the whole point is you don't know where you are in it right and and not in the same way as",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6199.107,
    "end": 6205.834,
    "text": " Quantum, well, that's a question when you get into the fine details, we don't know yet, but it's still different to quantum, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6205.874,
    "end": 6209.878,
    "text": "And I think that's where that quantum contextuality comes in as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6209.958,
    "end": 6212.081,
    "text": "So anyway, what's your thoughts on that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6213.508,
    "end": 6217.03,
    "text": " The thing that just came to mind and then blew is like, this is linear, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6217.05,
    "end": 6217.711,
    "text": "It's open-ended.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6218.891,
    "end": 6226.075,
    "text": "But sociologists and philosophers make important insights about the philosophy and history of science.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6226.796,
    "end": 6233.139,
    "text": "And so the mathematician can say, yeah, we're the most pure or we're the most correct or whatever it happens to be.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6233.76,
    "end": 6239.283,
    "text": "But they're nested in a sociological context, in a historical, in a philosophical context.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6239.743,
    "end": 6239.883,
    "text": "So...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6241.204,
    "end": 6249.391,
    "text": " It is closed from a causal closure perspective because it's not like physics have just broken out of the frameworks of thought.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6250.412,
    "end": 6265.424,
    "text": "So how to move this line into a conversation that's including all of these disciplines in a trans discipline and including people who aren't in academia or research in that as well.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6265.965,
    "end": 6266.145,
    "text": "Blue?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6268.422,
    "end": 6271.144,
    "text": " So this is an interesting comic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6271.284,
    "end": 6276.909,
    "text": "And I usually don't even talk about psychologists or sociologists because that's not science, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6277.569,
    "end": 6278.29,
    "text": "I'm just kidding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6278.69,
    "end": 6281.892,
    "text": "I really actually have a lot of respect for psychology and sociology.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6282.633,
    "end": 6285.755,
    "text": "But it's just not something that's ever been lumped into my pyramid before.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6285.855,
    "end": 6287.957,
    "text": "So thank you for sharing that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6288.077,
    "end": 6289.939,
    "text": "And seeing it in this way, maybe...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6292.42,
    "end": 6302.623,
    "text": " they should arrange by like the fundamentality of it, like sociology without like social interaction, we would not develop things like mathematics, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6302.663,
    "end": 6303.704,
    "text": "Like there would be no need.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6304.464,
    "end": 6307.805,
    "text": "So in terms of what's more fundamental, like maybe sociology,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6308.405,
    "end": 6309.306,
    "text": " is fundamental.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6309.346,
    "end": 6315.19,
    "text": "And psychology, like we're not even thinking about what makes us work if we're not psychologically okay, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6315.21,
    "end": 6319.272,
    "text": "Like if we're in a bad psychological state, nobody's thinking about intracells and DNA.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6319.332,
    "end": 6326.417,
    "text": "Like that's, there's just no, you have to have like the fundamental needs have to be met before you start to ponder things like, what am I made of?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6326.457,
    "end": 6328.078,
    "text": "And how do my parts work, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6328.979,
    "end": 6338.105,
    "text": "And really like, so maybe in terms of fundamentality, and then we are biology, and then, you know, so maybe in terms of the fundamental things, sociology is,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6338.665,
    "end": 6339.925,
    "text": " the pinnacle of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6340.866,
    "end": 6352.528,
    "text": "And again, there's probably many ways in which different perspectives or active inference can challenge this, or at least kind of continue this joke a little bit, but it's like pure active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6353.048,
    "end": 6355.409,
    "text": "It's really about sociological context.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6355.729,
    "end": 6357.91,
    "text": "We really have a mathematical formalism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6358.35,
    "end": 6361.19,
    "text": "It's really grounded in the ways that people have been studying physics.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6361.73,
    "end": 6363.211,
    "text": "That's one of the questions of 31, the paper.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6364.511,
    "end": 6369.315,
    "text": " is to what extent is it, has it, could it been grounded in physics?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6369.836,
    "end": 6381.405,
    "text": "But we really have physics and we really are talking about biology and for comprehensiveness and getting to the fundamentals, it is really fundamentally relational.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6382.526,
    "end": 6386.21,
    "text": " So we're not taking this reductionist purity spiral.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6386.71,
    "end": 6393.116,
    "text": "We're taking like a transdisciplinarity purity and we're just saying, this is our keyword.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6393.797,
    "end": 6398.301,
    "text": "And to really get at what we're talking about, we're really gonna respect all of these perspectives.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6398.841,
    "end": 6406.889,
    "text": "So that's kind of a funny challenge that you wouldn't necessarily hear arising from a disciplinary conversation.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6407.349,
    "end": 6408.21,
    "text": "So Steven, go for it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6409.059,
    "end": 6428.626,
    "text": " Yeah, I think this is also one thing, you know, we say, though, that we see the importance of social interaction, social inference and the challenges that I think actually this might be quite apt for where we had at the beginning with Maxwell's conversation is the perspective of the sociologists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6430.373,
    "end": 6433.994,
    "text": " becomes what is ascribed to social interactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6434.454,
    "end": 6439.475,
    "text": "The psychologists is what's ascribed in the mental models that we have in our head.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6439.955,
    "end": 6442.155,
    "text": "The biologists are ascribed in the categories.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6442.195,
    "end": 6444.196,
    "text": "The chemist is ascribed in the steady state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6445.196,
    "end": 6456.978,
    "text": "So when you get into this agent-based modeling, which again I think is more familiar to the newer work in biology, but it's something that I had to start to learn about,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6458.84,
    "end": 6469.408,
    "text": " and looking at these dynamics and modeling actually starts to go under the ground of all of these.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6470.409,
    "end": 6476.814,
    "text": "It doesn't make them invalid, because they are useful when you can take a perspective on the systemic work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6477.614,
    "end": 6480.817,
    "text": "But we're not taking perspectives in this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6480.977,
    "end": 6485.54,
    "text": "And the whole ground starts to become shifting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6486.201,
    "end": 6487.342,
    "text": "And that's really interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6488.55,
    "end": 6515.199,
    "text": " here's another kind of a subtlety actually so um sociologists okay just starting there that's our prior you know d coming in from the left sociology is applied psychology okay so we're going all the way you know chemistry is applied physics it's just like it's interesting the conversation is going that way i'm just seeing another comic where it could have been like physics is applied math",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6516.161,
    "end": 6537.571,
    "text": " chemistry is applied physics like who is saying which field is an application of which other field so there's a lot of ways that conversation could play out and by imagining the counterfactuals the semantic the rhetorical counterfactuals and then asking well what is concordant or disconcordant with our generative model and why",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6538.939,
    "end": 6551.954,
    "text": " That's a very rich starting point for transdisciplinary discussions because the whole inter, meta, transdisciplinary discussion, it's been decades, centuries, truly, with different words.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6552.735,
    "end": 6554.637,
    "text": "So how are we going to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6555.678,
    "end": 6569.831,
    "text": " look at this with a new light and maybe even integrate some of the truly recent developments in tools like performance computing and interactive notebooks and ontologies.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6570.412,
    "end": 6574.075,
    "text": "These didn't exist one or 200 years ago in the same way they do today.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6574.736,
    "end": 6591.06,
    "text": " So how are we going to respect qualitative and quantitative and different backgrounds, recognizing that we're never going to get the end of the story, even if you got 100 PhDs in any one of these fields or lived 100 years in a field outside of academia, you still wouldn't be at the end.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6591.6,
    "end": 6597.781,
    "text": "So how are we going to take a radically different approach to learning and applying?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6598.821,
    "end": 6601.122,
    "text": "Maybe active inference could have something to do with it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6601.942,
    "end": 6602.042,
    "text": "So",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6603.243,
    "end": 6609.185,
    "text": " In the last few minutes, anyone else in the live chat could just ask a final question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6610.126,
    "end": 6613.187,
    "text": "Otherwise, let's just sort of recap.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6613.407,
    "end": 6624.771,
    "text": "The big aims and claims of this paper were about the foundations in statistical physics and dynamical systems theory for the free energy principle.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6625.868,
    "end": 6633.898,
    "text": " And what's on the line, what's on the table for whether the theoretical underpinnings are adequate or not for FEP and ACT-INF?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6634.479,
    "end": 6639.385,
    "text": "Well, it's the practical utility as well as the theoretical adequacy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6640.086,
    "end": 6642.169,
    "text": "So that's what matters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6643.766,
    "end": 6646.447,
    "text": " they claim that their work is starting to fill in this gap.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6647.167,
    "end": 6663.995,
    "text": "And whether we think that there's any other pebbles in that gap or the gap is a meter across or a kilometer across, there is a differential and we can all positively contribute to that through discourse and through contributions to the literature.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6664.695,
    "end": 6666.376,
    "text": "And then the main argument of the paper",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6667.509,
    "end": 6678.204,
    "text": " And one of the big ideas that'll be really cool to talk about is that the foundations in physics allow the FEP models to be maximally general, to describe across systems",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6679.636,
    "end": 6691.962,
    "text": " But in the author's words, these assumptions also decrease the ability of FEP models to include enough factors to provide biologically plausible representations for living systems and the way that they are in the world.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6692.742,
    "end": 6702.507,
    "text": "So, you know, big idea, physical and physics grounding of FEP and what that says about the theoretical adequacy as well as the practical utility.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6703.128,
    "end": 6705.369,
    "text": "And then this idea of generalization",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6706.209,
    "end": 6713.277,
    "text": " And if we overgeneralize, do we sort of leave behind some of the features that we wanted to explain in the first place?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6713.997,
    "end": 6717.641,
    "text": "So that's a little bit of the recap and I'll just,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6718.68,
    "end": 6724.606,
    "text": " pull to our kind of closing slide and ask these questions and then Stephen and Blue, you can give a last thought.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6725.407,
    "end": 6727.57,
    "text": "What would a good understanding enable?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6728.27,
    "end": 6734.717,
    "text": "What are the unique predictions and the implications of this research or of what you thought of after learning about this research?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6735.518,
    "end": 6738.301,
    "text": "What are the next steps for FEP and active inference?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6739.209,
    "end": 6741.31,
    "text": " What are the goals of this or your research?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6741.91,
    "end": 6743.851,
    "text": "And then what are you still curious about?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6744.151,
    "end": 6750.193,
    "text": "What is your intrinsic motivation that's going to keep you reading these papers and contributing to the discussion?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6750.673,
    "end": 6752.893,
    "text": "So Stephen or Blue, any last thoughts?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6753.374,
    "end": 6754.454,
    "text": "Stephen first and then Blue.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6756.695,
    "end": 6760.156,
    "text": "I think in terms of this paper anyway, I think...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6761.36,
    "end": 6769.286,
    "text": " that this really does highlight this need to understand the difference between particles, voxels, things, systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6769.326,
    "end": 6774.95,
    "text": "I think this, because these types of critiques keep coming up, right, at times.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6775.05,
    "end": 6782.975,
    "text": "I know it has a risk of kind of tying the free energy principle community in some knots.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6783.876,
    "end": 6786.018,
    "text": "And so I think that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6787.291,
    "end": 6792.334,
    "text": " It's a challenge, and I think that that may be part of where this goes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6792.554,
    "end": 6795.636,
    "text": "And at the same time, I think it's a good provocation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6795.736,
    "end": 6802.339,
    "text": "And there is some questions here about how and why those confusions arise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6802.7,
    "end": 6813.466,
    "text": "And so I think that might be, you know, I'm curious about learning more about that, because I think that's going to help in other ways in doing this work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6814.786,
    "end": 6815.547,
    "text": "Thank you, Stephen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6815.727,
    "end": 6815.947,
    "text": "Blue?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6818.206,
    "end": 6826.057,
    "text": " So it's awesome to me, I think, that I'm talking about the general general generalizability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6826.097,
    "end": 6827.218,
    "text": "Sorry, that didn't come out well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6827.538,
    "end": 6832.806,
    "text": "The generalizability and applicability of like the free energy principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6833.526,
    "end": 6839.171,
    "text": " I really like that that's also like a trade-off between like epistemic and pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6839.211,
    "end": 6843.095,
    "text": "Like it reminds me of that balance that we see in the FVP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6843.195,
    "end": 6847.138,
    "text": "And so I think like the ultimate goal is to resolve that, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6847.158,
    "end": 6850.601,
    "text": "Like how do we strike the balance between epistemic and pragmatic value?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6850.902,
    "end": 6854.365,
    "text": "How do we strike that balance between generalization and application?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6855.794,
    "end": 6856.675,
    "text": " Great point.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6857.115,
    "end": 6871.706,
    "text": "We want to describe many systems and describe them well and walk in with a scaffold, but minimal constraining priors that prevent us from seeing some fundamental or even essential attributes of systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6872.286,
    "end": 6880.912,
    "text": "And then that general and specific, connecting that to learning and doing, to epistemic and pragmatic values or gains, which...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6882.045,
    "end": 6887.687,
    "text": " Hint, hint, we have included in the act of formalism as part of our policy selection approach.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6888.287,
    "end": 6900.131,
    "text": "So Stephen and Blue, plus everybody who asked truly excellent questions in the live stream, we'll see you in an organizational unit meeting or the Discord or some other way.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6900.391,
    "end": 6903.972,
    "text": "Just this is your affordance to participate and contribute.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6904.393,
    "end": 6907.293,
    "text": "So thanks again to everybody and we'll see you next time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6908.634,
    "end": 6908.754,
    "text": "Bye.",
    "speaker": "SPEAKER_04"
  }
]