[
  {
    "start": 7.435,
    "end": 8.175,
    "text": " Hello, everyone.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 8.716,
    "end": 10.877,
    "text": "Welcome to the Active Inference Lab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 10.937,
    "end": 13.359,
    "text": "This is Active Inference Livestream number 31.0.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 13.399,
    "end": 13.92,
    "text": "It's October 14th, 2021.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 19.309,
    "end": 20.77,
    "text": " Welcome to the ACT-INF Lab.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 21.35,
    "end": 27.293,
    "text": "We are a participatory online lab that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 27.853,
    "end": 30.474,
    "text": "You can find us at the links here on this slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 31.495,
    "end": 37.497,
    "text": "This is a recorded and an archived live stream, so please provide us with feedback so that we can improve on our work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 38.518,
    "end": 44.02,
    "text": "All backgrounds and perspectives are welcome here, and we'll be following good video etiquette for live streams.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 45.85,
    "end": 54.237,
    "text": " At this short link, you can see some of the past, present, and future streams that we'll be doing in the lab as part of the .com's organizational unit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 54.637,
    "end": 59.801,
    "text": "And the first tab has the regular Tuesday discussions that are group discussions, .1 and .2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 60.562,
    "end": 64.965,
    "text": "Right now we're in a .0, kind of an ad hoc scheduled contextualizing live stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 65.886,
    "end": 70.469,
    "text": "And then the other tabs have other kinds of live streams that can be scheduled at different times, different topics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 70.629,
    "end": 75.053,
    "text": "So just let us know if you want to get involved or co-organize an event with us.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 77.014,
    "end": 91.305,
    "text": " Today in active stream number 31.0, the goal is to learn and discuss this paper, Non-Equilibrium Thermodynamics and the Free Energy Principle in Biology by Patricia Palacios and Mateo Colombo.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 92.546,
    "end": 99.712,
    "text": "Like all the dot zeros, you'll get the disclaimer that this is just an introduction to some of the ideas of the paper and the context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 100.212,
    "end": 103.415,
    "text": "It's not a review or a judgment or a final word.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 105.555,
    "end": 116.585,
    "text": " In 31.0, we're going to start by looking over some of the key aims and claims and the abstract and the roadmap of the paper to get the big picture, then talk about some of the keywords.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 117.246,
    "end": 128.877,
    "text": "Maybe you're really familiar with some of the keywords, maybe it's the first time you've thought about some of these topics, and then we'll walk through some of the figures and formalisms and just get set up in the coming weeks to be discussing this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 130.58,
    "end": 133.542,
    "text": " So we'll start with just some introductions and warmups.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 133.822,
    "end": 141.766,
    "text": "We'll say hello and then maybe just mention something that we're excited to talk about or learn about or something that we noticed while reading the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 142.546,
    "end": 145.187,
    "text": "So I'm Daniel, I'm a researcher in California and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 146.468,
    "end": 155.252,
    "text": " This is just an exciting paper and topic because it's at the intersection of chemistry and physics and thermodynamics, but also active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 155.512,
    "end": 165.536,
    "text": "And it's a nice starting point for a conversation about what are the precursors and the tenants and the principles of free energy principle and active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 165.656,
    "end": 169.498,
    "text": "And then what are the consequences and what does that mean for the big picture?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 170.178,
    "end": 170.318,
    "text": "Luke?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 172.481,
    "end": 173.161,
    "text": " I'm Blue Knight.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 173.321,
    "end": 176.482,
    "text": "I'm an independent research consultant in New Mexico.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 176.502,
    "end": 195.749,
    "text": "And I really was excited to see this paper bring up some of the points that I've brought up as I've been reading more about active inference, specifically with respect to ergodicity and what that means, the potential implications for that, and also just other minor topics, but things I've mentioned in the past.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 197.139,
    "end": 206.329,
    "text": " It's cool sometimes to see how the threads of our previous discussions and things that a participant might have brought up, like, hey, this isn't making sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 206.489,
    "end": 208.651,
    "text": "And it's like, don't worry, it's not just you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 208.731,
    "end": 210.853,
    "text": "These are open research questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 211.073,
    "end": 214.277,
    "text": "And so we're seeing that and we'll be enacting it in the coming weeks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 217.463,
    "end": 241.689,
    "text": " some of the big questions in the paper kind of framed in non-technical or in not the author's words it's really asking what fundamental ideas from physics are utilized in the free energy principle and how are they utilized why are they utilized and then what are some implications or trade-offs associated with the use of these ideas either the ways that they have been used",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 242.429,
    "end": 265.149,
    "text": " are the pros and cons or what are the implications and what about the ways that they could be used so in the spirit of positive contributions to the literature how are we taking ideas from physics and other fields bringing it together in free energy principle and then what are the fundamental or just spuriously contemporary trade-offs",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 269.775,
    "end": 273.056,
    "text": " Let's first go to the aims and claims of the authors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 273.897,
    "end": 277.178,
    "text": "So I'll read it, and then Blue, you can give a thought.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 278.619,
    "end": 285.362,
    "text": "Well, the paper is the Non-Equilibrium Thermodynamics and Free Energy Principle in Biology on the PhilSci Archive at Pitt.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 285.642,
    "end": 288.103,
    "text": "So check out the paper and read it if you want to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 288.903,
    "end": 291.824,
    "text": "And a few of their aims and claims that we can extract out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 292.765,
    "end": 294.946,
    "text": "The free energy principle has received a lot of attention.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 295.686,
    "end": 301.27,
    "text": " but its foundations in statistical physics and dynamical systems theory have not been probed yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 302.231,
    "end": 315.26,
    "text": "This lack of attention is unfortunate because the theoretical adequacy of the free energy principle, as well as its practical utility for the study of key biological properties such as homeostasis and robustness, depend on the validity of those foundations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 315.9,
    "end": 317.581,
    "text": "Here we begin to fill this gap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 318.402,
    "end": 322.403,
    "text": " So that's kind of one of their contextualizing claims and their aim.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 323.283,
    "end": 334.585,
    "text": "And one of their arguments, a claim about their arguments is that as we are going to argue, the foundations in physics concepts allow models built from the free energy principle to achieve maximum generality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 335.125,
    "end": 346.347,
    "text": "But these assumptions also decrease the ability of these models to include enough factors to provide biologically plausible representations of the causal networks responsible for living systems dynamic equilibrium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 353.008,
    "end": 355.166,
    "text": " Any thoughts on the aims or we can continue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 358.806,
    "end": 386.965,
    "text": " i can't hear you i think that the aims are good sorry i just realized i was muted um i think that the these are good aims i think that uh one of the fundamental um claims is that in order to make the fep more generalized generalizable it's not as specific to biology as it could be i think that that was like the key trade-off maybe yes between specificity and utility and generalizability so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 388.254,
    "end": 397.944,
    "text": " One mindset is that as we generalize, we're gonna be explaining more systems, different systems, explaining them better, doing more, and it's just all up, up, up with generalization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 398.645,
    "end": 403.87,
    "text": "Another contrasting opinion is that as we generalize, we, out of necessity,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 405.151,
    "end": 427.89,
    "text": " abstract or average out over particulars and so we might actually lose utility or potentially and even disastrously lose the specifics of the system that we're talking about so all of a sudden we have this free floating generalization or abstraction that maybe initially was inspired by wanting to explain some sort of key biological property",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 428.57,
    "end": 440.416,
    "text": " like homeostasis and robustness in the author's view, but then we end up sort of throwing out the kernel or the essence of what we wanted to explain because we generalized too much.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 440.996,
    "end": 442.917,
    "text": "So we'll be exploring that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 445.438,
    "end": 447.119,
    "text": "Okay, do you want to read the abstract?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 448.04,
    "end": 448.24,
    "text": "Sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.272,
    "end": 460.369,
    "text": " According to the free energy principle, life is an inevitable and emergent property of any ergodic random dynamical system at non-equilibrium steady state that possesses a Markov blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 460.79,
    "end": 461.13,
    "text": "First in 2013.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 462.967,
    "end": 478.277,
    "text": " Formulating a principle for the life sciences in terms of concepts from statistical physics, such as random dynamical system, non-equilibrium steady state, and ergodicity, places substantial constraints on the theoretical and empirical study of biological systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.878,
    "end": 484.101,
    "text": "Thus far, however, the physics foundations of the free energy principle have received hardly any attention.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 484.661,
    "end": 492.367,
    "text": "Here, we start to fill this gap and analyze some of the challenges raised by applications of statistical physics for modeling biological targets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 493.107,
    "end": 507.894,
    "text": " Based on our analysis, we conclude that model building grounded in the free energy principle exacerbates a trade-off between generality and realism because of a fundamental mismatch between its physics assumptions and the properties of actual biological targets.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 509.775,
    "end": 510.075,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 510.715,
    "end": 512.516,
    "text": "And there's a lot to say.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 512.756,
    "end": 516.097,
    "text": "That's just the opening salvo from the authors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 517.038,
    "end": 519.979,
    "text": "How do they make good on this abstract?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 520.499,
    "end": 521.68,
    "text": "We can look at the roadmap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 523.104,
    "end": 547.753,
    "text": " there's not too many sections in this paper but there's a lot of meat within there's a general introduction and then a specific introduction to the free energy principle which is described in the context of self-organizing dissipative systems and then there's a little discussion on the explanatory scope of the fep and the introduction of the winged snowflake",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 548.633,
    "end": 565.421,
    "text": " thought experiment or idea which we'll return to soon section 3 talks about biological systems as random dynamical systems which isn't something that fep invented it's not something that actin invented this is a broader question about how to model biological systems and dynamical systems",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 566.815,
    "end": 588.97,
    "text": " Section four models biological active states as random dynamical attractors and talks about three big physics ideas that if we take section three, if we want to be modeling biological systems as dynamical systems, then we're using this physics ontology and what other key terms are relevant in physics for discussing random dynamical systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 589.51,
    "end": 590.451,
    "text": "And we will go through them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 591.231,
    "end": 593.373,
    "text": "They are the idea of phase spaces in biology,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 594.181,
    "end": 597.082,
    "text": " ergodicity, and random dynamical attractors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 597.562,
    "end": 599.983,
    "text": "There's then a discussion and a short conclusion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 600.343,
    "end": 602.783,
    "text": "So that's kind of the overall roadmap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 602.823,
    "end": 604.604,
    "text": "That's where we're going to go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 605.104,
    "end": 617.527,
    "text": "We're going to be exploring that trade-off or the implications of the introduction of physics fundamentals into the generalization of biological systems and maybe even non-living systems as well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 618.028,
    "end": 622.749,
    "text": "And just how's it all going to come together and how does it influence how we research going forward?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 624.813,
    "end": 635.46,
    "text": " The keywords are FEP, free energy principle, dynamic equilibrium, homeostasis, phase space, ergodicity, and attractor.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 636.22,
    "end": 638.421,
    "text": "And we can ask, where's active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 638.682,
    "end": 648.208,
    "text": "Not that it has to be a keyword for everything, but as we discuss, let's keep in mind, what are the differences between FEP and ACTIMF?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 648.988,
    "end": 653.611,
    "text": "And what are the implications of these claims about FEP for ACTIMF?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 656.687,
    "end": 659.457,
    "text": " All right, how about the first keyword, dynamic equilibrium?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 661.667,
    "end": 668.97,
    "text": " So interestingly, like you said that you like how this paper brings together physics and chemistry and biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 669.471,
    "end": 672.372,
    "text": "And I thought that chemistry was kind of blatantly omitted.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 673.392,
    "end": 674.793,
    "text": "And in my heart, I'm a chemist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 674.813,
    "end": 678.314,
    "text": "Like if I hadn't studied neuro, I would have really like gone into OCHEM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 678.334,
    "end": 683.617,
    "text": "I just thought that like working in the lab was a little scary, like too much ether and too like, whoa, when I came out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 685.217,
    "end": 688.879,
    "text": "So really, when I look up dynamic equilibrium, or the context that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 689.319,
    "end": 692.643,
    "text": " I'm familiar with dynamic equilibrium is in chemistry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 693.064,
    "end": 698.149,
    "text": "And so a dynamic equilibrium occurs when you have a reversible chemical reaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 698.67,
    "end": 701.854,
    "text": "So it's not that the reaction is over, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 701.874,
    "end": 708.221,
    "text": "Like here's an example of water ionizing into hydroxide and protons, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 709.002,
    "end": 709.322,
    "text": "And so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 711.149,
    "end": 719.054,
    "text": " it's not that when you have the equilibrium that the reaction is still occurring, it's just occurring at equal rates in the forward and reverse directions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 719.655,
    "end": 726.219,
    "text": "So this is dynamic equilibrium and it only happens in a reversible chemical reaction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 726.759,
    "end": 731.582,
    "text": "So there's no other way that I know of that dynamic equilibrium happens.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 732.082,
    "end": 737.566,
    "text": "It is an example of a system, particularly a chemical system at a steady state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.126,
    "end": 741.329,
    "text": " And so I looked through the paper, I don't know if you wanna flip to the next slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 741.349,
    "end": 748.035,
    "text": "I looked to the paper and I looked like, well, how are the authors using dynamic equilibrium?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 748.816,
    "end": 754.24,
    "text": "And I found this phrase, which I'll say here, the core of this account is a free energy principle",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 755.301,
    "end": 769.109,
    "text": " According to which, all biological systems actively maintain a dynamic equilibrium with their environment by minimizing their free energy, which enables them to avoid a rapid decay into an inert state of thermodynamic equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 769.689,
    "end": 775.773,
    "text": "And so then there's some citations, Friston and the Ramstad 2018 paper, and Parr and Friston in 2019.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 776.733,
    "end": 785.255,
    "text": " And so even I looked back through these papers and looked for dynamic equilibrium, and it's not there in the references that I was able to find.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 785.375,
    "end": 791.336,
    "text": "And so I was curious what the authors meant by dynamic equilibrium in a living system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 791.456,
    "end": 797.418,
    "text": "I mean, as far as I know, like maybe they meant dynamic coupling between the organism and the niche.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 798.778,
    "end": 805.662,
    "text": " Or maybe they mean the non-equilibrium steady state of homeostasis, which is not a dynamic equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 805.762,
    "end": 806.763,
    "text": "It's a non-equilibrium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 806.783,
    "end": 809.144,
    "text": "So I just found this phrasing kind of curious.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 810.265,
    "end": 813.887,
    "text": "And I'm assuming, just based on context, that they're referring to homeostasis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.927,
    "end": 819.03,
    "text": "But homeostasis includes plenty of irreversible reactions, irreversible chemical reactions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.09,
    "end": 822.172,
    "text": "And so that's kind of why this was a little bit confounding.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 824.147,
    "end": 824.748,
    "text": " It makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 824.988,
    "end": 833.935,
    "text": "Like if we think about instead of the water ionizing and the H plus and the OH minus coming back together and the overall values on both sides are staying the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 834.436,
    "end": 840.08,
    "text": "So let's think in the biological case, like moment to moment, our mass is staying the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 840.461,
    "end": 843.423,
    "text": "Let's just say, or some people might maintain the same mass for 30 years.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 844.744,
    "end": 854.475,
    "text": " But underlying that stability is actually many, many synthesis of fatty acids and the breakdown of fatty acids.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 854.875,
    "end": 859.06,
    "text": "And so it's like, okay, I get it that they're both going both sides at the same rate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 859.14,
    "end": 860.141,
    "text": "So there's a stable point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 861.018,
    "end": 867.442,
    "text": " but then also it's constituting its own irreversible thermodynamic reactions sometimes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 867.963,
    "end": 869.264,
    "text": "And so it's a good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 869.964,
    "end": 873.967,
    "text": "Do Friston at all use the term dynamic equilibrium?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 874.667,
    "end": 885.475,
    "text": "And are we talking about dynamic couplings, which might be at steady states, or are we talking about the non-equilibrium steady state of homeostasis?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 886.976,
    "end": 890.178,
    "text": "Okay, brings us to homeostasis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 893.092,
    "end": 901.999,
    "text": " Sure, so homeostasis is the steady state of internal physical and chemical conditions that are maintained by living systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 902.16,
    "end": 905.282,
    "text": "And there's a lot of variables that can be included in here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 905.743,
    "end": 907.824,
    "text": "Mass, I think, actually changes at night.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 908.665,
    "end": 915.331,
    "text": "The carbon that you exhale, you actually weigh less in the morning from sleeping all night and emitting carbon, I heard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.871,
    "end": 918.874,
    "text": "I don't know if that's really true, but I guess it depends on what scale you're measuring.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 920.134,
    "end": 924.757,
    "text": " But I think that pH has to be the same or within a pretty defined range.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 925.798,
    "end": 931.801,
    "text": "Osmolarity, sodium, potassium, and calcium ions, blood sugar, body temperature is a huge one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.683,
    "end": 943.869,
    "text": "And we do things throughout the day like eat and drink and use the restroom and put on jackets to help with our homeostatic conditions internally.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 944.838,
    "end": 950.141,
    "text": " Well, unless we're eating at night, we're losing water and some other molecules.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 950.181,
    "end": 951.962,
    "text": "So definitely we're lighter in the morning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 952.622,
    "end": 973.453,
    "text": "And then one discussion that we've had in a few different streams is when do we think of homeostasis as reducing uncertainty from a set point, like sort of a desired temperature, and then we want to just reduce our discrepancy versus when do we see allostasis or almost like anticipatory",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 974.588,
    "end": 996.466,
    "text": " processes by which biological systems actually take excursions qualified excursions from set points and how do we think about that within the broader history of cybernetics and it's been said that cybernetics had some challenges with dealing with post homeostasis so it's easy enough to see how a cybernetic system seeks",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 997.367,
    "end": 1019.513,
    "text": " a set point but then once you start thinking what is the process by which that set point is itself moved around all of a sudden that challenged a lot of historical cybernetics frameworks so that's definitely what we're exploring with actinf let's take another dip into a physics or a mathematical idea of a face base so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1020.529,
    "end": 1022.211,
    "text": " I'll read the yellow parts or you want to go for it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1023.312,
    "end": 1025.675,
    "text": "I'll read the yellow parts and then you give any description.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1025.896,
    "end": 1034.005,
    "text": "So in a phase space, every degree of freedom or parameter of the system is represented as an axis of a multidimensional space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1034.666,
    "end": 1038.371,
    "text": "So like every point on this spiral has two variables that describe it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1038.651,
    "end": 1040.413,
    "text": "It's like its value on the X and value on the Y.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1041.536,
    "end": 1054.712,
    "text": " And then the phase space trajectory represents the set of states compatible with starting from one particular initial condition located in the full phase space that represents the set of states compatible with starting from any initial condition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1056.761,
    "end": 1059.103,
    "text": " So just a quick comment or thought on that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1059.323,
    "end": 1081.62,
    "text": "So even just in the maintenance of homeostasis, like where your, you know, osmolarity is the same and your blood glucose is the same or just intercellular glucose or ATP levels, or, you know, if you just want to look at, at just maintaining homeostasis, not even including like the potential possible actions that I could take in like moving in a three-dimensional environment or anything like that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1082.12,
    "end": 1082.721,
    "text": "But, but it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1083.161,
    "end": 1091.588,
    "text": " it becomes very quickly an expansive multidimensional space, like something that we're not even like here we have like a 3D ish visualization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1091.649,
    "end": 1100.917,
    "text": "But, you know, in all these dimensions, it becomes very, very quickly computationally intractable because of the dimensionality of options that we're presented with.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1101.037,
    "end": 1105.12,
    "text": "And just even to maintain a homeostatic set point is is intense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1106.561,
    "end": 1106.722,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1109.312,
    "end": 1111.993,
    "text": " Phase spaces are just kind of the descriptive.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1112.033,
    "end": 1114.635,
    "text": "It's literally just the space that something can happen in.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1115.675,
    "end": 1118.577,
    "text": "And then there are trajectories through phase space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1118.617,
    "end": 1122.779,
    "text": "Well, there's points, which just are static values like three comma four.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1123.259,
    "end": 1127.221,
    "text": "And then there are trajectories, which are like linkages amongst sets of points.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1127.962,
    "end": 1132.444,
    "text": "And then also out there in phase space are attractors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1133.499,
    "end": 1144.487,
    "text": " So in the field of dynamical systems, an attractor is a set of states in the phase space towards which a system tends to evolve for a wide variety of starting conditions of the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1145.608,
    "end": 1150.812,
    "text": "System values close enough to the attractor values remain close even if slightly disturbed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1151.272,
    "end": 1175.748,
    "text": " so a kind of mental model there is like a rubber sheet and someone pulls the middle down a little bit that is now an attractor because things are from near or far are attracted towards it and then if they're at the bottom of that well they're going to resist being moved away from it and so that's sort of a simple ball rolling into a bowl attractor state and",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1176.468,
    "end": 1188.494,
    "text": " There's simple equations that govern that type of movement, but in higher dimensional phase spaces, there are different geometries of attractors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1189.214,
    "end": 1196.338,
    "text": "And then also for biological systems, it is a challenge to model using attractors, but that's what this paper is really about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1196.638,
    "end": 1202.081,
    "text": "Can we use that model of an attractor to talk about biological systems and how they regulate?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1207.374,
    "end": 1208.575,
    "text": " I just pulled this image out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1208.655,
    "end": 1217.241,
    "text": "Actually, I think it was brought up in the paper, and I don't remember if the original author who outlined these four types of attractor, if that was Kaufman.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1217.281,
    "end": 1228.629,
    "text": "I feel like it was Kaufman, but it was cited in this paper as well about the four different kinds of attractors, and so that's what's shown here is the strange attractor, the point attractor, the cycle, and the torus.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1229.589,
    "end": 1236.473,
    "text": " So just in case you were wondering what those kind of attractors looks like, it's drawn to points in this kind of way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1238.634,
    "end": 1246.178,
    "text": "It is also on another phase space of attractors with its own X and Y axis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1246.798,
    "end": 1248.459,
    "text": "Okay, ergodicity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1249.486,
    "end": 1274.877,
    "text": " this is a quote from the paper then blue any thoughts would be cool the ergodic density is an invariant probability measure that can be interpreted as the probability of finding the target system m in any state x when observed at a random point in time first in 2012. the assumption of ergodicity is important to get the fep off the ground since it ensures that organisms can be modeled as having invariant characteristics over time",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1277.202,
    "end": 1280.665,
    "text": " So just to kind of relate ergodicity to the phase space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1281.466,
    "end": 1293.295,
    "text": "So the concept of ergodicity is in a potential phase space that all of the potential points in that space are visited at one point or another, like that is ergodicity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1293.355,
    "end": 1296.678,
    "text": "And then the probability that you can find a, uh, uh,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1298.991,
    "end": 1306.84,
    "text": " the system in that space or at that point in space corresponds to how much time the system spends at that point in that space, if that makes sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1307.24,
    "end": 1308.722,
    "text": "It's kind of a circular loop, but.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1310.017,
    "end": 1311.217,
    "text": " This is just one slide.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1311.237,
    "end": 1317.779,
    "text": "We're gonna return to ergodicity later on, but this is a topic that Blue and I like learning about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1318.499,
    "end": 1331.342,
    "text": "However, if you know more about this, it would be great to have your perspective as well as if you're also just learning it and have questions to bring, because there's a lot you could learn about ergodicity and the ergodic hierarchy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1331.402,
    "end": 1335.163,
    "text": "So take a dive and then let us know how the water is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1336.485,
    "end": 1338.206,
    "text": " Also getting FEP off the ground.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1338.287,
    "end": 1340.108,
    "text": "I'm thinking, does FEP start on the ground?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1340.228,
    "end": 1341.329,
    "text": "Does it start underground?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1341.649,
    "end": 1343.471,
    "text": "Does it start- Is it a snowflake with wings?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1344.801,
    "end": 1346.142,
    "text": " Has it always been that way?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1346.503,
    "end": 1348.164,
    "text": "So, no, exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1348.445,
    "end": 1349.526,
    "text": "It's like the water cycle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1349.986,
    "end": 1350.166,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1350.647,
    "end": 1356.572,
    "text": "So, on to the FEP, which is, of course, the target, the system of interest of this paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1357.133,
    "end": 1363.199,
    "text": "And in Act-Inf Livestream 14 and before then and after then, we've had a lot of discussions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1363.299,
    "end": 1364.36,
    "text": "What is the FEP?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1364.8,
    "end": 1366.222,
    "text": "How does it relate to active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1366.502,
    "end": 1366.602,
    "text": "And...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1367.563,
    "end": 1370.784,
    "text": " It seems like we'll be working on those questions for a long, long time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1371.204,
    "end": 1383.208,
    "text": "But a few pieces that we've pulled out as kind of being good sort of cues to bring up alongside free energy principle and just see them as like cousins or in a network together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1383.988,
    "end": 1392.251,
    "text": "Multiscale systems, ensembles, like the collective behavior of multiple particles or other system subunits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1393.823,
    "end": 1402.074,
    "text": " the nexus of information and thermodynamics, which is really like information, thermo, like heat and dynamics, dynamical systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1402.174,
    "end": 1406.9,
    "text": "So often thermo and dynamics aren't really separated, but we're getting at that delineation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1407.761,
    "end": 1408.021,
    "text": "And then,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1409.736,
    "end": 1413.037,
    "text": " action policy selection as variational Bayesian inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1413.338,
    "end": 1428.104,
    "text": "So using information dynamics to study how policies are selected, and then there's sort of FEP as it is today, and then there's where could we go and develop with this framework, which is what we'll be exploring today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1429.224,
    "end": 1431.105,
    "text": "Any general comments before we get into the paper?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1433.238,
    "end": 1437.662,
    "text": " Only that, you know, you we haven't thermodynamics has classically been one word.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1437.702,
    "end": 1444.388,
    "text": "So like, I'm starting to just use infodynamics as one word just to be like non discriminatory, you know, or just dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1444.489,
    "end": 1446.17,
    "text": "It's like, it's all information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1446.19,
    "end": 1446.931,
    "text": "It's all thermo.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1446.951,
    "end": 1448.332,
    "text": "So yes, exactly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1448.993,
    "end": 1450.895,
    "text": "Okay, here we go to the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1452.697,
    "end": 1454.699,
    "text": "This is the first paragraph of the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1454.999,
    "end": 1456.02,
    "text": "And it's very informative.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1457.492,
    "end": 1460.374,
    "text": " Life scientists use the term equilibrium in various ways.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1460.955,
    "end": 1464.758,
    "text": "And so we're gonna look at three different definitions of equilibrium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1465.558,
    "end": 1474.646,
    "text": "And this is one reason why it's important to have ontologies and have ways of using terms that we can, if not distinguish, at least be clear about in their use.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1474.846,
    "end": 1477.088,
    "text": "So sometimes life scientists,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1478.487,
    "end": 1488.033,
    "text": " Use equilibrium to refer to an inert state of death where the flow of matter and energy through a biological system stops and the system reaches a lifeless state of thermodynamic equilibrium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1488.854,
    "end": 1490.635,
    "text": "That's sort of the ultimate equilibrium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1491.376,
    "end": 1500.742,
    "text": "Then there's more often they use it to mean homeostasis, which is the ability of keeping some variable in a system constant or within a specific range of values.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1501.442,
    "end": 1505.245,
    "text": "Going back to these old citations for where the term actually arises from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1506.414,
    "end": 1520.815,
    "text": " so that's sort of a living system so there's parts of it that are consuming energy hence not at the ultimate equilibrium but there's also other elements of it at least over certain time scales that are invariant some other times",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1522.403,
    "end": 1537.654,
    "text": " The term equilibrium is associated with the concept of robustness, which refers to the capacity of systems to dynamically preserve their characteristic structural and functional stability amid perturbations due to environmental change, internal noise, or genetic variation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1538.314,
    "end": 1555.623,
    "text": " So it's sort of like a low bar, a medium bar and a high bar of equilibrium ranging from just, yeah, the molecules are not doing any motion and there's a carcass on the ground to the molecules are churning and there's something invariant about the living system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1556.764,
    "end": 1570.58,
    "text": " going up into even the idea of robustness, which is that the system is doing something to maintain its sort of equilibrium, like its balance amidst noise, which is maybe seen as a type of homeostasis, but not exactly the same.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1570.78,
    "end": 1577.308,
    "text": "So any thoughts on why these distinctions are mattering or why start the paper this way?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1578.206,
    "end": 1584.892,
    "text": " You know, I'm curious, Daniel, like I, I mean, we've been in the life sciences for 20 some years, more maybe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1586.093,
    "end": 1592.138,
    "text": "And I have only used equilibrium in terms of life sciences in the first way to like as death.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.859,
    "end": 1601.186,
    "text": "So I'm just curious, and perhaps this is the inner chemist in me, but are you familiar with all of these uses of equilibrium in the life sciences also?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1601.446,
    "end": 1601.586,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1603.456,
    "end": 1605.657,
    "text": " I think I've seen the second one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1605.717,
    "end": 1608.758,
    "text": "People might not call it equilibrium, but like a buffer equilibrium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1609.118,
    "end": 1615.28,
    "text": "Well, the carbonate and the CO2 in your blood, and it's maintaining a buffered, a pH equilibrium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1616.36,
    "end": 1617.78,
    "text": "So that's not death.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1618.02,
    "end": 1629.224,
    "text": "It's a living system that's doing it, but it's referring to some chemical process that's being kept at a dynamic equilibrium within the scaffold that a living biological system is providing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1630.453,
    "end": 1641.038,
    "text": " And I'd also be curious, I don't think we dove into it, this Kitano 2004, like homeostasis to keep something within a range of values, it sounds a lot like robustness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1641.258,
    "end": 1645.42,
    "text": "So how are the second and the third definitions different?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1645.92,
    "end": 1657.806,
    "text": "Because like anti-fragility is something different where perturbations actually strengthen the system or cause it to develop, for example, but robustness is a little bit more like homeostasis, but open to anyone's thoughts, we'll see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1659.485,
    "end": 1662.306,
    "text": " Now, on to Friston et al.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1663.267,
    "end": 1682.856,
    "text": "So, over the past 20 years, giving us some historical context, since the new millennium, theoretical neuroscientist Carl Friston and collaborators have developed an account of the conditions of possibility of a certain kind of dynamic equilibrium between a biological system and its environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1683.735,
    "end": 1702.129,
    "text": " The core of this account is a free energy principle, according to which all biological systems actively maintain a dynamic equilibrium with their environment by minimizing their free energy through inference and action, which enables them to avoid a rapid decay into an inert state of thermodynamic equilibrium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1703.01,
    "end": 1705.872,
    "text": "So here's a few of the citations, 2012, 13, Ramstad et al., 2018, Parr and Frist in 2019.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1705.912,
    "end": 1707.253,
    "text": "So here are the PAPEs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1712.093,
    "end": 1714.435,
    "text": " People want to dive into the references.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1714.475,
    "end": 1716.397,
    "text": "Those are always really good places to start.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1717.097,
    "end": 1732.59,
    "text": "But whether you take the authors at their manifold, dimensionally reduced word, or you go into these original papers, or you send a tweet to an author, or you come in a live stream and talk to them, what are the key claims of the FEP?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1733.291,
    "end": 1737.615,
    "text": "From a rhetoric perspective, what does the FEP assume and what does it claim?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1738.772,
    "end": 1741.855,
    "text": " Which papers are key to FEP?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1742.476,
    "end": 1747.482,
    "text": "Not what was important in 2005 from 2002, but today, what is important?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1747.842,
    "end": 1754.429,
    "text": "So how do we respect that different citations from the past might have a partial picture or use a different formalism?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1755.35,
    "end": 1759.555,
    "text": " And then which papers are contradictory, even if only temporary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1759.996,
    "end": 1768.206,
    "text": "So somebody might make a claim in a 2010 paper, you can't explain situation X. And then like, you know, two weeks later, first in it all, write the response.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1768.846,
    "end": 1772.811,
    "text": "And then some people have, they bought the rumor, but they haven't heard the news.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1773.752,
    "end": 1791.174,
    "text": " So how do you keep a coherent narrative of the literature as there are errors, contradictions, disconcordances, all kinds of things that just make it less easy than it could be to understand what is happening with FEP, its proponents, and its detractors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1794.709,
    "end": 1804.702,
    "text": " So just a thought on this and something that I was thinking about as I was reading the paper, and a lot of this is footnoted throughout the paper, but the FPP has evolved over the last 20 years.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1804.762,
    "end": 1808.146,
    "text": "So it didn't start off in the state that it is now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1808.407,
    "end": 1810.87,
    "text": "It didn't start off like a completely elaborated...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1812.031,
    "end": 1819.293,
    "text": " And so it would be really cool to develop a timeline of the FEP, like first concept, you know, 2006 or whatever.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1819.373,
    "end": 1823.994,
    "text": "And then at what point in time did like the Markov blanket come into play?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1824.074,
    "end": 1827.234,
    "text": "And then when did active inference separate from the FEP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1827.354,
    "end": 1834.216,
    "text": "And to kind of get like a good idea of the situation as it's gone through its several iterations now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1835.885,
    "end": 1837.046,
    "text": " Great idea, Blue.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1837.586,
    "end": 1860.639,
    "text": "I'd hope that in Act-Inf Lab and other groups, we can collaborate to really make that happen because to have the timeline of developments and cross-link that with the core terms, which we'll talk about later today, and then also just who was involved and what were the contributions, it would just make it tremendously easier instead of just going back to square one",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1860.999,
    "end": 1889.587,
    "text": " sort of a scholar search just when we're curious about hey has there been something written about free energy and x okay so that was sort of the neutral context or at least not so uh barbarous but here's where the authors uh bring in the the gap the free energy differential in the literature and their contribution what actions are they going to take to reduce the differential the free energy principle has received a lot of attention",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1890.501,
    "end": 1915.386,
    "text": " no citations from whom a lot relative to what it's not I'm not saying it's incorrect in the paper just it would be awesome to learn what does it look like to have a lot of attention what does a Google Trends or a book engram viewer search result in are we on the up or are we going down from some period of time so what attention what regime of attention has the FEP received and from whom",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1916.707,
    "end": 1940.581,
    "text": " but the foundations of fep in statistical physics and dynamical systems theory have not been probed yet that's a claim maybe some people will think that they have so we'll look forward to learning about that this lack of attention is unfortunate because two reasons one the theoretical adequacy of the fep and two its practical utility for the study of biological properties",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1941.604,
    "end": 1943.204,
    "text": " depend on the validity of the foundations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1943.724,
    "end": 1946.325,
    "text": "So it's like, we want the house to be beautiful and useful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1947.125,
    "end": 1951.166,
    "text": "And if the foundations are not strong, it will not be beautiful and or useful.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1951.966,
    "end": 1957.447,
    "text": "So this work of the paper, as well as all the work around it is related to that gap.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1958.227,
    "end": 1962.828,
    "text": "So a few big questions like, what does it mean for a principal FEP?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1963.629,
    "end": 1965.269,
    "text": "And we can, of course,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1966.491,
    "end": 1970.672,
    "text": " have some subtlety with like what's a principle, a framework, a theory, a hypothesis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1970.912,
    "end": 1973.193,
    "text": "So let's just kind of roll with it together.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1973.693,
    "end": 1979.195,
    "text": "What does it mean for a scientific principle to have foundations in statistical physics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1979.415,
    "end": 1981.835,
    "text": "What does it mean for it to be grounded in dynamical systems?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1983.056,
    "end": 1983.756,
    "text": "Why does that matter?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1984.456,
    "end": 1990.278,
    "text": "Why does it matter how it's grounded or who thinks it's grounded in what for the FEP and in general?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1991.175,
    "end": 1995.736,
    "text": " And then always trying to connect the generalities with the minute particulars.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1996.276,
    "end": 1998.256,
    "text": "What does this paper actually do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1999.156,
    "end": 2001.337,
    "text": "And then what work is still needed?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2001.897,
    "end": 2010.138,
    "text": "Because it's easy to get caught up in some of these big sweeping, multi-decade, many person research trajectories.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2010.758,
    "end": 2014.139,
    "text": "And it's helpful sometimes to just separate out what is the paper doing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2014.599,
    "end": 2019.88,
    "text": "And then what is the bigger picture, like the grand synthesis that has to be done between FEP and some other field?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2022.22,
    "end": 2022.589,
    "text": " Anything here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2026.254,
    "end": 2055.434,
    "text": " here's from a footnote and it's um to forestall any confusion okay great all my confusions are about to be forestalled i love footnotes like that our focus is on free energy theorists not principalists by the way theorists assumptions that all biological systems at any scale can be modeled within the framework of ergodic random dynamical systems and that homeostasis and or robustness can be defined and studied in terms of dynamical attractors",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2056.335,
    "end": 2062.021,
    "text": " So I don't know if that's an assumption of all FEP colleagues.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2062.582,
    "end": 2066.367,
    "text": "I don't know if it's rather than an assumption, but rather a consequence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2066.907,
    "end": 2075.337,
    "text": "Like there are assumptions that people use, but then actually they have come to this claim as a consequence, not as an assumption or an ungrounded axiom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2076.519,
    "end": 2089.111,
    "text": " And while our discussion should suggest that concepts and mathematical representations from statistical physics and dynamical systems theory are sometimes abused in biology, it should not suggest that those concepts and representations have no use.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2089.932,
    "end": 2095.957,
    "text": "So it's saying, in fact, you can have good explanatory predictive models that involve dynamical systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2095.997,
    "end": 2099.0,
    "text": "So it's not saying math and biology is hopeless.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2099.921,
    "end": 2107.788,
    "text": " And then also this 2004 paper thought, who do you cite for saying that, you know, math gets abused in biology?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2108.068,
    "end": 2112.492,
    "text": "So this is Robert May, a famous biologist in 2004.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2113.573,
    "end": 2118.397,
    "text": "And this was just very interesting, like understanding the nonlinear dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2118.477,
    "end": 2122.0,
    "text": "And this was in the case of a virus and health situation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2123.223,
    "end": 2125.284,
    "text": " just extracting some of the key memes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2125.684,
    "end": 2127.805,
    "text": "It's like, we're gonna have to learn across systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2128.406,
    "end": 2130.847,
    "text": "We're not just gonna be able to have one default system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2132.248,
    "end": 2139.312,
    "text": "We need to think about multi-scale systems for applying and educating in transdisciplinary contexts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2139.832,
    "end": 2147.556,
    "text": "Like having an understanding of viral dynamics is gonna require population and ecological understanding as well as protein.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2148.457,
    "end": 2148.677,
    "text": "And then,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2149.591,
    "end": 2154.433,
    "text": " I venture to predict that the corresponding immunology texts will indeed look different in 20 or even 10 years time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2154.813,
    "end": 2165.837,
    "text": "Okay, well, we're right between 10 and 20 and maybe immunologists are starting to go, oh yeah, you can't just talk about what's the white blood cell touching the pathogen.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2166.617,
    "end": 2168.138,
    "text": "There's a bigger picture, there's a society.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2168.898,
    "end": 2170.379,
    "text": "And then what are those abuses?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2171.499,
    "end": 2185.587,
    "text": " And they're not always easy to recognize, especially because few have the expertise or the confidence or the personal narrative that they're able to ask questions across disciplinary contexts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2186.028,
    "end": 2188.469,
    "text": "So it's easy sometimes for something to be transdisciplinary.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2188.809,
    "end": 2193.032,
    "text": "And then like the biologists don't question the physics and the physics don't question the biology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2194.42,
    "end": 2196.421,
    "text": " all of a sudden something is not really getting questioned.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2196.481,
    "end": 2197.842,
    "text": "So it's totally a great point.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2198.502,
    "end": 2212.59,
    "text": "And this is a really important kind of fallacy, essentially, where a mathematical model is constructed with an excruciating abundance of detail in some aspects, while other facets of the problem are misty or vital parameters uncertain within a massive range.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2213.69,
    "end": 2241.751,
    "text": " and this happens just so many places it's unreal we made a mathematical model of this oh well you know of course we didn't consider other factor abc so it's not that everything has to be a theory of everything but we have to recognize that extremely partial mathematical models in biological systems may be less helpful than people claim them to be and it might be better if people pooled their efforts and work towards better models any thoughts on that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2243.683,
    "end": 2252.689,
    "text": " Just, you know, I mean, I think I'm definitely guilty of, like I remember back to Mike Levin's live stream when we were abusing physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2254.611,
    "end": 2256.312,
    "text": "So guilty as charged sometimes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2257.753,
    "end": 2263.157,
    "text": "But it is important to, you know, have an open dialogue and to ask questions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.337,
    "end": 2269.421,
    "text": "Like if there's a concept or something that you don't perhaps understand, maybe like you feel like you're a beginner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2269.462,
    "end": 2270.762,
    "text": "I mean, I've definitely felt this way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2270.802,
    "end": 2272.404,
    "text": "Like maybe I'm just being dumb, but...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2273.124,
    "end": 2297.165,
    "text": " know and then there's actually a very valid question at the end of that sentence so if uh you don't understand something be sure to ask until you do i think yep imagine just all the times somebody has said oh fep does that apply to living systems and so yeah it's a done deal well you know it's not a done deal so the conversation is still happening here we get to section two introduce introducing the fep",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2298.254,
    "end": 2305.44,
    "text": " The free energy principle, FEP, says that unless a biological system minimizes its surprise, it will rapidly die.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2306.56,
    "end": 2308.642,
    "text": "Now, what do those citations say?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2309.563,
    "end": 2313.626,
    "text": "Do they talk about system death or do they talk about system persistence?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2314.847,
    "end": 2327.697,
    "text": "More specifically, FEP presupposes a view of biological systems as essentially persisters, different authors here, and foregrounds the conditions of possibility for the persistence of biological systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2328.945,
    "end": 2332.427,
    "text": " So that's their top level take on FEP.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2333.427,
    "end": 2341.491,
    "text": "And then to connect a few of the keywords in Howie 2020 refers to a system's periodic phase attractive dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2341.711,
    "end": 2349.175,
    "text": "So attractors in the phase space that have periodicity in the state space to define what it is for a biological system to exist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2350.155,
    "end": 2357.419,
    "text": "Howie writes biological in existence is marked by a tendency to disperse throughout all possible states in state space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2358.843,
    "end": 2359.103,
    "text": " e.g.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2359.223,
    "end": 2364.488,
    "text": "a system ceases to exist as it decomposes, decays, dissolves, dissipates, or alliteratively dies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2365.269,
    "end": 2370.013,
    "text": "In contrast, to exist is to revisit the same states or their close neighborhoods.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2370.905,
    "end": 2384.189,
    "text": " So this is kind of bringing together what is life, Schrodinger's question, Ram said it all, 2018, with dissipative systems and systems that resist dissipation, systems that have a dynamic equilibrium.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2384.569,
    "end": 2386.27,
    "text": "What is the phase space we're talking about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2386.93,
    "end": 2389.531,
    "text": "These are the big questions we're getting at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2390.971,
    "end": 2393.352,
    "text": "And how does one disperse oneself exactly?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2395.031,
    "end": 2395.352,
    "text": " Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2395.372,
    "end": 2400.524,
    "text": "And how, I think we heard that from somebody earlier today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2400.544,
    "end": 2403.512,
    "text": "Somebody was getting dispersed during a practice talk.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2403.672,
    "end": 2404.033,
    "text": "It happens.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2405.536,
    "end": 2425.656,
    "text": " and where's surprise come into play not just the psychological like wow I was surprised it was a surprise birthday party but how do we go from attractors and dynamical systems to this statistical Bayesian concept of surprise and attracting sets and lower dimensional manifolds in attracting sets",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2426.452,
    "end": 2428.313,
    "text": " Make that quote big one more time for me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2429.133,
    "end": 2441.197,
    "text": "So something I thought was just unique or maybe remarkable was it says, free energy theorists relate the notion of entropy to the information theoretic quantity of surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.557,
    "end": 2443.858,
    "text": "But I think that this is done before",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2444.178,
    "end": 2445.82,
    "text": " the free energy principle arrived.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.161,
    "end": 2453.271,
    "text": "So in information theory, that's Claude Shannon makes the relationship between information and entropy and surprise.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2453.752,
    "end": 2457.437,
    "text": "So I don't think that that's something that the FEP started doing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.206,
    "end": 2482.363,
    "text": " well two themes we'll return to today and again and again which is like first this shouldn't be a pape versus pape battle this isn't a battle royale for whose hot take will reign supreme we should be collaborating on bigger research agendas and so clarifying the contributions that different people have made will help demystify and make active inference and fep more accessible because",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2483.163,
    "end": 2505.462,
    "text": " which claims or which contributions were made like a hundred years ago not that that makes it more valid but weren't made recently but sometimes when we only see recent citations it can be easy to get swept up but actually the authors of this paper do a good job of going back to some original citations but these are big eternal questions here's a fun paragraph in the paper",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2506.863,
    "end": 2517.326,
    "text": " Because it's sort of like, I reformatted it slightly because it shows that we're in synchronous and asynchronous discussion with Fristin et al.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2518.086,
    "end": 2522.768,
    "text": "So here is like, you know, him thinking slash saying, Fristin saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2524.025,
    "end": 2528.067,
    "text": " By finding, this is Friston's claim, pseudo Friston claim, not actually his quote.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2528.727,
    "end": 2549.697,
    "text": "By finding a suitable attractor in the dynamic model, life scientists would be able to gain understandings of the workings of dot, dot, dot, dot, dot, basically like this is the dream of active inference, that if we had attractor, phase bays, all these terms coming together, then we could just make it work for diverse biological systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2550.758,
    "end": 2550.998,
    "text": "And then...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2552.145,
    "end": 2553.466,
    "text": " the authors of the paper, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2554.047,
    "end": 2562.594,
    "text": "To better understand what this means, let's examine how such idealized models are developed and why free energy theorists opt to build their models starting from concepts in physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2563.355,
    "end": 2568.619,
    "text": "So this is like the dream of active inference and physical groundings for biological systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2569.46,
    "end": 2588.434,
    "text": " And then the authors do the right thing, which is to steal person the argument, to investigate what its actual strengths are and why somebody would want to make that argument or why this is something that we're motivated to pursue instead of just immediately critiquing it as like not an important thing to want.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2589.435,
    "end": 2589.615,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2592.25,
    "end": 2596.774,
    "text": " All right, so here is in the red quote from the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2597.655,
    "end": 2598.696,
    "text": "So Friston et al, 2006.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2601.124,
    "end": 2603.125,
    "text": " Way long ago, way, way long ago.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2603.785,
    "end": 2606.186,
    "text": "Ask us to imagine- Were you even born yet?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2606.526,
    "end": 2607.466,
    "text": "Were you even born yet?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2607.786,
    "end": 2608.367,
    "text": "Oh, please, Lou.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2608.727,
    "end": 2609.647,
    "text": "Oh, please.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2611.268,
    "end": 2614.029,
    "text": "Ask us to imagine a snowflake endowed with wings.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2614.789,
    "end": 2625.913,
    "text": "This winged snowflake could move, use its wings as solar reflectors or fans, and exchange energy with the environment for a much longer period than we would expect of an inanimate piece of ice to keep going under identical circumstance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2626.793,
    "end": 2651.263,
    "text": " unlike familiar snowflakes the winged snowflake can choose actions which are the means of by which different outcomes are brought about in different states of the environment its wings allow the snowflake to bring about outcomes such as lowering its core temperature in response to an increase in air temperature so let's go to first in 2006 and this is figure one so we're imagining they're sort of on the left is like a traditional snowflake model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2652.381,
    "end": 2654.721,
    "text": " There's sort of, it doesn't have any action affordances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2655.001,
    "end": 2660.543,
    "text": "So it's just being tossed around in the soup and it freezes when it's cold.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2661.143,
    "end": 2668.384,
    "text": "And then when the temperature gets below this critical phase boundary, it melts and the system fails to persist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2669.044,
    "end": 2674.885,
    "text": "So it's like, you know, checkpoint, are we good with systems persisting versus dissipating?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2675.285,
    "end": 2678.106,
    "text": "This is kind of our simple physical example.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2678.766,
    "end": 2696.877,
    "text": " a piece of ice freezing in the sky and melting all right now let's imagine if the ice froze in a way where it had wings and slightly different colored wings i wondered what the symbolism was here but it has these two different wings",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2697.657,
    "end": 2701.66,
    "text": " and that allows it to engage in action on the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2702.24,
    "end": 2714.988,
    "text": "So for example, if it detects or it predicts or acts as if it's predicting that it's going to head towards a warmer area, that's like lower down or something, all of a sudden it can flap a few times and get into a colder area.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2715.429,
    "end": 2720.292,
    "text": "So here, this snowflake just falls, but this one is able to flap and stay cold.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2721.032,
    "end": 2724.975,
    "text": "And so through action, it's able to persist longer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2725.99,
    "end": 2728.642,
    "text": " So it's precluding a phase transition",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2729.824,
    "end": 2737.651,
    "text": " from solid to liquid through this active exchange with the environment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2737.891,
    "end": 2740.333,
    "text": "So that's like the winged snowflake model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2741.194,
    "end": 2756.967,
    "text": "That's kind of a nice thought experiment from Yonder to help us understand like the steps from mere physical system to systems that start to engage in actions on the environment, especially those that keep persistence of the system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2757.587,
    "end": 2757.988,
    "text": "Anything here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2759.747,
    "end": 2764.391,
    "text": " Okay, here's figure three from that same Friston 2006 paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2765.172,
    "end": 2774.86,
    "text": "And this is really an awesome figure because it shows some concordances between act-dymph, even though it's not even really used in those terms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2774.9,
    "end": 2776.121,
    "text": "So that's why we need the timeline.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2776.401,
    "end": 2778.743,
    "text": "Like is act-dymph even mentioned in this paper in 2006?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2779.104,
    "end": 2786.19,
    "text": "It might not be actually, but we can see there's this perception action cycle, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2786.835,
    "end": 2810.015,
    "text": " and this is related to a few other kinds of action perception cycles footnote paper incoming we can think of this as like a bowl and then the ball is rolling to the bottom of the bowl it's a image we return to again and again now the y-axis is the free energy and so here's the minimum possible free energy and it's like the system starts here there's a change in the environment",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2811.158,
    "end": 2834.521,
    "text": " that causes a mismatch that mismatch can be reduced through two different types of updates of a model one is an action and the other is a perception so which order happens details details details but the idea is like at each loop there's an environmental change which is then renormalized or returned to something",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2835.402,
    "end": 2847.832,
    "text": " through perception and action, which relates to an active inference, how we say that the two ways that free energy can be minimized are through updates of the generative model, like learning or parameter updating, or through action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2848.192,
    "end": 2849.553,
    "text": "How do we reduce surprise?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2850.174,
    "end": 2851.194,
    "text": "Inference and action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2851.795,
    "end": 2852.736,
    "text": "Why reduce surprise?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2853.276,
    "end": 2859.521,
    "text": "Because if we have an optimistic generative model, we don't want to be surprised about our model where we're living.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2860.141,
    "end": 2863.144,
    "text": "So we act and we infer so that we persist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2864.696,
    "end": 2865.277,
    "text": " Any comments here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2867.859,
    "end": 2870.381,
    "text": "But it's just a cool, like input could be the state of chemoreceptors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2870.421,
    "end": 2878.307,
    "text": "You know, already we're going from these sort of physics formalisms and dynamical systems formalisms towards just, oh yeah, you know, drop it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2878.327,
    "end": 2882.49,
    "text": "It could be like chemical and biological, but was it justified in 2006?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2883.611,
    "end": 2887.434,
    "text": "Well, looking back on it, not as much as it is justified today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2888.194,
    "end": 2891.197,
    "text": "And what will they say in 2033, looking back on this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2891.617,
    "end": 2893.559,
    "text": "So all work in progress.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2896.261,
    "end": 2922.981,
    "text": " okay so this is from page six of the paper and won't uh read the full quote because we've kind of gotten at this trade-off between utility and accuracy and generalizability but the big questions here are what systems is the fep modeling or describing where has it been used where could it be used where shouldn't it be used or can't it be used",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2924.229,
    "end": 2928.593,
    "text": " How good is the FEP for modeling or describing these different systems?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2929.394,
    "end": 2930.595,
    "text": "How good could it be?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2931.176,
    "end": 2932.717,
    "text": "And what would it take to get it there?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2933.358,
    "end": 2939.904,
    "text": "And then also an important question for those of you who are FEP or ACT-IMP fans, and you have a challenging conversation,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2940.902,
    "end": 2948.644,
    "text": " take a step back and ask your colleague, what models do you prefer with similar or different explanatory scope?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2949.104,
    "end": 2950.304,
    "text": "Just what else is out there?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2950.744,
    "end": 2957.206,
    "text": "Because it really helps ground the discussion in what that person's understanding or preferences are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2958.026,
    "end": 2960.287,
    "text": "And a lot of times people will come up blank.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2960.847,
    "end": 2964.468,
    "text": "They'll say, I'm critiquing your unified model of perception, cognition, action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2964.488,
    "end": 2965.668,
    "text": "Okay, great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2965.828,
    "end": 2966.348,
    "text": "Critique away.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2966.408,
    "end": 2967.229,
    "text": "That's what I'm doing too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2967.749,
    "end": 2968.289,
    "text": "What do you prefer?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2968.309,
    "end": 2968.349,
    "text": "Oh,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2969.605,
    "end": 2969.865,
    "text": " Nothing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2970.466,
    "end": 2976.835,
    "text": "So it helps us stay positive with the contributions that we're making to this field while also recognizing the discrepancy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2977.636,
    "end": 2982.803,
    "text": "And that combination of recognizing discrepancy and taking action is active inference.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2984.704,
    "end": 2985.644,
    "text": " You know, this is funny.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2985.684,
    "end": 2990.286,
    "text": "This is a good contrast to the Sims paper that we just did.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2990.306,
    "end": 2996.367,
    "text": "And I feel like at the end of the last live stream, we were just talking about thermodynamics and information theory and the relationship between those two things.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2997.628,
    "end": 3003.529,
    "text": "But I always want to take the FEP and use it for non-biological systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.589,
    "end": 3008.191,
    "text": "I think I veer toward panpsychism more than most people.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3010.231,
    "end": 3011.952,
    "text": "I have a hard time with the line between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3012.653,
    "end": 3019.248,
    "text": " Mere active inference and adaptive active inference or like the evolutionary late evolutionary commerce late whatever and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3020.124,
    "end": 3028.09,
    "text": " Like the, you know, brain is the ultimate source of cognition and capable, capable organ, capable cognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3028.51,
    "end": 3033.333,
    "text": "And so like, would the FEP apply to a set of molecules in a beaker?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3033.994,
    "end": 3035.595,
    "text": "Like it doesn't have preferences.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3035.635,
    "end": 3039.357,
    "text": "Do the molecules prefer to be in an equilibrium state or how does that work out?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3039.397,
    "end": 3044.981,
    "text": "Like I want to take the FEP and use it in systems that maybe it's not designed for.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3045.021,
    "end": 3045.321,
    "text": "I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3045.822,
    "end": 3047.183,
    "text": "I tend to want to go the other way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3048.564,
    "end": 3048.964,
    "text": "Makes sense.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3051.573,
    "end": 3055.021,
    "text": " Here's that adaptive versus mirror active inference slide from 30.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3055.101,
    "end": 3056.965,
    "text": "Good segue, perfect segue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3057.507,
    "end": 3060.894,
    "text": "And so here's a question from FEP Landia.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3062.458,
    "end": 3065.419,
    "text": " What makes biological cognition special or different?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3066.14,
    "end": 3069.421,
    "text": "So we're not gonna go too much into it here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3069.861,
    "end": 3075.624,
    "text": "We talked about it in live stream number 30 a ton, and it was just super interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3075.704,
    "end": 3078.525,
    "text": "To what extent does it matter that it can engage in counterfactuals?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3079.025,
    "end": 3080.926,
    "text": "Does the temporal depth matter?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3081.486,
    "end": 3084.608,
    "text": "But if we're on the outside, how do we know what the temporal depth is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3085.068,
    "end": 3090.07,
    "text": "Is it the temporal depth it acts as if it's cognizing?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3091.226,
    "end": 3093.487,
    "text": " Where does energy dissipation come into play?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3094.107,
    "end": 3095.587,
    "text": "So these are big questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3096.467,
    "end": 3097.808,
    "text": "What is cognition?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3098.568,
    "end": 3100.529,
    "text": "And is there just one kind of cognition?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3101.009,
    "end": 3108.851,
    "text": "And biological systems do a special combination of it, but it's different in kind of decimal point, but not in the top level.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3109.471,
    "end": 3111.091,
    "text": "Or are they really different in type?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3111.231,
    "end": 3114.052,
    "text": "Or is it such a great quantitative difference that it's different in type?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3115.193,
    "end": 3116.673,
    "text": "Big questions here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3119.154,
    "end": 3120.334,
    "text": "More from the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3121.9,
    "end": 3126.801,
    "text": " Active inference models are phase space representations of biological systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3127.862,
    "end": 3130.382,
    "text": "So that's like a full stop moment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3130.843,
    "end": 3133.063,
    "text": "This isn't what biological systems are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3133.663,
    "end": 3136.924,
    "text": "It's a phase space representation of systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3137.324,
    "end": 3138.885,
    "text": "Here we're talking about biological systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3140.362,
    "end": 3154.845,
    "text": " as forming expectations over observable external states and inferring policies, state action mappings, that minimize the expected free energy of those states under a generative model in some predefined Markov decision process.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3155.866,
    "end": 3167.228,
    "text": "By minimizing expected free energy, the modeled system would attain a non-equilibrium steady state, and so it would maintain, in some sense, a low entropy probability distribution over its states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3168.249,
    "end": 3169.409,
    "text": "So what is active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3170.467,
    "end": 3171.968,
    "text": " What topics is it related to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3172.708,
    "end": 3173.829,
    "text": "What is it based upon?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3175.13,
    "end": 3188.477,
    "text": "We look at that ball in the bowl and it's easy to say, well, the way that the imperative that's pushing the system forward is that the ball wants to be as low down as possible and it's gonna be minimizing its potential energy that way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3189.578,
    "end": 3197.463,
    "text": "Another story about the bowl is the ball is going to end up or act as if it's going to end up with the tightest bound.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3198.342,
    "end": 3221.84,
    "text": " through time on how far left and right it goes now that also takes you right to the bottom of the bowl but you didn't have to mention that you wanted to go down it was just that the desire to minimize the uncertainty led to the bottom of the bowl in that structure and so how do we think about some of these different ways and what are the physics metaphors and then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3222.694,
    "end": 3232.842,
    "text": " An assumption from the paper, an assumption made by the active inference models developed by free energy theorists is that target biological systems can be represented as random dynamical systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3233.582,
    "end": 3235.324,
    "text": "What does this assumption mean exactly?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3236.164,
    "end": 3236.785,
    "text": "What does it mean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3237.445,
    "end": 3239.167,
    "text": "And what are the assumptions of ACT-INF?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3240.157,
    "end": 3242.259,
    "text": " What are the assumptions of other frameworks?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3243.019,
    "end": 3245.902,
    "text": "Does Act-Inf have the same assumptions as other frameworks?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3246.522,
    "end": 3248.023,
    "text": "Does it have fewer or different?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3248.364,
    "end": 3250.065,
    "text": "Does it have more assumptions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3250.686,
    "end": 3255.149,
    "text": "Are there assumptions of Act-Inf that are consequences of other ideas or vice versa?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3255.87,
    "end": 3261.074,
    "text": "So these are just awesome questions that the authors are raising and that their work is like a jumping off point into.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3265.353,
    "end": 3265.573,
    "text": " Good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3265.893,
    "end": 3274.681,
    "text": "So one question that I always have is what if the active inference and the free energy principle presumably have the same assumptions, but do they have to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.701,
    "end": 3277.704,
    "text": "And so that's always something I wonder.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3280.836,
    "end": 3282.697,
    "text": " How has active inference developed?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3283.318,
    "end": 3284.639,
    "text": "This is a fun paragraph.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3285.44,
    "end": 3287.881,
    "text": "Active inference modeling evolves rapidly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3288.622,
    "end": 3289.663,
    "text": "Eats, shoots, leaves.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3290.764,
    "end": 3304.514,
    "text": "As Maxwell Ramstad, Dr. Maxwell Ramstad, helpfully reminded us in conversation, up to roughly 2012, the dynamics of internal and active states in active inference models were determined through gradient descent on variational free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3305.294,
    "end": 3307.756,
    "text": "So let's call that phase one, before 2012.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3310.191,
    "end": 3311.892,
    "text": " We need a real timeline for this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3312.133,
    "end": 3314.634,
    "text": "This is just informal, but this is why we need the timeline.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3315.915,
    "end": 3317.577,
    "text": "Figure out if we're truly on the best timeline.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3318.317,
    "end": 3332.448,
    "text": "From around 2012 until recently, like 10 minutes ago or 2019, active inference models have been equipped with algorithms for policy selection, which evaluate the average free energy expected under each policy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3332.668,
    "end": 3335.23,
    "text": "So expected free energy, not just variational free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3336.591,
    "end": 3339.513,
    "text": "In their latest work, the active inference community",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3341.394,
    "end": 3354.822,
    "text": " have endowed their models with a recursive expected free energy functional, which enables the models to represent target systems higher order counterfactual beliefs, which are beliefs a system has about the beliefs it would have as a consequence of action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3355.402,
    "end": 3364.388,
    "text": "So that's the deep parametric active inference, that's sophisticated active inference, that's what we spoke about with a mental action paper, Sanved Smith et al.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3365.629,
    "end": 3370.892,
    "text": "Okay, so those are three waves that are important to distinguish in the development of active inference models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3372.486,
    "end": 3390.558,
    "text": " Because these modeling advances all seem to make assumptions about the ergodicity of biological systems and the biological meaning of dynamical attractors, the points we make in what follows may help explain why hashtag all active inference models thus far tend to trade off realism for maximal generality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3391.318,
    "end": 3398.503,
    "text": "So they're respecting the developments on the framework and encompassing it, summarizing it, maybe accurately, maybe not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3400.168,
    "end": 3412.999,
    "text": " And then saying, because they all make some common assumptions, they're all victim to this trade-off of realism for generality, or is it utility for generality?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3413.299,
    "end": 3414.019,
    "text": "Which one was it again?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3414.32,
    "end": 3415.22,
    "text": "Realism, utility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3416.221,
    "end": 3416.962,
    "text": "What are the trade-offs?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3417.662,
    "end": 3419.164,
    "text": "So what are the waves of active inference?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3420.376,
    "end": 3424.418,
    "text": " how does ergodicity come into play in these different waves?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3425.339,
    "end": 3438.267,
    "text": "So I know there's a lot on there, but this is really an important piece to understand that there's been recent developments and yeah, it's still in progress.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3440.788,
    "end": 3440.988,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3443.11,
    "end": 3453.618,
    "text": "Here, this is some technical details that it'd be awesome to just learn more from the authors or from anyone else who sees this and gets excited by it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3455.119,
    "end": 3461.404,
    "text": "This is about some of the physics formalizations of noise and dynamics and phase spaces.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3462.264,
    "end": 3466.708,
    "text": "And just a term that I was curious about is like a co-cycle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3468.171,
    "end": 3474.432,
    "text": " So it's kind of taking that idea of returning to an attracting state and maybe connecting it to some other ideas like a co-cycle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3474.933,
    "end": 3479.794,
    "text": "But these are just things to learn and discuss about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3481.074,
    "end": 3485.615,
    "text": "And then this is sort of the classic Bayesian network, Markov blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3486.435,
    "end": 3488.816,
    "text": "Is there a Markov blanket that picks out the mind?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3489.536,
    "end": 3494.577,
    "text": "Is the network of autopoetic processes and biological systems identical to the Markov blanket of the system?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3495.057,
    "end": 3497.178,
    "text": "What is the metaphysical status of Markov blankets?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3498.154,
    "end": 3499.135,
    "text": " And then the author's right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3499.435,
    "end": 3504.66,
    "text": "These debates in the metaphysics of the FEP can be left on the side since we're not interested in metaphysics here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3505.501,
    "end": 3509.344,
    "text": "Hmm, I thought we were having a discussion that was meta to physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3510.085,
    "end": 3512.167,
    "text": "So where is your metaphysics now?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3515.29,
    "end": 3516.431,
    "text": "Okay, anything else there?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3518.873,
    "end": 3519.934,
    "text": "Action in the loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3522.23,
    "end": 3531.838,
    "text": " Given this setup, free energy theorists are interested in finding the active states of the systems that are confined to a bounded subset of states and remain there indefinitely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3532.579,
    "end": 3539.725,
    "text": "So we want to have our internal states be at a certain level, like thinking about our temperature being at a certain value or anything else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3540.526,
    "end": 3545.57,
    "text": "And now we want to talk about the control theory question, which is what active states",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3546.411,
    "end": 3555.74,
    "text": " should the system engage in, conditioned on internal and sensory states, such that the internal states do remain bounded within a subset of states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3558.562,
    "end": 3561.545,
    "text": "More technical details.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3562.246,
    "end": 3572.095,
    "text": "If one assumes that the dynamics of the target organism is ergodic, if one assumes that the dynamics of the target organism is ergodic,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3573.596,
    "end": 3575.037,
    "text": " It's grammatically incorrect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3575.137,
    "end": 3580.68,
    "text": "If one assumes that the dynamics of the target organism are ergodic, that's why you can't read it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3580.7,
    "end": 3582.021,
    "text": "That's why the compiler failed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3582.561,
    "end": 3595.188,
    "text": "Then random dynamical attractors can be associated with the ergodic density, a P distribution of X given M, which is proportional to the amount of time each state is occupied by the organism.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3595.789,
    "end": 3601.432,
    "text": "So here's where we return to their definition of the ergodic density as the invariant probability measure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3604.168,
    "end": 3610.893,
    "text": " There's a few other terms that I know some listeners know about, whether they'll help us with it, it's another question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3611.453,
    "end": 3617.258,
    "text": "But what does it mean to talk about the Lebesgue measure of the attractor?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3618.519,
    "end": 3627.626,
    "text": "How is that connected to dynamical systems and entropy and whatever this integral is calculating in the limit of time approaching infinity?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3628.746,
    "end": 3635.15,
    "text": " But this is kind of this thing that we see in space and in time, like one over space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3635.17,
    "end": 3638.553,
    "text": "So like what's the tiniest infinitesimal space for all space?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3639.193,
    "end": 3642.335,
    "text": "Or what's the tiniest, tiniest moment for all time?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3643.396,
    "end": 3647.479,
    "text": "So how does that connect to action control theory?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3648.254,
    "end": 3649.696,
    "text": " More on that later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3649.816,
    "end": 3654.022,
    "text": "But here, even in this slide, it raises the question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3654.623,
    "end": 3658.448,
    "text": "So here it says, such active internal states in an organism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3658.548,
    "end": 3662.814,
    "text": "And so maybe it's the way that the diagrams are usually drawn for active inference, but",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3663.354,
    "end": 3668.316,
    "text": " I don't ever think of active states as internal states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3668.496,
    "end": 3672.437,
    "text": "Like there's active states, sensory states, internal states, external states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3672.538,
    "end": 3679.36,
    "text": "And I always think about the sensory and the active states as on the boundary between internal and external.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3680.1,
    "end": 3681.961,
    "text": "So... Absolutely.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3682.441,
    "end": 3686.303,
    "text": "There are internal, external, sense and action states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3686.763,
    "end": 3689.544,
    "text": "So what are the active internal states?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3691.237,
    "end": 3692.678,
    "text": " There's a few ways of thinking about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3692.718,
    "end": 3697.142,
    "text": "The particular states are the sense action, the blanket states, and the internal states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3697.763,
    "end": 3705.49,
    "text": "So maybe that's what's being referred to, or we can... Well, when we're talking about mental action, I guess then the active states are internal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3707.772,
    "end": 3707.972,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3708.713,
    "end": 3710.835,
    "text": "Between the past and the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3711.476,
    "end": 3713.197,
    "text": "But still internal, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3713.798,
    "end": 3715.359,
    "text": "Like in mental action, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.379,
    "end": 3715.439,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3715.76,
    "end": 3715.9,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3719.389,
    "end": 3730.677,
    "text": " With this definition of active states in hand, so I believe that we're now working with the Friston ontology of action being not the internal states, but who knows?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3731.538,
    "end": 3735.441,
    "text": "Friston 2012 finally formulates the principle of least action as follows.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3736.722,
    "end": 3737.743,
    "text": "The principle of least action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3738.902,
    "end": 3740.905,
    "text": " the internal states of an active system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3741.325,
    "end": 3743.468,
    "text": "So that wouldn't be the action states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3743.829,
    "end": 3747.674,
    "text": "That would be the internal states of a system with on the interface having action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3748.755,
    "end": 3752.781,
    "text": "They minimize surprisal L such that the variation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3753.942,
    "end": 3779.145,
    "text": " delta s of action s with respect to its internal states r of t existing in r vanishes and then classic future friston look at that the 2100s are going to be just so good the fep would suffice to derive the principle of least action and is defined by friston in the past and the future as follows the free energy principle",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3780.103,
    "end": 3807.315,
    "text": " technical technical technical if the internal states minimize free energy then the system conforms to the principle of least action and is an active system this will be good to unpack and learn more from the authors as well as from those who study these areas because it's sort of something we all ask is like wait least action but then they're engaging in action couldn't they just do less action wouldn't that be more of a fulfillment of the least action principle but",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3808.211,
    "end": 3808.871,
    "text": " What is it actually?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3808.891,
    "end": 3810.472,
    "text": "It's like a stationary principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3810.552,
    "end": 3811.393,
    "text": "It's an invariance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3811.453,
    "end": 3814.295,
    "text": "So there's a little bit more nuance than just staying on the couch.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3815.515,
    "end": 3818.297,
    "text": "And I haven't heard this term active system before.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3818.317,
    "end": 3822.259,
    "text": "I've heard like active inference system or inactive system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3822.679,
    "end": 3824.781,
    "text": "But this active system is new to me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.041,
    "end": 3831.344,
    "text": "And indeed, Friston was a very forward thinking guy, is a very forward thinking guy all the way into the 2100s.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3835.751,
    "end": 3847.955,
    "text": " When expressed in these terms, so in the terms of physics, the FEP provides us with an account of biological persistence as a generic type of stability of random dynamical systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3849.136,
    "end": 3851.376,
    "text": "So then they talk about first in 2012 and 13, some simulations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3854.229,
    "end": 3868.558,
    "text": " And then here's what the author's challenge is and say, let's then put into better focus some of the difficulties involved in this challenge and ask, is there any reason to believe that all biological systems at any scale can be modeled as random dynamical systems?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3869.459,
    "end": 3874.803,
    "text": "And how does this maximal generality bear on the degree of realism of the models?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3875.503,
    "end": 3879.105,
    "text": "So we had a few previous discussions ago, we had, you know,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3880.086,
    "end": 3905.886,
    "text": " realism we had utility we had instrumentalism we had all these different axes and how are we going to manage that trade-off because sometimes the most quote realistic description of a system isn't the most useful or it's not the most general so there's a lot of trade-offs happening how does model realism relate to generalizability and how does that relate to the utility of the model as well as other attributes like its simplicity",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3908.021,
    "end": 3910.322,
    "text": " that's like the relationship between the map and the territory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3910.402,
    "end": 3913.422,
    "text": "If you wanted the territory, then you wouldn't need a map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3913.782,
    "end": 3914.043,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3914.963,
    "end": 3919.504,
    "text": "And then almost like the compass or a piece of paper that just, you know, says like, you are here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3919.744,
    "end": 3921.144,
    "text": "It's like, it's so general.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3921.444,
    "end": 3926.466,
    "text": "You can always look down and that map is going to be at least not telling a lie.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3927.366,
    "end": 3929.326,
    "text": "You know, this is your left or something like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3929.366,
    "end": 3931.607,
    "text": "This is, but is that useful?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3932.697,
    "end": 3939.771,
    "text": " It generalizes really well, but have we lost this whole question of navigation in the desire to find the simplest map?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3943.052,
    "end": 3950.456,
    "text": " So something that I wonder about, like, you know, are biological systems random dynamical systems?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3950.496,
    "end": 3952.997,
    "text": "Like, what's a non-random dynamical system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3953.157,
    "end": 3957.259,
    "text": "Like, a dynamical system as opposed to, like, a static system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3957.319,
    "end": 3958.44,
    "text": "Like, statics, dynamics?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3958.78,
    "end": 3963.382,
    "text": "And so, like, what other system could a biological system be?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3963.843,
    "end": 3968.065,
    "text": "Like, if it's not a random dynamical system, what is the alternate system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3968.405,
    "end": 3969.146,
    "text": " How about hypothesis?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3969.446,
    "end": 3972.969,
    "text": "Just like what you said about like, okay, well, what is the better model for cognition?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3973.029,
    "end": 3977.572,
    "text": "If not, you know, active inference, then what model is the better model, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3977.612,
    "end": 3979.534,
    "text": "Like, so, but what about for a biological system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3979.694,
    "end": 3984.518,
    "text": "If it's not random dynamical system, what is the best model for a biological system?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3985.319,
    "end": 3985.559,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3986.6,
    "end": 3989.082,
    "text": "Dynamical through time dynamics, random.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3990.245,
    "end": 3993.366,
    "text": " used in a lot of different ways, but is that statistical?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3993.666,
    "end": 3994.567,
    "text": "Is it stochastic?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3994.627,
    "end": 3996.007,
    "text": "Where's determinism fit into play?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3996.987,
    "end": 3998.288,
    "text": "Well, let's talk about it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3998.788,
    "end": 4005.17,
    "text": "So here's section four, and this is like some of the main body paragraphs and contributions of the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4006.371,
    "end": 4010.692,
    "text": "It's the section modeling biological active states as random dynamical attractors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4012.233,
    "end": 4018.755,
    "text": "Free energy theorists account of biological systems persistence relies on three main modeling assumptions, ergodicity,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4019.735,
    "end": 4027.437,
    "text": " the existence of Markov blankets that imply a partition of states into external and internal, the existence of random dynamical attractors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4028.477,
    "end": 4036.579,
    "text": "In this section, we concentrate on assumptions one and three, and on the more fundamental challenge of defining phase basis for target biological systems in the life sciences.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4037.22,
    "end": 4041.721,
    "text": "So the three core ideas that they're saying are,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4043.055,
    "end": 4050.284,
    "text": " underlying FEP work in biological systems are ergodicity, Markov blankets, and random dynamical attractors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4051.445,
    "end": 4052.586,
    "text": "Are those the main three?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4053.087,
    "end": 4054.469,
    "text": "That's a really important question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4055.731,
    "end": 4071.215,
    "text": " This paper is going to focus on the first and the third, not going as much into the Markov blankets discussion, because there's been a huge amount of discussion on Markov blankets, and we've talked about them separately.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4071.655,
    "end": 4076.476,
    "text": "So they're going to focus on ergodicity and random dynamical attractors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4077.236,
    "end": 4083.671,
    "text": " That's 4.2 and 3, but that's going to be introduced by discussion on phase spaces in biology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4084.273,
    "end": 4086.277,
    "text": "So that's what the authors have set out to do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4087.83,
    "end": 4101.279,
    "text": " Now, shameless lab plug, we're working on an active inference ontology in a participatory way that includes references, definitions, translations into multiple human languages.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4101.879,
    "end": 4109.284,
    "text": "It will be many things and it will scaffold educational content that will make this entire field more accessible and rigorous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4109.944,
    "end": 4111.706,
    "text": "So terms like face space,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4113.094,
    "end": 4116.655,
    "text": " We've talked about state space on September 13th.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4117.295,
    "end": 4130.779,
    "text": "So every week we're bringing together different perspectives and sharing resources and working towards common understandings in this document to really get at what are the core assumptions of FEP or ACT-INF?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4131.139,
    "end": 4132.519,
    "text": "What do these terms mean?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4132.959,
    "end": 4135.96,
    "text": "What would somebody need to learn if they wanted to understand more?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4136.48,
    "end": 4151.026,
    "text": " So it's really important work and we're definitely going to draw upon the author's contributions here as we work to scaffold an active inference ontology so that we don't get tied up in active state, action state, systems with action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4151.587,
    "end": 4154.148,
    "text": "We can be clear about how we're talking about this field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4154.308,
    "end": 4155.548,
    "text": "And in fact, we really have to be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4156.529,
    "end": 4159.91,
    "text": "Anything on our ontology document before we continue back to the paper?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4160.911,
    "end": 4161.311,
    "text": "No, I'm good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4162.111,
    "end": 4165.473,
    "text": "But this has been a fun project with many contributors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4167.472,
    "end": 4169.853,
    "text": " So let's talk about phase spaces in biology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4170.574,
    "end": 4173.616,
    "text": "We introduced this in the earlier keyword section.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4174.616,
    "end": 4180.4,
    "text": "So the phase space of the system is a giant space formed by the relevant degrees of freedom of the target system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4181.58,
    "end": 4183.782,
    "text": "And then that's the space of the possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4184.867,
    "end": 4193.974,
    "text": " A point in the phase space corresponds to a microstate, which completely determines the system in terms of the variables and parameters required for analyzing its dynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4194.595,
    "end": 4202.24,
    "text": "And the dynamics are determined by the equations of motion, which describe the evolution of points or trajectories in phase space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4203.822,
    "end": 4205.723,
    "text": "So here's that phase space kind of model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4206.404,
    "end": 4211.468,
    "text": "And then the authors are going to suggest that there's at least three facts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4212.523,
    "end": 4220.307,
    "text": " cold hard facts that make face spaces in biology hard to apply because first biological systems have many degrees of freedom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4220.847,
    "end": 4221.728,
    "text": "It's not just a pendulum.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4223.399,
    "end": 4233.924,
    "text": " Second, the symmetries, which are invariant preserving transformations, underlying the observed regularities in biological phenomena are more unstable than physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4235.044,
    "end": 4235.264,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4236.325,
    "end": 4244.729,
    "text": "And third, the phase space for many real world biological targets is much less stable than that for the kinds of target systems studied in physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4246.229,
    "end": 4249.331,
    "text": "So what do you think about that or about phase spaces in biology?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4251.249,
    "end": 4258.05,
    "text": " Yeah, I mean, I think I mentioned the multidimensionality in the beginning when we were talking about the phase spaces in biological systems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4259.031,
    "end": 4263.592,
    "text": "And I think that it just comes to that with any system, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4263.652,
    "end": 4265.732,
    "text": "Like you can always include too many parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4265.792,
    "end": 4269.093,
    "text": "Like you can have the territory or you can have a dramatically reduced map.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4269.153,
    "end": 4271.913,
    "text": "And so finding that correct balance is hard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4272.413,
    "end": 4279.915,
    "text": "And if we're looking at, you know, say states of a system and trying to predict the next state,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4281.736,
    "end": 4285.159,
    "text": " What are all of the factors conditionally independent?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4285.219,
    "end": 4289.062,
    "text": "Is there some mingling of the variables there?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4289.243,
    "end": 4292.585,
    "text": "And is it okay to just model a couple at a time?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4292.826,
    "end": 4296.609,
    "text": "And what if we don't know if there are some confounding variables in the system too?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4296.689,
    "end": 4302.354,
    "text": "So it's a difficult task, but it's how do we start to get a grip on it is hard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4302.874,
    "end": 4303.035,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4305.154,
    "end": 4310.016,
    "text": " And a big question in the background here is, does this matter for applications?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4310.697,
    "end": 4327.765,
    "text": "So yes, these are in principle critiques of doing dynamical phase space models of biology, but we know that dynamical systems models of neural systems, of hormonal systems, of ecology, these are all really useful and people use them every day.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4328.306,
    "end": 4330.367,
    "text": "Gene, regulatory networks, don't forget those.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4331.483,
    "end": 4358.726,
    "text": " how could we forget but does something having these sort of fundamental critiques prevent it from being useful not always this is a really nice um points about the open-endedness of biological phase space so this is the work of longo montvale and kaufman 2012 who said that in physics one can pre-state the phase space for target systems based upon stable stable invariances and symmetries",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4359.915,
    "end": 4363.336,
    "text": " So we can like say the ball is going to be rolling around in the box.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4363.516,
    "end": 4365.737,
    "text": "Those are the boundaries and here's the invariances.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4366.758,
    "end": 4381.403,
    "text": "Historical processes studied in evolutionary and population biology, like all these processes that we know and love in biology, involve symmetry breaking, which makes the phase spaces structurally unstable, ever changing and unpredictable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4382.472,
    "end": 4385.673,
    "text": " Now unpredictable is a little bit of a tough one because that's a continuum.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4385.913,
    "end": 4390.155,
    "text": "What if you can predict 1% of the variance in great evolutionary transitions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4390.655,
    "end": 4392.696,
    "text": "Is it unpredictable or is it predictable?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4393.116,
    "end": 4394.757,
    "text": "You know, is it half full or half empty?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4395.637,
    "end": 4396.658,
    "text": "And then this is from the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4397.745,
    "end": 4411.737,
    "text": " Because we cannot pre-state the ever-changing phase space of biological evolution, we have no settled relations by which we can write down the equations of motion of the ever-new biologically relevant observables and parameters, but that we cannot pre-state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4412.618,
    "end": 4419.644,
    "text": "More, we cannot pre-state the adaptive niche as a boundary condition, so could not integrate the equations of motion even were we to have them all.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4420.144,
    "end": 4422.967,
    "text": "So it's like there's the ball rolling around on the billiards table,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4423.567,
    "end": 4430.572,
    "text": " but now there's mutations in the genome of the ball so that there's like totally new mechanisms arising in a way that might have a historiosity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4431.353,
    "end": 4435.015,
    "text": "Oh yeah, and the table is mutating and it's made up of other organisms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4435.296,
    "end": 4442.681,
    "text": "So it's easy to see how we get lost in the complexity, yet adaptive action exists and useful models exist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4443.221,
    "end": 4451.868,
    "text": "So how do we reconcile the fundamental open-endedness and creativity and novelty of evolution with our desire to explain some portion of the variance so we can act effectively?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4453.069,
    "end": 4460.392,
    "text": " Well, and this relates, like, to a question that I had brought up to you yesterday, Daniel, I think, about, like, what about discretizing space?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4460.772,
    "end": 4464.794,
    "text": "And so I know that, like, some of the physics principles rely on infinite time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4464.894,
    "end": 4469.076,
    "text": "Like, the ergodicity specifically relies on the possibility of infinite time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4469.376,
    "end": 4471.497,
    "text": "And this is all stuff that's, like, kind of beyond me.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4471.537,
    "end": 4475.499,
    "text": "But what if we have a temporarily restricted moment, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.519,
    "end": 4478.04,
    "text": "Like, what if we're just interested about now and five years from now?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4478.54,
    "end": 4481.742,
    "text": "Or what if we're just interested in now and five years ago, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4481.802,
    "end": 4482.282,
    "text": "And so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4483.122,
    "end": 4488.846,
    "text": " In each moment, is this symmetry breaking happening or at what scale?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4489.306,
    "end": 4510.76,
    "text": "And so is there perhaps a chunk of time, a small discrete chunk of time from a microsecond to 100 years where these types of inferences can be used and where the equations are applicable and where we can use the model under the specification that this model is not good for the next 2 million years, but it will last you 20, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4511.12,
    "end": 4511.26,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4512.601,
    "end": 4533.301,
    "text": " it's a model of the phase space of blood glucose versus ph in a person as measured by the devices we have it's not of blood sugar over a million years because that doesn't even make sense given the system of interest so how do we reconcile pragmatics and utility with these really important philosophical questions so that was four one phase spaces four two",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4534.56,
    "end": 4534.98,
    "text": " Ergodicity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4536.101,
    "end": 4540.042,
    "text": "One of the assumptions of the FEP is that all biological systems are ergodic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4540.382,
    "end": 4544.143,
    "text": "So paging, Ramstead, et al, et al.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4544.783,
    "end": 4547.584,
    "text": "This is something we really want to unpack and understand.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4548.285,
    "end": 4549.085,
    "text": "How does it...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4550.191,
    "end": 4565.438,
    "text": " mean ergodicity or more precisely metric transitivity in random dynamical systems like what is the math and the physics and is that an assumption of the fvp what does this mean to assume that biological systems quote are ergodic",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4566.198,
    "end": 4575.124,
    "text": " which is different than saying biological systems for some spatial temporal scales can be modeled using statistics that involve ergodic assumptions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4575.864,
    "end": 4590.814,
    "text": "So there's a lot of nuance there, like whether we're making relist claims about how biological systems are or whether we're using statistics in an instrumental fashion to make useful models of organisms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4591.315,
    "end": 4595.818,
    "text": "But the big questions are like, what kinds of systems are ergodic and how?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4596.979,
    "end": 4621.956,
    "text": " what are the implications of ergodic assumption is it ever not an assumption but it's actually like a consequence of some empirical grounding there's the ergodic hierarchy so ergodicity it's not just like yes or no there's a total continuum with a lot of complex math and then just for everyone how or where does this matter for modeling under the fep or active inference in real world situations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4624.037,
    "end": 4638.229,
    "text": " And they did call out in the paper a reference to Ramstad and the local ergodicity, which is for a biological organism, something like the boundaries in which the organism can exist.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4639.651,
    "end": 4643.034,
    "text": "Anyway, I think Maxwell, come explain it to us, please.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4643.094,
    "end": 4646.497,
    "text": "But the authors did mention that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4648.359,
    "end": 4649.6,
    "text": " Here's a quote from the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4650.58,
    "end": 4666.43,
    "text": "Birkhoff, 1931, demonstrated that if a dynamical system is ergodic, then the infinite time limit exists and coincides with the phase average for almost all initial conditions, little x, like the realized conditions, within the bigger x, like the space of the possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4667.711,
    "end": 4669.153,
    "text": " This is called the ergodic theorem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4670.055,
    "end": 4672.879,
    "text": "And that is going to get linked to everything we were just discussing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4673.379,
    "end": 4676.584,
    "text": "Surprisal minimization as ergodicity maintenance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4677.385,
    "end": 4681.852,
    "text": "And then here, the proof of the principle of least action is straightforward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4682.753,
    "end": 4682.994,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4684.269,
    "end": 4694.833,
    "text": " and rests on noting that action and the entropy of the ergodic density over external states are related via the ergodic theorem, Friston, past and the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4695.633,
    "end": 4701.416,
    "text": "So PNAS, Burckhoff, 1931, pretty interesting paper and just,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4702.176,
    "end": 4715.149,
    "text": " It's amazing to think like 100 years of mathematics after this, but this is kind of that initial formalization of what if the space average and the time average were going to be related to each other?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4716.851,
    "end": 4717.732,
    "text": "So it's a cool topic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4717.852,
    "end": 4725.079,
    "text": "We've brought up ergodicity before, and it would be really helpful for people who know some of the technical details to help work with it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4727.728,
    "end": 4733.43,
    "text": " This is one analogous to how they brought up, like, here's the facts that challenge phase spaces in biology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4734.031,
    "end": 4738.953,
    "text": "So here's some facts that challenge the application of ergodic theorems to real systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4740.233,
    "end": 4745.476,
    "text": "And there's good reasons, the authors say, to think that the theorem cannot be realistically applied in the domain of biology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4747.213,
    "end": 4753.415,
    "text": " First off, it's not enough to show that the infinite limit exists.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4753.775,
    "end": 4756.535,
    "text": "It also has to be shown that the convergence rate is plausible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4756.695,
    "end": 4758.096,
    "text": "We're going to talk about that in a second.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4759.576,
    "end": 4771.159,
    "text": "Second point, comparing biological to non-biological systems, it's harder to estimate the amount of time that they need to kind of asymptote because of the non-uniformities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4772.628,
    "end": 4789.996,
    "text": " Another reason, and this is going to be one that I know people will have things to say, why ergodicity cannot plausibly be assumed in biology is that the ergodic theorem requires the dynamics of the system to be ergodic, which means that eventually almost every point will visit every measurable region in X.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4791.016,
    "end": 4799.444,
    "text": " We've talked about that before, but biological systems never revisit the exact same state if you think about every molecule constituting the phase space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4800.104,
    "end": 4809.093,
    "text": "But if the phase space is just temperature versus blood sugar, yes, you pretty much will revisit some points, but will you revisit every point?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4809.693,
    "end": 4812.896,
    "text": "Are you going to reach a value of negative 5,000 sugar and 900 degrees Celsius?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4813.217,
    "end": 4813.317,
    "text": "No.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4816.206,
    "end": 4818.127,
    "text": " We're talking about bounded states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4818.907,
    "end": 4820.948,
    "text": "And that's kind of a nuance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4822.169,
    "end": 4827.471,
    "text": "And then- Well, and it's also the arrow of time is moving forward, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4827.511,
    "end": 4828.412,
    "text": "It points one direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4828.532,
    "end": 4833.414,
    "text": "And so like, you know, at age 40, my skin will never have the collagen it had at age four.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4833.494,
    "end": 4835.175,
    "text": "Like that's never going to happen again, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4835.595,
    "end": 4838.697,
    "text": "So, I mean, and there are some things that just decrease as you age.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4839.797,
    "end": 4840.017,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4840.598,
    "end": 4841.778,
    "text": "So there are, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4842.639,
    "end": 4844.219,
    "text": "Let's look at this Palacios 2018 paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4846.314,
    "end": 4850.415,
    "text": " So this is, I guess, an earlier paper by the first author.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4850.915,
    "end": 4852.875,
    "text": "So it kind of gives a little context.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4854.596,
    "end": 4859.016,
    "text": "Had we but whirled enough in time, but we don't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4860.717,
    "end": 4862.417,
    "text": "Exclamation point, colon.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4863.237,
    "end": 4867.998,
    "text": "Justifying the thermodynamic and infinite hyphen time limits in statistical mechanics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4868.678,
    "end": 4873.199,
    "text": "Great title, well punctuated, a bevy of punctuations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4874.329,
    "end": 4878.692,
    "text": " And this is just a very interesting paper that we skimmed over.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4878.712,
    "end": 4890.659,
    "text": "And I'm sure there's a ton to say, it'd be great to speak with the author about it, but they argue that this has, there's an important consequence for the philosophical literature on infinite limits.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4891.759,
    "end": 4894.201,
    "text": "And that's basically, it's not just about like where you are,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4895.505,
    "end": 4919.824,
    "text": " where you are in phase space it's about where you're going that's the asymptote in infinite time and it also matters how fast you're going to get there so it's like kind of the asymptote for a pane of glass is like in a puddle on the ground because it's a liquid or it's a glass but that might take so long that over some time scale it can be modeled as if it's not changing for example",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4920.768,
    "end": 4931.648,
    "text": " So that's kind of a cool notion that it's not just about where a system is or where it's being attracted towards, but actually the dynamics of the approach matter a lot.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4931.849,
    "end": 4933.532,
    "text": "And that's certainly true in biological systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4937.754,
    "end": 4950.147,
    "text": " The assumption of ergodicity to give a definition of equilibrium states is a controversial assumption even in the domain of physics, especially due to existence of physical systems in equilibrium that have proven to be non-ergodic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4950.748,
    "end": 4953.551,
    "text": "So I didn't find this Palacios 21 citation in the Biblio.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4955.305,
    "end": 4961.928,
    "text": " This is the reason why physicists and philosophers have offered alternative approaches to equilibrium that do not rely on ergodicity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4962.908,
    "end": 4973.432,
    "text": "Even philosophers that defend a quasi-ergotic approach to equilibrium recognize that this definition of equilibrium may plausibly apply only to a restricted class of systems such as gases.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4974.833,
    "end": 4993.749,
    "text": " so sounds bad but then we go okay the authors say it doesn't mean of course that ergodicity or a weaker notion of local ergodicity may sometimes be a reasonable assumption to make so in other words it might be useful for specifically defined systems anyway",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4995.148,
    "end": 5008.434,
    "text": " However, the fact that one cannot extrapolate the assumption of ergodicity to the behavior of all relevant systems in biology casts doubt on the project of formulating a principle that depends on this assumption and is both maximally general and biologically realistic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5010.115,
    "end": 5021.661,
    "text": "So ideas that we've heard a little bit about, but how are we going to finesse realism and generality and grounding in physics when biological systems might be grounded in things that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5022.512,
    "end": 5023.393,
    "text": " are not fulfilled.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5024.173,
    "end": 5024.854,
    "text": "So that's 4.2.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5026.335,
    "end": 5029.377,
    "text": "All right, 4.3, random dynamical attractors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5030.798,
    "end": 5051.253,
    "text": "What makes the application of FEP to account for real world behavior, biological systems, is even more challenging beyond 4.2 and 4.1, because one also has to show the existence of an attractor and also justify why certain attractors, but not others, plausibly denote homeostatic states in the target.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5052.5,
    "end": 5054.081,
    "text": " There might be multiple attractors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5055.202,
    "end": 5057.443,
    "text": "And then there's this question of chaotic systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5057.463,
    "end": 5058.644,
    "text": "Do you want to add anything on these?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5060.665,
    "end": 5066.689,
    "text": "Basically, it's non-trivial to say that there's an attractor and it's the right one and it results in adaptive behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5067.309,
    "end": 5068.51,
    "text": "There's a lot that goes into it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5070.391,
    "end": 5073.353,
    "text": "So, but we can learn more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5073.453,
    "end": 5074.754,
    "text": "We'll hear more questions later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5075.214,
    "end": 5077.556,
    "text": "And then just to go quickly to five and six.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5078.176,
    "end": 5079.077,
    "text": "So five, discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5080.598,
    "end": 5085.659,
    "text": " In the previous sections, we've analyzed three challenges involved in the justification of the free energy principle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5086.299,
    "end": 5091.26,
    "text": "So one was pre-stated phase spaces for most biological systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5092.16,
    "end": 5097.681,
    "text": "Two was the lack of the warrant for making ergodicity assumptions in biology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5098.561,
    "end": 5106.503,
    "text": "And three is the challenge of identifying homeostasis with attractors in a phase space, even if one and two were accomplished.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5107.574,
    "end": 5124.624,
    "text": " Based on our analysis, one overall conclusion is that because of a fundamental mismatch between its physics assumptions and the properties of biological targets, model building grounded in the FEP achieves maximal generality, yay, for minimal biological plausibility.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5126.285,
    "end": 5126.525,
    "text": "Bad.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5127.526,
    "end": 5129.587,
    "text": "So how is that going to work?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5131.028,
    "end": 5137.072,
    "text": "As we raised earlier, how does generality versus plausibility get traded off for real systems?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5138.314,
    "end": 5142.336,
    "text": " in the FVP, in ACT-INF and in what other frameworks?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5142.716,
    "end": 5152.902,
    "text": "Let's always have another one if people want to or can think of one so that we're not just asking whether it's like as good as it could be, because here's a hint, it's not as good as it could be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5153.342,
    "end": 5155.824,
    "text": "We're always going to see ways to improve the theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5156.909,
    "end": 5160.992,
    "text": " and the literature, if only by organizing other work and making it more accessible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5161.613,
    "end": 5165.096,
    "text": "So what is its relative biological plausibility?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5165.676,
    "end": 5167.658,
    "text": "What is its relative generalizability?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5168.118,
    "end": 5169.459,
    "text": "And what are we relativizing to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5170.34,
    "end": 5183.151,
    "text": "Because as they say, like for other idealized scientific representations, even if the FEP involves simplifying distortions, it does not follow that it must be minimally realistic and have limited explanatory or predictive power.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5185.754,
    "end": 5188.356,
    "text": " So they're saying like, it's kind of like enemy of my enemy is my friend.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5188.636,
    "end": 5195.64,
    "text": "It's like saying, just cause you idealize and simplify that it doesn't mean that you're gonna get explanation or prediction.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5197.181,
    "end": 5198.822,
    "text": "So that's their discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5199.403,
    "end": 5204.546,
    "text": "They fall back to the three key points that they think challenge",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5205.836,
    "end": 5215.382,
    "text": " the usage of physics ideas in biology that are postulated to be underlying the FEP phase spaces, ergodicity, and random attractors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5216.862,
    "end": 5222.486,
    "text": "And they're concluding that there's a mismatch between the physics assumptions and the properties of biological targets.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5227.269,
    "end": 5231.011,
    "text": "Here in the implications and predictions, they write,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5232.606,
    "end": 5251.249,
    "text": " If the FEP or active inference models it grounds make simplifying distortions, distorting assumptions about the phase space of a target system, the ergodicity of biological systems, and the existence of an attracting set corresponding to homeostatic states for these systems, then these idealizations should earn their keep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5251.93,
    "end": 5256.61,
    "text": "So, you know, you've been a bad theory, but it's not all over.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5256.85,
    "end": 5257.951,
    "text": "You could be a good theory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5258.091,
    "end": 5259.871,
    "text": "You could earn your keep maybe in the future.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5261.226,
    "end": 5266.031,
    "text": " And then they write, we'll just read it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5266.171,
    "end": 5281.046,
    "text": "These idealizations should allow life scientists to attractively draw some explanation and prediction about relevant biological observables in real world systems and assess those predictions against measurements relevant to understanding some aspect of homeostatic processes in actual biological systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5281.807,
    "end": 5282.667,
    "text": "DaCosta et al., 2020.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5284.71,
    "end": 5290.833,
    "text": " Our contention is that the idealizations made by free energy theorists do not play these practical and epistemic roles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5291.674,
    "end": 5294.075,
    "text": "And so this is the DaCosta et al.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5294.095,
    "end": 5297.257,
    "text": "2020, active inference on discrete state spaces, a synthesis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5298.257,
    "end": 5302.38,
    "text": "And here are from table one, here's all the applications.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5303.491,
    "end": 5326.293,
    "text": " it's interesting because like this pragmatic and epistemic role that's kind of the ontology of active inference that's how we talk about policy selection and then it's like okay looking at this list i'm seeing a lot of pragmatic and epistemic value but what is the contention that the idealizations themselves",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5327.421,
    "end": 5339.321,
    "text": " do not play pragmatic or epistemically valuable roles, I think it'd be good to get a little clarification because table one has a lot of, and since then even, there's a lot of interesting areas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5339.922,
    "end": 5340.783,
    "text": "What do you think about that, Blue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5341.676,
    "end": 5369.157,
    "text": " yeah it's interesting like the word choice of the author here like the idealizations made by the f free energy theorists theorists so what are these idealizations like the reliance on ergodicity and random dynamical systems theory like are these the idealizations or is it actually using the fep and active inference for practical applications that don't play the practical and epistemic roles so i just i'm curious as to that word choice",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5370.023,
    "end": 5374.556,
    "text": " And Steven in the chat wrote, the use of approximation science around ergodicity",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5375.694,
    "end": 5380.097,
    "text": " could give the potential to have sufficient revisiting of states to make meaningfulness plausible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5380.838,
    "end": 5387.222,
    "text": "How can we measure when sufficient approximation to ergodicity exists in order to make variational free energy inferences?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5387.942,
    "end": 5389.884,
    "text": "So good question we can ask.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5390.484,
    "end": 5401.992,
    "text": "And as we kind of explored, revisitation is one component of ergodicity, but also there's this element of revisiting every point and of exploring the whole phase space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5402.012,
    "end": 5404.974,
    "text": "So as we kind of addressed, what is ergodicity?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5405.865,
    "end": 5429.237,
    "text": " the reality of ergodicity and applying those models to biological systems and then yeah can we use approximations and approximation science to make it work even if in the infinite perfect case it doesn't exactly seem like it would like the t-test assumes that there's an equal variance between the two groups unless you have a t-test with in equal variances yet",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5430.177,
    "end": 5435.82,
    "text": " No two groups in reality are going to have the exact same variance, yet the t-test works.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5436.62,
    "end": 5440.663,
    "text": "So how can we take that same approach and think about the systems that we're working with here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5442.103,
    "end": 5446.726,
    "text": "Here's their whole conclusion in a churning maelstrom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5447.886,
    "end": 5454.17,
    "text": "They're arguing that FEP theorists have pursued maximal generalization by relying on physics concepts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5454.95,
    "end": 5457.872,
    "text": "However, that means that they've sacrificed biological realism",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5458.803,
    "end": 5476.756,
    "text": " And the danger of sacrificing biological realism is that you risk minimizing explanatory and predictive power of those accounts for biological systems, which are homeostatic and manifestingly far from equilibrium in their persistence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5477.817,
    "end": 5485.323,
    "text": "And their last paragraph, the FEP can perhaps be better understood as a maximally general definition of any system that persists",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5486.493,
    "end": 5491.016,
    "text": " but this definition does not seem to provide us with any new insight into biological systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5492.597,
    "end": 5502.984,
    "text": "To the extent free energy theorists treat all biological systems at any scale as pre-specified generic objects with fixed, currently unknown equations of motion,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5504.124,
    "end": 5510.107,
    "text": " their account risks missing all features that make biological systems interesting kinds of thermodynamic systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5510.748,
    "end": 5515.41,
    "text": "So it's like, you know, a city where there's all kinds of intersections and then you have a grid map.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5515.87,
    "end": 5526.136,
    "text": "And so we distort the system in a way where all of a sudden we thought we were generalizing, but we ended up losing touch with the system and therefore explanatory and predictive power.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5526.856,
    "end": 5527.997,
    "text": "Any thoughts on the conclusion?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5530.766,
    "end": 5551.489,
    "text": " um no i mean i think that that you know they have made their point pretty clearly so um i think the fpp also has a lot of room to grow being that it's you know relatively not not quite 20 yet so i think that um you know hopefully that some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5552.731,
    "end": 5560.414,
    "text": " pragmatic and epistemic value will be put forth by the generalizations made by the FEP in some future model, perhaps.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5561.315,
    "end": 5564.596,
    "text": "That's almost like a deep time sociological value.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5565.516,
    "end": 5576.881,
    "text": "Even a provocative theory, which has limited epistemic or pragmatic value, not saying the FEP is, could play a role in a broader social system that still gets the job done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5577.201,
    "end": 5578.422,
    "text": "So that's kind of a cool notion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5579.52,
    "end": 5580.89,
    "text": " What questions for 31.1 did you put up?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5583.317,
    "end": 5584.978,
    "text": " So I think I've raised them all already.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5585.038,
    "end": 5593.065,
    "text": "So what is the dynamic equilibrium of living systems, as the authors state here and as I stated in the beginning keywords?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5593.845,
    "end": 5599.329,
    "text": "And it says we should pay closer attention to the fundamental differences between physics and biology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5599.97,
    "end": 5603.092,
    "text": "What are the differences between physics and biology?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5603.192,
    "end": 5612.399,
    "text": "In the paper they made, they went to a great length to explain why biological systems weren't ergodic, but then also they made the point that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5613.16,
    "end": 5637.347,
    "text": " physics they have they have a really hard time like proving organicity exists at all um in any physical system so what are what are these fundamental differences between physics and biology that that are so critical like that it seems that you know the fvp kind of misses the point um and then they refer often in the paper to active states as as internal states and i i just wonder",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5638.726,
    "end": 5644.857,
    "text": " What, like, I mean, I've really thought about active states as like the interface between internal and external and part of the blanket.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5644.897,
    "end": 5646.6,
    "text": "And so I just wonder why...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5647.912,
    "end": 5653.477,
    "text": " the active states are included in internal states and their description of the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5653.537,
    "end": 5660.264,
    "text": "So just some technical things that I have questions about and hopefully the authors will be here to answer them.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5660.624,
    "end": 5660.864,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5661.565,
    "end": 5666.189,
    "text": "Steven wrote, we may never know the whole phase space as the phase space may be variable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5666.69,
    "end": 5669.853,
    "text": "Yes, that's what we talked about, like the phase space of temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5669.973,
    "end": 5670.613,
    "text": "Does that include...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5671.514,
    "end": 5673.916,
    "text": " impossible temperatures that the system cannot persist at.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5674.496,
    "end": 5684.684,
    "text": "And then the fact that the phase space can change is the open-endedness of the long ago, I think, 2012 open-endedness of the phase space in biological systems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5684.724,
    "end": 5691.39,
    "text": "So for sure, that's why we can read the papes and then have specific citations and ontologies in mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5691.43,
    "end": 5696.153,
    "text": "So we're not kind of cross-angling because those are great points and they were the points made in the paper.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5696.954,
    "end": 5702.219,
    "text": " And then Steven asks, is biological realism based upon folk biological assumptions?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5702.919,
    "end": 5710.006,
    "text": "So I think this sort of like folk hyphenated everything has come into the forefront with the discussion with Matt Sims.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5710.646,
    "end": 5710.946,
    "text": "So yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5711.829,
    "end": 5735.889,
    "text": " what is biologically real you know what models are biologically realistic isn't that just like the question of what is real so yeah what is even real at all exactly yeah realism sounds good until you so you ask too many questions so what a fun discussion so we ask all these questions like what does a good understanding enable",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5736.772,
    "end": 5739.274,
    "text": " What are the unique predictions and implications of this paper?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5740.015,
    "end": 5742.677,
    "text": "What are the next steps for FEP and ACT-IMF?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5743.458,
    "end": 5745.039,
    "text": "What are the goals of this research?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5745.8,
    "end": 5747.481,
    "text": "And then what are we still curious about?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5748.282,
    "end": 5750.204,
    "text": "It was a fun discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5750.304,
    "end": 5754.487,
    "text": "So thanks a ton, Blue, for doing it and for working a ton on the slides.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5755.528,
    "end": 5757.81,
    "text": "We'll look forward to 31.1 and beyond.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5757.83,
    "end": 5758.471,
    "text": "Awesome.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5758.491,
    "end": 5758.831,
    "text": "Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5758.851,
    "end": 5758.911,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5758.951,
    "end": 5759.131,
    "text": "Bye.",
    "speaker": "SPEAKER_03"
  }
]