[
  {
    "start": 8.956,
    "end": 36.997,
    "text": " hello welcome everyone it is october 25th 2023 we're in active inference for the social sciences and today we're in a discussion section it is avil and i and we'll start off by just saying hello and kind of reflecting on where we're at with the course then we have the questions form that is on the course website it's in the video description",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 38.22,
    "end": 40.883,
    "text": " feel free to submit questions via this form.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 41.964,
    "end": 48.411,
    "text": "And then today we're going to look at the questions that have been submitted and not answered yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 49.211,
    "end": 51.294,
    "text": "And we'll just give some thoughts on them.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 51.554,
    "end": 55.298,
    "text": "Also look for more questions to arise in the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 56.239,
    "end": 57.42,
    "text": "So with that,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 59.022,
    "end": 60.864,
    "text": " What do you want to begin with, Avel?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 61.584,
    "end": 72.093,
    "text": "Feel free to give any kind of overview or statement, and then we'll jump to the specific questions that have been submitted before today and during today.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 73.735,
    "end": 78.479,
    "text": "The only statement here that I want to make is the last presentation I did, so...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 80.282,
    "end": 84.883,
    "text": " prediction cause constraints to exist would be our wealth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.004,
    "end": 96.207,
    "text": "Sorry of that, but I really don't have anything to say that is more specific right now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 97.327,
    "end": 97.587,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 98.308,
    "end": 100.508,
    "text": "Well, this should be pretty fun.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 100.628,
    "end": 103.129,
    "text": "Let's jump into some questions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 105.61,
    "end": 105.83,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 109.141,
    "end": 117.353,
    "text": " What are the challenges and potential solutions in using active inference to model collective behaviors with various environmental constraints?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 125.084,
    "end": 131.409,
    "text": " So the challenge is first is that in any model you have to pick what you include and what you did not include.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 131.71,
    "end": 138.155,
    "text": "So when you talk about boundary conditions, when you talk about what's included in the model, you have to make hypothesis.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.575,
    "end": 143.559,
    "text": "Like if I tell you model, I don't know country that is under sanctions like North Korea or Russia.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 144.64,
    "end": 145.881,
    "text": " Okay, how do you model that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.981,
    "end": 154.446,
    "text": "Do you make a set base for every possible product, like every dimension accounts for a specific product or type of product?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 155.067,
    "end": 159.73,
    "text": "And you have a zero if you have access to it, sorry, a zero if you don't have access to it, and one if you have access to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 160.53,
    "end": 167.856,
    "text": " OK, but what if we have new things that is not very useful if you're interested in innovation or something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 168.417,
    "end": 174.302,
    "text": "So we'll have to make specific that will try to specific questions that you want to ask to the model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 175.283,
    "end": 180.988,
    "text": "And using Active Inference does not change a thing to that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.01,
    "end": 194.496,
    "text": " And where it is relevant is that you can have endogenous evolution of constraints using Act-in-France.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 195.216,
    "end": 207.062,
    "text": "I think in a more meaningful sense than you'd have with a pure, let us say, Hebbian or non-representational framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 207.503,
    "end": 212.606,
    "text": " or a framework that is representational, where the space representation is like hard-coded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 213.786,
    "end": 235.898,
    "text": "So there is a space of models, let us say, of evolution of social norms, where I think Active Inference would have an edge, because Active Inference is built to represent normativity and intentionality, and it is not the case, to my knowledge, of other, like either dynamicist or cognitivist frameworks for modeling.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 241.581,
    "end": 245.323,
    "text": " Could you maybe restate and go into a little more detail?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 246.164,
    "end": 250.347,
    "text": "Was it non-representational or indirect specification of what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 252.868,
    "end": 255.23,
    "text": "Of the beliefs of the system.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 256.291,
    "end": 258.192,
    "text": "So what's being directly specified?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 258.472,
    "end": 259.593,
    "text": "What's directly specified?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 259.613,
    "end": 261.994,
    "text": "And then what is being indirectly specified?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 263.695,
    "end": 264.376,
    "text": "Inactive inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 266.465,
    "end": 293.729,
    "text": " active inference you have at least in a sense uh correspondence between dynamical constraints like information over where system is and belief that the system holds that are akin to norms are like international states so beliefs our intentions are things that are going on inside and to my knowledge there is no framework that makes an explicit",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 294.758,
    "end": 304.205,
    "text": " For more connection between the two, you'd have dynamicist framework, where you have stuff that happens, and there is no representation or intentional states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 304.946,
    "end": 322.679,
    "text": "And you have things like utility theory, where you have to specify preemptively what are the intentional states of the agents, which are not very relevant to represent the emergence evolution of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.122,
    "end": 346.798,
    "text": " social constraints within a collective system uh so um situation where active inference would be useful is to model i'm uh i will try to remember the term that kaufman used kaufman filling and filling in um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 353.464,
    "end": 356.385,
    "text": " So I will share the, can we both share the screen?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 356.505,
    "end": 357.185,
    "text": "No, we can't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 357.765,
    "end": 363.447,
    "text": "You can add it directly in this Coda page.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 366.628,
    "end": 368.688,
    "text": "I'll be a little easier then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 370.429,
    "end": 376.09,
    "text": "Just go to the backend course Coda page and then follow the token.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 376.13,
    "end": 376.31,
    "text": "Yep.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 377.491,
    "end": 379.771,
    "text": "And then go to the questions table and pop it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 380.171,
    "end": 382.212,
    "text": "I don't have the questions that is on your screen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 386.792,
    "end": 391.514,
    "text": " Just click on this little expansion.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 391.914,
    "end": 394.095,
    "text": "Challenges and potential solutions, and then pop it out.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 403.998,
    "end": 404.938,
    "text": "Pop out what?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 407.539,
    "end": 410.38,
    "text": "Just next to the row, see this expand row?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.521,
    "end": 412.661,
    "text": "And then you'll be in the same place.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 415.051,
    "end": 416.052,
    "text": " What is the row C?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 417.132,
    "end": 418.273,
    "text": "There is no letters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 418.793,
    "end": 419.573,
    "text": "No, no, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 419.613,
    "end": 422.315,
    "text": "Just look visually at the expand row.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 422.335,
    "end": 426.697,
    "text": "Look visually at the expand row.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 427.317,
    "end": 428.918,
    "text": "Just click the expand row.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 432.896,
    "end": 434.357,
    "text": " on the question that we're addressing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 434.717,
    "end": 436.397,
    "text": "And you'll pop into this campus.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 437.478,
    "end": 442.58,
    "text": "The question that we are addressing is not on the page, at least on my terminal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 443.54,
    "end": 447.041,
    "text": "Are you looking at the public front end or at the course back end?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 447.161,
    "end": 448.542,
    "text": "I'm looking at the back end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.302,
    "end": 449.582,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 449.622,
    "end": 451.983,
    "text": "And I do not have the question what are blah, blah, blah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 455.845,
    "end": 457.345,
    "text": "Oh, it is a sub question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 458.726,
    "end": 459.526,
    "text": "What are the challenges?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 459.666,
    "end": 459.986,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 461.167,
    "end": 461.667,
    "text": "Okay, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 461.907,
    "end": 462.167,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 467.426,
    "end": 468.806,
    "text": " You were talking about Kaufman, though.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 468.946,
    "end": 469.486,
    "text": "What was it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 471.327,
    "end": 485.69,
    "text": "Yes, it's a paper that he co-signed, whose main author is Tepoferin, a critic of economic, like, I say rationality, but no, they say it's Bolin rationality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 486.45,
    "end": 492.872,
    "text": "So the Dictionary of Cognitive Biases, Approach to Modeling Human Behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 494.113,
    "end": 503.175,
    "text": " And basically, the point of the paper, as I understand it, is that you have an evolution of the goals and norms that shape a social ecology.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 504.296,
    "end": 520.18,
    "text": "And this kind of open-ended evolution of the intentional states of the agent, I think, can be addressed in a more meaningful way with Active Inference than with any other formal framework, kind of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 532.742,
    "end": 553.412,
    "text": " there are several other aspects i think so first to kind of restate the the challenges and then go to the potential solutions and the advantages um like the advantages in principle and in practice you started with identifying like the major any kind of modeling",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 554.83,
    "end": 578.312,
    "text": " challenges so active inherits from all of these modeling challenges or areas that are difficult to step aside from and then depending on the resources of the group and whether it's 2023 or 2000 you know future time when there's different tooling so that is just about the the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 579.073,
    "end": 606.919,
    "text": " challenge of active inference sometimes compared today with more off-the-shelf approaches which also may or may not work but in an active you'll be spending your time making something that may or may not work may or may not be orders of magnitude more just sophistication of a modeling setting then the team is ready to again that's a general modeling point but it's also very easy to get into with active and to jump the gap between something that is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 607.859,
    "end": 636.769,
    "text": " pedagogical and helps show something like intuitive or cool and making something for example that can be used in high reliability settings and that's a jump that hasn't been necessarily conveyed in the open source setting so it's difficult to see examples of whereas there's kind of like production type machine learning algorithms that can at least be no that's just a little general point so what are some advantages",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 640.196,
    "end": 659.492,
    "text": " there's some really interesting concepts related to this like indirect specification so like let's just say that we were talking about the mountain car example or a social variable that seemed to be moving within a certain range then the direct encoding of that constraint",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.655,
    "end": 675.334,
    "text": " would um be basically made outdated okay now the landscape changes and then all of a sudden the mountain car can go twice as far to a different direction so if that constraint had been explicitly encoded about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 676.115,
    "end": 703.776,
    "text": " cognitive variables or about the x position the mountain car then the model goes stale but if what's encoded is somehow a relation with the agent in the environment so the mountain car has 10 horsepower and it can go left or right as its affordances and everything that builds from there and then here's the laws of physics or mechanics such that here's the weight of the car and and then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 705.638,
    "end": 714.065,
    "text": " if the landscape changes or is modeled as changing, then you get, oh yeah, now it can go further or shorter in this direction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 715.586,
    "end": 731.618,
    "text": "But that's like an outcome of the relationship between the agent and the environment explicitly represented as such versus just looking at the outcome and then putting constraints on the outcome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 731.638,
    "end": 734.28,
    "text": "Mm-hmm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 736.089,
    "end": 736.93,
    "text": " Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.21,
    "end": 750.198,
    "text": "To say, we have historically the concept of explanation that we have inherited from the 19th, 20th centuries that we explain by having a lawful relationship between variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.599,
    "end": 755.021,
    "text": "And to do that, we have to pre-specify what are the relevant variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 755.901,
    "end": 761.065,
    "text": "And this is not a thing that exists with open-ended evolutionary dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 762.005,
    "end": 762.746,
    "text": "This is all in the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 764.014,
    "end": 786.094,
    "text": " going to call you a cognitive agency something something paper so um and so when we ask questions to a model we don't want to have the answer yeah it will evolve and justly we don't really know this is not what is expected basically so we tend not to look at upper-ended evolution dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 787.378,
    "end": 804.697,
    "text": " I would say that ActiveInference has some leverage to represent that, that other frameworks could not have because of the relationship between constraints as a clinical thing and beliefs as an intentional state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.462,
    "end": 837.587,
    "text": " yeah one thing that makes me think of so when we're when we're doing modeling based uh outcome based modeling whether for hobby or for grad school for job like we're often in a setting that either expects or rewards or accepts only a converging",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.093,
    "end": 858.688,
    "text": " answer because uh because it's being you know does insulin in drosophila change their circadian this or that it's like that's it's very it's very converged of a question already and it's something where we're looking to reduce her uncertainty about um so then that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 861.73,
    "end": 888.591,
    "text": " um closes off i mean to the extent that it converges it closes off divergent routes not just of like doing and addressing that question that's more of a methodological point but it then we we don't um make models that can see a more open-ended horizon of what could actually happen in the system because that always adds more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 890.797,
    "end": 913.002,
    "text": " state spaces that can be broken and unfolded so i guess again to the kind of kernel of the question you've written these very interesting sequence of papers about symmetry breaking and and all of this so how do you use that in a way that goes beyond just stating larger and larger state spaces",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 915.063,
    "end": 923.566,
    "text": " Or feeling less and less confident when it seems like a large piece of this is that certain aspects of systems are unprestatable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 926.626,
    "end": 928.227,
    "text": "Sorry, confident about what precisely?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 930.007,
    "end": 930.748,
    "text": "Unprestatable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.348,
    "end": 933.608,
    "text": "Unprestatable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 933.748,
    "end": 935.049,
    "text": "Yes, I'm confident that...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 938.14,
    "end": 945.248,
    "text": " You cannot prestate the space of possibilities or space of beliefs that an agent can have and model of an evolution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 946.109,
    "end": 955.781,
    "text": "Something that could, like, that is by definition of the terms, something that could be argued is that there is no such thing as an evolution, but that would be a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.146,
    "end": 972.015,
    "text": " That would be a very bold thing to claim and most people would not say that explicitly ever because it's kind of obviously not the case.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 973.076,
    "end": 974.737,
    "text": "If there is an argument for it, I'd like to hear it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 978.68,
    "end": 986.645,
    "text": "But the arguments that are stated against the open-ended evolution thing are",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 991.785,
    "end": 991.867,
    "text": " Um,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 996.463,
    "end": 1022.718,
    "text": " Basically, you have, I would say, all rely on a confusion between the fact that the law of physics works, which they do, and the idea that the specific language that physics talks is a full and objective representation of everything there is or could be, which is like it's a possibility, we can discuss about it, but this is a distinct possibility that the statement that the law of physics works, which again they do.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1028.863,
    "end": 1030.024,
    "text": " Okay, cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1030.064,
    "end": 1047.173,
    "text": "Well, then just to sort of close on this, Octinf advantages, many interesting conceptual advantages, we hope, analytical and more transdisciplinary or more holistically.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1047.854,
    "end": 1056.759,
    "text": "And also another huge piece is it's connected to an always improving open source computational environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1057.83,
    "end": 1058.691,
    "text": " We expect and prefer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1059.893,
    "end": 1074.692,
    "text": "But in that case, linking a system in year X, social system or model, it's kind of like using a Linux system that there could be some developments like in message passing algorithms or interoperability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1075.553,
    "end": 1104.322,
    "text": " of different generative models or category theoretic augmentation of models that are connected to the active inference ontology all these different kinds of synthetic technologies which we can basically already imagine and to some extent already have it becomes a way to map systems to um a lot and that that is not as far as i understand um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1105.782,
    "end": 1134.519,
    "text": " plausible without kind of a first principles and the ecosystems of shared intelligence and all these other kind of memes and themes that we talk about all the time surprise minimization things doing as most likely for them to do paths of least action bayesian mechanics then there's a continuity of explanation with the rock just being there and the investor trading with this strategy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1135.72,
    "end": 1159.075,
    "text": " an instrumental unifying account that makes relatively minimal claims about the territory that includes the rock and the investing activity what'd you add in uh but um like what you saw the message passing is uh interesting to me because",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1159.994,
    "end": 1168.118,
    "text": " You have a broad coalition of physicists, mathematicians, scientists, people in academia who basically think there is one language to nature.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1168.559,
    "end": 1170.7,
    "text": "And what we do as scientists is to discover it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1171.9,
    "end": 1176.323,
    "text": "And I don't think that holds water, not only because evolution is a thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1177.663,
    "end": 1179.484,
    "text": " which is a sufficient argument, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1179.624,
    "end": 1201.609,
    "text": "But if you look at message passing, if you look at quantum mechanism, if you look at category theory, you open formally and conceptually the possibilities that there are different languages in the world and they may be more or less interoperable and they may be non-reducible to each other.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1203.05,
    "end": 1206.992,
    "text": " And then you start to ask questions, I'd say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1207.012,
    "end": 1218.919,
    "text": "Especially when implicitly or explicitly you are interested in what determines the fact that a specific language works in a specific context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1219.459,
    "end": 1226.243,
    "text": "I'm not going to go further down the math road.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1231.111,
    "end": 1241.96,
    "text": " You have important compatibility slash interoperability results between major fields of physics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1243.981,
    "end": 1247.284,
    "text": "I will give a reference by John Baez.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1247.964,
    "end": 1249.345,
    "text": "I don't know how to pronounce it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.425,
    "end": 1251.747,
    "text": "I never said this out loud, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.467,
    "end": 1252.648,
    "text": "Baez.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1252.668,
    "end": 1252.768,
    "text": "Baez.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1259.966,
    "end": 1265.468,
    "text": " So you have important interoperability results in fields of physics and formal science.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1267.629,
    "end": 1280.295,
    "text": "And we don't have a proof, however, that all possible representations of physics are interoperable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.036,
    "end": 1282.676,
    "text": "How do you say that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1282.996,
    "end": 1283.977,
    "text": "Interoperable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1284.437,
    "end": 1285.177,
    "text": "Interoperable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1286.258,
    "end": 1286.938,
    "text": "Interoperable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1287.018,
    "end": 1288.659,
    "text": "OK, so they said it's wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1290.29,
    "end": 1292.431,
    "text": " No, it's a great point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1292.611,
    "end": 1298.534,
    "text": "And what's really interesting is like the relationship between Bayes graphs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1299.034,
    "end": 1308.558,
    "text": "First off, Bayes graphs being analytically described and then computationally implementable is on the order of decades old.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1309.199,
    "end": 1318.103,
    "text": "And then as we kind of explored just yesterday in live stream 55.0, the relationship between the Bayes graph",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1318.923,
    "end": 1337.171,
    "text": " and Forney graphs, which enabled message passing to be done procedurally to optimize a Bayes graph, which just brings all of these computational, all these analytical connections, but that wasn't understood until it was, and that was only slightly over two decades ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1338.672,
    "end": 1346.756,
    "text": "So then, in fact, those kinds of results and developments reflect",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1349.959,
    "end": 1378.651,
    "text": " the changing social and scientific niche so I don't know maybe this is a different question but science as a social activity and then I don't know how does that ground our work or give us more what so about the whole language thing I don't know where",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1379.457,
    "end": 1399.833,
    "text": " It's at now, but at least 10 years ago, it seemed that you can have message passing, you can have bias and coherence of state of observable that does not rely explicitly on the probabilities as in a distribution that is embedded in a specific set space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1400.194,
    "end": 1405.358,
    "text": "You can have bias and coherence that pre-exists to the representation in which probability is embedded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1406.811,
    "end": 1423.837,
    "text": " And if there was a way to cross this and message passing, you'd have a pretty straightforward road to a straight turn count of contextuality and social construction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1424.057,
    "end": 1425.358,
    "text": "I say this with scare quotes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1427.74,
    "end": 1441.376,
    "text": " great note exciting for um quantum context and quantum social and scripts and constraints and norms let's close that question for now though nice okay um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1445.595,
    "end": 1468.909,
    "text": " how can oh yeah great question thank you to whoever asked and again video description you can ask it'll appear and we'll see if anyone writes more questions during the stream how can or does a framework slash Theory slash principle of everything articulate with moral normative ethical deontic considerations",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1476.445,
    "end": 1489.098,
    "text": " So I think it is addressed in a good amount of detail by an activist, how you relate a theory of biological individuation to a theory of ethics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1490.94,
    "end": 1496.666,
    "text": "I do not have a good grip on this literature, so I have nothing to say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1498.655,
    "end": 1528.304,
    "text": " high level intuitive uh opinion on that but this is not like state of the art and um okay basically i'd uh i'd say this flows well with uh stoic uh virtuatics things act according to the nature so you might as well uh work so that your nature is good and then you have a recursivity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1529.292,
    "end": 1531.354,
    "text": " in counting what is good and what is not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.074,
    "end": 1536.958,
    "text": "And I do not see a straightforward analytical way to resolve this ambiguity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1538.279,
    "end": 1539.58,
    "text": "I said circularity or ambiguity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.72,
    "end": 1540.501,
    "text": "Both apply.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.066,
    "end": 1547.366,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1547.426,
    "end": 1558.255,
    "text": "So I think Evan Thompson has worked on that and may have a much better answer to how",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1559.465,
    "end": 1577.698,
    "text": " relate theories of being and theories of physics oh very loaded actually yeah i guess my sort of short answer would there there would be for first just",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1579.338,
    "end": 1608.608,
    "text": " we would have to hear a lot more even possible perspectives but without even hearing them can at least maybe say that there is an articulation and a meter stick as an instrument and this kind of goes actually to that question about the base spaces and uh what is preconditioned so in what ways is the meter stick um articulate with downstream",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1610.996,
    "end": 1632.029,
    "text": " ethical frameworks what ought to be done it was just normative more broadly um there's downstream decisions that the meter stick is agnostic to and then the meter stick is also a social results that is itself downstream of other norms and constraints",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1633.393,
    "end": 1647.823,
    "text": " biotic abiotic constraints regularities of space time i would say there is um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1650.29,
    "end": 1664.481,
    "text": " What we can do with a theory of sense-making, be it active inference or inactivism, is to just describe what we mean by normativity, analytics, what are the underlying natural processes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1665.422,
    "end": 1667.924,
    "text": "When I say natural, I do not mean by opposition to social.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1668.024,
    "end": 1671.807,
    "text": "Those processes are biological and social at the same time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1675.743,
    "end": 1690.634,
    "text": " That may bring reflexivity or distance to account of normativity, that may prove some of them incoherent or ill-advised, that will not give you a solution to what is ethical and what is not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1692.215,
    "end": 1696.318,
    "text": "Notably because the most natural way to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1698.522,
    "end": 1727.154,
    "text": " derive ethics from something like an activism or something like it in france is that you both those framework are centered around biological individuation so we may say that logical individuation is good actually that sounds sensible but then the question is biological duration for whom because you have a right i guess our desire will at least to exist but so does cancer cells within your body who jumps who",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1727.794,
    "end": 1728.214,
    "text": " I don't know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1728.715,
    "end": 1732.937,
    "text": "Not from a purely scriptural account.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1732.977,
    "end": 1742.141,
    "text": "There is no way you can straightforwardly, anonymously derive a prescriptive notion of good from any physics, any descriptive account of the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1744.54,
    "end": 1751.663,
    "text": " You will have, when you make normative claims, you have goals because you are a living thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1751.743,
    "end": 1761.767,
    "text": "And because of active inference slash negativism, we know that cognition is embedded in normativity, in the autonomy, in the biological activity of the agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1762.807,
    "end": 1769.75,
    "text": "So the theory that you are framing is in some way motivated, even if you don't know how or admit that it is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1770.954,
    "end": 1781.583,
    "text": " And then I'd say from there, it does not quite destroy the project of an objective system of ethics, but it makes it much harder to defend",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1784.136,
    "end": 1797.719,
    "text": " So yeah, I'd say you can derive a lot of negative results from descriptive theory of, I wouldn't say ethics, because ethics are non-descriptive, but descriptive theory of how ethics come to be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1798.879,
    "end": 1805.261,
    "text": "I would say that it is hard, if not impossible, to derive positive results.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1806.861,
    "end": 1810.002,
    "text": "If someone tried to do it, I'd like to see what this is.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1815.287,
    "end": 1842.595,
    "text": " wow thank you avil that last piece was very interesting many results many many ant colonies with their behavior to model many real situations to understand social constraints and norms in instrumentally with descriptions that are then in the discussion section of the paper",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1843.94,
    "end": 1858.372,
    "text": " and the data are the data and those are the descriptive aspects it's a different kind of data in a slight way but there's already enough to describe and interpret from what would be merely described and it is very hard to derive positive",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1861.078,
    "end": 1884.869,
    "text": " results first it's a hard domain to make positive results in not not just ones that make people feel good but by positive like positivism like um justified true assertions about a metaphysical space so it's hard to derive positive results about normativity and the kind of areas that this person asked these are all areas that are are um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1888.274,
    "end": 1915.246,
    "text": " and it's hard to use a quantitative theory which is almost it's an abstraction or it's just one language it's hard to use that to make positive results external to the system harder to make external to the system positive results internal to the system are dime a dozen but then to really make that reflexive loop that you described",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1917.122,
    "end": 1944.883,
    "text": " between the um the what is and what what we expect and prefer which is actually woven up in an interesting way in act inf rather than two kind of diverged timelines like what we quote expect to happen like a prediction of the likeliest future and then a second timeline that's like well what what I would really prefer to be doing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1946.932,
    "end": 1955.237,
    "text": " In ACT-INF, the agent just has one expectation slash preference, which loads up on the pragmatic value.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1957.619,
    "end": 1966.825,
    "text": "But that gives a unified approach towards one's expectations of how things will be and what they expect slash prefer them to be.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1979.232,
    "end": 1987.517,
    "text": " I would say that at vibe check level, Active Inference flows well with the idea that empowerment is good, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1989.759,
    "end": 1995.142,
    "text": "But make it a formal relation would be quite hard.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1997.303,
    "end": 2004.168,
    "text": "You could say that Active Inference vibes well with the notion that everyone knowing their place is good, which is quite the opposite.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2005.996,
    "end": 2016.939,
    "text": " So I don't see an ambiguous relation between active inference and any ethical framework I can think of.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2018.98,
    "end": 2032.224,
    "text": "I would say, again, that it flows well with a virtue ethics framework because of the relation between one's action and one's nature, according to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2033.004,
    "end": 2034.985,
    "text": "Nature being here in a term that is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2036.769,
    "end": 2044.751,
    "text": " Maybe not the best term, but I'm literally using a traduction of a Before Christ text.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2044.911,
    "end": 2047.372,
    "text": "So yeah, nature is not that bad.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2048.332,
    "end": 2054.874,
    "text": "Just not what we mean in the context of 19th, 20th discussions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2058.955,
    "end": 2063.776,
    "text": "Yeah, that's a very complex topic with definitely a lot of rich work on like",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2065.62,
    "end": 2093.926,
    "text": " are cities and people nature are humans animals and uh that sort of homo sapiens type discourse and then how does active inference frame the relationship with the niche in terms of entanglement or communication or co-action intra action communication and influence through",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2095.748,
    "end": 2116.953,
    "text": " blanket what where does that go beyond just describing it doesn't have to I think a sort of base level and what you refer to here is like that artifact the product of the work which is what the work is about can be a jumping off point",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2118.405,
    "end": 2138.648,
    "text": " or other directions and so the work of active inference modeling can be in what it leads to it's not always internal to the model that the improved awareness or better decision is realized",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2147.554,
    "end": 2157.377,
    "text": " I can see one quite straightforward, and I don't think it is an entirely broken way to relate ethics to active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2159.138,
    "end": 2169.501,
    "text": "Ethics... Like, not ethics, normativity as a social phenomenon, it is a collective phenomenon, it's about social relationships.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2171.022,
    "end": 2175.303,
    "text": "And you could apply a descriptive theory",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2176.34,
    "end": 2191.929,
    "text": " of human behavior, like human social aggregated collective behavior, to find out what traits in a organization are prone to survival or adaptivity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2192.69,
    "end": 2200.615,
    "text": "And you could say that those traits are good actually by construction of what we mean by ethics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2201.255,
    "end": 2202.616,
    "text": "That could be a coherent claim.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2203.706,
    "end": 2210.63,
    "text": " And then you could be interested in what traits make an organization durable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2213.392,
    "end": 2227.341,
    "text": "This is the only logically straightforward way I see, but that would tend to identify as good things that I would not see as good, like feudalism.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2227.621,
    "end": 2228.942,
    "text": "It lived quite a long time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.443,
    "end": 2231.764,
    "text": "Well, feudalism, let us say.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2234.525,
    "end": 2242.107,
    "text": " old school empires with no claim to representations or power by the, how do you say, populace.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2244.348,
    "end": 2255.411,
    "text": "And you could integrate, you could basically renormalize this theory, not around clock time, but around",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2258.106,
    "end": 2263.271,
    "text": " I don't know the metric of lifetime, how much things happen within the organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2264.472,
    "end": 2268.255,
    "text": "And then you'd start having something that is less obviously wrong.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2269.816,
    "end": 2280.426,
    "text": "And you could have basically ethics be about optimization of specific parameters that can be addressed by a descriptive framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2281.306,
    "end": 2284.069,
    "text": "But you'd have to make a lot of jumps to get there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2285.925,
    "end": 2296.451,
    "text": " And while I do not see an obvious problem to that, it is very possible that we would not like the conclusion of such an optimization thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2297.432,
    "end": 2305.416,
    "text": "And again, if you want to model something, you have to decide what are the parameters of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2306.737,
    "end": 2308.058,
    "text": "And you can be wrong about that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2309.038,
    "end": 2315.482,
    "text": "So here again, you do not have an ambiguous, even at a purely descriptive level, you do not have an ambiguous application of anything to anything.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2320.694,
    "end": 2323.655,
    "text": " Would say that more empowerment is good, actually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2327.437,
    "end": 2331.099,
    "text": "And I would say this goes at many nested scales of organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2334.521,
    "end": 2345.866,
    "text": "And I would say it has somehow something to do to the physics of biological individuation, but only in a vibe check way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2348.894,
    "end": 2368.63,
    "text": " nothing wrong with that um yeah especially with some of the recent work like the variational synthesis with eco evo devo and the connections between the statistical concepts of persistence or thinkness from free energy principle",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2369.793,
    "end": 2398.506,
    "text": " related to re-measurement of the observer or the organism of themself that concept of repeated measurement being compatible in our work and and in other related works basically with fitness if there's a height distribution of trees in the forest and then a certain time point later the height distribution is the same that was stabilizing dynamics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2399.54,
    "end": 2402.562,
    "text": " we could say stabilizing evolution or stabilizing selection.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2403.762,
    "end": 2405.564,
    "text": "If it moved, it moved.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2407.865,
    "end": 2424.134,
    "text": "And so how do, since there is such a coupling between things being as they are and basically what the distribution of what is there is described both this stoic way, but also this kind of evolutionary biology way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2425.535,
    "end": 2428.417,
    "text": "So does active inference offer any",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2430.265,
    "end": 2450.574,
    "text": " other or complementary perspective other than just the kind of strengths and weaknesses of the of using fitness phenotypic fitness or mimetic fitness as its own justification",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2454.042,
    "end": 2457.505,
    "text": " To say that is to say that something is good because it exists.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2458.126,
    "end": 2460.148,
    "text": "This is not a strong position to take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2462.269,
    "end": 2474.56,
    "text": "So this is why you'd have quite high level of difficulty to derive anything prescriptive from anything descriptive.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2475.701,
    "end": 2476.903,
    "text": "The function is not the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.803,
    "end": 2478.444,
    "text": "You can make",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2479.369,
    "end": 2499.158,
    "text": " relation between the two, no ethics is purely blind about nature, no fear of nature is purely ethically unmotivated, but to have formal relation between the two is probably not possible, at least highly non-trivial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2504.58,
    "end": 2506.921,
    "text": "Okay, so to kind of close on this question,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2509.16,
    "end": 2530.08,
    "text": " How does the free energy principle as a principle for everything and active inference as an implementable framework for applying free energy principle systems, how does that articulate with these broader, very deep and fundamental human social contexts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2530.621,
    "end": 2531.802,
    "text": "Short answer seems to be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2535.051,
    "end": 2561.625,
    "text": " it's a lot like other scientific ideas inherits a lot of their challenges and frictions and and situations also there appear to be some interesting promising routes or themes to weave in however even with a very charitable or optimistic interpretation there seems some in principle challenges with these areas",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2563.308,
    "end": 2583.515,
    "text": " that make certain kinds of claims perhaps not even within the proximate understanding we have of active inference but people should totally write in the live chat or add comments and stuff i mean it's just interesting question okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2597.646,
    "end": 2613.113,
    "text": " are higher order beliefs about doing better than expected at PEM, probably prediction error minimization, integrated into the architecture of the agent's internal model of external dynamics and itself in those dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2614.073,
    "end": 2641.728,
    "text": " my thought here is that we have prior beliefs to fulfill certain self-evidencing expectations eg homeostatic predictions but how do those interact with these higher order predictions which appear to my mind to deny or negate the fundamental priors insofar as they predict the agent to go over and above the levels of prediction error minimization which otherwise might be achieved by fulfilling those fundamental priors",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2646.55,
    "end": 2647.391,
    "text": " They gave their thought.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2647.811,
    "end": 2649.693,
    "text": "Let's return to the original question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2653.636,
    "end": 2654.457,
    "text": "I do not know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2654.877,
    "end": 2669.109,
    "text": "Like, I know that a comparison to a baseline homeostatic level of prediction randomization is a quite important thing in computational psychiatry, notably in the work of Parkinson's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2670.431,
    "end": 2674.054,
    "text": "I do not know how that's implemented, actually, in computational models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2675.362,
    "end": 2695.351,
    "text": " so i'd uh rather not answer personally uh ben white should be more informed about these things yeah or maybe you don't know well i mean the word that seems to be doing the work is integrated",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2697.085,
    "end": 2705.453,
    "text": " So higher beliefs about doing better than expected at prediction error minimization, or we can just say free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2706.194,
    "end": 2712.26,
    "text": "So this was explored in the affective inference work.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2713.401,
    "end": 2714.442,
    "text": "So if the...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2716.093,
    "end": 2744.33,
    "text": " um free energy was um decreasing as expected it was associated with neutral valence if things were improving better than expected it was associated with positive valence and if things were doing worse than expected it was negative valence so because of the ability to make hierarchical active models",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2746.175,
    "end": 2772.78,
    "text": " and just hierarchical bayesian models in general it is possible to talk about these beliefs about beliefs metacognitive beliefs so it is possible to make models that have expectations about how well even an optimization process is going to go and then a computational psychiatrist or whatever may associate that with the affect how is that integrated into",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2775.356,
    "end": 2804.39,
    "text": " the agent's internal model of external dynamics well shortest answer is to sketch it out how one sees it and then it becomes either there or not but just in general if the internal model includes these higher order beliefs about doing better than expected then that's the agent's generative model that then interfaces or articulates with external dynamics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2808.055,
    "end": 2816.418,
    "text": " So you could have some environment that has a environmental regularity or dynamics that are influenceable or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2817.499,
    "end": 2827.603,
    "text": "And then you could deploy two agents, one of them that has the baseline generative model and the other one has this doing better than expected layer that the questioner is asking about.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2828.543,
    "end": 2832.705,
    "text": "And then they can do parameter sweeps and maybe adding this higher order belief",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2833.553,
    "end": 2855.765,
    "text": " increases the state space a lot and so it increases the computational cost a lot but some interesting pockets of behavior are found or the behavior in that setting ends up looking the exact same but in another setting it would have been different a lot of these questions point towards very important modeling questions",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2856.94,
    "end": 2884.262,
    "text": " which can basically only be pointed at because so much is going to depend on what the actual model is okay um where can i find the recommended reading list mentioned in the lectures",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2899.443,
    "end": 2923.534,
    "text": " so where we have the um slides from the lecture they're in live streams just go to the big table and find the slides if you find a lecture that doesn't have slides just let us know we'll we'll add it um where things were just mentioned in the lectures",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2924.537,
    "end": 2940.578,
    "text": " that's a great question and our goal at the active inference journal beyond just transcribing and publishing and adding captions and translating and everything of these live streams we would like to also do more bibliographic work",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2941.639,
    "end": 2965.409,
    "text": " so that the books that people mention we can also have in that open source versioned journal so we generate the first version the transcript people update it improve it oh what was the name of that author what book are they talking about here and then we can actually have a unified bibliography section or the stream so that sounds interesting to you",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2966.764,
    "end": 2970.126,
    "text": " And you'd benefit from it, then surely many, many others will too.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2970.266,
    "end": 2977.351,
    "text": "So if you're excited to do that kind of active inference journal work, I highly encourage slash recommend it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2979.872,
    "end": 2980.713,
    "text": "Evel, what else will you add?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2984.215,
    "end": 2984.495,
    "text": "Same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2985.836,
    "end": 2986.897,
    "text": "I can have nothing to add.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2987.717,
    "end": 2987.937,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2990.619,
    "end": 2990.819,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2992.2,
    "end": 2992.38,
    "text": "Well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2995.441,
    "end": 2999.703,
    "text": " We can look at some of the other questions that were added that others wrote.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3000.404,
    "end": 3010.068,
    "text": "People in live chat can add question or they can go to the course website and ask a new question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3014.911,
    "end": 3025.056,
    "text": "Do you want to look at one of the previous ones or do you have any other thoughts you want to bring up?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3027.205,
    "end": 3027.885,
    "text": " Not really.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.965,
    "end": 3041.61,
    "text": "The first ones were answered, so I don't like... And they were asked weeks ago, so there is a relatively low likelihood that going over them again would be very helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3042.33,
    "end": 3043.991,
    "text": "Do you think we can cut the discussion?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3045.811,
    "end": 3046.072,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3046.812,
    "end": 3050.713,
    "text": "But the important things that are not treated now can be treated in conclusion anyway.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3052.834,
    "end": 3055.875,
    "text": "Okay, so what are the next steps then for the course?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3057.904,
    "end": 3062.686,
    "text": " Next up is, did a lot of people register for the presenting in the conclusion session?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3065.768,
    "end": 3069.55,
    "text": "I haven't gotten any specific responses or titles yet.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3071.09,
    "end": 3074.892,
    "text": "OK, so we see if people do that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3076.173,
    "end": 3086.498,
    "text": "Yeah, we can write another message, including even a short video message or just a written one, and then also ask specific people.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3088.228,
    "end": 3113.712,
    "text": " also if anyone is like interested to present something but they're not really sure the format or they want pre-recorded we're just kind of exploring and seeing what the people who are following along live want to do and also trying out things that we think futures will want to do too so if someone has an idea on that we're definitely open to it",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3123.689,
    "end": 3124.35,
    "text": " Any last thoughts?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3127.675,
    "end": 3128.617,
    "text": "Nope, I'm good.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3129.458,
    "end": 3129.698,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3130.94,
    "end": 3131.161,
    "text": "All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.162,
    "end": 3132.583,
    "text": "Thank you then.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3132.603,
    "end": 3135.327,
    "text": "See you, Abel.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3135.708,
    "end": 3136.008,
    "text": "Ciao.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3136.81,
    "end": 3136.99,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  }
]