[
  {
    "start": 39.417,
    "end": 39.698,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 40.5,
    "end": 41.141,
    "text": "Hello, everyone.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 41.181,
    "end": 41.522,
    "text": "Welcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 42.13,
    "end": 44.232,
    "text": " This is ACT-INF livestream number 51.1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 45.933,
    "end": 52.298,
    "text": "We are in the second discussion of this paper, Canonical Neural Networks Perform Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 53.539,
    "end": 55.581,
    "text": "Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 56.282,
    "end": 61.846,
    "text": "We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 62.447,
    "end": 64.629,
    "text": "You can find us on this slide.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 65.029,
    "end": 67.371,
    "text": "And this is recorded in an archived livestream.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 68.031,
    "end": 70.473,
    "text": "So please provide us feedback so we can improve our work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 71.414,
    "end": 76.017,
    "text": " All backgrounds and perspectives are welcome and will follow good video etiquette for live streams.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 77.278,
    "end": 84.543,
    "text": "Head over to ActiveInference.org to learn more about the Institute and how to participate in projects and learning groups.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 86.244,
    "end": 86.484,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 87.537,
    "end": 99.433,
    "text": " We're in act-inf stream number 51.1 and having our first non-solo discussion on this paper, Canonical Neural Networks Perform Active Inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 100.535,
    "end": 101.977,
    "text": "And really appreciative.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 103.078,
    "end": 121.949,
    "text": " to you that you've joined today it's going to be a great discussion we'll begin with introductions i'll say hello and then please just jump in however you'd like and we can start by setting some context so i'm daniel i'm a researcher in california",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 122.769,
    "end": 141.94,
    "text": " And I was interested in this paper because we've been talking a lot about active inference from a variety of different perspectives, from the more fundamental math and physics to some applications, philosophy, embodiment, all these really interesting threads.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 142.821,
    "end": 145.102,
    "text": "And this paper seems to make a really interesting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 145.242,
    "end": 168.364,
    "text": " clear meaningful contribution and connection by connecting active inference entities and this approach of modeling to neural networks which are in daily use globally so thought it was a fascinating connection and really appreciate that we can talk about this today so to you and welcome",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 174.775,
    "end": 177.998,
    "text": " Go for it, Takuya, however you'd like to introduce and say hello.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 178.778,
    "end": 179.779,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 179.999,
    "end": 185.944,
    "text": "Hi, I'm Takuya Isomura, neuroscientist in RIKEN Brain Science Institute in Japan.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 186.945,
    "end": 195.952,
    "text": "I'm particularly interested in universal characterization of neural network and brain using mathematical techniques.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 196.781,
    "end": 213.414,
    "text": " So this work, I believe, is important as a link between active brain-influenced aspect, vaginal-influenced aspect of the brain, and the dynamic system aspect of the neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 213.915,
    "end": 217.838,
    "text": "So I'm very happy to join this discussion session.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 218.118,
    "end": 219.339,
    "text": "Thank you for the invitation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 220.0,
    "end": 220.66,
    "text": "Nice to meet you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 222.342,
    "end": 224.063,
    "text": "Nice to meet you as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 226.656,
    "end": 231.379,
    "text": " The first thing you added, the universal characterization of neural networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 232.56,
    "end": 236.262,
    "text": "What is the universal characterization of neural networks?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 236.383,
    "end": 239.625,
    "text": "Why is it being pursued in this area of research?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 241.506,
    "end": 251.493,
    "text": "So as a narrow sense, my aim, main aim of this paper is that so, you know,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 252.925,
    "end": 269.211,
    "text": " People use active inference formalization to characterize brain activity, behavior, so on, so on, but which would be different from a conventional neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 269.291,
    "end": 272.032,
    "text": "So there is a class of problem.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 273.772,
    "end": 277.895,
    "text": " which is associated with conventional neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 278.355,
    "end": 289.943,
    "text": "And it is not very clear whether all characterization of conventional neural network can be explained by active inference free energy principle or not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 290.223,
    "end": 298.549,
    "text": "So here, universal characterization means that characterization of every aspect of conventional neural network",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 300.309,
    "end": 317.216,
    "text": " which is a kind of dynamical system derived as the association between a physiological phenomena and simple mathematical formula typically using differential equations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 318.391,
    "end": 333.242,
    "text": " As the broad sense, I think universal characterization means that, well, it is the characterization of brain intelligence, but it's a big picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 334.043,
    "end": 341.969,
    "text": "And what the paper particularly addresses is only one aspect of the full picture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 346.485,
    "end": 346.865,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 347.766,
    "end": 355.25,
    "text": "So it'll be great to pull back to really understand what synthesis is happening.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.811,
    "end": 361.194,
    "text": "So I'm going to ask, what makes a neural network model a neural network model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 362.074,
    "end": 365.477,
    "text": "And what makes an active inference model an active inference model?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 366.137,
    "end": 371.12,
    "text": "Is this synthesis and connection you've made true because of what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 374.437,
    "end": 385.283,
    "text": " because basically what we showed is the mathematical equivalence between the formulation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 386.144,
    "end": 402.575,
    "text": " of canonical neural networks and the formulation of active inference, in the sense that we showed that a class of neural network can be characterized by a minimization of some biologically plausible cost function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 403.076,
    "end": 409.4,
    "text": "And we show that that cost function can be read as a class",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 411.543,
    "end": 422.131,
    "text": " variational Bayesian inference under a particular class of generative model in terms of well-known partial observer polymer composition process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 426.293,
    "end": 426.594,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.495,
    "end": 433.699,
    "text": "Shall we perhaps walk through some of the sections of the paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 433.719,
    "end": 439.042,
    "text": "It would be awesome just for each of these sections,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 440.137,
    "end": 446.884,
    "text": " maybe the numbered and the lettered sections, what does the section aim to show and why was it there in the paper?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 452.671,
    "end": 457.696,
    "text": "So yeah, briefly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 460.678,
    "end": 462.019,
    "text": " It's an overview, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 463.599,
    "end": 480.105,
    "text": "So briefly, so first we introduce the main issue, main problem of our interest, which is a relationship.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 480.405,
    "end": 485.987,
    "text": "So we try to make a formal link between neural network and active rainforest.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 486.027,
    "end": 487.348,
    "text": "That's the main",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 488.078,
    "end": 489.94,
    "text": " problem background.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 490.321,
    "end": 499.291,
    "text": "And then we first formulate the equivalence, mathematical equivalence in a very broad manner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 500.072,
    "end": 506.52,
    "text": "So in the first section in result, we formulate the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 508.246,
    "end": 521.653,
    "text": " the relationship using a complete class theorem, which is a well-known statistical theorem proposed very long time ago.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 522.793,
    "end": 535.439,
    "text": "And using that, we link a general form of neural network with a general form of variational Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 537.6,
    "end": 553.845,
    "text": " problem is that this characterization does not address a specific form of generative model, which is crucial to characterize a specific model, specific neural network dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 553.985,
    "end": 556.126,
    "text": "So in the following",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 557.806,
    "end": 573.821,
    "text": " sections, we characterize the problem using POMDP, or Partially Observed Grammar Conditional Process, and link that model with a particular class of canonical neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 576.044,
    "end": 579.987,
    "text": "And then we simulate it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 580.087,
    "end": 581.609,
    "text": "We use the simulation to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 582.264,
    "end": 588.842,
    "text": " to corroborate that property in terms of some main tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 595.333,
    "end": 595.613,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 596.334,
    "end": 597.134,
    "text": "Thank you for this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 598.476,
    "end": 601.958,
    "text": "Could we talk about the complete class theorem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 602.979,
    "end": 606.302,
    "text": "So what is the scope of the complete class theorem?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 607.443,
    "end": 613.708,
    "text": "And why was it the relevant set of the neural networks to pursue or the right way to frame it?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 615.42,
    "end": 617.381,
    "text": " Thank you for asking that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 617.581,
    "end": 624.965,
    "text": "I like the slide you showed in the last week's video.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 626.066,
    "end": 635.951,
    "text": "Completed class theorem basically indicates the relationship between some class of decision rule and Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 637.452,
    "end": 652.526,
    "text": " Here, a crucial keyword is admissibility or admissible decision rule, which is a rule which is as good as other decision rules, or at least",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 660.126,
    "end": 664.988,
    "text": " at one point, better than other decision rules.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 665.008,
    "end": 674.152,
    "text": "So, simply speaking, admissibility indicates, in some sense, it is the best rule for some aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 674.612,
    "end": 683.196,
    "text": "And usually we characterize such a goodness using cost function, loss function, or risk function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 683.776,
    "end": 707.729,
    "text": " And here, what we did is establish some association with this type of loss function or risk function with a function of canonical neural network, which we call cost function or biologically plausible cost function for neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 708.389,
    "end": 713.471,
    "text": " Our assumption is that neural network minimizes cost function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 714.551,
    "end": 730.036,
    "text": "If it achieves the minimization and it is obviously achieves some sort of optimality, we can say it is admissible with respect to that cost function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 732.569,
    "end": 751.409,
    "text": " The beauty of complete class theorem is that if we find some admissible decision, then automatically we can say that it is Bayesian inference in terms of some Bayesian cost function with generative model or prior beliefs.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 752.25,
    "end": 767.937,
    "text": " So this complete cross theorem is crucial as an abstract characterization of the relationship between conventional neural network architecture dynamics and variational Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 767.977,
    "end": 772.259,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 773.08,
    "end": 773.48,
    "text": "Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 775.641,
    "end": 780.103,
    "text": "What does it mean when you said it was biologically plausible of a loss function?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 782.26,
    "end": 807.994,
    "text": " The term is a little bit arbitrary because in this paper, we mean by biological reproducibility in the sense that this neural network model can be derived from realistic neural model through some approximation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 811.053,
    "end": 823.504,
    "text": " Here, biologically plausibility suggests or means plausibility as a neural model or synaptic plus system model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 824.805,
    "end": 836.055,
    "text": "And if this cost function, loss function can derive such a plausible algorithm, then we can say that this cost function is biologically plausible.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 839.901,
    "end": 847.507,
    "text": " So what is the distinction between those neural and synaptic components in the loss function, or what equation to look at?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.909,
    "end": 853.872,
    "text": "You mean distinction between neurodynamics and synaptics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 854.413,
    "end": 858.857,
    "text": "Yeah, what is the distinction between them and how is it represented in the equations?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 860.868,
    "end": 861.308,
    "text": " Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 862.549,
    "end": 881.625,
    "text": "Basically, neural activity equation means a differential equation about a variable that represents firing intensity or some sort of variables associated with neural firing.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 884.028,
    "end": 900.135,
    "text": " On the other hand, synaptic elasticity equation means an update rule about the synaptic weight or synaptic strength, which is a connection between two neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 901.403,
    "end": 926.363,
    "text": " And the beauty of this formulation proposed in this paper is that we characterize both neuroactivity equation and synaptic plasticity equations in terms of gradient descent on a same cost function, a common cost function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 927.284,
    "end": 930.727,
    "text": "So we can say that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 932.834,
    "end": 950.005,
    "text": " If we consider the partial derivative of some cost function with respect to neural activity, then it derives a gradient descent rule about neural activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 950.485,
    "end": 959.311,
    "text": "While if we consider partial derivative of cost function L with respect to synaptic weight, then we derive a synaptic plasticity rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 970.56,
    "end": 977.952,
    "text": " Are those the only two aspects of a neural network or why are those the two key aspects?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 981.218,
    "end": 983.399,
    "text": " It is a main character.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 984.279,
    "end": 1001.947,
    "text": "I think it's a main body of the neural activity if we consider some inference running or action exhibit by neural network in the sense that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1002.687,
    "end": 1008.35,
    "text": " neural activity correspond to fast dynamics, fast gradient dynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1008.95,
    "end": 1017.595,
    "text": "And while synaptic plasticity indicate a slow dynamics that minimize risk function, cost function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1018.175,
    "end": 1024.138,
    "text": "But in general, we can consider any aspect, any variables associated with neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1024.198,
    "end": 1028.5,
    "text": "For example, at least what we show in the paper is that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1028.981,
    "end": 1034.691,
    "text": " any free parameter which may be associated with firing threshold.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1035.072,
    "end": 1040.562,
    "text": "Although we don't discuss in this paper, it would be possible to add other",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1042.561,
    "end": 1060.141,
    "text": " variables related to neural network for example we here we ignore contribution of real factor but it will be possible to add the real factor in this formulation or any other aspect of virus called neural network",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1064.909,
    "end": 1072.997,
    "text": " That's very interesting, and it speaks also to a general separation of time scales.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1073.918,
    "end": 1086.73,
    "text": "For example, in different multi-scale systems or in the renormalization group, where it's describing some minimal multi-time scale system",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1087.631,
    "end": 1103.608,
    "text": " where the faster timescale can be seen as perception like a slower timescale can be seen as more learning like, and then in some hierarchical model, what's learning of one timescale can be perceptual for a slower timescale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.049,
    "end": 1107.172,
    "text": "So it's a very nice generalization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1112.717,
    "end": 1123.083,
    "text": " Are there any examples of decision rules that will help us think about the action components of what the neural network is doing?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1123.784,
    "end": 1135.23,
    "text": "Because it may be more familiar to think about digit characterization and image classification, some kind of classical tasks for neural networks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1136.131,
    "end": 1140.994,
    "text": "But how does the decision rule play out in the context of neural networks?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1146.902,
    "end": 1155.888,
    "text": " In this paper, we basically assume a closed loop, comprising a neural network part and an environmental part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1157.429,
    "end": 1167.276,
    "text": "Neurons receive sensory input from the environment and provide some feedback to the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1171.553,
    "end": 1187.606,
    "text": " Yeah, even with the example of digit classification, we can say that output corresponds to classifier classification output, which is kind of decision rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1188.106,
    "end": 1188.907,
    "text": "More relevant",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1189.768,
    "end": 1200.596,
    "text": " example would be, for example, controlling agent, like a robot control, or any kind of controlling or decision making tasks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1201.256,
    "end": 1214.225,
    "text": "For example, when we encounter some choice task, we need to advertise, for example, left or right, or something, any kind of such a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1215.748,
    "end": 1223.654,
    "text": " decisions can be associated with the admissibility or admissible decision rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1227.377,
    "end": 1237.945,
    "text": "So what would an example of an inadmissible or admissible strategy be in the decision-making task?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1240.026,
    "end": 1242.088,
    "text": "Admissibility",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1243.258,
    "end": 1249.443,
    "text": " usually characterized by loss function or risk function so if",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1252.498,
    "end": 1279.747,
    "text": " so here in admissibility indicate that this there is another decision rule which is uh at least one point better than uh the the the forecast decision rule so yeah simply speaking in other visibility indicate that it's that that decision rule is not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1280.507,
    "end": 1285.932,
    "text": " better, not good, relatively.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1287.073,
    "end": 1290.496,
    "text": "But let's just say our decision rule is we always turn right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1291.829,
    "end": 1310.68,
    "text": " is that an example of a decision rule because there might be settings where that is strictly effective and the simplest rule whereas there's other settings where that's going to be tragic so what does it mean to be admissible for an agent in light of different environmental contexts",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1311.881,
    "end": 1314.183,
    "text": " That's an interesting point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1314.503,
    "end": 1331.517,
    "text": "So even with such a two-month simplified rule, it can be admissible under some particular situation, particular loss function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1332.315,
    "end": 1340.879,
    "text": " For example, the rule that always turn right may be the best under some situation, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1341.579,
    "end": 1355.405,
    "text": "So the relationship of admissibility or inadmissibility depends on both agent characteristic and the environmental characteristic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1359.667,
    "end": 1362.068,
    "text": "What aspects of the environment",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.285,
    "end": 1389.075,
    "text": " For example, if that decision rule matches the structure, architecture of environment, then maybe that decision always turn right, achieve the shortest path under some situation, some environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1392.028,
    "end": 1396.87,
    "text": " How does this admissibility help us think about like overfitting?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1398.431,
    "end": 1408.295,
    "text": "And how does it help us think about the way that different practices are used for neural networks to prevent them from being overfit in practice?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1411.036,
    "end": 1411.356,
    "text": "Well,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1416.892,
    "end": 1424.458,
    "text": " Well, strictly, admissivity is characterized with the Bayesian risk.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1424.979,
    "end": 1435.528,
    "text": "So we cannot observe a hidden state of the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.088,
    "end": 1440.993,
    "text": "Only we can observe a part of the entire",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1443.046,
    "end": 1454.209,
    "text": " So, the question is, important question is, what is the best choice under such a limited information?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1454.329,
    "end": 1459.53,
    "text": "Yeah, information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.63,
    "end": 1466.732,
    "text": "So, this Bayesian list idea or admissibility or complete crest theorem,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1472.557,
    "end": 1477.203,
    "text": " tell us that well-known Beijing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1479.295,
    "end": 1500.628,
    "text": " Only the well-known Bayesian framework achieved the admissibility, admissible decision, which means that in this aspect, Bayesian optimizations give us a best-of-choice strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1500.688,
    "end": 1504.87,
    "text": "Otherwise, we overfeed for",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1508.344,
    "end": 1512.969,
    "text": " would find the suboptimal solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1514.111,
    "end": 1527.266,
    "text": "So it's a nice association, nice linkage between the decision, what is a good decision, and more established statistical inference, Bayesian inference framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1531.479,
    "end": 1531.86,
    "text": " Thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1532.181,
    "end": 1534.128,
    "text": "That's very helpful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1534.409,
    "end": 1537.057,
    "text": "So we're reducing our",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1538.815,
    "end": 1566.701,
    "text": " uncertainty and risk about hidden states in the environment so in the special case where the entire environment is observable without error like a chess game then there's an equivalence between calculation of risk or loss on observables or on hidden states but they're not really hidden but they are environmental states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1567.765,
    "end": 1589.856,
    "text": " Whereas any amount of uncertainty in the mapping between observations and hidden states, which is usually shown as A in the partially observable Markov decision process, any amount of uncertainty about unobserved or partially observed environmental states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1592.429,
    "end": 1619.747,
    "text": " enables you to fit your uncertainty optimally about that hidden state and fit that uncertainty simply with a gradient descent and by doing so you don't overfit a model of observables which might be the fallacy or the issue with simply doing descriptive statistics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1621.004,
    "end": 1630.126,
    "text": " you might get an infinitely small variance with a frequentist estimate because you have 100,000 data points.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1630.746,
    "end": 1636.167,
    "text": "So the variance from a descriptive statistics perspective might be very small.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1641.388,
    "end": 1648.71,
    "text": "I think it speaks very much to why neural networks are useful in practice from training with limited data sets",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1650.253,
    "end": 1654.874,
    "text": " Because that's an empirical observation that they don't entirely overfit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1655.435,
    "end": 1659.896,
    "text": "But also I'm sure there's ways to construct them that are overfit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1661.416,
    "end": 1661.696,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1664.317,
    "end": 1671.599,
    "text": "Overfit would occur if we select some optimal prior beliefs, for example.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1674.02,
    "end": 1676.061,
    "text": "Well, I'm not sure if...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1677.458,
    "end": 1684.422,
    "text": " it is an overfit in the sense that you mentioned.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1685.243,
    "end": 1696.87,
    "text": "Because if we select some prior wave, then the Bayesian function itself changes, and the neural network tries to fit to that cost function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1696.97,
    "end": 1706.756,
    "text": "So cost function minimization would be achieved in such a situation, but that solution is not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1707.516,
    "end": 1711.818,
    "text": " good for our, you know, original purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1713.158,
    "end": 1714.119,
    "text": "That's a tricky part.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1714.919,
    "end": 1730.165,
    "text": "Yeah, that is reminiscent of some discussions we've had discussing like driving off a cliff or blowing up is also reducing free energy, like dropping off a building reduces your potential energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1731.006,
    "end": 1736.288,
    "text": "And so there are potentially decision making or strategic trajectories",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1737.128,
    "end": 1742.491,
    "text": " that do for some time horizon minimize free energy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1743.891,
    "end": 1749.174,
    "text": "Perhaps even, or maybe even guaranteed better than some longer time horizon.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1749.895,
    "end": 1760.82,
    "text": "Because if the short-term strategies were somehow better than the long-term horizon, it would be difficult to imagine because the long-term horizon would be at least as good as a short-term strategy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1762.801,
    "end": 1765.823,
    "text": "So that speaks to the challenges of planning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1767.299,
    "end": 1767.899,
    "text": " in action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1768.26,
    "end": 1773.303,
    "text": "So how is planning addressed in modern neural networks?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1774.443,
    "end": 1776.645,
    "text": "And how does this work help us think about that?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1776.665,
    "end": 1783.108,
    "text": "That's another very important aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1783.269,
    "end": 1791.513,
    "text": "So first, I have to say that this framework addresses the planning aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1791.734,
    "end": 1795.436,
    "text": "But that planning is not necessarily",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.046,
    "end": 1812.092,
    "text": " the optimal or the optimal solution in the sense that what we are interested in is optimization or planning under a limited structure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1812.692,
    "end": 1821.016,
    "text": "The structure is characterized by here, vertical plausible two layer neural networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1821.896,
    "end": 1823.937,
    "text": "So yeah, planning,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1825.08,
    "end": 1834.568,
    "text": " occurred by association between risk in the future and our decision in the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1835.249,
    "end": 1849.06,
    "text": "Here, we model that aspect using a delayed modulation of cyanotic plasticity mediated by some neuromodulator or neurotransmitters.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1850.762,
    "end": 1852.003,
    "text": "This is the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1859.142,
    "end": 1877.55,
    "text": " This is modeled as the product of the risk factor and the heavier product holding the cost function, neural network cost function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1882.284,
    "end": 1889.111,
    "text": " All right, I'm going to ask a great question from the chat, and then we'll look at the figures a little closer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1889.751,
    "end": 1895.436,
    "text": "So ML Don wrote, a question stuck in my mind for a long time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1896.017,
    "end": 1897.659,
    "text": "Could you please put it to rest?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1898.359,
    "end": 1906.247,
    "text": "Do we need to have knowledge about all states, possible actions, and sensory inputs for active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1911.075,
    "end": 1927.94,
    "text": " Well, you mean if you seek the exact solution, exact optimal solution, then maybe more information would help you to find that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1929.201,
    "end": 1938.944,
    "text": "But under some model, general model, under some ideal assumption, then",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1940.73,
    "end": 1948.099,
    "text": " or variables are not necessary to achieve the optimal solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1949.641,
    "end": 1953.726,
    "text": "I'm not sure if I correctly answered your point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1955.848,
    "end": 1957.891,
    "text": "So, just to restate it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1959.377,
    "end": 1964.678,
    "text": " Of course, knowing all the state's possible actions and sensory inputs, it's not a bad thing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1965.238,
    "end": 1971.62,
    "text": "Worst case, there's some computational complexity trade-offs, but the problem becomes fully stateable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1972.38,
    "end": 1988.243,
    "text": "But I think ML Don is asking about cases where you don't know all of the state spaces or potentially even the dimensionality or the semantics of...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1990.414,
    "end": 2011.789,
    "text": " hidden states active states sensory inputs and why not even add cognitive states so in not just partially observed but partially known state spaces how are these addressed in neural networks and how does active inference help us think about it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2017.181,
    "end": 2018.483,
    "text": " Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2019.563,
    "end": 2032.655,
    "text": "I think the question is about how can we separate those states, sensory, action, internal, external.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2037.479,
    "end": 2042.783,
    "text": "How can we separate, not just in principle have these states be separated,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2043.666,
    "end": 2053.331,
    "text": " but deal with the fact that some of these states we might have good knowledge on and some states, like the hidden states, we might not even know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.351,
    "end": 2058.714,
    "text": "Like we don't know the dimensionality of the cause vector in the world.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2059.474,
    "end": 2059.874,
    "text": "I see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2059.894,
    "end": 2064.537,
    "text": "For example, in terms of dimensionality,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2066.305,
    "end": 2073.265,
    "text": " There is a statistical technique to estimate dimensionality, for example, various",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2075.094,
    "end": 2092.826,
    "text": " information criteria, like Akai-gei information criteria, base information criteria, or then try to infer or estimate plausible dimensionality about the environmental hidden states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2093.486,
    "end": 2100.05,
    "text": "So there is an analogy with those information criteria and variational free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2100.09,
    "end": 2103.693,
    "text": "So with variational free energy minimization, we can",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2104.335,
    "end": 2115.282,
    "text": " we can identify the plausible model structure, which in principle involves the dimensionality aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2116.703,
    "end": 2133.174,
    "text": "But in terms of neural network, in this paper, we don't carefully consider about the dimensionality optimization because we first define the number of neurons.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2134.205,
    "end": 2136.967,
    "text": " and don't change during training.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2137.847,
    "end": 2156.918,
    "text": "But in principle, we can consider the change in the number of neurons which is associated with, for example, adult neurogenesis or development during the developmental stage.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2157.819,
    "end": 2161.441,
    "text": "That would be an important extension.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2162.87,
    "end": 2187.623,
    "text": " this this this this direction that's very interesting here's um a remark well one note is equation one summarizes a lot of what you've been describing",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2188.646,
    "end": 2201.214,
    "text": " There's a parallelism or a concordance being drawn between the loss function of neural networks and the variational free energy of the parameterized model there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2201.955,
    "end": 2214.323,
    "text": "So to come back to these processes that influence learning, which we could think of as the neural network becoming more fit from a loss function perspective, or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2215.123,
    "end": 2225.128,
    "text": " the variational Bayesian partially observable Markov decision process entity generative model becoming better at doing what it does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2225.788,
    "end": 2229.55,
    "text": "So there's the firing rate on the neural network side.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2230.47,
    "end": 2258.855,
    "text": " the synaptic plasticity at a slower time scale which we discussed a little earlier and then now there's a third time scale with the birth and death of new cells and maybe even new layers and that kind of multi-scale temporal structuring is not intrinsic to the base graph",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2260.68,
    "end": 2269.802,
    "text": " to represent multiple nested time scales in a base graph in the active inference literature, it's more common to make a hierarchically nested model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2271.563,
    "end": 2284.006,
    "text": "And just say that the time handling on one level is happening more rapidly with respect to clock time than deeper nested slower models.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.886,
    "end": 2287.427,
    "text": "Whereas the neural formulation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2289.835,
    "end": 2315.692,
    "text": " allows us to deal with multiple ongoing timescales without appealing to hierarchical nesting which is a very important feature well yeah both both directions would be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2316.744,
    "end": 2324.938,
    "text": " possible without hierarchical modeling or with hierarchical modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2325.479,
    "end": 2329.866,
    "text": "So even with hierarchical modeling, the optimization of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2331.144,
    "end": 2348.785,
    "text": " dimensionality should be possible or would be possible but so in other direction so we can consider that a population of neural models so one has a single layer another has a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2349.486,
    "end": 2359.76,
    "text": " two layers, three layers, four layers, and consider the probability or plausibility of network architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2362.279,
    "end": 2382.621,
    "text": " associated with the performance or cost function minimization under a particular environment, which is, in principle, have the same computational architecture with the hierarchical Bayesian model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2387.045,
    "end": 2388.606,
    "text": " Very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.487,
    "end": 2389.727,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2389.847,
    "end": 2410.523,
    "text": "Perhaps I over generalized or speculated because I thought about how one could have a 100 time step POMDP that also performs multi-scale behavior, potentially extremely wastefully, but at least it could in principle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2411.544,
    "end": 2416.748,
    "text": "And similarly within a neuron, there could be another neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2419.417,
    "end": 2421.819,
    "text": " or some other structure approximated by that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2422.58,
    "end": 2440.835,
    "text": "So they almost both enable hierarchical and non-hierarchical modeling, as you described, but in very different ways that lead to very different implementations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2440.855,
    "end": 2441.856,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2446.28,
    "end": 2468.107,
    "text": " i think this brings us to the topic of forward and reverse engineering so you talked a lot about reverse engineering yeah what is reverse engineering and what is forward engineering and what has been done in these areas of engineering",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2470.638,
    "end": 2478.243,
    "text": " OK, I'm not an expert of reverse engineering in the broad sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2478.323,
    "end": 2493.352,
    "text": "But I believe that reverse here means your characterization of the blueprint of some device or machine",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2494.853,
    "end": 2508.153,
    "text": " data observable information like activity or action behavior of some agent right so goal is identification of the blueprint",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2509.526,
    "end": 2524.251,
    "text": " and the crucially here blueprint correspond to generative model because once we define generative model we can derive variation of energy algorithm running algorithm inference algorithm and any behavior of agent so",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2525.311,
    "end": 2550.121,
    "text": " here reverse means that we first observe some activity of agent and its mechanism is still unknown for us but we can estimate its mechanism using that activity by identifying the most plausible",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2552.529,
    "end": 2564.729,
    "text": " generative model which can minimize some cost function or risk function when we feed the data to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2566.282,
    "end": 2568.324,
    "text": " the model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2568.704,
    "end": 2594.426,
    "text": "So, on the other hand, forward engineering would be a more mainstream way, first define model, blueprint, generate model, then derive everything, including functional, running inference algorithms, behavior action algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2600.242,
    "end": 2614.825,
    "text": " So by reverse engineering neural networks, we're observing some already parameterized neural network and then fitting a POMDP to it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2616.926,
    "end": 2627.888,
    "text": "To what extent is it possible to take a given POMDP and create a neural network that performs that inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2631.652,
    "end": 2657.46,
    "text": " uh okay in this paper uh or in the following uh paper what we consider is a strategy that we first fit uh empirical data whether for neural response data to a basically plausible canonical neural network model which is a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2658.2,
    "end": 2678.864,
    "text": " which is similar to a conventional model fitting approach, where we have differential equation and data and fit data to the differential equation to explain the behavior with the minimal prediction.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2678.884,
    "end": 2679.105,
    "text": "So now,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2681.625,
    "end": 2706.632,
    "text": " a virtue of this framework we established is that we can transform we can naturally transform such a neural network architecture with the well-known partially observable market decision process architecture because for any a kind of canonical neural network there is a",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2707.202,
    "end": 2708.023,
    "text": " cost function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2710.265,
    "end": 2725.683,
    "text": "So we derive cost function from neural activity equation, which is opposite with the conventional way we first define cost function derived algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2726.063,
    "end": 2728.206,
    "text": "And then we use",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2729.046,
    "end": 2736.571,
    "text": " the former equivalence between neural network cost function and variational free energy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2737.892,
    "end": 2745.216,
    "text": "So now transform the neural network architecture to Bayesian model architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2746.057,
    "end": 2755.262,
    "text": "And once we characterize variational free energy, there should be some generative model that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2757.072,
    "end": 2761.513,
    "text": " define that variational free energy functional.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2762.274,
    "end": 2778.098,
    "text": "So in particular, in this example, canonical neural network nicely correspond to a class of well-known partially observed Markov decision process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2778.458,
    "end": 2784.72,
    "text": "So by using this procedure, we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2786.523,
    "end": 2808.091,
    "text": " uh identify the plausible home dp architecture which is a quest which correspond to observed activity data okay",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2809.673,
    "end": 2837.565,
    "text": " well let's stay on this last point so after all those transformations first the measurements of neurons using that data to fit the neural network and then by virtue of the relationships unpacked in the paper transforming the neural network in the left side of figure one into",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2839.666,
    "end": 2842.128,
    "text": " a particular form of the POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2842.829,
    "end": 2848.273,
    "text": "So first, what are the constraints on that form of the POMDP?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2848.954,
    "end": 2855.74,
    "text": "Is this a little corner of model space or what are the space of acceptable POMDPs?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2858.382,
    "end": 2863.846,
    "text": "That totally depends on what kind of neural network model you are considering.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2864.727,
    "end": 2866.309,
    "text": "So for example,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2867.762,
    "end": 2879.266,
    "text": " In this paper, we discuss about a particular class of POMDP in which each state takes either 0 or 1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2880.127,
    "end": 2887.009,
    "text": "So it's very restricted compared to the general form of POMDP.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2887.049,
    "end": 2893.312,
    "text": "But we consider a factorization in the sense that although",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2894.145,
    "end": 2911.608,
    "text": " Each is either 0 or 1, but we consider a vector of observation, a vector of hidden state, where each element corresponds to one single one-hot vector.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2912.068,
    "end": 2921.87,
    "text": "But as an entire state, it can represent a high-dimensional discrete state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2923.516,
    "end": 2934.049,
    "text": " And this architecture nicely corresponds to neural network architecture because usually each neuron takes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2935.16,
    "end": 2943.564,
    "text": " either 0 over 1 or some continuous variable between 0 and 1.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2944.585,
    "end": 2954.03,
    "text": "So we use this association to characterize a particular POMDP which corresponds to neural networks.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2954.967,
    "end": 2979.197,
    "text": " And this follows a particular mean field approximation or approximation in generative model because we associate posterior belief in this particular POMDP with the neural activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2980.413,
    "end": 3006.321,
    "text": " which means that posterior of action also have a factorization architecture, in the sense that we don't, we don't fully consider about the second order statistics between neuron 1's activity and neuron 2's activity, which is outside of this formalism.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3007.682,
    "end": 3008.202,
    "text": "So each",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3009.406,
    "end": 3025.73,
    "text": " Each neuron's activity corresponds to a posterior expectation about a particular element of the state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3026.53,
    "end": 3036.493,
    "text": "And we don't consider the joint posterior probability of all states.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.104,
    "end": 3050.488,
    "text": " So although this is a limitation, we see this as a Bayesian inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3051.308,
    "end": 3063.053,
    "text": "But otherwise, we can consider any recurrent network architecture which corresponds to a state of transition matrix.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3064.145,
    "end": 3087.131,
    "text": " And it would be possible to extend this architecture to hierarchical structure in the sense that it is straightforward to consider a tree structure or any kind of hierarchical structure by assuming that some neuron connect to other neuron but not connect to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3089.081,
    "end": 3089.802,
    "text": " other neuron.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3090.082,
    "end": 3096.829,
    "text": "So this is same as considering hierarchal structure in general.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3103.576,
    "end": 3107.059,
    "text": "Thanks, that's very interesting.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3108.561,
    "end": 3111.143,
    "text": "It's commonly remarked in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.625,
    "end": 3119.409,
    "text": " the base graphs that they represent the connections amongst random variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3120.309,
    "end": 3124.612,
    "text": "And there's a relationship between their computability and their sparsity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3125.332,
    "end": 3130.235,
    "text": "The sparsity structure as in which variables do or do not influence each other",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3132.0,
    "end": 3138.522,
    "text": " makes the problem tractable through factorization and just kind of conceptually.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3138.762,
    "end": 3149.544,
    "text": "Like if every one of a thousand variables or an unknown number of large variables, if it was all by all, the number of parameters to fit on that connectivity matrix would be very high.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3150.044,
    "end": 3153.805,
    "text": "So statistical power would be very low for any given edge.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3154.446,
    "end": 3159.547,
    "text": "Whereas the more and more constrained you make the connectivity of the variables,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3160.327,
    "end": 3168.713,
    "text": " the more statistical power you have to resolve or kind of spend on fitting those edges, like in a structural equation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3169.634,
    "end": 3182.003,
    "text": "But you might be losing sight of the unknown unknowns by constraining yourself to a very limited or fallacious topology of the variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3182.583,
    "end": 3188.528,
    "text": "So there's this kind of structure learning, statistical inference question in the Bayes graphs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3190.171,
    "end": 3212.814,
    "text": " then on the neural side from the biological much of neuroscience is about understanding how the firing rate connectivity patterns and other factors how the structure of those neural systems and their function like form and function enable",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3214.466,
    "end": 3218.029,
    "text": " adequate inference and inference on action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.21,
    "end": 3236.304,
    "text": "So it's like in both of those areas, or really like in neural network, artificial and neural networks, and in variational bays, the discussion is about how the structure and the fine tuning",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.631,
    "end": 3265.207,
    "text": " work together to generate function and about some of the statistical or um biological challenges of balancing different needs while also constraining the cost in terms of materials and biometabolism so it's a very rich intersection that is being explored here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3269.89,
    "end": 3272.531,
    "text": " if these models can really be moving back and forth.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3278.513,
    "end": 3282.414,
    "text": "In the sense that back and forth?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3285.775,
    "end": 3296.939,
    "text": "Moving back and forth like there's some imprints of the model that is implementation independent or like some interlingua or some semantics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3298.351,
    "end": 3299.392,
    "text": " Or compatibility?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3299.432,
    "end": 3300.073,
    "text": "I don't really know.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3300.113,
    "end": 3315.809,
    "text": "I mean, that's something we can explore is like, what is it that is such that one could forward engineer and then reverse engineer and have like kind of an expectation maximization between these two areas?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3315.869,
    "end": 3318.952,
    "text": "So what is it that's being sought?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.416,
    "end": 3329.579,
    "text": " Yes, that's an important point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3329.68,
    "end": 3345.872,
    "text": "For example, a virtue of this relationship is that we can use the knowledge of Bayesian inference to explain neuroactivity and neurodynamics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3346.693,
    "end": 3357.642,
    "text": " which is crucial because people often say that characterizing neural dynamics is not straightforward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3358.803,
    "end": 3371.532,
    "text": "We may obtain some solution of neural net dynamics, but the meaning of that dynamics in terms of functional aspect is very unclear.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3371.653,
    "end": 3374.555,
    "text": "We don't know the meaning of connectivity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3375.276,
    "end": 3393.418,
    "text": " strength matrices and what is the meaning of the threshold factor so on so on those are derived from the you know the modeling physiological phenomena but it is not necessary to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3394.259,
    "end": 3403.442,
    "text": " have a clear linkage to a functional explanation of the brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3403.743,
    "end": 3409.885,
    "text": "But once we translate these dynamics into Bayesian inference,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3410.425,
    "end": 3426.351,
    "text": " then we can explain every functional aspect of the neural net dynamics architecture in terms of where established Bayesian inference under a particular class of Bayesian modeling, in this case, POMDP model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3428.632,
    "end": 3437.916,
    "text": "So now it turns out that synaptic strengths correspond to A matrix, B matrix, which are very established",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3439.967,
    "end": 3440.807,
    "text": " clear meaning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3442.168,
    "end": 3458.175,
    "text": "So yeah, this is useful to explain neural synaptic property in terms of where we establish statistics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3464.578,
    "end": 3469.2,
    "text": "Also, for the people in the active inference side,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3470.234,
    "end": 3475.324,
    "text": " it would be helpful to understand the neuronal substrates",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3476.13,
    "end": 3481.774,
    "text": " about a particular active inference model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3482.815,
    "end": 3488.44,
    "text": "So I think it's related to forward modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3488.96,
    "end": 3501.99,
    "text": "But finally, to discuss about the vertical substrate of that forward model, we need to address the neural network",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3504.423,
    "end": 3508.135,
    "text": " architecture, the substrate property.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3508.977,
    "end": 3510.362,
    "text": "So in that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3512.028,
    "end": 3529.393,
    "text": " case, we can transform a particular POMDP Bayesian modeling to a neural network architecture using this relationship and then get a prediction about the substrate.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3529.453,
    "end": 3536.475,
    "text": "So if we have this Bayesian model, this particular quantity in this model should be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3545.643,
    "end": 3547.364,
    "text": " would be possible using.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3554.027,
    "end": 3554.728,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.108,
    "end": 3555.548,
    "text": "Oh, it's all good.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.568,
    "end": 3557.629,
    "text": "Can you just repeat the last, like, 20 seconds?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3558.97,
    "end": 3559.25,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3559.87,
    "end": 3574.878,
    "text": "So in the last part I mentioned about the four, so first we define the Bayesian model and then can predict what is the neuronal substrate that corresponds to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3576.485,
    "end": 3578.747,
    "text": " that particular Bayesian model.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3579.667,
    "end": 3593.954,
    "text": "So this would be useful to identify the biological quantities that correspond to a quantity in Bayesian influence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3595.315,
    "end": 3595.535,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3598.257,
    "end": 3598.537,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3600.638,
    "end": 3600.778,
    "text": "Well,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3603.834,
    "end": 3630.697,
    "text": " there's a lot there it makes me think about the differences of implementation and heuristics in the computational setting which is often in the extreme disembodied and the biological setting which is in the extreme entirely embodied and for a given generative model",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3632.777,
    "end": 3662.22,
    "text": " the kinds of computational heuristics that can be applied include a whole host of different strategies ranging from sampling to tree exploration and branching to parallel paralyzing the data architecture and all these other kinds of disparate strategies and software packages and implementations",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3664.781,
    "end": 3686.226,
    "text": " But on the biological side, what is needed is something that's very simple, but also very inscrutable, which is a given pattern of interactions must embody that calculation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3688.712,
    "end": 3698.813,
    "text": " So that might mean that it can add three digit numbers, but it can't add two digit numbers under some constraints.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3701.124,
    "end": 3720.091,
    "text": " but what isn't accessible to that kind of morphological biological or like form and functional computing what's not accessible are the tree branching the database decentralization like they're a different set of heuristics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3721.411,
    "end": 3739.071,
    "text": " right but they're both very useful when we're thinking about making sentient artifacts or benefiting simply from the explainability across both sides of this figure yeah",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3739.904,
    "end": 3742.866,
    "text": " So you now address an important point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3742.986,
    "end": 3756.234,
    "text": "So honestly, it is very non-trivial whether there is a corresponding biological architecture for any given Bayesian architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3756.634,
    "end": 3765.899,
    "text": "I believe it is impossible to design biological architecture to correspond to arbitrary Bayesian architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3767.08,
    "end": 3775.383,
    "text": " Only a limited aspect of Bayesian model can be implemented in a biological plausible manner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3775.843,
    "end": 3785.026,
    "text": "And that point is crucial as a characterization of biological network, biological brain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3786.166,
    "end": 3789.947,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3790.207,
    "end": 3790.467,
    "text": "Wow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3790.947,
    "end": 3795.829,
    "text": "Well, just to kind of touch again on this forward and reverse engineering,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3798.607,
    "end": 3813.525,
    "text": " for a given pomdp if we're willing to compose it within a certain class which might be quite general still but some class of pomdp as written on the paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3815.219,
    "end": 3830.265,
    "text": " we may be able to have a neural network architecture that would be very amenable to deep learning, low energy computing, pre-training, various features.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3830.945,
    "end": 3839.729,
    "text": "And then on the other side, for a given artificial neural network that we come across in the wild,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3841.019,
    "end": 3861.924,
    "text": " or a model of neural dynamics that we fit using a neural network model, so something in a neuroscience laboratory, that model can have interpretability corresponding to the variables of a given POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3863.214,
    "end": 3871.901,
    "text": " And just to kind of give one more point on how that's going deeper than, for example, statistical parametric mapping, SPM.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3873.302,
    "end": 3882.109,
    "text": "So let's just assume that the neural network we're dealing with is fit from brain data from some lucky ant.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3883.85,
    "end": 3891.256,
    "text": "Right now, what would be possible, or prior to this line of work or without this line of work, one could...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3892.907,
    "end": 3908.175,
    "text": " fit a neural dynamics model and then do all kinds of analyses like power analyses on the different frequency spectra and say, look at the average firing rate or the correlation coefficients of firing rate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3908.215,
    "end": 3913.878,
    "text": "So fit the firing rates and the synaptic plasticities and store all that data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3914.618,
    "end": 3919.041,
    "text": "And then we could just pick a POMDP that we've seen in the literature",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3920.148,
    "end": 3924.01,
    "text": " without any reference to the neural network and optimize the POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3924.79,
    "end": 3934.876,
    "text": "And then we could say, well, it turns out that when the POMDP O is high, there's increased theta power in this firing pattern.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3935.736,
    "end": 3946.842,
    "text": "So it's like comparing the descriptive statistics from the neural model to the descriptive summary statistics of the POMDP decision-making model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3947.702,
    "end": 3964.106,
    "text": " However, with this formal connection, there is actually an interpretability to the unobserved neural states, which are what are being inferred from the fMRI measurement, from the EEG measurements and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3964.946,
    "end": 3974.248,
    "text": "Those underlying variables have a specific interpretability in relationship to the structure of the POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3981.676,
    "end": 3981.996,
    "text": " Right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3982.116,
    "end": 3988.918,
    "text": "So yeah, that's also a very interesting, important aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3989.938,
    "end": 3999.18,
    "text": "So as you said, what you said is, I think, conventional, more conventional strategy.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4000.04,
    "end": 4001.801,
    "text": "And it is also",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4002.601,
    "end": 4012.931,
    "text": " formally related to model comparison aspect so we usually think various major modeling and identify or select what is the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4013.826,
    "end": 4034.738,
    "text": " you know best model to explain the given data and this reverse engineering idea involves such a model comparison aspect in the sense that we we try to find the model with the best best explainability which should be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4036.027,
    "end": 4039.49,
    "text": " have the identical functional, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4040.031,
    "end": 4051.161,
    "text": "So we directly addresses the exact same cost function architecture using the transformation, natural transformation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4051.922,
    "end": 4059.769,
    "text": "So it should be up to explain the neural data in the Bayesian sense.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4062.697,
    "end": 4077.016,
    "text": " yeah one can imagine how that would transform the way that current neuroimaging studies and technologies describe",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4078.2,
    "end": 4103.896,
    "text": " what it is about the measurement that provides information about the cognitive model so to give another related example let's just say a person was wearing a EEG headset and a previous study had shown that increased Alpha band activity was associated with this behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4106.064,
    "end": 4125.195,
    "text": " That's comparing a descriptive statistic of the observations of the sensor and correlating the summarized observable to some other variable, like anxiety or performance on a behavior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4127.896,
    "end": 4134.54,
    "text": "In contrast, an unobserved variable in this setting",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4135.922,
    "end": 4149.63,
    "text": " the actual underlying neural state is being correlated to some semantic generative model component.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4151.751,
    "end": 4163.878,
    "text": "So it's no longer necessarily that any single frequency band would be associated more or less with a given outcome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.974,
    "end": 4193.132,
    "text": " but it's actually some hidden state variability which gains the interpretability across this transformation which is a subtle point but it speaks to how broadly the equivalents would reinterpret empirical neuroimaging results",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4194.258,
    "end": 4220.337,
    "text": " as well as a variety of artificial neural network experiments and diagnostics where people do lesion studies and double knockouts on artificial neural networks so anywhere where somebody with awareness sees that a neural network artificial or biological",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4221.46,
    "end": 4246.375,
    "text": " is having summary features described and correlated to something that's more semantic in a quest for meaning may now have a different approach that involves formalizing the model explicitly in terms of unobserved hidden states with a cost function",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4248.186,
    "end": 4276.33,
    "text": " akin to a variational free energy minimizing risk bounding surprise on the unobservables so even though the unobservables were modeled in a sense in the other conventional strategy like neural activity is a variable in fmri experiments it's underlying the bold signal",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4277.614,
    "end": 4291.624,
    "text": " Yet this formalism concordance is a more coherent and powerful connection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4294.026,
    "end": 4296.287,
    "text": "I believe so.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4297.168,
    "end": 4300.951,
    "text": "So you now address this very",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4301.937,
    "end": 4302.918,
    "text": " important point.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4304.339,
    "end": 4308.562,
    "text": "First, to address that, we need to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4309.545,
    "end": 4315.107,
    "text": " clarify about the what is a program considered here.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4315.247,
    "end": 4335.756,
    "text": "So this is a problem so called meta Bayesian problem in the sense that researchers try to infer or estimate neural activity or brain activity, which inferred the external world dynamics, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4335.876,
    "end": 4337.497,
    "text": "So neuron or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4337.577,
    "end": 4343.078,
    "text": " brain-inferred environment, and we research inferred brain activity.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4343.418,
    "end": 4348.719,
    "text": "So there are two-step Bayesian inference processes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4349.22,
    "end": 4359.602,
    "text": "So this sort of meta-Bayesian problem is quite tricky, intractable, because sometimes",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4361.082,
    "end": 4370.246,
    "text": " So probability, so sometimes random variable becomes a posterior belief about other aspect.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4371.247,
    "end": 4389.975,
    "text": "So I think there is some established approach about meta Bayesian, but this paper provides some alternative in the sense that we separate two problem by saying that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4390.988,
    "end": 4404.891,
    "text": " here, what we infer is simply a neural network model or neural network dynamics, which is shown in the left-hand side of this figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4405.471,
    "end": 4414.032,
    "text": "So we feed the data to conventional neural network model, which is a simple differential equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4414.732,
    "end": 4417.053,
    "text": "But thanks to this",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4417.953,
    "end": 4438.284,
    "text": " formal equivalence between neural network dynamics and the POMDP behavior, then we can transform the resulting neural network architecture or dynamics into the Bayesian inference in some sense post hoc manner.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4440.876,
    "end": 4452.094,
    "text": " So we nicely avoid directly addressing the meta Bayesian problem, but obtain the same kind of solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4454.187,
    "end": 4476.97,
    "text": " In that sense, yes, combining with brain activity recording like EEG or imaging, we can estimate a plausible neural network model in the left-hand side and we can transform that to a POMDP in the right-hand side.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4480.356,
    "end": 4480.556,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4480.916,
    "end": 4481.256,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4481.677,
    "end": 4486.699,
    "text": "I'm going to show an image and ask a question from Dave in the chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4487.82,
    "end": 4489.3,
    "text": "So Dave made this image.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4492.802,
    "end": 4499.426,
    "text": "It's the right side of figure one that we've just been looking at with the variational Bayesian formation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4500.386,
    "end": 4504.248,
    "text": "And he wrote, the arc shown as impinging on the S self-arc",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4506.798,
    "end": 4508.08,
    "text": " Is this intentional?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4508.5,
    "end": 4514.088,
    "text": "If so, it could represent tuning or modulation of the feedback of S into itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4516.411,
    "end": 4518.915,
    "text": "So do you have a thought on this?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4521.101,
    "end": 4522.382,
    "text": " It's intentional, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4523.223,
    "end": 4537.277,
    "text": "I think it's related to the usual formulation of POMDP architecture and active inference context, in the sense that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4538.078,
    "end": 4557.744,
    "text": " you know our decision or policy in the usual setting modify the state transition matrix B matrix right so here delta is an alternative of policy",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4559.965,
    "end": 4560.625,
    "text": " of agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4560.765,
    "end": 4572.77,
    "text": "So basically, the director indicates a state transition matrix under a particular decision which agent made.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4574.311,
    "end": 4581.894,
    "text": "In that sense, what the agent changes is a state transition matrix, not the state itself directly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4582.674,
    "end": 4585.875,
    "text": "That's why we use this illustration.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4589.722,
    "end": 4616.423,
    "text": " awesome very subtle but important point which is when we look at the classical pomdp formulation so here we'll look at a version shown in figure two i'll just bring just figure two in um could you describe what you just did about the role of the b matrix in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4618.143,
    "end": 4646.662,
    "text": " influencing how hidden states change and how that is where our policies have impact and also please how do the top and the bottom of figure two differ okay so in the in the usual formulation uh under uh active influence uh with the pom db structure so we first consider uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4648.189,
    "end": 4654.805,
    "text": " uh the the three prior free for us and the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4656.792,
    "end": 4673.558,
    "text": " depending on the prior preference, we compute the expected energy and its minimization provides the policy and the policy modulates the state transition.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4674.518,
    "end": 4680.62,
    "text": "So now in the upper layer, we instead use the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4682.441,
    "end": 4695.407,
    "text": " filter which is the action of the agent so here action or decision was made for each time step",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4696.656,
    "end": 4705.423,
    "text": " so that unlike the computational formulation, we have a sequence of delta.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4706.284,
    "end": 4723.117,
    "text": "And for each time step, delta modulates the state transition matrix B. So B is the matrix that transforms a hidden state in the previous step to the S in the current time step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4724.984,
    "end": 4744.271,
    "text": " Its moderation indicates that under a specific decision rule, for example, if this S indicates our position in the virtual environment, with the GO decision, our position moves forward.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4745.391,
    "end": 4751.716,
    "text": " Or if we choose a no-go decision, then it's unchanged.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4752.256,
    "end": 4761.483,
    "text": "So such a modulation of state transition was made by choosing delta.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4762.384,
    "end": 4770.51,
    "text": "And the lower part corresponds to Bayesian inference made by a Bayesian agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4772.077,
    "end": 4801.394,
    "text": " So basically, there is a symmetry between upper part and the lower part because we assume that this Bayesian agent has a plausible generative model which nicely corresponds to a given environment defined in the above part, upper part in this figure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4802.35,
    "end": 4819.586,
    "text": " But one interesting thing, asymmetry, is that to model this particular canonical neural network, we don't",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4820.47,
    "end": 4839.911,
    "text": " consider an arrow or a link from delta posterior to s posterior which is in the environment delta modulate s in the next step.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4841.098,
    "end": 4844.004,
    "text": " through beam matrix modulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4845.567,
    "end": 4852.32,
    "text": "In this particular Bayesian engine, which formally correspond to canonical neural network,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4853.631,
    "end": 4855.532,
    "text": " we don't consider that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4857.473,
    "end": 4871.102,
    "text": "It is correspond to an absence of the projection from output layer to the middle layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4871.142,
    "end": 4871.302,
    "text": "OK.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4883.191,
    "end": 4883.472,
    "text": " Let's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4886.157,
    "end": 4886.959,
    "text": "This is from the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4890.291,
    "end": 4914.353,
    "text": " 2020 paper but it shows the neural network architecture the two-layer architecture so could you um restate the top and the bottom of figure two in the 22 paper and connect it to why it's important that you're studying two-layer neural network models",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4915.999,
    "end": 4940.369,
    "text": " uh i miss you oh yeah can you just connect um the uh asymmetry between the top and the bottom on figure two with the two-layer neural network architecture you said that the asymmetry there's no direct link between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4945.302,
    "end": 4949.525,
    "text": " Yeah, this is another story.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4950.125,
    "end": 4972.258,
    "text": "So in the previous paper, there is only output rate or the perceptual layer, because we basically consider a single-layer feedforth network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4974.198,
    "end": 4983.321,
    "text": " My apologies for some confusion about the network architecture in the 2020 paper.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4983.381,
    "end": 4992.364,
    "text": "So now, upper part of this network architecture correspond to environmental generative process.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4993.044,
    "end": 5000.566,
    "text": "And only a lower part correspond to single layer, single feed forward neural network architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5001.747,
    "end": 5002.187,
    "text": "So now,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5004.114,
    "end": 5017.317,
    "text": " This part is identical to a map from O to S posterior in the 2022 papers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5019.678,
    "end": 5019.798,
    "text": "Ah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5023.539,
    "end": 5023.839,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5024.599,
    "end": 5026.92,
    "text": "So, on the top of Figure 2,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5028.763,
    "end": 5031.184,
    "text": " is the actual generative process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5032.304,
    "end": 5047.588,
    "text": "It's the true structure of causation in the environment, which is to say that actions, delta, actually influence how states change through time via B delta.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5050.009,
    "end": 5057.051,
    "text": "The generative process through the A matrix emits observations, sequences of observations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5058.519,
    "end": 5085.295,
    "text": " and here on the bottom with a mirrored structure is the generative model of the entity so what's the relevance of the arrows and the more 40 factor graph structure on the bottom the arrow uh indicates the the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5087.079,
    "end": 5088.14,
    "text": " the influence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5090.722,
    "end": 5107.994,
    "text": "So it's a flow of the information in the sense that to calculate S in the step 2, we use the information of step 2's observation and step 1's",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5109.236,
    "end": 5111.718,
    "text": " posterior expectation of our hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5112.059,
    "end": 5117.965,
    "text": "So those two determine the S2's expectation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5119.026,
    "end": 5125.513,
    "text": "Usually in the phonograph, we consider a retrospective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5127.935,
    "end": 5135.98,
    "text": " So in the sense that S3 also affect the S2 inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5136.06,
    "end": 5151.391,
    "text": "But this correspond to a Bayesian smoother in the sense that we update every time step simultaneously to better inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5151.852,
    "end": 5155.574,
    "text": "However, what we consider here is more",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5157.885,
    "end": 5170.991,
    "text": " filtering approach in the sense that for each step we compute the latest hidden state and then we don't change any other states in the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5171.731,
    "end": 5178.534,
    "text": "So that's why we don't consider the arrow from future to the past.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5182.696,
    "end": 5183.056,
    "text": "Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5183.436,
    "end": 5184.797,
    "text": "Yeah, just to highlight that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5187.037,
    "end": 5206.397,
    "text": " In the Bayesian smoothing approach, it's kind of like fitting a spline because it takes the whole time series and it fits the smoothest possible line or the line whose smoothness is on the AIC-BIC frontier.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5208.001,
    "end": 5227.181,
    "text": " But here on the bottom, with the almost pseudocode implementation provided by the 40-factor graph, which was demonstrated to be equivalent with the Bayesian graph in the 2017 work with Fristin, Parr, and de Vries.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5228.522,
    "end": 5237.669,
    "text": " This architecture is reflecting a filtering scheme like a Kalman filter or just generalized Bayesian filtering through time where",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5240.026,
    "end": 5264.262,
    "text": " estimates are being carried forward and changed time point to time point such that the decision rules or the updates perhaps more accurately are defined between time points and the total time series does not have to be loaded into memory or remembered at once and then the Bayesian filtering approach",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5266.155,
    "end": 5272.2,
    "text": " has the asymmetry with a different consideration of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5274.382,
    "end": 5287.752,
    "text": "So why again is it that action is considered differently in the Bayesian filtering approach on the bottom of the generative model than the consideration of action in the generative process?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5290.174,
    "end": 5292.596,
    "text": "That corresponds to",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5294.591,
    "end": 5314.865,
    "text": " lack of connection from y to x in the figure one or probably a figure four is helpful to the that relationship you also uh",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5319.017,
    "end": 5327.183,
    "text": " Yeah, this is an example network architecture comprising input layer, middle layer, output layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5327.663,
    "end": 5340.653,
    "text": "What we consider is the information flow from sensory to middle layer, and middle layer have self-connection, recurrent connection, and middle layer project to output layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5341.388,
    "end": 5347.572,
    "text": " So there is no connection from all output layer to middle layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5350.734,
    "end": 5365.284,
    "text": "So that's why we don't consider the link from delta in the bottom layer of the figure to 2s posterior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5367.425,
    "end": 5369.867,
    "text": "So this is different from true",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5371.096,
    "end": 5374.719,
    "text": " generative process in the environment.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5378.321,
    "end": 5394.493,
    "text": "This is a kind of simplification because our purpose is identifying the plausible Bayesian model which corresponds to this type of Tureya neural network, canonical network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5396.565,
    "end": 5416.896,
    "text": " So in other words, this canonical neural network uses an approximation about that point or uses a limited form of POMDP scheme.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5423.973,
    "end": 5424.313,
    "text": " Thanks.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5425.054,
    "end": 5432.863,
    "text": "So could you describe W, V, K, and gamma?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5433.564,
    "end": 5439.63,
    "text": "Just what is the biological or functional interpretation of those variables?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5441.152,
    "end": 5445.517,
    "text": "What brain regions or what processes or pathologies do they map to?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5447.295,
    "end": 5456.7,
    "text": " OK, so basically W, V, K are synaptic stresses in the form of matrices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5457.581,
    "end": 5466.026,
    "text": "And their difference, so they represent",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5467.336,
    "end": 5492.9,
    "text": " dynamic connection in the different layer or different architecture, in the sense that W means forward connectivity from sensory layer to middle layer, K corresponds to recurrent network, recurrent connectivity, and V corresponds to projection from middle layer to output layer.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5493.726,
    "end": 5504.909,
    "text": " So in this paper, we don't discuss the relation to brain anatomy in detail.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5506.129,
    "end": 5521.433,
    "text": "But one can consider an analogy, for example, say x correspond to cerebral cortex activity and y",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5522.421,
    "end": 5534.067,
    "text": " why, for example, correspond to cerebrum in the sense that it determines the action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5534.948,
    "end": 5546.794,
    "text": "So it is considered that in the cerebrum there is a signal that represents a choice decision, for example, goal decision or no goal decision.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5547.577,
    "end": 5551.438,
    "text": " made in Cerebrum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5551.918,
    "end": 5557.4,
    "text": "It's analogous to this particular architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5557.42,
    "end": 5576.306,
    "text": "On the other hand, in the Cerebrum, sorry, in the Cerebral Cortex, we compute the sensory information to generate some inference, prediction, and perhaps planning, so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5577.353,
    "end": 5585.255,
    "text": " which is computed by this recurrent network in this particular modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5586.075,
    "end": 5598.999,
    "text": "Although we don't separate brain region in detail, this class of recurrent network is sufficient to characterize any type of architectures.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5604.8,
    "end": 5627.755,
    "text": " in the sense that we can design any higher curve or mutually connected architecture using a generic class of recurrent network by changing weight matrices.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5635.149,
    "end": 5635.509,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5635.89,
    "end": 5642.033,
    "text": "So the middle layer we can think of as like the cognitive stuff.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5642.974,
    "end": 5656.021,
    "text": "It's the internal states when we talk about perception, cognition, action in the act-inf scheme or even in the sandwich model of cognition, perception, cognition, action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5657.6,
    "end": 5684.435,
    "text": " so w is describing how those sensory inputs either in one step or composably in multiple steps become processed to these x representations of hidden external causes inferred external states and so these are the states that have that sigma relationship",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5685.805,
    "end": 5706.23,
    "text": " a generalized synchrony with external states the sigma and the generalized synchrony are not discussed in in your paper but um it connects to other work and the recurrent connections are facilitating attention or waiting of the stimuli",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5708.615,
    "end": 5716.201,
    "text": " This is the recurrent learning loop and the relationship of the A between observations and hidden state estimates.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5718.582,
    "end": 5729.41,
    "text": "And then a different kind of modulation comes into play between the hidden state estimate of the internal state and the action selection.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5730.171,
    "end": 5731.632,
    "text": "So what is gamma?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5733.717,
    "end": 5746.49,
    "text": " Corresponding to and why is the gamma modulation between layers two and three differing functionally from the K synaptic modulation of one and two?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5748.16,
    "end": 5758.746,
    "text": " Yeah, so K matrix basically formally correspond to B matrix in the Bayesian formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5758.826,
    "end": 5764.67,
    "text": "So it's the information about the prediction, right?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5765.27,
    "end": 5773.835,
    "text": "Our knowledge or our expectation about the next state based on the previous state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5775.18,
    "end": 5782.725,
    "text": " On the other hand, the role of gamma is quite different from such a computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5782.745,
    "end": 5796.494,
    "text": "Gamma basically means risk factor, risk function, which is... In principle, we can use arbitrary risk function.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5796.514,
    "end": 5801.037,
    "text": "So this is a part of generative model we designed.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5801.876,
    "end": 5816.621,
    "text": " And the role of risk function in generative model formulation is an alternation of form of generative model depending on the value of gamma, which enables",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5820.398,
    "end": 5833.542,
    "text": " post-addictive or retrospective modulation of evaluation and past decisions given an outcome in the future.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5833.562,
    "end": 5838.503,
    "text": "In terms of neural network, of course,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5839.179,
    "end": 5841.7,
    "text": " it corresponds to some neuromodulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5841.94,
    "end": 5854.685,
    "text": "For example, dopaminergic moderation is famous in the literature, which modulates the activity and plasticity of various brain regions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5854.725,
    "end": 5866.07,
    "text": "But we particularly focus on dopaminergic or any kind of neuromodulation of cyanotic plasticity in",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5866.91,
    "end": 5870.892,
    "text": " the output layer which may correspond to cerebrum.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5872.734,
    "end": 5885.141,
    "text": "In the cerebrum, neuroactivity or plasticity modulated by dopaminergic input is used as the optimization option",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5895.85,
    "end": 5902.156,
    "text": " rule, decision rule, or sometimes attention and various purpose.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5909.562,
    "end": 5938.32,
    "text": " awesome very interesting because in some previous papers and models that we've looked at attention is dealt with as policy selection on mental states so internal action selection is it's an action-like variable describing attention and awareness and even metacognition and so that connects",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5940.169,
    "end": 5952.877,
    "text": " the role of dopamine in motor decision making seen in many dyskinesias, but also with the role of dopamine in seemingly",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5954.591,
    "end": 5982.254,
    "text": " non-motor based decision making like gambling or investing where it doesn't seem to immediately translate to a given motor sequence yet it has analogous computational characteristics and the comorbidities and the side effects of different drugs that affect the dopamine neurophysiology are known to have carryover",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5983.775,
    "end": 6011.981,
    "text": " in terms of like the rigidity or excessivity of motor and decision-making aspects so it's like interesting that dopamine has long been understood to have that parallel role in attention as cognitive action and motor action and that was established empirically through modifications of dopamine signaling",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6013.301,
    "end": 6038.969,
    "text": " and also had been modeled analogously with computational neuroscience and this is providing again a slightly different interpretation of that very well studied dopaminergic modulation of attention and policy um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6041.178,
    "end": 6041.498,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6042.618,
    "end": 6051.661,
    "text": "And in addition to that, I believe another important aspect is a modulation of synaptic plasticity by dopamine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6052.642,
    "end": 6061.305,
    "text": "Well, I can show you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6076.24,
    "end": 6077.201,
    "text": " Do you want to show something?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6077.221,
    "end": 6077.581,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6080.043,
    "end": 6085.506,
    "text": "Can you see this paper?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6087.868,
    "end": 6091.15,
    "text": "I sent you a link in the chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6091.851,
    "end": 6097.094,
    "text": "Or if you can't, I'll send you a PDF.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6097.875,
    "end": 6098.756,
    "text": "OK, let me see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6100.677,
    "end": 6102.118,
    "text": "I'll get it up now.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6107.899,
    "end": 6122.134,
    "text": " right the paper is um a critical time window for dopamine actions on the structural plasticity of dendritic spines from 2014. so what is interesting about this paper",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6125.68,
    "end": 6136.725,
    "text": " Yeah, it basically explains the modulation of plasticity by dopamine, which is common.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6137.305,
    "end": 6147.37,
    "text": "But the crucial point of this paper is that it proves that dopaminergic input can modulate",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6149.266,
    "end": 6154.309,
    "text": " Hebbian plasticity even after Hebbian plasticity is established.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6154.669,
    "end": 6170.279,
    "text": "So this paper showed that they add dopaminergic input, for example, two seconds after or several seconds after the Hebbian plasticity is established.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6170.359,
    "end": 6174.582,
    "text": "But such a post hoc modulation, post hoc",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6177.323,
    "end": 6194.407,
    "text": " introduction of dopaminergic input is sufficient to change the past plasticity, which may be associated with the post hoc re-evaluation of our past decisions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6194.767,
    "end": 6205.009,
    "text": "So by decision making, we of course changing the plasticity, changing the weight matrix through plasticity,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6205.689,
    "end": 6220.733,
    "text": " But to evaluate the goodness or badness of our decision, we need to observe the future outcome, which is propagated by, for example, dopamine.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6221.833,
    "end": 6232.756,
    "text": "And this paper nicely shows empirically that dopamine actually can change the past",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6235.049,
    "end": 6245.398,
    "text": " this Jones evaluation, maybe after such a psychic level, very, very local level equals called peak level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6247.76,
    "end": 6247.98,
    "text": "Hmm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6252.564,
    "end": 6258.83,
    "text": "So there's a short term window",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6260.766,
    "end": 6287.63,
    "text": " critical time window that they're describing but there's some window yeah some window yeah by which dopamine potentially unrelated to the initial heavy and plasticity event right where secondary dopamine signaling or not secondary just after the initial fact",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6289.246,
    "end": 6302.516,
    "text": " potentially have a different valence or the same valence can synergize or cancel the plasticity formed in the moment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6303.437,
    "end": 6304.037,
    "text": "Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6305.879,
    "end": 6312.644,
    "text": "And this is not limited to dopamine, but other neuromodulator can also do this.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6318.53,
    "end": 6324.794,
    "text": " Well, on one hand, how does this change our understanding of animal neurophysiology?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6324.814,
    "end": 6333.3,
    "text": "And then I guess on the other hand, how does this influence how we would design sentient artifacts?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6335.301,
    "end": 6347.59,
    "text": "For both animals and the sentient,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6348.974,
    "end": 6378.454,
    "text": " agent artificial agent uh and one important message i believe is that so this tells us um possible simple architecture to make planning you know this is association between past decision and future reward or any risk factors which is otherwise computed by",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6379.544,
    "end": 6384.969,
    "text": " computing forward prediction by iterating some computation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6385.489,
    "end": 6396.078,
    "text": "I believe this is a usual way to predict the future event and then select the action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6396.759,
    "end": 6405.487,
    "text": "But using this physical property, which is observed in an actual experiment,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6406.787,
    "end": 6414.873,
    "text": " we can design, we can imagine other simpler architecture to make a planning.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6417.635,
    "end": 6427.921,
    "text": "So for both animal and synthetic Bayesian agent, it provides an alternative explanation about the",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6429.762,
    "end": 6457.992,
    "text": " association between our past decision and the future based on the optimization of our decision to maximize the reward or minimize risk well one interesting note is we spoke earlier about the difference between the bayesian smoothing all at once approach and the bayesian filtering step-by-step approach now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6459.122,
    "end": 6465.907,
    "text": " If one had infinite knowledge and computational resources, the Bayesian smoothing approach is the way to go.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6466.567,
    "end": 6469.329,
    "text": "Like, you don't want the decision rule for investment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6469.869,
    "end": 6476.874,
    "text": "You want to look at the whole time series, past, present, and future, and know the best moments to have made the trades.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6477.334,
    "end": 6478.555,
    "text": "I mean, there's no comparison.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6478.695,
    "end": 6481.157,
    "text": "You're going to do better with the Bayesian smoothing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6481.963,
    "end": 6489.428,
    "text": " However, it's just implausible computationally and because it requires total memory of the past and knowledge of the future.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6490.149,
    "end": 6500.816,
    "text": "So that's what motivates the development of Bayesian filtering approaches, which are tractable and calculable through time.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6502.116,
    "end": 6505.559,
    "text": "Yet, with this time-delayed modulation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6507.705,
    "end": 6512.568,
    "text": " part of the Bayesian smoothing strength comes back into play.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6514.249,
    "end": 6523.174,
    "text": "It doesn't enable true anticipation of future states, but that's what the expected free energy does.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6524.935,
    "end": 6531.619,
    "text": "However, the delayed neuromodulation allows for reconsideration of a window of past states",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6532.918,
    "end": 6541.304,
    "text": " And so in that way, it corresponds to like a slightly deeper filter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6542.344,
    "end": 6548.829,
    "text": "Not just a filter of a time step of one, but a filter of like a rolling window of five or with some decay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6548.849,
    "end": 6554.733,
    "text": "And you don't want that window to be too big because if the window were 10 minutes...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6556.147,
    "end": 6562.812,
    "text": " then too many contrasting stimuli would get piled together.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6563.733,
    "end": 6566.835,
    "text": "The dopamine level would just converge to a mean field average.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6567.736,
    "end": 6582.327,
    "text": "But there's some time decay or time constant on the post hoc modulation where that neuromodulatory signal is actually a parameter of interest.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6583.433,
    "end": 6611.549,
    "text": " and that's not an infinitely long or infinitely short window but it's some niche dependent amount of time and that's a very interpretable and first principles interpretation of the computational role of neuromodulators in a way that is also consistent with all these other concordances we've been exploring so",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6613.385,
    "end": 6616.167,
    "text": " it's quite an interesting connection back.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6618.289,
    "end": 6632.781,
    "text": "I guess in our final minutes of this discussion, what are you, well, maybe go to the beginning at the end.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6633.854,
    "end": 6653.589,
    "text": " which I meant to ask earlier, but it's a good way that we can sort of close today and look forward, which is how did you come to this line of research, specifically studying neural networks in this way with Carl Friston and your colleagues?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6658.613,
    "end": 6660.675,
    "text": "So, yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6664.034,
    "end": 6666.069,
    "text": " So, well...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6668.926,
    "end": 6677.731,
    "text": " So my interest was the characterization of biological network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6678.391,
    "end": 6695.282,
    "text": "So my first motivation is to make a biologically plausible artificial intelligence, but to achieve that we need to know about biological brain or biological neural network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6696.466,
    "end": 6716.52,
    "text": " And then, in these several years, I collaborated with the doctor, Professor Carl Christen, to study about his theory of re-energy principle activity in forests.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6718.386,
    "end": 6739.435,
    "text": " And then my question during that period was, is the free energy principle everything about the biologically plausible neural network?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6739.775,
    "end": 6745.498,
    "text": "Or is there any other aspect that can characterize",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6746.601,
    "end": 6769.551,
    "text": " uh the vertical neural network so it is non-trivial uh it was non-trivial so that's why i i tried to so i tried to start from uh characterizing the neural network first so our strategy is not",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6773.001,
    "end": 6784.106,
    "text": " not considering the way of implementing any Bayesian algorithm as the brain architecture.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6784.146,
    "end": 6793.03,
    "text": "But my interest is rather characterization of a given vertical network in terms of",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6794.486,
    "end": 6796.747,
    "text": " something, some other things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6797.788,
    "end": 6802.951,
    "text": "One possible way is, of course, Bayesian inference, free-energy principle-active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6803.891,
    "end": 6809.334,
    "text": "So that's why I first start from characterizing biological network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6810.955,
    "end": 6818.66,
    "text": "But just defining neural network architecture is insufficient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6818.78,
    "end": 6819.74,
    "text": "It is too",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6822.038,
    "end": 6823.619,
    "text": " it is not tractable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6823.659,
    "end": 6833.803,
    "text": "It is far beyond the computational tractability as the mathematical analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6833.963,
    "end": 6844.427,
    "text": "And we need some assumption or some trick to increase the tractability.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6844.607,
    "end": 6849.949,
    "text": "And one day, I came up with an idea that",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6854.169,
    "end": 6865.616,
    "text": " So in which we consider that both neuroactivity and plasticity follow the same cost function gradient.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6865.957,
    "end": 6877.544,
    "text": "This is very much an analogy with a physical system like Lagrangian formulation or Hamiltonian formulation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6877.604,
    "end": 6879.405,
    "text": "So usually we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6879.861,
    "end": 6899.236,
    "text": " consider some energy landscape and design plausible trajectory as the solution of some principle of minimum action or least action.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6899.937,
    "end": 6900.277,
    "text": "So we",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6903.078,
    "end": 6922.569,
    "text": " Imagine that, what if we apply such idea to neural network, conventional neural, canonical neural network or biological neural network to characterize their dynamics in the first principle.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6923.59,
    "end": 6929.453,
    "text": "That's the first motivation, first step to come up with this framework.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6931.795,
    "end": 6951.911,
    "text": " And finally, we noticed that it is not easy to connect the Newtonian dynamics with this type of neural activity study because neural activity creation is not necessary to be a second-order differential equation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6953.357,
    "end": 6979.956,
    "text": " rather it is a first order and considering many things then we we finally used a cost function proposed in the papers which is not necessary have a formal",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6982.376,
    "end": 7003.494,
    "text": " identity with the so-called Lagrangian in the Newtonian physics, but it is rather plausible as the rule or underlying mechanism of such type of network.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7012.193,
    "end": 7012.513,
    "text": " Awesome.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7013.834,
    "end": 7019.476,
    "text": "Well, it has been quite an interesting dot one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7020.396,
    "end": 7024.278,
    "text": "I really appreciate everything you've shared today.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7025.559,
    "end": 7027.419,
    "text": "Is there anything else you want to add at this point?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7027.439,
    "end": 7028.68,
    "text": "Otherwise, we'll talk again.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7030.661,
    "end": 7033.382,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7034.162,
    "end": 7035.743,
    "text": "I already speak.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7038.024,
    "end": 7038.364,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7038.384,
    "end": 7039.104,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7040.044,
    "end": 7040.685,
    "text": "Talk to you later.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7040.945,
    "end": 7041.105,
    "text": "Bye.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 7041.994,
    "end": 7044.601,
    "text": " Yeah, thank you very much for a nice discussion.",
    "speaker": "SPEAKER_02"
  }
]