[
  {
    "start": 33.288,
    "end": 34.909,
    "text": " Hello and welcome everyone.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 35.389,
    "end": 37.79,
    "text": "This is Active Livestream number 51.2.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 37.931,
    "end": 38.731,
    "text": "It's November 9th, 2022.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 38.831,
    "end": 41.092,
    "text": "Welcome to the Active Inference Institute.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 46.38,
    "end": 53.045,
    "text": " We're a participatory online institute that is communicating, learning, and practicing applied active inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 53.866,
    "end": 60.091,
    "text": "This is a recorded and an archived livestream, so please provide us feedback so we can improve our work.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 61.131,
    "end": 67.396,
    "text": "All backgrounds and perspectives are welcome, and we'll be following video etiquette for livestreams.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 69.178,
    "end": 75.643,
    "text": "Head over to activeinference.org to learn more about participating in different institute projects.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 77.308,
    "end": 79.202,
    "text": " All right, well, we're in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 80.572,
    "end": 107.647,
    "text": " actin stream number 51.2 we're in our third discussion on the paper canonical neural networks perform active inference from 2022. we had a dot zero video with some background and context and overview and then last week in 51.1 we had a great discussion went over many interesting details of the paper",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 108.427,
    "end": 126.963,
    "text": " and related topics so today we're going to jump in cover some empirical details some implications connect some more dots maybe look at some code and thanks again takuya for joining these discussions um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 127.944,
    "end": 143.734,
    "text": " i'm daniel i'm a researcher in california and thought a lot over the last week about what this kind of neural network pomdp synthesis or translation really means",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 144.975,
    "end": 169.829,
    "text": " and just want to learn more about what fundamentals or foundational aspects of these different kinds of models enable that synthesis or translation and then again what that means for areas where one or the other kind of model is already in use so thanks again for joining and i'll pass it to you",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 176.335,
    "end": 180.977,
    "text": " If you want to say hi or give any other a second introduction.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 183.278,
    "end": 183.718,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 183.898,
    "end": 188.46,
    "text": "I'm Takuya Isomura in RIKEN Brain Science Institute, Japan.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 189.54,
    "end": 199.464,
    "text": "So I look forward to discuss another different aspect of this work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 200.004,
    "end": 201.145,
    "text": "So yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 203.547,
    "end": 218.865,
    "text": " Well, let's just remind ourselves of the fundamental parallel being made in the paper, and then we'll get to these two questions about kind of the two directions that things can go.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 220.346,
    "end": 223.03,
    "text": "One representation is in equation one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 224.192,
    "end": 230.393,
    "text": " with a loss function of a neural network and the free energy on a POMDP.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 230.953,
    "end": 242.516,
    "text": "And that's also seen visually in figure one with a neural network being drawn a concordance against the variational base of the action perception loop.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 242.976,
    "end": 249.017,
    "text": "So maybe just let's begin by restating what is this parallel",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 250.037,
    "end": 252.924,
    "text": " that is in equation one and figure one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 254.187,
    "end": 256.693,
    "text": "And how was it reached in this paper?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 259.701,
    "end": 259.901,
    "text": "So,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 261.577,
    "end": 284.953,
    "text": " Basically, the idea here is that we would like to characterize the dynamics and plasticity of canonical neural network in terms of Bayesian inference because arbitrary dynamics of neural network is intractable in the sense that we don't know",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 285.893,
    "end": 298.424,
    "text": " what is the function underlying such a dynamics and what is the consequence of the self-organization or plasticity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 300.366,
    "end": 307.092,
    "text": "So once we translate the dynamics in terms of Bayesian inference, we can assign",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 309.033,
    "end": 323.767,
    "text": " quantities in Bayesian inference for any biological quantities, which enables us to lend the explainability to the neural network dynamics and architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 324.607,
    "end": 326.649,
    "text": "So that's a basic idea.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 327.09,
    "end": 332.354,
    "text": "And what we have done in this paper is that we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 333.314,
    "end": 353.489,
    "text": " consider a biologically plausible cost function for this particular canonical neural network and show the equivalence between that cost function and the variation of free energy under a particular partially observable normal composition process model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 355.191,
    "end": 355.791,
    "text": "So, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 358.234,
    "end": 358.574,
    "text": " Awesome.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 359.254,
    "end": 368.298,
    "text": "So let's look at the parallel between the cost function for neural networks and the variational free energy.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 368.919,
    "end": 372.82,
    "text": "So one representation of that was in figure three.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 373.581,
    "end": 385.406,
    "text": "So maybe could you just describe what is the structure of the variational free energy expression and what is the structure of the loss function?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 387.296,
    "end": 402.539,
    "text": " Okay, so there is a clear parallel between the functional structure or those component in variational free energy and the component in neural network cost function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 403.319,
    "end": 411.781,
    "text": "So let's say the first time in F correspond to the, yeah, it's correspond to the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 413.154,
    "end": 415.595,
    "text": " the expectation about hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 416.315,
    "end": 420.096,
    "text": "S is hidden state posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 420.236,
    "end": 429.718,
    "text": "So that part basically indicates the free energy with respect to the hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 429.758,
    "end": 429.978,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 430.899,
    "end": 431.899,
    "text": "And the second part",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 432.951,
    "end": 449.069,
    "text": " correspond to the free energy but the decision posterior so here delta indicates the posterior belief about agent decision or action and now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 451.369,
    "end": 477.297,
    "text": " in terms of the correspondence between the free energy and neural network function here the first time in the neural network cost function correspond to middle layer neural activity which has the recurrent connection and receive sensory input from sensory layer and then project the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 478.268,
    "end": 481.129,
    "text": " the output to the output layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 482.57,
    "end": 494.436,
    "text": "And the second term corresponds to the output layer, which receives signals from the middle layer and sends the feedback response to the environment.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 505.393,
    "end": 516.979,
    "text": " So both of these expressions have the first term being more like a cognitive, perceptual, sensory learning term.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 517.519,
    "end": 523.082,
    "text": "And the second term is more like a control theoretic action selection.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 524.182,
    "end": 530.406,
    "text": "And how did you see this analogy or concordance?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 530.506,
    "end": 534.948,
    "text": "Because it looks like a zipper, like everything is totally lined up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 538.456,
    "end": 551.497,
    "text": " Well, so this figure, this graph itself showed a clear correspondence because so now",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 552.398,
    "end": 563.122,
    "text": " we are considering a particular form of POMDP in which each element of hidden state takes either 0 or 1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 563.883,
    "end": 572.126,
    "text": "But there are many states, so it is expressed in the form of, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 574.116,
    "end": 575.117,
    "text": " factorization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 576.057,
    "end": 592.427,
    "text": "So now we consider that in terms of the S's posterior, bold S, upper part of bold S correspond to the expectation about each element of S taking one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 593.991,
    "end": 600.675,
    "text": " and the lower part of the bold S correspond to the expectation about S taking zero.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 600.975,
    "end": 607.159,
    "text": "So it is a block vector about the expectation, posterior expectation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 607.999,
    "end": 610.241,
    "text": "And this S nicely",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 611.261,
    "end": 619.968,
    "text": " correspond to the block vector shown in the bottom of this figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 621.229,
    "end": 629.036,
    "text": "It is a vector of x and bar x. And here, bar x indicates 1 minus x in the element-wise sense.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 639.305,
    "end": 648.614,
    "text": " which exactly corresponds to the block vector of S expectation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 648.634,
    "end": 656.702,
    "text": "This correspondence also observed in the second",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 658.362,
    "end": 676.64,
    "text": " term here log s correspond to log x and also log a correspond to the block matrix of w log w here",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 678.009,
    "end": 705.022,
    "text": " W hat indicates the sigmoidal function of W, and its bar means 1 minus sigmoidal function of W. So actually, because we now consider binary hidden state and binary observation, it's likelihood mapping",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 705.6,
    "end": 718.51,
    "text": " So likelihood mapping from hidden state to observation is expressed as a block matrix, which exactly corresponds to the block matrix shown in the bottom of this figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 725.155,
    "end": 735.022,
    "text": "So like this, for every term, we have the exact correspondence between the upper expression and the lower expression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 738.16,
    "end": 747.385,
    "text": " So that's why we can say that this is a natural mapping from neural network formation to variational region formation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 751.487,
    "end": 758.631,
    "text": "So it speaks as a sort of identity between those two different expressions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 760.373,
    "end": 774.497,
    "text": " So although one may be able to consider another mapping from neural network to Bayesian inference, this is a sort of the simplest mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 777.378,
    "end": 786.12,
    "text": "So how would it look different if it were three states categorical distribution or a continuous distribution?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 786.32,
    "end": 788.441,
    "text": "What aspects would change?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 789.822,
    "end": 792.385,
    "text": " Thank you for asking that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 792.505,
    "end": 813.143,
    "text": "So that's, in some sense, outside of this paper, because only when we consider a binary state, binary hidden state, this analogy is established nicely.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 813.603,
    "end": 814.163,
    "text": "Otherwise,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 815.347,
    "end": 818.068,
    "text": " we need to consider some extension.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 819.188,
    "end": 833.292,
    "text": "So because consider that each neuron encode the probability or expectation of some value taking 1.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 834.613,
    "end": 837.054,
    "text": "Then the probability or expectation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 840.485,
    "end": 849.791,
    "text": " of taking 0 can be simply computed by computing 1 minus neural activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 849.871,
    "end": 859.858,
    "text": "So actually, neural activity, which is a single-dimensional variable, is sufficient to express the expectation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 861.159,
    "end": 868.664,
    "text": "But once we consider the three-state hidden state program,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 869.544,
    "end": 886.148,
    "text": " So this doesn't work, so we need to consider at least two variables, but its relation to neural network expression is not very clear in general.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 892.298,
    "end": 911.333,
    "text": " that's very interesting why it would be so strong of a concordance in a binary case but immediately unclear for other distributions yeah",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 915.811,
    "end": 939.766,
    "text": " Generally, for POMDP expression, we consider the one-hot expression, one-hot vector expression, which means that we normalize the value in the sense that the summation or variable to be one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 941.883,
    "end": 957.469,
    "text": " Maybe there is some neural substrates that achieve that normalization, but for a classic type of neural network, like canonical neural network considered in this paper,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 958.909,
    "end": 964.032,
    "text": " What is that neuronal substrate is not really clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 964.652,
    "end": 973.237,
    "text": "That's why we selected the binary case, because it's simple and has a clear analogy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 975.017,
    "end": 998.339,
    "text": " So what does it mean for a artificial or for a biological neuron to have activity dynamics or plasticity context that justifies it being described as playing like a belief role in a Bayesian setting?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1001.929,
    "end": 1005.653,
    "text": " Higher firing means more belief, higher firing means lower belief.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1005.954,
    "end": 1011.42,
    "text": "What does it really mean to have a connection between activity dynamics and belief states?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1012.561,
    "end": 1012.942,
    "text": "I see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1013.382,
    "end": 1020.471,
    "text": "So if you assign a particular mapping, then it's meaning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1021.111,
    "end": 1022.592,
    "text": " is also determined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1023.213,
    "end": 1036.381,
    "text": "In this case, we assign that neural activity correspond to the posterior expectation about an element of hidden state taking one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1037.221,
    "end": 1045.727,
    "text": "So once we define this mapping, then higher neural activity indicate the higher probability of taking one.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1052.779,
    "end": 1065.364,
    "text": " So neural activity is on the x-axis, and the y-axis of the sigmoid function is the probability of taking one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1067.645,
    "end": 1074.628,
    "text": "Well, neural activity encodes the expectation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1075.468,
    "end": 1080.71,
    "text": "So neural activity is the sigmoidal function of something itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1088.261,
    "end": 1100.626,
    "text": " So this is because once we see a fixed point of neural activity equation, which is derived from this cos function, it has a form of sigmoidal function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1100.706,
    "end": 1104.007,
    "text": "So x equals sigmoidal function of blah, blah, blah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1104.788,
    "end": 1110.51,
    "text": "So this form is exactly correspond to a softmax",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1111.346,
    "end": 1136.086,
    "text": " operation softmax function of something which is seen in the solution of posterior expectation that is so that's what the neural activity encodes and what is the Bayesian interpretation or the update rules on the plasticity",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1138.08,
    "end": 1142.103,
    "text": " OK, that's another important point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1142.704,
    "end": 1167.322,
    "text": "So in terms of posterior parameters, so in the case of Bayesian inference, we consider the update about the Dirichlet parameter of A matrix and B matrix, which is usually expressed by the small case variable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1169.043,
    "end": 1190.33,
    "text": " And its meaning is that if we compute the partial derivative of f with respect to small a, then its fixed point solution looks like",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1194.074,
    "end": 1215.531,
    "text": " Outer product of SNO, which is also known as Hebbian product, because it has analogy to update rule depending on the pre-synaptic neuron activity and post-synaptic neuron activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1216.477,
    "end": 1231.986,
    "text": " And according to this formal equivalence, we revisit, we can see again such an analogy in a formal sense here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1235.052,
    "end": 1245.927,
    "text": " if we compute the partial derivative of L neural network cost function with respect to W, then we get a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1249.309,
    "end": 1263.594,
    "text": " then we can formally derive the Hebbian plasticity which depends on the activity of pre- and post-synaptic neural activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1268.695,
    "end": 1297.946,
    "text": " okay so hebion plasticity often described as neurons that fire together wired together here you're discussing it in terms of a matrix operation on the pomdp side between observables and hidden states so there's a hebion plasticity happening between the perceptual layer",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1300.719,
    "end": 1302.62,
    "text": " and the cognitive layer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1302.64,
    "end": 1305.342,
    "text": "Right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1305.362,
    "end": 1324.654,
    "text": "So the first half of the neural network is trained according to Hebbian plasticity rules that optimize the A in terms of the perceptual and learning-like relationship between hidden states and observables.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1326.878,
    "end": 1350.056,
    "text": " then the second half of the neural network has a slightly different structure it is optimizing based upon retroactive reanalysis of consequences of action according to the fictive causality construction",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1353.682,
    "end": 1365.764,
    "text": " So actually, in this figure B, upper layer correspond to environment, and the lower part correspond to agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1365.824,
    "end": 1370.325,
    "text": "So this structure correspond to figure A's.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1371.106,
    "end": 1374.726,
    "text": "This correspond to a simpler version of POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1374.846,
    "end": 1377.907,
    "text": "So for full version of POMDP,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1378.847,
    "end": 1385.57,
    "text": " Its corresponding neural network is showing figure four of this paper.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1385.59,
    "end": 1394.633,
    "text": "This is the neural network architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1395.033,
    "end": 1395.573,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1403.058,
    "end": 1418.124,
    "text": " So as you said, there is a network connection from sensory layer to cognitive layer, which is expressed by W here, and recurrent connection, which correspond to state transition matrix,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1418.844,
    "end": 1442.416,
    "text": " is expressed by K matrix which is recurrent synaptic connectivity and as you say the action generation through retrospective reward or risk evaluation is done by output layer through the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1444.318,
    "end": 1449.17,
    "text": " synaptic connectivity expressed as V in this figure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1451.485,
    "end": 1472.052,
    "text": " So V is the synaptic connectivity between cognitive states in the middle layer and the action selection states in Y. And so in that way, V is exactly analogous to W. But why and how does gamma come into play only in this second layer?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1472.292,
    "end": 1476.233,
    "text": "I mean, why not have gamma one in the first layer, gamma two in the second layer?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1479.278,
    "end": 1491.907,
    "text": " Generally speaking, it is possible to modulate plasticity in the first layer using another modulator, gamma.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1492.407,
    "end": 1498.172,
    "text": "But for simplicity, we focus only on neural modulation in the output layer.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1499.072,
    "end": 1526.835,
    "text": " Analogy is that, for example, as you said, the first layer computes more perceptual things, so perception of an external world, and instead, on the other hand, the second layer, which is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1528.516,
    "end": 1532.943,
    "text": " mapping from cognitive layer to action layer",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1539.075,
    "end": 1543.258,
    "text": " perform the optimization of its own action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1543.798,
    "end": 1558.609,
    "text": "For example, in the story atom, in the brain, action selection is optimized by modulation of dopaminergic input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1560.27,
    "end": 1575.702,
    "text": " Usually, that circuit receives signals from a cortical neural circuit and sends signals to another neural nucleus in",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1580.298,
    "end": 1581.138,
    "text": " meet a brain.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1581.839,
    "end": 1592.885,
    "text": "But a point here is that neuron in striatum encode some decision, for example, goal or no goal.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1593.245,
    "end": 1596.027,
    "text": "So such a decision is encoded.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1597.142,
    "end": 1625.576,
    "text": " So now we consider analogy between POMDP expression in the Bayesian formation and the neural circuit in the brain that optimize action through some sort of modulation by another factor here that factor correspond to gamma",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1627.026,
    "end": 1638.692,
    "text": " And the role of gamma, gamma has a variety of functions.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1638.732,
    "end": 1645.195,
    "text": "But in this paper, we focus only on the modulation of plasticity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1646.755,
    "end": 1655.619,
    "text": "So here, the Hebbian plasticity is not determined by only a preposterous relationship, but determined by",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1657.99,
    "end": 1672.178,
    "text": " It's a three-factor relationship in the sense that the plasticity is updated by the product of gamma and pre- and post-synaptic activity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1672.458,
    "end": 1677.4,
    "text": "So there are three times in one plasticity group.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1678.381,
    "end": 1682.283,
    "text": "This is why this gamma can modulate plasticity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1686.519,
    "end": 1692.263,
    "text": " So how would a glial factor look different computationally?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1692.963,
    "end": 1700.828,
    "text": "And where in the brain have people identified glial or other factors as relevant for learning?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1700.848,
    "end": 1704.97,
    "text": "Yeah, that's interesting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1705.471,
    "end": 1712.275,
    "text": "I'm not fully sure about the equation of the glial modulation of neural activity or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1712.932,
    "end": 1734.703,
    "text": " plasticity, there are many discussion and I don't, I'm sorry, I don't know the exact form, but one possible implementation is similar to this type of neuromodulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1734.923,
    "end": 1738.085,
    "text": "So it would be possible to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1739.401,
    "end": 1758.547,
    "text": " model some glial modulation, contribution of glial factor to plasticity in the form of three-factor learning rule, which is mathematically speaking the same as this type of neuromodulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1764.09,
    "end": 1784.876,
    "text": " here in table two we have another set of correspondences it's like a sideways figure three right but a little bit more like a dictionary anything to add or any variables that we haven't really mentioned",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1787.11,
    "end": 1788.631,
    "text": " What about the firing thresholds?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1788.791,
    "end": 1794.434,
    "text": "Because these are common parameters in a neural model.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1795.495,
    "end": 1807.922,
    "text": "However, we don't really hear about the interpretation of these constructs within the variational Bayes POMDP.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1809.923,
    "end": 1815.127,
    "text": "Yeah, there is an interesting story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1816.69,
    "end": 1820.234,
    "text": " Yeah, that's a very interesting point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1820.334,
    "end": 1836.393,
    "text": "So when we first tried to make made an analogy between neural network on the home DP program, one program is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1839.139,
    "end": 1847.303,
    "text": " the law of threshold factor, because as you said, it is not observed in POMDP structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1848.083,
    "end": 1864.671,
    "text": "But there is another factor in POMDP, which is prior expectation about hidden state, which is usually expressed by D matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1866.492,
    "end": 1866.973,
    "text": "And we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1868.166,
    "end": 1874.804,
    "text": " But what we consider is the relationship between the matrix and the firing threshold.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1877.927,
    "end": 1906.363,
    "text": " Finally, what we found is that spiring threshold is not equal to D matrix itself, but it is a summation of D matrix and some function of synaptic strength, which is equal to A matrix, B matrix in the POMDP formation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1907.083,
    "end": 1926.117,
    "text": " In other words, what we found is that H, which is the firing threshold in neural network architecture, is actually an adaptive threshold, which is not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1928.819,
    "end": 1940.564,
    "text": " fixed value but h is a function of w synaptic strength and h changes depending on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1942.612,
    "end": 1951.174,
    "text": " For example, if W is too large, then neural activity can be unstable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1951.274,
    "end": 1961.176,
    "text": "So we have to reduce the activity to make neural activity more stable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1961.616,
    "end": 1968.278,
    "text": "So we can see an analogy of homeostatic mechanism here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1969.458,
    "end": 1992.96,
    "text": " So like this, if we design H as the function of W and the function of some another factor, which is all perturbation term in this,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 1993.732,
    "end": 2008.826,
    "text": " table, then we could make a formal analogy between this H and some variable in POMDP formulation, which is shown in the right-hand side of this table.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2009.426,
    "end": 2018.795,
    "text": " table, although its value is not simple because it has three terms, three different terms.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2018.835,
    "end": 2025.561,
    "text": "So all of them contribute to make H or M",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2028.949,
    "end": 2041.413,
    "text": " But anyway, once we establish a mapping between H and this value, then everything works.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2041.853,
    "end": 2050.035,
    "text": "So the cost function in different settings have a homer correspondence.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2053.256,
    "end": 2057.197,
    "text": "What are the H and the M firing thresholds?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2058.371,
    "end": 2072.434,
    "text": " So H corresponds to middle-layer RM threshold, and M indicates output-layer threshold, which are different variables.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2073.335,
    "end": 2087.518,
    "text": "And interestingly, H corresponds to prior expectation but hidden state, because it corresponds to cognitive layer, and M corresponds to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2088.51,
    "end": 2113.622,
    "text": " prior belief about its own action because it is a it is a bias in the action layer yeah it's very interesting that the perceptual firing threshold h only includes prior beliefs on hidden states",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2115.031,
    "end": 2126.299,
    "text": " beliefs about how observations map to hidden states A and beliefs about how hidden states change through time B. So that's like pure passive inference.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2127.539,
    "end": 2143.95,
    "text": "And then the firing thresholds for M correspond to only beliefs about preferences and beliefs about actions or habits with C and E. So there's like a complete division of labor",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2145.171,
    "end": 2167.271,
    "text": " or partitioning functionally between these structurally different parts of the neural network and structurally different and functionally different parts of the pomdp yet they're integrated in unified loss functions or unified imperatives",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2170.564,
    "end": 2198.02,
    "text": " so it's like there's extreme separability of perception and action on both sides of the figure one divide but also they're integrated but they're separate and that's what kind of grants it the best of both worlds because if they were any more integrated you couldn't really pull them apart",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2199.185,
    "end": 2226.761,
    "text": " if they were any less integrated then the imperative the loss function or the variational free energy would be ad hoc and unprincipled but there's kind of a middle ground where they have a principled integration but still a distinguishment right this is caused by you know network structure defined uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2231.453,
    "end": 2235.819,
    "text": " or it is because the structure of Bayesian network defined in POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2247.546,
    "end": 2247.947,
    "text": " model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2249.508,
    "end": 2256.096,
    "text": "Both of them define the causal relationship between elements or quantities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2256.116,
    "end": 2258.098,
    "text": "Its substrate is",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2263.692,
    "end": 2264.553,
    "text": " not important.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2264.713,
    "end": 2275.843,
    "text": "So its relationship, causal relationship is crucial to determine the cost function or its fixed point in this context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2276.363,
    "end": 2280.907,
    "text": "So that's why we can see that analogy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2284.827,
    "end": 2296.934,
    "text": " Well, there's a few technical points I think we can now go into, and then there will be some more general points about applications and intelligence.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2297.754,
    "end": 2302.156,
    "text": "So first, the code availability statement.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2302.997,
    "end": 2306.339,
    "text": "Awesome to see that the MATLAB scripts are available.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2307.276,
    "end": 2309.617,
    "text": " and also archived on Zenodo.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2310.458,
    "end": 2315.28,
    "text": "So here is the GitHub repo for reverse engineering.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2315.3,
    "end": 2321.324,
    "text": "Do you want to give any overview descriptions of what people can expect to see in this repo?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2321.944,
    "end": 2324.846,
    "text": "And also what about using MATLAB?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2330.409,
    "end": 2332.37,
    "text": "Why did you use MATLAB?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2332.75,
    "end": 2335.852,
    "text": "What advantages or limitations do you see in MATLAB?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2338.732,
    "end": 2351.395,
    "text": " So because this is a very simple simulation, so MATLAB is sufficient to encode the whole script.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2352.755,
    "end": 2361.038,
    "text": "And so we also try some visualization in the MATLAB.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2361.298,
    "end": 2366.059,
    "text": "See here, if you run the script, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2368.211,
    "end": 2379.121,
    "text": " you can see the process of an agent solving the maze task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2379.761,
    "end": 2381.583,
    "text": "What do they do in the maze task?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2383.125,
    "end": 2386.668,
    "text": "So here, the aim of this agent",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2388.203,
    "end": 2394.506,
    "text": " is to reach the right-hand side of this maze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2394.786,
    "end": 2404.891,
    "text": "And so because this is a typical example of a delayed modulation task, that's why we select the maze task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2407.012,
    "end": 2414.035,
    "text": "So to achieve this maze task, agent required to make some plan to",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2415.356,
    "end": 2419.701,
    "text": " be able to select a good decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2420.202,
    "end": 2433.338,
    "text": "Because without planning, you may encounter the wall and cannot go further and you may fail the maze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2434.079,
    "end": 2443.591,
    "text": " But with planning, it is possible to see the path to reach the right-hand side of this space.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2446.414,
    "end": 2448.957,
    "text": "So does it know its x position?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2453.45,
    "end": 2464.434,
    "text": " Yeah, it received a state from neighboring 11 times 11 cells, which is shown in the bottom part.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2464.554,
    "end": 2474.657,
    "text": "Yeah, this all most left figure indicate the observation, so 11 times 11 state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2477.85,
    "end": 2481.111,
    "text": " around the agent position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2482.292,
    "end": 2492.735,
    "text": "Now agent is on the right-hand side of the maze at the goal position, and it observes a neighboring state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2497.277,
    "end": 2499.117,
    "text": "Well, a few interesting things.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2500.017,
    "end": 2503.119,
    "text": "Here, it's looking off the right end.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2504.079,
    "end": 2504.359,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2504.833,
    "end": 2511.198,
    "text": " And it has this kind of periodic belief in the key distribution.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2511.898,
    "end": 2512.439,
    "text": "Why?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2515.481,
    "end": 2526.729,
    "text": "I think it is because when the agent is in the middle point of maze, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2529.654,
    "end": 2533.457,
    "text": " All neighboring state is in the maze.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2533.517,
    "end": 2538.881,
    "text": "So there is a path, and there is a wall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2540.142,
    "end": 2548.669,
    "text": "So this makes some periodicity, because maze have some structures.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2549.109,
    "end": 2553.733,
    "text": "And actually, it have a periodic structure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2555.012,
    "end": 2562.555,
    "text": " And only at the goal position, then right-hand side becomes a wall.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2563.996,
    "end": 2572.139,
    "text": "But it is not common for this agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2572.159,
    "end": 2581.062,
    "text": "This is because this agent shows such periodic patterns.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2584.471,
    "end": 2600.764,
    "text": " yeah the streets are one wide and they tend to be separated by one so we see this periodicity what is um the numbers in this middle bottom plot and what does the checkerboard represent",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2601.82,
    "end": 2603.301,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2603.841,
    "end": 2611.624,
    "text": "Here, Qs and Qd correspond to possible expectation about the state and the decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2611.844,
    "end": 2616.506,
    "text": "So middle panel indicate decision posterior.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2617.447,
    "end": 2626.251,
    "text": "And decision here, we characterize decision as a sequence of four-step",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2627.872,
    "end": 2637.965,
    "text": " So each action corresponds to a movement to right or left or up or down.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2639.74,
    "end": 2659.793,
    "text": " And we consider a four-step sequence of that action, which is expressed as D. So it has four power of four possibilities. 256.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2664.173,
    "end": 2665.054,
    "text": " Yeah, 256.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2665.614,
    "end": 2671.317,
    "text": "So this is plotted on a x-y coordinate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2672.638,
    "end": 2681.804,
    "text": "Because in the middle panel, the middle point corresponds to the current position of agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2682.184,
    "end": 2693.771,
    "text": "And with the four-step movement, agent can go one of any colored position.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2695.954,
    "end": 2704.597,
    "text": " And the color brightness correspond to the expectation about the agent decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2706.017,
    "end": 2707.678,
    "text": "Well, this is very interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2708.098,
    "end": 2714.62,
    "text": "If we just were to think about you're in a point, and you can go up, down, left, right, you have four moves.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2716.841,
    "end": 2721.042,
    "text": "Naively, it sounds like, well, it should look like a Gaussian blur.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2722.219,
    "end": 2728.163,
    "text": " Most of those should cancel out and then it should become rarer and rarer monotonically.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2728.843,
    "end": 2743.312,
    "text": "But actually you start in the middle, you can't end up on these white squares because it's like one, two, three, and then you have to leave.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2746.207,
    "end": 2765.673,
    "text": " So it's kind of like horses in chess or other pieces where actually their embodiment, like it's very unexpected that you can't in four moves, end up next to where you began when you can be so much further.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2766.653,
    "end": 2772.235,
    "text": "And then we see this kind of like embodied inferential prior with QS.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2774.349,
    "end": 2780.752,
    "text": " that embodies regularity beliefs about the width of the road and the separation of the roads.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2781.772,
    "end": 2793.138,
    "text": "And then there's these like embodied action priors and real consequences that have to do with the structure of movement.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2795.179,
    "end": 2797.7,
    "text": "So what it's doing, it's thinking,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2799.338,
    "end": 2801.299,
    "text": " about policies of length four.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2801.599,
    "end": 2804.081,
    "text": "There's 256 policies of length four.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2805.182,
    "end": 2810.305,
    "text": "There's some degeneracy because there's obviously not 256 squares here.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2811.045,
    "end": 2819.31,
    "text": "So while only one policy is going to take you up, up, up, up, up, down, down, down, down, down, other squares are reachable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2819.43,
    "end": 2828.776,
    "text": "Like the center square is probably the mode because it can be reached at least a handful of ways.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2831.966,
    "end": 2851.783,
    "text": " and then at each time point it's basically saying okay I know where my X position is and given my local 11 by 11 view I'm trying to plan to go right oh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2855.154,
    "end": 2882.785,
    "text": " then here through time in the simulation here it starts at 30 something it quickly figures out how to get to about 40. and then it's kind of going up and down on 40 but it can't really break out because all of these bottom four routes are closed it has a breakout and then very quickly it hits another plateau around 60.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2884.56,
    "end": 2902.641,
    "text": " right then it kind of has a very nice breakout and in just a few steps goes very far so what is dopamine doing or how is dopamine helping it in the Plateau and then to break out of the Plateau",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2903.857,
    "end": 2913.068,
    "text": " Yes, so this agent runs this particular maze structure",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2917.006,
    "end": 2941.579,
    "text": " through many trials so before training it failed to reach the goal but after training it achieved such a such a nice behavior so to achieve this the role of dopamine is that we design a gamma function such that if",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2942.791,
    "end": 2954.5,
    "text": " the agent can move rightward with some distance during some time limit, then risk becomes small.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2954.74,
    "end": 2960.024,
    "text": "So like, say, gamma equals 0, so no risk situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2960.524,
    "end": 2969.31,
    "text": "In that sense, in that case, this agent updates synaptic weights through Hebbian plasticity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2970.411,
    "end": 2991.959,
    "text": " But if the agent fails to go rightward with some distance during a limited time frame, then gamma becomes large, like 0.6, which is larger than the average 0.5.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2997.323,
    "end": 3001.317,
    "text": " design that drawing in such situation",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3003.012,
    "end": 3007.754,
    "text": " anti-Hebbian plasticity occurred instead of Hebbian plasticity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3007.834,
    "end": 3024.001,
    "text": "So anti-Hebbian plasticity indicate, so works as the disassociation between the current state and current decisions, because the current decision doesn't work.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3024.141,
    "end": 3026.783,
    "text": "It's not good decision.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3027.163,
    "end": 3029.524,
    "text": "So we try to make",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3030.377,
    "end": 3042.091,
    "text": " the agent forget that particular decision rules through the modulation of heavy and plasticity done by gamma factor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3042.651,
    "end": 3050.3,
    "text": "So this can be analog to the dopaminergic modulation of heavy and plasticity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3052.242,
    "end": 3068.579,
    "text": " so if the policy is resulting in the expected outcome gamma stays at 0.5 the policy is as risky or consequential as expected and then the policy can either go better than expected",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3069.46,
    "end": 3086.13,
    "text": " which facilitates learning to support that decision to be made more, or the outcome of the policy can be worse than expected, which disassociates previous conceptions to discourage that kind of behavior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3087.171,
    "end": 3087.912,
    "text": " Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3088.853,
    "end": 3104.513,
    "text": "A crucial point is that this association is done with a different time frame in the sense that we consider multiplication of current risk and past decisions to average",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3106.275,
    "end": 3111.696,
    "text": " over past to present Hebbian product.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3112.376,
    "end": 3126.039,
    "text": "This makes an association between past decision sequence and the current risk, which enables to optimize the decision to minimize the future risk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3126.939,
    "end": 3128.84,
    "text": "It is just a shift of timeframe.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3131.94,
    "end": 3134.961,
    "text": "So here, risk is being used in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3136.98,
    "end": 3165.132,
    "text": " a formal sense similar to how it's used in economics which is the associated uncertainty of outcomes with respect to a policy where does danger come into play like what if there was a adversary in the maze or something that was dangerous how does this kind of model accommodate or hunger",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3166.164,
    "end": 3185.417,
    "text": " or different kinds of competitions because right now it's basically just trying to diffuse right word with a bias right but how do different kind of um situational elements become integrated into the generative model and generative process okay",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3186.681,
    "end": 3197.524,
    "text": " Any of those factors can be involved in a risk factor, a single risk factor.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3197.544,
    "end": 3206.766,
    "text": "So you can actually design risk factor because risk factor modulates generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3210.047,
    "end": 3220.396,
    "text": " So that's why agent try to minimize the risk through Bayesian brief updating.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3220.456,
    "end": 3227.842,
    "text": "But the risk itself is in some sense outside of such a Bayesian framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3228.022,
    "end": 3233.506,
    "text": "So we can design arbitrary risk.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3233.666,
    "end": 3236.108,
    "text": "So it may involve some danger",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3237.149,
    "end": 3260.841,
    "text": " factor any any any other factor and this simulation it is a pomdp or it is a neural network and what scripts might we look at to understand the structure of the maze agent",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3263.532,
    "end": 3274.258,
    "text": " OK, it is basically expressed using the quantity in HomeDP for tractability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3274.458,
    "end": 3290.548,
    "text": "But for example, if you see the MDP, well, this is made as MDP learning, probably.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3295.831,
    "end": 3321.745,
    "text": " okay uh there is a variable sim type uh on the in the definition of yes same type correspond to the type of simulation so if it's one or two it becomes a form dp or neural network to my understanding well",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3325.495,
    "end": 3336.045,
    "text": " In this particular example, we use the, let's say,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3340.932,
    "end": 3344.214,
    "text": " Oh, maybe it's not a good example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3345.355,
    "end": 3349.677,
    "text": "The difference is unclear in there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3351.118,
    "end": 3357.162,
    "text": "Yeah, well, there's no difference in this script as well.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3357.242,
    "end": 3361.024,
    "text": "So maybe another example.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3361.044,
    "end": 3362.505,
    "text": "Let's see.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3369.583,
    "end": 3375.269,
    "text": " What is MDP init is initiating the markup decision process?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3376.05,
    "end": 3376.53,
    "text": "Exactly.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3376.55,
    "end": 3382.176,
    "text": "It's just determining the initial state of the home DB simulation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3383.354,
    "end": 3396.686,
    "text": " And if we compute the variational free energy or risk, MDP risk, compute the risk function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3398.267,
    "end": 3402.971,
    "text": "So basically, we use the neural network",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3404.585,
    "end": 3409.349,
    "text": " structure computation in this particular setup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3410.569,
    "end": 3419.156,
    "text": "So when you click maze.m, then in the line 13.1,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3425.811,
    "end": 3428.853,
    "text": " line 31, we determined that the same type is 2.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3428.893,
    "end": 3433.436,
    "text": "This corresponds to neural network architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3434.237,
    "end": 3448.547,
    "text": "So there is a very slight difference between home DP architecture and neural network architecture, because assuming neural network architecture corresponds to considering",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3455.767,
    "end": 3462.608,
    "text": " If you choose the POMDP architecture, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3482.834,
    "end": 3492.582,
    "text": " we sometimes use the D-gamma function to compute the posterior expectation about parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3493.643,
    "end": 3507.876,
    "text": "But in the neural network modeling, the D-gamma function doesn't appear, but it is replaced with the logarithm of some function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3508.974,
    "end": 3520.06,
    "text": " And asymptotically speaking, the difference between the gamma function of something and the logarithm function of something is asymptotically the same.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3520.86,
    "end": 3532.727,
    "text": "So that's why we can transform HomeDP to neural network architecture when the number of samples is sufficiently large.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3536.687,
    "end": 3545.129,
    "text": " Which form do you expect performs better under small or large amounts of data?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3547.809,
    "end": 3554.891,
    "text": "Well, for large amounts of data, they work in the same manner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3555.031,
    "end": 3562.632,
    "text": "For small amounts of samples, I'm not",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3563.422,
    "end": 3573.53,
    "text": " I'm not fully sure, but it corresponds to the assumption about the posterior belief distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3573.65,
    "end": 3590.504,
    "text": "So if you assume Dirichlet distribution, then your resulting functional form is something that uses the D-gamma function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3591.736,
    "end": 3617.774,
    "text": " in terms of bayesian inference probably which is optimal well probably all right let's return to the earliest questions from today so um in your script which people can reference there's basically a toggle",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3619.076,
    "end": 3628.664,
    "text": " between having it in SIM type one or SIM type two, corresponding to the POMDP and the neural network.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3630.566,
    "end": 3635.61,
    "text": "What about if there's a published neural network or POMDP?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3637.511,
    "end": 3644.297,
    "text": "How can we use this architecture to create a translation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3648.439,
    "end": 3652.841,
    "text": " Is there any difference in this kind of like translating models in the wild?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3655.882,
    "end": 3665.647,
    "text": "Different than the full construction of a special script that can speak both languages.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3670.829,
    "end": 3680.636,
    "text": " Well, in terms of script, there's no difference, asymptotic difference, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3680.956,
    "end": 3684.798,
    "text": "So they work in the same manner.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3684.898,
    "end": 3697.767,
    "text": "So only translation of variable is so you can",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3700.023,
    "end": 3706.106,
    "text": " you can see the same source code in two different ways.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3706.487,
    "end": 3715.552,
    "text": "So if you see that this is a neural network simulation, then it is translated as a neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3715.572,
    "end": 3719.254,
    "text": "Or if you see that this is a POMDP, then it's POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3723.433,
    "end": 3739.703,
    "text": " so for some neural network being used in an industrial setting how would we get from the neural network to a pomdp and where would where or how would that representation be valuable",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3741.269,
    "end": 3746.032,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3747.854,
    "end": 3761.183,
    "text": "The important point is that we consider a particular form of neural network, which is called canonical neural network architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3761.843,
    "end": 3774.806,
    "text": " So only when we assume this class of neural network, then you can find the exact correspondence to a particular form of POMDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3775.706,
    "end": 3790.189,
    "text": "Otherwise, you need to establish another equivalence between another form of neural network architecture and some sort of Bayesian model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3793.185,
    "end": 3807.634,
    "text": " This may be expressed by POMDP, but maybe not so straightforward to be expressed as the conventional POMDP architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3809.515,
    "end": 3818.321,
    "text": "So what is it about the canonical neural network architecture that facilitates its translation into the POMDP form?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3819.522,
    "end": 3824.523,
    "text": " Yeah, first of all, it assumes a sigmoidal activation function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3825.303,
    "end": 3832.985,
    "text": "It is nicely correspond to entropy term in the POMDP equations, POMDP formulations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3833.765,
    "end": 3840.166,
    "text": "So that's why we can create clear mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3840.726,
    "end": 3842.727,
    "text": "So yeah, in other words,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3843.926,
    "end": 3848.154,
    "text": " Simply speaking, they have the same nonlinearity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3848.515,
    "end": 3853.163,
    "text": "That's why this translation is very easy.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3857.679,
    "end": 3876.046,
    "text": " with another non-linearity or a neural network equation, then we need to find another type of entropy equation or another type of prior distribution, which is very non-trivial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3878.507,
    "end": 3882.809,
    "text": "How does one even go about doing that research?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3887.869,
    "end": 3904.425,
    "text": " Well, if you want to go that direction, then I think the first step is to find the prior brief, which makes... Find the prior brief and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3911.306,
    "end": 3919.112,
    "text": " find the equivalence between a particular neural network architecture and a particular Bayesian model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3925.616,
    "end": 3929.879,
    "text": "This sigmoidal activation is interesting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3930.74,
    "end": 3932.381,
    "text": "It corresponds to",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3934.813,
    "end": 3958.953,
    "text": " general patterns seen in psychophysics like two objects that are the same weight you're gonna have a 50 chance of saying that one is heavier and then initially the difference has the most um returns on that decision being made accurately yeah",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3959.628,
    "end": 3984.018,
    "text": " and then as it crosses some threshold where it just is the beyond a noticeable difference the decision becomes essentially probabilistic like the firing curve becomes saturated the neuron is at the it has a very low belief about zero or very high belief about zero or one flip that um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3986.795,
    "end": 4010.013,
    "text": " so there there is a nice grounding of that kind of a sigmoidal response curve with respect to stimuli differences and it has of course tractable analytical properties but it also just happens to be a good response summarizer",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4011.604,
    "end": 4012.985,
    "text": " Yeah, you're right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4013.125,
    "end": 4017.57,
    "text": "So sigmoidal function is also known as a psychometric function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4017.65,
    "end": 4026.117,
    "text": "As you say, we observe that characteristic in many psychophysical experiments.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4026.798,
    "end": 4037.268,
    "text": "And the previous work also said that even at the single neuronal level, the same behavior",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4038.41,
    "end": 4060.582,
    "text": " were observed, which means that for each neural activity, we can re-observe the similar property, which is sometimes called as neurometric function, which have the form of sigmoidal activation function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4063.655,
    "end": 4076.649,
    "text": " So it is a nice reason to design neural network architecture using a sigmoidal function.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4079.235,
    "end": 4089.677,
    "text": " All right, let's cover a few questions in the chat from Dave, and then in the end, turn to some general thoughts.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4090.817,
    "end": 4094.438,
    "text": "Okay, this was when we were looking at figure three.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4095.679,
    "end": 4103.62,
    "text": "So you described these vectors or matrices.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4103.68,
    "end": 4107.041,
    "text": "What kind of matrix or vector did you describe them as?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4111.927,
    "end": 4112.667,
    "text": " Block matrix?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4114.968,
    "end": 4115.808,
    "text": "Block matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4119.249,
    "end": 4119.549,
    "text": "Block?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4121.05,
    "end": 4121.43,
    "text": "Block.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4122.91,
    "end": 4123.45,
    "text": "Meaning what?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4124.41,
    "end": 4124.71,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4125.351,
    "end": 4131.872,
    "text": "Block matrix or block vector is a vector of vector or matrix of matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4132.713,
    "end": 4134.333,
    "text": "So imagine that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4143.286,
    "end": 4144.187,
    "text": " Sorry, just zoom.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4144.207,
    "end": 4145.787,
    "text": "Just glitch.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4145.827,
    "end": 4146.868,
    "text": "Just repeat the last piece.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4147.848,
    "end": 4148.129,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4148.769,
    "end": 4149.129,
    "text": "Unstable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4149.449,
    "end": 4157.213,
    "text": "So, well, block matrix means that so element of matrix is a matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4158.533,
    "end": 4163.336,
    "text": "So, let's say 2 by 2 matrix like matrix in the yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4164.384,
    "end": 4165.585,
    "text": " you're pointing.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4166.646,
    "end": 4171.99,
    "text": "So this here, W1 hat is a matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4173.171,
    "end": 4176.193,
    "text": "And W0 hat is another matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4177.634,
    "end": 4184.36,
    "text": "And combining four matrices, we define a single block matrix.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4187.002,
    "end": 4187.342,
    "text": "All right.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4188.443,
    "end": 4188.823,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4189.984,
    "end": 4192.186,
    "text": "So Dave then asks,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4193.527,
    "end": 4213.981,
    "text": " The hosts of Machine Learning Street Talk, number 67, with Carl Fristen, another podcast where Fristen has spoken, pressed Carl Fristen on why is it so important that most of the values in a generative model matrix assume values of exactly zero?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4217.383,
    "end": 4220.886,
    "text": "Why is it important that generative model matrices are sparse?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4223.554,
    "end": 4232.261,
    "text": " I'm not fully sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4232.701,
    "end": 4237.265,
    "text": "I think there is some context before that point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4238.426,
    "end": 4252.977,
    "text": "I think under a particular situation, then, yeah, as you say, the many elements in the matrix of Genting model should be zero, but I'm not sure if it's a general statement or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4254.724,
    "end": 4264.416,
    "text": " What do you think about compressed analyses on sparse matrices?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4269.222,
    "end": 4271.745,
    "text": "Is that a useful technique or direction?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4275.822,
    "end": 4281.507,
    "text": " you can use that knowledge to construct a model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4281.587,
    "end": 4288.053,
    "text": "So you can use that knowledge to make more accurate inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4288.373,
    "end": 4293.838,
    "text": "So in that sense, generally speaking, such assumption should be useful.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4293.858,
    "end": 4300.644,
    "text": "For example, as you said, it would be possible to use some",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4301.846,
    "end": 4309.672,
    "text": " sparse prior to restrict the value of parameter.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4310.353,
    "end": 4316.918,
    "text": "It is, in principle, same as assuming some L1 norm.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4318.331,
    "end": 4332.185,
    "text": " to design the distribution, to design the prior distribution, which is, mathematically speaking, exactly the same as considering Lasso regression.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4334.608,
    "end": 4334.828,
    "text": "Yes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4339.144,
    "end": 4357.078,
    "text": " We've explored a little bit how from a canonical neural network to a particular form of a POMDP gives us some semantics and interpretability around the dynamics and plasticity of the neural network.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4358.259,
    "end": 4365.024,
    "text": "What do we gain by taking a stated POMDP generative model",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4365.996,
    "end": 4369.458,
    "text": " and deriving an analogous neural network?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4372.64,
    "end": 4380.005,
    "text": "Do we gain access to efficient computation, new software packages, different applications?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4384.348,
    "end": 4388.871,
    "text": "Well, if one use POMDP and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4391.329,
    "end": 4401.912,
    "text": " one's goal is to design an efficient Bayesian model, then I think POMDP expression is sufficient.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4402.092,
    "end": 4418.596,
    "text": "So you don't need to consider neural network architecture, probably, because Bayesian inference or POMDP",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4419.926,
    "end": 4431.211,
    "text": " architecture and the Bayesian formulation is designed to achieve some sort of mathematically optimal inference and decision making.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4431.591,
    "end": 4437.193,
    "text": "So it itself is an optimal scheme.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4437.894,
    "end": 4445.157,
    "text": "But if one needs to consider a link between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4446.425,
    "end": 4453.135,
    "text": " Bayesian inference and biological substrate, then this mapping is crucial.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4454.759,
    "end": 4467.529,
    "text": " So simply speaking, we assume that a brain performs Bayesian inference, but its substrate is still unclear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4467.709,
    "end": 4475.235,
    "text": "So we need to link the Bayesian quantity to biological quantities.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4475.815,
    "end": 4481.5,
    "text": "So this mapping, this equivalence, helps us to its translation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4483.356,
    "end": 4497.286,
    "text": " So when you start from HomeDP model, then this translation facilitates the process of finding its neuronal substrate.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4498.026,
    "end": 4509.173,
    "text": "So once you translate that to neural network quantities, then it helps us, it facilitates",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4510.899,
    "end": 4516.742,
    "text": " experimental validation or application to real data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4516.822,
    "end": 4538.395,
    "text": "So if its modeling is apt for a particular neural network, neural circuit architecture, then it should provide some prediction about the architecture or dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4541.142,
    "end": 4544.383,
    "text": " empirical data, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4544.963,
    "end": 4553.065,
    "text": "So first we start from Bayesian model, which is not necessary to be equal to empirical data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4553.165,
    "end": 4559.146,
    "text": "So maybe there is some mapping, but its mapping is not straightforward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4559.666,
    "end": 4570.049,
    "text": "We may have multiple mappings, but once you translate Bayesian model to a particular neural network architecture, then",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4571.915,
    "end": 4580.122,
    "text": " mapping or relationship between empirical data to such a particular neural network model is straightforward.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4581.143,
    "end": 4589.23,
    "text": "So it helps us to apply Bayes to an explanation of empirical data.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4589.471,
    "end": 4590.011,
    "text": "That's my thought.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4597.105,
    "end": 4624.754,
    "text": " is it fair to say that neural networks have found wide recent application because they facilitate statistical learning in cases where the inference problem has not been a priori well specified one can just have a folder of images and a list of labels and just say here's the data",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4626.337,
    "end": 4646.302,
    "text": " run it through this architecture or this architecture explorer and so with this concordance we gain new interpretability into those settings that kind of arose from ill-specified inference problems",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4647.421,
    "end": 4672.965,
    "text": " And then on the other hand, for problems that we already have well specified in terms of a POMDP generative model of a particular form, we gain the connection to actually implement it with empirical data and bring it into relevant industrial settings.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4676.846,
    "end": 4706.222,
    "text": " what systems or phenomena are promising to continue research on the maze example obviously is a simple case but are you continuing research into more advanced computational agents robotic animal oh hello",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4708.752,
    "end": 4726.687,
    "text": " Yeah, one can design a more sophisticated agent which performs some difficult task based on a canonical neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4728.168,
    "end": 4732.032,
    "text": "But there is some limitation, clear limitation,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4734.191,
    "end": 4735.552,
    "text": " on that direction, right?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4735.712,
    "end": 4751.482,
    "text": "So yeah, I should emphasize that a class of canonical neural network which correspond to a particular POMDP is much smaller than a general POMDP framework.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4752.602,
    "end": 4756.485,
    "text": " So there are some limitations, a list of limitations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4756.585,
    "end": 4772.877,
    "text": "So if one's goal is to design a sophisticated Bayesian engine to perform some task or control robot, then one direction is just to forget such a limitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4774.578,
    "end": 4777.761,
    "text": " seek the mathematical optimality.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4778.341,
    "end": 4781.444,
    "text": "And another direction is biological plausibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4782.024,
    "end": 4792.632,
    "text": "So if one wants to make some agent which is biologically plausible, then this correspondence is crucial because it tells us",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4794.332,
    "end": 4807.782,
    "text": " limitation, the biological limitation, through the existence or non-existence of such a mapping between POMDP and particular neural network architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4808.703,
    "end": 4822.253,
    "text": "So it would be useful to consider a biological substrate to achieve a difficult task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4831.138,
    "end": 4843.189,
    "text": " And that task would be related to large-dimensional image processing, image recognition, or sound recognition.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4843.689,
    "end": 4849.114,
    "text": "Such a multi-modality can be involved, or decision can be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4850.174,
    "end": 4851.375,
    "text": " higher dimensional.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4853.717,
    "end": 4867.87,
    "text": "In the major task, we just consider the four direction of movement, but it can be extended to higher dimensionality, like arm movement, body movement, so on and so on.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4868.771,
    "end": 4875.758,
    "text": "So in principle, it can be extended in that direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4879.207,
    "end": 4884.829,
    "text": " Which directions or questions are you excited about?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4884.849,
    "end": 4894.552,
    "text": "Or what areas of studying the basis of biological and computational intelligence are relevant?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4896.032,
    "end": 4900.254,
    "text": "Yes, so in terms of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4902.673,
    "end": 4911.299,
    "text": " The importance of canonical network, as you said, its virtue is a vertical plausibility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4911.379,
    "end": 4929.833,
    "text": "So it would be nice that if we model some task which is conducted by real animal, and one already recorded some neural activity, brain activity,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4931.72,
    "end": 4954.947,
    "text": " Then we design a task which is exactly same as the task which is done by the animal, and then compare the simulated agent and MP-Curl data to discuss about the similarity or difference between the simulated agent and real.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4958.029,
    "end": 4962.504,
    "text": " animal, that would be very interesting direction of research.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 4965.805,
    "end": 4988.1,
    "text": " yeah and if there could be some unexpected prediction or explanation right in the computational agent that would bolster the relationship and then um one other aspect is it would help with the reproducibility and the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 4990.171,
    "end": 5006.505,
    "text": " documentation around behavioral studies if the computational agents were pre-registered and someone said we've already done the statistical power analyses and we've already explored with parameter sweeps",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5007.83,
    "end": 5014.034,
    "text": " How many observations we need to make of the two-armed bandit?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5014.435,
    "end": 5016.916,
    "text": "How many observations of the three-armed bandit?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5017.437,
    "end": 5022.6,
    "text": "Should we do three mice a hundred times or a hundred mice three times?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5023.821,
    "end": 5030.266,
    "text": "Those are the total substance of designing research programs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5031.867,
    "end": 5034.268,
    "text": "And so having a formal representation",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5035.35,
    "end": 5044.07,
    "text": " of behavioral tasks that are being studied will help us design behavioral observations and experiments that aren't simply ad hoc.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5048.865,
    "end": 5049.305,
    "text": " All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5050.006,
    "end": 5052.627,
    "text": "That's an interesting application.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5052.647,
    "end": 5061.451,
    "text": "So yeah, this framework helps to design the experimental setup itself.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5062.732,
    "end": 5073.798,
    "text": "And what we often consider is the prediction ability of this modeling canonical neural networks to predict",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5075.666,
    "end": 5078.894,
    "text": " the scenario harmonization or dynamics",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5080.089,
    "end": 5086.894,
    "text": " or the real neural network in the animal during the learning process.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5087.555,
    "end": 5100.004,
    "text": "So in principle, it is possible to predict the behavior after learning based only on data in the initial stage.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5100.785,
    "end": 5109.692,
    "text": "Because once we obtain some empirical data, then we can feed that data to design a particular canonical network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5110.518,
    "end": 5125.966,
    "text": " And canonical neural network makes some self-organization through a minimization of cost function, which is exactly the same as Bayesian belief updating under a particular generative model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5126.989,
    "end": 5148.451,
    "text": " which means that its dynamics go through the shortest path on the free energy landscape, which means that we can make some quantitative prediction about the synaptic trajectory or neural activity or any kind of parameters.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5149.071,
    "end": 5159.775,
    "text": " So we demonstrated that using in vitro neural network and uploaded some pre-print recently.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5160.255,
    "end": 5169.779,
    "text": "So at least at the level of in vitro network, which is much simpler than VR brain,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5170.965,
    "end": 5183.579,
    "text": " we could predict the self-organization of in vitro network using this canonical network architecture.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5185.321,
    "end": 5190.767,
    "text": "This supports the plausibility of the free energy principle because",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5192.916,
    "end": 5213.252,
    "text": " this canonical network predicts the self-organization through the variational free energy minimization and its solution, its result, has a tight correlation to actual self-organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5216.915,
    "end": 5219.437,
    "text": "That's a very interesting experiment.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5219.657,
    "end": 5221.639,
    "text": "So what",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5223.169,
    "end": 5227.674,
    "text": " animal were the neurons from and what was measured about these neurons?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5228.655,
    "end": 5237.646,
    "text": "Yes, so that in vitro network is obtained from a rat embryo",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5239.596,
    "end": 5246.501,
    "text": " we use cortical cells to make that in vitro network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5247.122,
    "end": 5255.209,
    "text": "And task is a sort of causal inference task, which can be designed in the form of HomeDP.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5255.909,
    "end": 5257.13,
    "text": "So imagine that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5257.35,
    "end": 5261.414,
    "text": "So we usually simulate agents that receive",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5262.214,
    "end": 5268.275,
    "text": " signals generated by HomeDP generative process and process some Bayesian task.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5269.035,
    "end": 5276.457,
    "text": "So we just replace that Bayesian agent to a real in vitro neural network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5276.857,
    "end": 5286.099,
    "text": "So we stimulate neuron with some signal which is made by some hidden sources through likelihood mapping.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5287.062,
    "end": 5295.289,
    "text": " The question is whether the in vitro network can infer the hidden states through some self-organization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5295.409,
    "end": 5296.43,
    "text": "And they can.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5296.67,
    "end": 5299.933,
    "text": "They could infer the hidden causes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5303.996,
    "end": 5312.183,
    "text": "What does it look like functionally when the neural network has succeeded at inferring the hidden causes?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5313.072,
    "end": 5323.899,
    "text": " Yeah, the direct observation is done by the number of response spikes to a particular pattern of sensory input.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5324.379,
    "end": 5328.502,
    "text": "So again, we can see a clear correspondence between",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5329.422,
    "end": 5334.183,
    "text": " neural activity level and posterior belief about hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5334.363,
    "end": 5341.445,
    "text": "So here we see an early evoked response to an electrical stimuli.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5341.645,
    "end": 5353.348,
    "text": "We see the response from 10 to 30 milliseconds after each stimulation, and we compute the number of spikes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5354.602,
    "end": 5381.148,
    "text": " And that spike changes their preference in the sense that some neurons learn to preferentially respond to source 1 but not source 2, which is not a response to input itself, but it looks like a response to a particular source.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5382.304,
    "end": 5398.749,
    "text": " So it is inference, which is empirical evidence that neural network actually perform some sort of causal inference in a manner consistent with variational Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5399.529,
    "end": 5403.63,
    "text": "And then we compute another quantity in Bayesian inference.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5404.351,
    "end": 5407.832,
    "text": "In the real vertical data, we show that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5410.506,
    "end": 5416.871,
    "text": " firing threshold factor is consistent with the prior belief about hidden state.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5417.072,
    "end": 5426.299,
    "text": "And we also compute the synaptic weight statistically through some connection strength estimation method and show that",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5431.348,
    "end": 5447.437,
    "text": " So estimated synaptic strength is consistent with something encoding posterior belief about parameters as expected by the theory.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5449.558,
    "end": 5459.584,
    "text": "Well, we looked at Table 2 earlier, and this is almost like the next step after the theoretical concordance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5460.877,
    "end": 5476.493,
    "text": " is all right, well, let's measure the release of a neurotransmitter or the empirical synaptic strength or the firing threshold or all these different features in different empirical systems.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5477.934,
    "end": 5484.521,
    "text": "So what systems, what experimental systems does your group work in?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5489.464,
    "end": 5498.53,
    "text": " That in vitro system was made when I was a PhD student.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5498.71,
    "end": 5505.835,
    "text": "So that is the experiment we done in my previous lab.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5506.615,
    "end": 5507.656,
    "text": "And now I move",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5508.137,
    "end": 5510.459,
    "text": " to the RIKEN Institute.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5510.719,
    "end": 5517.143,
    "text": "And I'm a principal investigator of a salary unit.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5517.464,
    "end": 5523.608,
    "text": "So now, actually, we don't use any experimental setup.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5524.008,
    "end": 5529.472,
    "text": "So any experimental validation is done with some collaboration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5530.132,
    "end": 5537.418,
    "text": "So although I cannot say a detail about that collaboration, but yeah, we learned some.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5538.178,
    "end": 5565.974,
    "text": " a collaborating work about the validation of celery using uh various animals yeah so we hope we can show some interesting result following results using animal data very um interesting yeah well it speaks a lot to the stage",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5568.3,
    "end": 5590.848,
    "text": " that our field is in in certain ways where we've seen a lot of graphics that are suggestive this paper and the building on the previous 2020 paper made a suggestive possibility",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5592.322,
    "end": 5615.045,
    "text": " much closer to a analytically demonstrated translation and then took the next step incrementally into the in silica agent and so it's only natural to then explore different embodied systems as well um",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5619.953,
    "end": 5637.138,
    "text": " there any other sections that you wanted to like look at or highlight or any other topics about the paper or adjacencies or active inference that you think are interesting to go into yeah",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5641.187,
    "end": 5651.753,
    "text": " So OK, then I would like to mention about some limitation of this paper, which is not directly discussed in the papers.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5652.413,
    "end": 5660.377,
    "text": "So for example, well, we focus on a discrete state space model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5660.978,
    "end": 5667.321,
    "text": "So we avoid to assume some substrates that encode",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5669.292,
    "end": 5672.454,
    "text": " the covariance of the distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5672.534,
    "end": 5677.397,
    "text": "So once you assume POMDP, then it is categorical distribution.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5677.417,
    "end": 5685.222,
    "text": "So it is different from assuming Gaussian distribution characterized by mean and variance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5685.783,
    "end": 5689.205,
    "text": "So the neuronal substrate of variance",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5690.53,
    "end": 5692.051,
    "text": " is still unclear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5692.331,
    "end": 5696.072,
    "text": "And we now try to figure out that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5696.652,
    "end": 5699.653,
    "text": "So this is one direction of limitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5700.794,
    "end": 5716.119,
    "text": "And another limitation is that, thanks to a simple ODP structure, in this paper, we don't care about the hierarchical",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5717.938,
    "end": 5719.599,
    "text": " you know, optimization.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5719.659,
    "end": 5732.963,
    "text": "But generally, it is crucial to update parameters through hierarchical optimization through some backpropagation-like computation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5733.683,
    "end": 5746.468,
    "text": "Although it is unclear whether backpropagation itself occurs in the real brain, but we still have some alternatives that achieve such a",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5747.702,
    "end": 5752.629,
    "text": " optimization, and its neural substrate is still unclear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5753.33,
    "end": 5756.495,
    "text": "And this paper does address that direction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 5759.56,
    "end": 5759.8,
    "text": "Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5761.542,
    "end": 5761.703,
    "text": "Hmm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5774.628,
    "end": 5784.811,
    "text": " Another area I'm wondering about is like, where in neural structures is the learning reflected?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5785.452,
    "end": 5789.053,
    "text": "Where is the function and learning reflected?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5789.875,
    "end": 5798.659,
    "text": " Well, sometimes it has to do with not just structural tweaking, but the presence or absence of synapses.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5798.719,
    "end": 5818.749,
    "text": "So obviously this model does not expand into synaptogenesis, synaptic pruning, let alone neurogenesis and neuroapoptosis, which we mentioned in the previous discussion, but understanding how these larger scale structural changes",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5819.89,
    "end": 5844.266,
    "text": " which are certainly important in biological systems, become reflected in artificial neural networks, and then how that translates all the way back to POMDP, and then whether we could go the other way, what kinds of POMDP structures in their neural network realization would have structural modification?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5844.787,
    "end": 5846.328,
    "text": "You can imagine a POMDP structure",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5848.01,
    "end": 5862.615,
    "text": " that does structure learning but the neural network doesn't have structural change or there's a pomdp that doesn't do structural learning but it's met it's manifested by a neural network that does have a structural change element",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5864.096,
    "end": 5884.926,
    "text": " so structure is doing something very different in these two different categories of model and then also um even within neural firing which is different amongst different species and so on there's different aspects of what that firing is",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5886.198,
    "end": 5890.619,
    "text": " that would have different implications for the actual biological substrate of cognition.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5891.179,
    "end": 5899.34,
    "text": "Like the simple connection is firing rate to posterior belief.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5900.36,
    "end": 5903.041,
    "text": "Average firing rate, no change in posterior.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5903.481,
    "end": 5908.282,
    "text": "Reduce the firing rate if the posterior should be going down, increase it if it should be going up.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5909.162,
    "end": 5913.263,
    "text": "Or maybe there are neurons that have a flipped valence, but the same type of relationship.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5913.903,
    "end": 5914.443,
    "text": "But there's other...",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5915.711,
    "end": 5941.483,
    "text": " firing patterns like spike time dependent plasticity synchronization amongst different brain regions there's a lot of things that don't change the rate overall that again from the biological systems we know that those phenomena and mechanism are important for different cognitive processes",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5946.337,
    "end": 5972.966,
    "text": " so there will be many many years of a fruitful relationship um i'm gonna bring in this picture that that um alexandra had taken maybe we need a third panel in figure one because these three systems moving between them",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 5976.716,
    "end": 6004.243,
    "text": " is going to be the substance of the field for a long time and there's maybe other edges to build but understanding how artificial neural networks intermediate between the empirical measurements and manipulations that we can make of real neural systems and the",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6006.013,
    "end": 6019.327,
    "text": " interpretability and factorize ability of POMDPs, it might be a bridge too far to go from the POMDP to the neuron.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6020.028,
    "end": 6028.377,
    "text": "You could always use this technique, but it would be a purely descriptive statistic type approach.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6031.787,
    "end": 6056.506,
    "text": " But it's so interesting that by intermediating through a formal connection established in figure one, I mean in equation one, but also shown here, then we can kind of extend the chain of explanation, prediction, control, design,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6058.268,
    "end": 6084.3,
    "text": " all the way on through and that just unlocks like an incredible amount of neuroscience that hasn't been formalized mathematically and an incredible amount of generative models that have been specified for different learning settings sometimes even by analogy to biological settings",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6086.089,
    "end": 6096.617,
    "text": " But the metaphor remains just a metaphor until it's possible to intermediate with this type of neural network development.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6098.038,
    "end": 6098.299,
    "text": "Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6099.6,
    "end": 6101.101,
    "text": "That's a crucial point.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6105.424,
    "end": 6115.372,
    "text": "It is easy to imagine that real data or real phenomena can be modeled using very realistic",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6116.269,
    "end": 6119.755,
    "text": " neuron model or glial model, synaptic model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6119.775,
    "end": 6123.442,
    "text": "We believe that it is possible.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6126.005,
    "end": 6138.577,
    "text": " And then real data, sorry, real model is not necessarily tractable, not necessarily useful because it is too much complicated to analyze something.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6138.617,
    "end": 6148.266,
    "text": "So we use some reduction usually, mathematically speaking, which correspond to topological transformation to make the model simpler.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6149.805,
    "end": 6167.012,
    "text": " And then we need to consider the translation of that simplified neural network model, because neural network model itself is not explainable, which just represents some dynamics.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6167.112,
    "end": 6170.593,
    "text": "And its functional meaning is not clear.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6171.113,
    "end": 6174.534,
    "text": "But thanks to the Bayesian framework,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6176.215,
    "end": 6182.577,
    "text": " a very nice framework to lend the explainability.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6183.417,
    "end": 6199.441,
    "text": "And this translation, this correspondence, helps us to link such phenomena-based equation modeling and functional-based equations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6201.164,
    "end": 6208.188,
    "text": " Yeah, one paper from 2017 that was much discussed by some.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6208.988,
    "end": 6211.97,
    "text": "Could a neuroscientist understand a microprocessor?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6213.431,
    "end": 6222.636,
    "text": "And this group with Jonas and Cording, they had a simulation of a microprocessor.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6223.676,
    "end": 6246.725,
    "text": " from uh earlier video game console I believe and then using the analogy of like the transistors and their connections as neural firing and structural connectivity they were able to simulate experimental settings input and action and then make measurements from like every neuron",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6248.246,
    "end": 6251.569,
    "text": " including doing lesions and loss of functions and so on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6252.129,
    "end": 6262.959,
    "text": "And it turns out that a lot of the techniques that are used to derive scientific explanation from analogous data collected from a biological system",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6264.48,
    "end": 6275.422,
    "text": " those techniques which ostensibly should be isolating functional explanations, in fact, did not isolate effective explanations.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6276.102,
    "end": 6292.025,
    "text": "You could have a deletion over here that induces some statistical change all the way over here, and that may or may not be a useful clue towards the function of even sub-circuits.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6293.556,
    "end": 6314.54,
    "text": " And so I think that was a wake-up call with respect to the interpretability of simply this connection between the biological and the neural network.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6316.36,
    "end": 6322.501,
    "text": "This connection alone is of limited applicability",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6324.64,
    "end": 6337.264,
    "text": " even when the neural network model becomes so complex as to recapitulate the biological phenomena, you're never under any guarantee that you're going to recover interpretability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6338.024,
    "end": 6349.068,
    "text": "You may have just created an atomic level simulation of the phenomena, but of course a map that is the same scale as the phenomena isn't a map.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6349.988,
    "end": 6353.049,
    "text": "It's just a copy that has no more interpretability.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6355.69,
    "end": 6375.709,
    "text": " And it's almost like what is now extended, again, as we kind of just summarize this and think about how we move forward, is that connection can now be extended into the space of interpretable causal models, right?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6376.457,
    "end": 6386.364,
    "text": " and the generalized Bayesian graphical computational frameworks and all the heuristics that we can then use like variational Bayes and all these other methods.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6387.485,
    "end": 6405.478,
    "text": "So it'd be interesting to look back at different data sets of in vitro and in vivo and in silico neural activation, especially if the task was of this constrained set of POMDPs",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6407.674,
    "end": 6422.261,
    "text": " And it was already amenable because as you brought up, other settings would require a little bit more theory development before we understand what POMDP family would be applicable.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6428.583,
    "end": 6428.904,
    "text": "Cool.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6429.224,
    "end": 6433.306,
    "text": "Well, do you have any final thoughts or questions?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6433.326,
    "end": 6436.487,
    "text": "I don't.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6438.536,
    "end": 6439.677,
    "text": " Do you hop?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6443.94,
    "end": 6455.589,
    "text": "I want to download the MATLAB scripts and generate the figures, play around with a few of these parameters.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6456.77,
    "end": 6460.473,
    "text": "Like I see that you can change how far the entity can see.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6462.968,
    "end": 6469.459,
    "text": " And then with these models, I'm also always curious about the computational complexity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6469.479,
    "end": 6475.228,
    "text": "Like if you extended the planning horizon from four to five or you dropped it down to three.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6477.879,
    "end": 6492.652,
    "text": " what is the runtime consequences and what is the performance consequences and where might we be able to use single or swarms of really simple agents",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6494.068,
    "end": 6499.83,
    "text": " maybe even making binary decisions and achieve high performance.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6501.491,
    "end": 6522.78,
    "text": "And where do we really need to move into these large combinatoric spaces in order to solve problems and the kinds of complex planning problems that we solve, whether it's planning our day or planning our week,",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6525.214,
    "end": 6538.538,
    "text": " Are those more like true deep horizon planning problems with extensive consideration of counterfactuals and calculation of alternatives?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6539.438,
    "end": 6552.202,
    "text": "Or are those actually composite decisions that are made up of smaller, simpler sub decisions?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6553.851,
    "end": 6557.832,
    "text": " that we may or may not have flexibility to restructure.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6560.573,
    "end": 6580.417,
    "text": "So that a decision, a complex chess maneuver, a sacrifice in chess or another game, it may be possible to model that as a deep horizon scan or a kind of intuitive heuristic",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6582.717,
    "end": 6586.742,
    "text": " for inappropriate skilled entity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6589.466,
    "end": 6597.857,
    "text": "For for this particular two layer structure, there is a clear limitation about the, you know,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6599.497,
    "end": 6608.363,
    "text": " the horizon of the search, forward search, because it doesn't use forward prediction.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6608.524,
    "end": 6611.426,
    "text": "It uses a post-diction approach.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6611.486,
    "end": 6613.067,
    "text": "So it's a clear limitation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6613.107,
    "end": 6625.096,
    "text": "But still, it may have some performance, ability to achieve some level of performance.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6626.864,
    "end": 6631.965,
    "text": " That actually, I mean, that provides even another way to look at planning.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6631.985,
    "end": 6648.449,
    "text": "So the two ways I was describing planning, as it's often described in the PMDP literature, is again, is it a true deep horizon consideration or is it just short-term heuristics or nested models that are short?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6649.289,
    "end": 6655.31,
    "text": "And I think that this paper says maybe neither.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6656.434,
    "end": 6662.409,
    "text": " Maybe it's purely the fictive causality on the past.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6663.431,
    "end": 6663.612,
    "text": "Hmm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6664.127,
    "end": 6678.857,
    "text": " that leads to the emergence of sentience and maybe even teleological planning-like behavior through the ongoing reconsideration of the consequences of past action.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6679.557,
    "end": 6683.68,
    "text": "But it's neither a short nor a long-term planning challenge.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6683.74,
    "end": 6688.683,
    "text": "It's actually like a memory and learning challenge, and no planning occurs.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6689.444,
    "end": 6690.925,
    "text": "Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6691.285,
    "end": 6692.886,
    "text": "But indirect planning...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6693.749,
    "end": 6717.897,
    "text": " you know planning element is involving c matrix planning as a phenomena occurs and de-risking through time occurs but there um but it says something quite interesting and deep that that phenotype or function could be enacted by a system that",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6718.897,
    "end": 6743.102,
    "text": " explicitly looks a long way ahead explicitly looks a short way ahead or moves forward and looks backwards only right which is what they sometimes say about the past and the future so that may be a very biologically plausible form of learning",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6744.904,
    "end": 6753.634,
    "text": " And it's already intimately connected with the dynamics and the plasticity in terms of an integrated loss function.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6755.537,
    "end": 6760.002,
    "text": "So these are all excellent directions to keep learning on.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6761.741,
    "end": 6762.001,
    "text": " Right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6763.262,
    "end": 6772.566,
    "text": "And I'm also interested in the vertical implementation of such a short-term or long-term forward prediction and planning.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6772.726,
    "end": 6787.973,
    "text": "And I hope to find some nice connectivity to such an implementation of Bayesian model and the implementation in real brain network.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 6789.724,
    "end": 6811.874,
    "text": " cool and also i'm i'm always curious about the invertebrate brain as a ant researcher and so many of the micro architectures as well as the regional architectures that people discuss are mammalian centric which makes sense",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6812.794,
    "end": 6834.941,
    "text": " the mammalian cortical column and the relationship with the dopaminergic midbrain and the cortical regions and the spinal reflex arc those are all important systems of interest yet the micro and meso anatomy of the invertebrate nervous system is pretty distinct",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6836.301,
    "end": 6859.692,
    "text": " so our model should be able to describe neural and cognitive systems of course across invertebrates and vertebrates so i look forward to also seeing like what those models of the invertebrate nervous system and collective behavior where you could have some type of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6860.572,
    "end": 6887.854,
    "text": " backwards looking risk inference of the swarm who knows who knows well we really appreciate the time that you took for these discussions I think they are immensely important and we wish you the best of luck in these continued directions",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6892.43,
    "end": 6896.453,
    "text": " Okay, that's it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6896.813,
    "end": 6897.114,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6898.655,
    "end": 6899.395,
    "text": "Thank you very much.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6900.036,
    "end": 6900.536,
    "text": "See you next time.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6900.556,
    "end": 6900.616,
    "text": "Bye.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 6900.776,
    "end": 6900.977,
    "text": "Bye.",
    "speaker": "SPEAKER_04"
  }
]