[
  {
    "start": 6.738,
    "end": 36.274,
    "text": " hello and welcome this is active guest stream 64.1 it's november 29th 2023 we're here with elliot murphy returning guest and we'll be talking about this paper rose a neurocomputational architecture for syntax so for introduction and describing how today's stream is going to go elliot thank you for joining to you all right thanks so much daniel uh yeah i work at the uh ut health in houston in texas in the epilepsy",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 36.952,
    "end": 44.496,
    "text": " monitoring unit where we use intercranial recordings to map language in patients with epilepsy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 45.156,
    "end": 50.539,
    "text": "But today I want to present something a little bit more theoretical, a little bit more kind of philosophical almost.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 50.579,
    "end": 63.666,
    "text": "This is a new paper that's just come out in the Journal of Neurolinguistics, and I thought it'd be good for me just to kind of walk through the paper step by step, give some motivation, give some description, give some kind of outline of the general kind of framing for the paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 64.571,
    "end": 72.516,
    "text": " So the framework for this paper is trying to propose a general model for how to research language using intercranial recordings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 73.437,
    "end": 78.5,
    "text": "It's basically kind of move beyond research that comes from other kinds of extracranial imaging methods.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 79.44,
    "end": 87.546,
    "text": "And it's trying to really figure out what is the most appropriate level of description in terms of neural complexity for specific aspects of language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 88.066,
    "end": 89.707,
    "text": "So there's many different parts of language, as we know.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 90.465,
    "end": 98.57,
    "text": " Language has words, it has sounds, you can read language, you can sign it, you can construct meaning, you can do all sorts of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 99.07,
    "end": 114.9,
    "text": "But the real kind of question for me is at what level of neural complexity and therefore at what level of appropriate recording resolution based on what tools you have available is going to be providing you with the most reliable signatures of particular levels of structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 117.508,
    "end": 125.735,
    "text": " In this model, termed the ROSE model, I invoke representations, operations, structures, and encoding, and I'll introduce them step by step.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 126.396,
    "end": 133.082,
    "text": "And so for the purposes of this kind of introduction, I'm just going to kind of outline what those general kind of frameworks are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 133.502,
    "end": 145.292,
    "text": "But to begin, the most kind of basic assumption that we have about language, in terms of like the findings from linguistics, so the study of language, like the scientific study of language, one of the really basic introductions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 145.814,
    "end": 165.702,
    "text": " that you find in every introductory textbook is that linguists have kind of arrived at the conclusion that the human mind brain applies a set of rules to recursively combine linguistic units into larger objects, which derives an unbounded array of hierarchically structured expressions with humans in varying sentence meaning based on syntactic configuration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 165.922,
    "end": 174.365,
    "text": "Now that's a lot of jargon, but essentially what that means is when you hear a linear sequence of words, like, you know, we watched a movie with Jim Carrey,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 174.96,
    "end": 177.683,
    "text": " You can pass that not simply as like beads on a string.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 178.043,
    "end": 185.731,
    "text": "You can pass it in two ways, depending on how you chunk the individual phrases together and how you establish relations between different elements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 186.552,
    "end": 196.783,
    "text": "So, for example, we watched a movie with Jim Carrey can mean that you watched, you know, Eternal Sunshine of Spotless Mind, or it can mean that you're sat there next to Jim Carrey watching",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 197.332,
    "end": 199.613,
    "text": " you know, the new Napoleon film, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 200.073,
    "end": 204.535,
    "text": "So there's kind of ambiguity there, but the ambiguity arises due to structural configurations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 204.955,
    "end": 209.156,
    "text": "So that's kind of how you rearrange the sentences kind of in your head internally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 209.537,
    "end": 213.358,
    "text": "And that is obviously a process that's independent immediately from sensory motor",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 213.778,
    "end": 242.693,
    "text": " you know transformations or experience or speech or sound or orthography so these are very abstract processes and they're clearly mental processes they're not processes of the visual system they're not processes of the auditory system they're clearly uh hyroid and mental computations so what that phrase um unbounded array of hierarchically restricted expressions means is it just means that humans have this generative capacity and people like Carl Christen and Chomsky talk about generativity quite a lot what it basically means is the ability to just do exactly what I'm doing right now",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 243.553,
    "end": 260.844,
    "text": " use a finite set of elements, so lexical items or memorize words, and then recombine them again and again and again in really novel combinations, such that you can say sentences that have never been said before in the totality of human existence, but which are immediately assigned a meaning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 261.428,
    "end": 267.392,
    "text": " You don't have to think too hard about what meanings are usually unless you're reading, you know, Finnegan's Wake, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 267.993,
    "end": 271.035,
    "text": "So typically this is a reflexive process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 271.375,
    "end": 272.116,
    "text": "So it's automatic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 272.196,
    "end": 272.676,
    "text": "It's quick.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 273.377,
    "end": 278.58,
    "text": "The brain resolves this very well without much effort, without much energetic cost as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 279.501,
    "end": 280.862,
    "text": "So the question is, how does the brain do this?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 283.675,
    "end": 291.336,
    "text": " So, you know, an additional point to make here is that this capacity for hierarchical occasion has also been linked to human-specific cognitive superiority.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 291.357,
    "end": 292.717,
    "text": "So that's a more general background here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 293.077,
    "end": 305.959,
    "text": "So people like Stan Dehaene, Hauser and Wattamil, they've long stressed that this facility for constructing hierarchically organized linguistic structures is really potentially a human-specific function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 306.019,
    "end": 308.1,
    "text": "And that's a very long and, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 310.02,
    "end": 337.349,
    "text": " it's a long and difficult topic to get to get into so I'll put it to one side but it's an interesting topic to to explore the possibility that this whatever this process is it might in fact be unique to humans um so in the theoretical domain and turning to neurobiology an emerging consensus in neuroscience is that complex behavior and cognition rely on coordinated interactions between brain regions with face synchronization being a major candidate for a mechanism implementing this coordination by gating information transmission in the brain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 338.563,
    "end": 344.289,
    "text": " But unlike for models of attention and working memory, there's currently an absence of oscillatory phase coding in models of natural language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 344.53,
    "end": 345.17,
    "text": "So what does that mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 346.232,
    "end": 353.159,
    "text": "So in the neurobiology of attention and working memory, there's been a lot of really exciting accounts by people like Al Miller, Ole Jensen,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 354.066,
    "end": 373.187,
    "text": " and a lot of other people trying to explore the relationship between neural synchronization metrics and some kind of isomorphic kind of relationship to some property of either an endogenous computation, like a working memory process, or some kind of property of the environment that you're kind of, you know, passing in real time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 373.968,
    "end": 374.709,
    "text": "But in language,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 375.202,
    "end": 382.504,
    "text": " The best we have, just to boil it down very generally, the best we have at the moment in language is basically called cartographic models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 382.984,
    "end": 385.025,
    "text": "So that's kind of localizationist models in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 385.505,
    "end": 404.07,
    "text": "So we have a decent idea, thanks to the really brilliant work by people like Greg Hickok and William Machen and Angela Friederici and Nye Ding and David Popel and really an incredible roster of people from the last few decades who very carefully mapped out which specific brain regions seem to be sensitive to different types of linguistic structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 404.91,
    "end": 413.937,
    "text": " So lexicality, meaning the meaning of a word, syntax, the generation of a sentence structure, a phrase structure, semantics, the meaning of words, phonology and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 414.357,
    "end": 416.199,
    "text": "But what we really have right now is just a kind of map.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 417.27,
    "end": 437.276,
    "text": " we have a map of the brain that you can pull up on google and you can google you know language syntax brain and you'll get a decent uh you know rough architecture of which parts of the brain seem to be sensitive to different parts of language but the main reason why i wrote this paper is because that's essential you know mapping out the terrain is obviously essential but the next step",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 438.6,
    "end": 442.504,
    "text": " People from working memory, vision, attention, they did this a while ago.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 442.964,
    "end": 449.79,
    "text": "The next step is therefore to transition to a kind of how question, which is which neural mechanisms are involved in language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 450.09,
    "end": 456.715,
    "text": "So rather than simply saying, these are the brain regions involved, we have to then say, okay, these are the brain regions, but what is the brain doing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 457.376,
    "end": 459.497,
    "text": "By what operations is it performing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 460.078,
    "end": 463.361,
    "text": "At what level of neural complexity is it sensitive?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 463.581,
    "end": 465.222,
    "text": "So just because this part of the brain is sensitive,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 466.636,
    "end": 468.717,
    "text": " we don't really know in what way it's sensitive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 468.917,
    "end": 474.119,
    "text": "What type of neural processes is it actually recruiting to yield that sensitivity?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 474.579,
    "end": 482.962,
    "text": "And what does that sensitivity really look like outside of bowl fluctuations or high gamma amplitude increases and other kind of typical measurements?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 483.702,
    "end": 484.842,
    "text": "So that's in the theoretical domain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 485.743,
    "end": 486.663,
    "text": "In the empirical domain,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 487.185,
    "end": 497.869,
    "text": " Invasive intercranial recordings have recently mapped out some of the feature space associated with how much phonological information can be transmitted by different neural mechanisms and some citations there for you to look at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 498.31,
    "end": 501.411,
    "text": "But within the domains of syntax and semantics, there's been less clear progress.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 501.791,
    "end": 503.252,
    "text": "And the reason for that is pretty obvious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 503.872,
    "end": 506.273,
    "text": "Phonology, sound, auditory processing,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 506.889,
    "end": 510.931,
    "text": " you know, the kind of a finite feature space involved in articulatory processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 511.612,
    "end": 523.539,
    "text": "That's a very non-trivial, you know, field to explore, but it has been mapped out very clearly because the, you know, processes are kind of less abstract, more well agreed upon, more transparent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 523.899,
    "end": 524.9,
    "text": "They involve more clear,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 525.83,
    "end": 536.975,
    "text": " sensory motor transformations and things that you can detect very clearly with very nice clear signatures in different types of neural state space or in fact different regions of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 537.755,
    "end": 540.476,
    "text": "And these are also things that you can disrupt very easily.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 540.496,
    "end": 542.857,
    "text": "So it's very easy to disrupt phonological processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 542.977,
    "end": 546.619,
    "text": "We know which parts of the brain, which parts of cortex is disrupted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 547.219,
    "end": 551.482,
    "text": " But it's less clear how you specifically disrupt things like syntax and semantics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 552.043,
    "end": 556.626,
    "text": "You can knock out language comprehension in general, just all of language comprehension.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 557.106,
    "end": 561.129,
    "text": "You can knock out and disrupt certain aspects of working memory performance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 561.51,
    "end": 570.737,
    "text": "But when it comes to knocking out, disrupting the brain's ability to specifically process syntactic or semantic information, that's been very difficult.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 571.077,
    "end": 574.92,
    "text": "And there's only been a few papers on that, which I cite in this paper over the last couple of years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 574.96,
    "end": 576.601,
    "text": "But it's very difficult to really try and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 577.795,
    "end": 593.94,
    "text": " provide causal evidence to try and really stimulate the brain in the OR or to find lesion patients who've had a stroke and who exhibit extremely specific niche deficits around this aspect of syntax or semantics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 594.64,
    "end": 596.541,
    "text": "So that's kind of the obstacle that we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 596.581,
    "end": 604.863,
    "text": "The obstacle we have is that we have this very strange, potentially human-specific, seemingly very simple process of just building hierarchical structures",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 605.558,
    "end": 609.301,
    "text": " But it's very difficult to isolate from all these other things going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 609.661,
    "end": 615.785,
    "text": "Because as soon as you build a sentence structure, as soon as you build a phrase or a sentence, you are also doing loads of other things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 616.145,
    "end": 617.907,
    "text": "You are also using your attention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 618.027,
    "end": 619.348,
    "text": "You're also using working memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 619.588,
    "end": 623.791,
    "text": "You're also saying things or reading things or engaging your eyes or ears.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 624.434,
    "end": 627.596,
    "text": " So it really is very difficult to isolate it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 629.417,
    "end": 631.337,
    "text": "So anyway, that's the problem that we have.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 632.578,
    "end": 634.879,
    "text": "So I'll just skip this part to the next section here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 635.339,
    "end": 640.262,
    "text": "So I'm just going to read through some of this text and maybe try and unpack it a little bit more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 640.542,
    "end": 647.626,
    "text": "But the past decade has seen the emergence of low frequency phase coherence as a feasible index of hierarchical syntactic structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 648.146,
    "end": 650.247,
    "text": "So what that means is that if you read these papers,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 650.8,
    "end": 656.148,
    "text": " And there's low frequency oscillations in the brain that can be detected using MEG or scalp EEG.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 656.769,
    "end": 659.533,
    "text": "And they basically show little fluctuations, little peaks",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 661.09,
    "end": 666.153,
    "text": " aligned with certain moments and periods or windows of structure building.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 666.414,
    "end": 672.258,
    "text": "I'm just thinking of more metaphorical, little islands of structure that come along when you pass a sentence in real time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 672.758,
    "end": 678.462,
    "text": "Whenever that moment of structure building occurs, you seem to get this low frequency peak in activity in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 679.223,
    "end": 684.807,
    "text": "It tends to be around classical language cortex, like left inferior frontal cortex or temporal cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 685.307,
    "end": 689.471,
    "text": " But the actual spatial temporal isolation is still a little bit iffy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 689.571,
    "end": 691.532,
    "text": "We still don't really know, quite frankly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 692.073,
    "end": 695.656,
    "text": "So that's the kind of background for that aspect of language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 696.096,
    "end": 702.722,
    "text": "At the same time, though, recent work has also examined local cortical processing using intracranial recordings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 702.822,
    "end": 704.464,
    "text": "So these are recordings inside the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 705.425,
    "end": 708.326,
    "text": " And what they do is they often focus instead on high-frequency power.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 708.566,
    "end": 721.692,
    "text": "They can detect low-frequency power, absolutely, but most of the analyses and novel findings within the intracranial space have prioritised looking into high-frequency research for the simple reason that that's the only real way that you can get high-frequency recordings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 722.652,
    "end": 730.035,
    "text": "So this works to expose signatures of syntax in other areas outside of low-frequency dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 730.436,
    "end": 731.316,
    "text": "So there's a big question here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 732.162,
    "end": 742.088,
    "text": " how these two distinct recording scales, low-frequency dynamics and high-frequency dynamics, could be combined in a coherent model of natural language syntax and cortical computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 742.928,
    "end": 744.029,
    "text": "That hasn't been addressed yet.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 744.609,
    "end": 747.131,
    "text": "So that's kind of one of the arguments that I try and build here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 747.151,
    "end": 759.318,
    "text": "So yeah, neural oscillations are effectively, like I mentioned, they reflect synchronized fluctuations in neuronal excitability and are typically grouped by frequency, and mainly for convenience, but not always.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 759.338,
    "end": 759.838,
    "text": "There are, in fact,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 761.203,
    "end": 763.183,
    "text": " there seems to be something else going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 763.283,
    "end": 767.544,
    "text": "Common rhythms are often termed delta, theta, alpha, beta, and then gamma.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 769.705,
    "end": 778.867,
    "text": "And broadly speaking, high frequency activity reflects local neural processing, whereas low frequency activity reflects regional synchronization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 779.267,
    "end": 783.187,
    "text": "So high frequency activity, you get that local cortical computation in a specific brain region.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 783.407,
    "end": 788.488,
    "text": "This brain region is doing something, as opposed to low frequency activity, which is often more widespread.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 788.909,
    "end": 790.969,
    "text": "And it's more to do with the coordination",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 791.878,
    "end": 793.158,
    "text": " of regional synchronization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 793.478,
    "end": 806.802,
    "text": "So the low frequencies say, okay, it's time for you guys to all come online at this particular time to, you know, engage your spike activity in this particular time period, but over a larger portion of tissue typically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 806.862,
    "end": 809.863,
    "text": "It's over much larger areas of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 810.783,
    "end": 815.184,
    "text": "And then there's a bunch of other kind of computational differences seemingly as well between these lower bands.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 815.325,
    "end": 818.645,
    "text": "So for example, alpha is very often implicated in cortical disinhibition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 819.166,
    "end": 820.566,
    "text": "It kind of helps to shield and protect",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 821.595,
    "end": 845.125,
    "text": " ongoing representations from you know decay and transformation and then Theta oscillations often implicated in hippocampus I've been involved in learning and memory there's a big literature on that don't need to go into the details but essentially there's a whole you know panoply of low frequency rhythms and they seem to be sensitive to different cognitive processes or at least you know recruited or they seem to index a bunch of lower order processes potentially",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 846.949,
    "end": 848.151,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 848.832,
    "end": 853.621,
    "text": "So one way to kind of introduce this is through a model that I proposed in my book in 2020.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 854.202,
    "end": 857.468,
    "text": "And in this model, again, using invoking low frequency power,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 858.326,
    "end": 871.474,
    "text": " The combinatorial power of language is indexed via various oscillatory interactions like forms of cross frequency coupling, which is basically when the phase of a lower frequency rhythm kind of coordinates and dictates the firing of a high frequency rhythm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 871.894,
    "end": 882.801,
    "text": "So you kind of get a potential facilitation of what's called multiplexing, or kind of packaging representations in one order and then sending them downstream and kind of re-accessing them in a different part of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 884.3,
    "end": 894.367,
    "text": " So in this book of mine, there's a bunch of literature that I've reviewed to motivate the idea that delta theta phase amplitude coupling constructs multiple sets of syntactic and semantic features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 894.868,
    "end": 899.091,
    "text": "So you get this initial low frequency phase interaction between delta and theta.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 899.855,
    "end": 903.417,
    "text": " And this occurs when the phase of delta is synchronized with the amplitude of theta.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 904.077,
    "end": 910.46,
    "text": "And delta represents superordinate syntactic categories, whereas theta represents feature bundles generated via lexical access.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 910.8,
    "end": 911.32,
    "text": "What does that mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 911.66,
    "end": 918.163,
    "text": "It means that these theta oscillations, there's something called theta-gamma coupling, famous in memory research and navigation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 918.923,
    "end": 924.786,
    "text": "Theta-gamma coupling, and in fact, there's some really nice work published yesterday, I think, by Oli Jensen, looking at how attention might be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 925.246,
    "end": 945.847,
    "text": " also implemented through alpha gamma coupling but the basic idea is that you have individual sets of features that are you know basic mental representations like things responsible for you know animacy plurality uh basic conceptual categories they seem to be triggered by high frequency activity and then they're coordinated and packaged into a single kind of chunk",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 946.247,
    "end": 964.696,
    "text": " by theta so you have a single low frequency theta wave and within that single wave you get a bunch of individual you know five six seven or eight however many you can kind of squeeze and fit in uh and there's kind of trade-off between fidelity and uh the kind of number of um gamma oscillations you can package inside a theta cycle um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 965.396,
    "end": 985.767,
    "text": " But that packaging of theta with gamma helps you to kind of coordinate and unify an individual representation in the attention and visual spaces that's been referred to as, you know, coordinated visual attention when you kind of your visual your visual system is kind of attuning to particular properties in the environment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 986.921,
    "end": 993.488,
    "text": " In the language space, I'm kind of invoking it to unify different individual features that compose into a lexical item.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 993.869,
    "end": 996.431,
    "text": "So a lexical item is just a fancy word for a word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 996.752,
    "end": 1000.216,
    "text": "So something like, you know, laptop, bed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1000.536,
    "end": 1001.497,
    "text": "I'm just thinking of random words.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1001.778,
    "end": 1004.28,
    "text": "All of these random words are obviously composed of individual features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1004.841,
    "end": 1030.501,
    "text": " conceptual features right so a bed is inanimate it's uh you know it has a particular geometry it has a particular function a purpose a design and so on and all these different conceptual features compose into what we mean by a bed whenever you think of a bed or a chair or a mirror um or you know Whole Foods it could be anything it's simple or anything from simple to complex you have a constellation of conceptual features that are being composed somehow and the idea here is that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1031.328,
    "end": 1041.292,
    "text": " These low frequency theta oscillations are there to coordinate the firings of those individual features, which is why you get a lot of lexicality effects being found in, for example, the theta range.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1041.992,
    "end": 1048.494,
    "text": "And then what you do is, in this model, you get those theta bundles of flexible features and you embed them further.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1049.094,
    "end": 1050.015,
    "text": "So you nest them again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1050.535,
    "end": 1059.698,
    "text": "And what you do when you nest them again within a delta rhythm is that the delta rhythm then takes over from the individual lexical items and it composes a syntactic identity, so a structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1060.776,
    "end": 1061.556,
    "text": " a structural identity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1062.437,
    "end": 1076.502,
    "text": "So for example, it's been well studied in linguistics that when you put two items together, two words together, you get a kind of symmetry breaking operation where one of the items kind of determines the category of the phrase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1077.082,
    "end": 1082.945,
    "text": "So for example, if you say red boat, a red boat is a boat that is red.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1083.825,
    "end": 1086.726,
    "text": "A red boat is not a red light quality",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1087.182,
    "end": 1089.745,
    "text": " that has boat-like features, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1091.026,
    "end": 1092.628,
    "text": "So there's a kind of immediate asymmetry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1092.988,
    "end": 1093.99,
    "text": "And you get that all over the place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1094.01,
    "end": 1100.597,
    "text": "If you say John ran, John ran does not mean that there's a special kind of John who is exhibiting a running feature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1101.017,
    "end": 1103.7,
    "text": "It means that there's an event of running and John was its agent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1103.981,
    "end": 1105.122,
    "text": "So there's always an immediate kind of,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1105.855,
    "end": 1106.735,
    "text": " asymmetry in language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1107.096,
    "end": 1118.499,
    "text": "And that's, you know, people like Stan Dehaene have kind of speculated that one of the interesting things about language is that unlike music and mathematics that kind of allow symmetry in their structures, language doesn't really like symmetry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1118.98,
    "end": 1122.201,
    "text": "As soon as you get symmetry in language, the language system tries to break it somehow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1122.961,
    "end": 1133.384,
    "text": "Because there has to be some kind of categorizer for you to identify what's called the label or the category of the phrase for you to get a single unified syntactic representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1133.725,
    "end": 1135.025,
    "text": "So in other words, whenever you get",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1135.43,
    "end": 1140.036,
    "text": " two words being combined together, one of them always wins and one of them is the loser.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1140.977,
    "end": 1142.639,
    "text": "And that's how you build syntactic structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1142.699,
    "end": 1145.442,
    "text": "You get a kind of categorization process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1146.003,
    "end": 1148.466,
    "text": "So just to kind of recap, you have Delta,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1149.264,
    "end": 1170.972,
    "text": " Peter and gamma the delta assigns or it somehow derives or facilitates the syntactic inference of what the categories and the reason who knows right i'll try and explain some potential reasons here and ultimately it's unknown, but we do know that in the empirical domain, we get a lot of these syntax signatures being found in the delta range so delta seems to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1171.605,
    "end": 1194.287,
    "text": " care about chunking on some level maybe not syntactic specific chunking but i think it's possible um for reasons cited in the paper so delta and then and train then packages within one of its waves multiple theta rhythms uh and the reason why is because the same mechanism that you invoke when you get theta gamma coupling so it's a series of nesting you know nesting and nesting and nesting",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1195.368,
    "end": 1222.222,
    "text": " and you know the whole rose architecture in this paper is basically trying to construct uh what some people might think of as rather crude but i think rather empirically motivated in fact um isomorphic relationship between structure and neural kind of signal complexity right uh it's it's common for people to think well you know the brain's very complicated language is very complicated it surely can't be the case that a particular level of linguistic structure maps directly onto a particular resolution of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1222.762,
    "end": 1227.144,
    "text": " for example, oscillatory phase coding, I think there's good empirical evidence to actually assume that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1228.064,
    "end": 1233.846,
    "text": "And that not everything takes place at the lower coarse grain level, at the spike level, for example, or even intracellularly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1234.627,
    "end": 1252.434,
    "text": "I think it's unlikely that all of these complex processes from making inferences about, you know, whether or not red or blue wins and becomes the categorizer or the adjective or phrase is all taking place at the intra or intercellular level, at the kind of global, you know, the kind of stuff that you can detect using single unit recordings, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1253.161,
    "end": 1256.244,
    "text": " I think something more global and interactive is happening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1257.025,
    "end": 1267.757,
    "text": "And that's why you kind of need to invoke some kind of phase code, because the phase code, you only get that once you transition to more global synchronization metrics of the kind found with low frequency dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1267.797,
    "end": 1269.939,
    "text": "That's the whole point of low frequency synchronization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1270.48,
    "end": 1273.983,
    "text": "So I think that's kind of the kind of basic natural progression that you find here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1274.998,
    "end": 1282.808,
    "text": " least in the way that i've motivated it in using the literature that i review in the book and kind of is recapitulated here to a certain extent",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1284.028,
    "end": 1286.85,
    "text": " Okay, so then we turn to something called phase resetting.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1287.19,
    "end": 1296.757,
    "text": "So phase resetting, alongside concurrent encoding and storage of the products of these generated objects, permits a facility for recursive self-call.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1297.477,
    "end": 1299.699,
    "text": "So that's kind of where you get the recursive mechanism of language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1299.739,
    "end": 1310.326,
    "text": "You're consistently re-nesting objects into this more complex delta rhythm, chunking out more and more and more low-frequency complexes, essentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1311.525,
    "end": 1322.572,
    "text": " And just as an aside, we also know that from empirical work by people in my lab and in the Netherlands as well, that you get a bunch of different dynamics alongside this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1322.612,
    "end": 1335.821,
    "text": "So, for example, we know that beta rhythms and other types of gamma rhythms are involved in all sorts of different types of processes like conceptual storage and maintenance of a particular structure in memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1336.5,
    "end": 1340.722,
    "text": " And so there's a very kind of complex interplay here between different rhythms and it's not intuitive.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1340.802,
    "end": 1342.542,
    "text": "It's not easy to grasp on first.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1342.922,
    "end": 1350.885,
    "text": "You know, I realize I'm not potentially not doing the best job of explaining it because there's a lot of things that unpack as soon as you move to another kind of concept, you have to unpack it to a certain extent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1350.945,
    "end": 1355.747,
    "text": "But the basic idea is that there's a number of interacting low frequency rhythms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1356.263,
    "end": 1360.527,
    "text": " that then dictate the firing rate and coordination of these faster rhythms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1360.907,
    "end": 1373.239,
    "text": "And the faster rhythms are responsible for the smaller, more atomic features like individual lexical items, and the slower rhythms are responsible for the more complex, larger structures like syntactic identities,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1373.739,
    "end": 1376.72,
    "text": " and syntactic workspaces and things that you construct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1376.88,
    "end": 1382.582,
    "text": "So the kind of output, I guess, the output of the syntactic generative engine is found at the lower frequency end.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1383.023,
    "end": 1395.487,
    "text": "Whereas the input, the kind of stuff that you need to provide to the system to get any syntactic structure building done in the first place, like, for example, lexical features, you need at least to access some features before you can combine them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1395.687,
    "end": 1397.928,
    "text": "In order to combine something, you need to have something to combine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1398.588,
    "end": 1403.35,
    "text": "Those individual properties are hosted by the high frequency oscillations, essentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1404.306,
    "end": 1404.457,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1405.843,
    "end": 1408.904,
    "text": " And then finally, traveling oscillations are also going to be relevant here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1409.404,
    "end": 1414.246,
    "text": "So these are essentially these low frequencies that I mentioned, except they exhibit a particular directionality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1414.606,
    "end": 1416.547,
    "text": "They migrate in phase coherence across the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1417.287,
    "end": 1423.31,
    "text": "And what that means is they coordinate the spiking of neural clusters across the brain, across fixed points.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1423.51,
    "end": 1425.651,
    "text": "So they kind of move from one part of the brain to another part.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1425.891,
    "end": 1434.034,
    "text": "And as they do so, as the phase of the low frequency is shifted across a particular path, they then trigger",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1434.674,
    "end": 1440.339,
    "text": " particular spiking profiles of these neurons that they travel across.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1440.92,
    "end": 1442.201,
    "text": "So it's a coordination process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1442.621,
    "end": 1453.031,
    "text": "And it's also, of course, given the nature of a migration path, that naturally leads to the conclusion that, as is often commonly known, different parts of the brain are innately sensitive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1453.649,
    "end": 1463.078,
    "text": " to particular representational features of the environment, particular conceptual features, things like faces, places, orthographic information, emotions and things like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1463.878,
    "end": 1468.643,
    "text": "There's a very big difference, for example, between inferior parietal cortex and anterior temporal cortex in terms of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1468.943,
    "end": 1470.805,
    "text": " which conceptual features they seem to be sensitive to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1471.286,
    "end": 1483.019,
    "text": "So if you get that traveling profile, you get that low frequency phase code moving across a particular extended path, then that immediately gets you essentially for free.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1483.059,
    "end": 1487.684,
    "text": "It gives you for free the mechanism of activating distinct conceptual",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1489.165,
    "end": 1515.125,
    "text": " representations during that process and so I I think you know there's a lot of other things to say here but traveling waves have been implicated in a number of kind of behaviorally relevant and processes in humans and also non-humans um and they seem to support brain connectivity and function more generally and so yeah that's kind of the background for the traveling wave mechanism um and then finally one final thing to say here um I mentioned the Delta Theta",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1515.6,
    "end": 1522.585,
    "text": " and gamma complex, there's also been some interesting work outside of language looking at delta gamma feature combinatorics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1522.925,
    "end": 1532.591,
    "text": "So that's kind of skipping out the middleman and simply involving this low frequency delta complex being phase coupled with the amplitude of high frequency gamma oscillations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1533.152,
    "end": 1536.574,
    "text": "And what that seems to be involved in is feature combinatorics in general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1537.014,
    "end": 1539.836,
    "text": " So, for example, it's been involved in fluid intelligence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1540.196,
    "end": 1554.105,
    "text": "So when you have to just perform a particular task or solve a problem immediately and call upon various cognitive representations from different core knowledge systems in your mind, lots of different aspects of intelligence, you have to kind of recruit here and there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1554.425,
    "end": 1555.466,
    "text": "You don't necessarily have to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1555.526,
    "end": 1558.268,
    "text": "In fact, you don't at all construct a hierarchical structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1559.028,
    "end": 1562.169,
    "text": " You don't construct a hierarchical recursive representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1562.57,
    "end": 1567.632,
    "text": "You just combine things together into a set, into a conglomerate, to help you solve a particular puzzle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1568.052,
    "end": 1569.593,
    "text": "So that's what fluid intelligence is all about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1570.353,
    "end": 1575.895,
    "text": "You also get that with, say, in early stages in phrase composition in ScalPEG.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1575.935,
    "end": 1580.017,
    "text": "So people like Andre Martin and Jonathan Brennan have done some nice work showing this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.197,
    "end": 1586.34,
    "text": "So what that tells you is that in language and also non-language, you can combine features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1587.193,
    "end": 1588.074,
    "text": " for all sorts of reasons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1588.855,
    "end": 1596.445,
    "text": "If you need to do that, delta-gamma coupling seems to be sufficient, and it seems to be a very efficient way of doing that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1597.106,
    "end": 1604.655,
    "text": "Now, if you want to construct an unbounded array of hierarchically structured expressions, as I mentioned earlier, that might not be sufficient",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1605.316,
    "end": 1617.488,
    "text": " And so the empirical argument I'm making here is that delta gamma coupling will not be sufficient for the kind of rich syntactic phenomena that are often documented in standard textbooks, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1617.829,
    "end": 1621.813,
    "text": "So anything beyond a basic phrase unit, I suppose, anything with long distance relations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1622.273,
    "end": 1651.456,
    "text": " or dependencies and things like that or in fact anything beyond a single phrasal structure will probably need to be um called upon all these other mechanisms that i mentioned earlier the more kind of richly layered uh levels of low frequency interactions so um so delta gamma is fine for you know feature combinatorics but it doesn't seem to be sufficient again that's an empirical claim could be wrong about that but it doesn't seem to be sufficient based on the literature for the more kind of complex structures of the kind that we uh that we all know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1652.316,
    "end": 1680.716,
    "text": " in the linguistics world um okay and then we can also make some interesting claims here that i've made with my colleague antonio benitez bracco in in seville in spain and all these aspects of oscillatory dynamics obviously result from somewhere they don't come from nowhere they result from genetic guidance and some recent workers provided a list of candidate genes for this particular guidance so we have a particular phase code a neural code for syntax but it's got to come from somewhere",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1681.523,
    "end": 1698.768,
    "text": " unless you're, you know, well, I'm not going to name any names, but unless you're the kind of person who's so in love with, you know, deep learning and large language models that you think that it's all just some kind of epiphenomenal domain general learning process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1699.108,
    "end": 1702.509,
    "text": "But if you don't believe that, then there's got to be some kind of genetic structure for language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1702.769,
    "end": 1710.311,
    "text": "And so we've mapped a bunch of these potential genes using a bunch of different techniques to particular functions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1711.723,
    "end": 1714.246,
    "text": " But that's a very much an ongoing kind of far off project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1714.306,
    "end": 1718.39,
    "text": "It's just the very beginnings of trying to map out the kind of genetics of the neural code for language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1718.65,
    "end": 1720.231,
    "text": "But at least it's a coherent project, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1720.372,
    "end": 1722.454,
    "text": "It's a legitimate coherent project.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1722.574,
    "end": 1724.235,
    "text": "Although rather nascent too, to be fair.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1725.096,
    "end": 1726.037,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1727.278,
    "end": 1733.804,
    "text": "So just to background this discussion a little bit more, I realize we're already quite far in, so I'll just kind of skip ahead a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1735.615,
    "end": 1746.878,
    "text": " One of the most important questions in the neurobiology of syntax is essentially, you know, what type of neural activity, low frequency activity, high frequency activity, spike rate, can track very long or very brief phrases?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1747.518,
    "end": 1757.881,
    "text": "So my basic answer, which I've already essentially given to you, is associating roughly the respective scales of recording and neural organization with particular levels of linguistic complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1758.361,
    "end": 1765.143,
    "text": "So low frequency gets you structures, high frequency gets you operations, and spike rate, individual spike trains give you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1765.783,
    "end": 1766.684,
    "text": " basic representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1767.445,
    "end": 1767.705,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1768.626,
    "end": 1772.308,
    "text": "So this section here is slightly less important for our purposes, so I'll just skip over it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1772.689,
    "end": 1789.162,
    "text": "But essentially, my claim in this section of the paper, section three, is just to kind of review existing models of language in the brain, neurobiology of syntax in particular, and just to show that they essentially tick many of these boxes, but not necessarily all of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1789.522,
    "end": 1794.006,
    "text": "So certain models emphasize the R or the O, but they don't talk about the S or the E.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1795.073,
    "end": 1800.415,
    "text": " Or in fact, in my own book, I talk about the O and the S, but I don't really talk about R or E at all, in fact.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1800.635,
    "end": 1811.017,
    "text": "Other work talk about potentially a combination of all these features, but don't provide a particular mechanistic relationship between how these features relate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1811.477,
    "end": 1820.72,
    "text": "So, for example, you can talk about the neurobiology of R and O and S and E, but even if you have that, you still need to have some way of causally relating them, which is the kind of final section of this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1821.52,
    "end": 1832.629,
    "text": " which is how you get, so for example, you know, I mentioned that the representations, the R unit is hosted at the spike level and the E unit encoding is represented in low frequency traveling waves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1833.189,
    "end": 1835.05,
    "text": "But how the hell do you connect those two things, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1835.07,
    "end": 1837.893,
    "text": "How do you directly, what mechanism do you coordinate them?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1838.053,
    "end": 1845.719,
    "text": "So we know there's some recent work showing that in fact, traveling waves can in fact directly coordinate spike LFP coupling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1846.079,
    "end": 1849.782,
    "text": "That's some very promising work there to kind of unify all these features together.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1850.402,
    "end": 1851.884,
    "text": " But you've got to have a mechanism to do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1851.944,
    "end": 1857.429,
    "text": "So you've got to have a separate mechanism in between R and O, O and S and S and E. It doesn't just come for free.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1858.831,
    "end": 1863.536,
    "text": "OK, so a lot of these previous models are very promising from a cartographic perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1863.576,
    "end": 1869.142,
    "text": "They really do help us understand which parts of the brain are involved in different aspects of syntax or semantic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1870.042,
    "end": 1876.447,
    "text": " But in terms of providing the how question, right, like which neural mechanisms exactly are involved, that's typically lacking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1877.168,
    "end": 1879.89,
    "text": "The best candidate you have is definitely the work of Stan De Haene.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1880.49,
    "end": 1895.162,
    "text": "He's done some really nice work showing that signature syntax might be in places that most people have not really thought about, especially at the lower order level in individual spike, spiking activity or cellular barcodes and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1895.302,
    "end": 1897.964,
    "text": "That's very promising and it's something that I invoke in this paper, in fact, as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1898.704,
    "end": 1924.823,
    "text": " um okay so just to introduce this a little bit further um these four components of rows rrc enter into every syntactic and phenomenon everything as soon as you get a syntactic structure you need to have at least all of these things um okay so in terms of representations i define them just like any old uh mental representation essentially",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1925.656,
    "end": 1929.22,
    "text": " They are an instruction to provide a particular conceptual feature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1930.18,
    "end": 1933.343,
    "text": "They are composed of features determining constraints on operations as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1933.363,
    "end": 1934.524,
    "text": "And that's a really important point, by the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1934.544,
    "end": 1935.285,
    "text": "I do want to stress that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1935.926,
    "end": 1942.612,
    "text": "It's well known in linguistics that words have things like selectional restrictions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1943.012,
    "end": 1946.956,
    "text": "So a verb will often co-occur or will need to occur with, say, another word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1948.356,
    "end": 1950.237,
    "text": " You can't just put words in any order that you like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1951.297,
    "end": 1954.218,
    "text": "So, you know, words are kind of like magnets.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1954.238,
    "end": 1956.199,
    "text": "They kind of try and attach to certain other words.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1956.859,
    "end": 1958.48,
    "text": "And often that's independent of statistics, by the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1958.72,
    "end": 1965.282,
    "text": "There's some good work by Andrea Martin and Sophie Slats on the relationship between statistics of language and structure in language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1965.602,
    "end": 1966.722,
    "text": "And they're not the same thing at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1966.962,
    "end": 1970.784,
    "text": "They often correlate and they often aid each other in various ways, in very intricate ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1971.104,
    "end": 1972.124,
    "text": "But they're not the same thing at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1972.664,
    "end": 1981.967,
    "text": " You can't simply derive all possible structured language just from the frequency properties of words and the bigram and trigram frequency rate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1982.027,
    "end": 1982.707,
    "text": "You need something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1982.747,
    "end": 1983.927,
    "text": "You need kind of structural information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1984.748,
    "end": 1996.091,
    "text": "So the fact, this is kind of maybe a subtle point, but the fact that individual representations do in fact have selectional and agreement and movement constraints already tells you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1996.96,
    "end": 2011.72,
    "text": " there's got to be some kind of relationship between or dependency between the nature of how we neurally represent these representations and how they then transition into the operation stage right the o stage and there's got to be an initial dependency and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2012.887,
    "end": 2016.328,
    "text": " So some of these features can be maybe a little bit borrowed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2016.688,
    "end": 2021.029,
    "text": "But linguists often talk about things like demonstrative, noun, plural, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2021.189,
    "end": 2022.57,
    "text": "These are, of course, human-defined.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2023.51,
    "end": 2028.871,
    "text": "The way that our conceptual systems work, we've tried to define these things using these terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2029.151,
    "end": 2031.792,
    "text": "Are these cognitively plausible or neurobiologically plausible?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2032.472,
    "end": 2032.872,
    "text": "Maybe not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2033.333,
    "end": 2037.954,
    "text": "But there's at least some kind of atomic unit that's being evolved here, a unit, just call it X, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2038.194,
    "end": 2042.155,
    "text": "So this feature X and Y, they are being composed into particular terms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2042.575,
    "end": 2060.897,
    "text": " uh configurations so maybe these terms these english language terms are just convenience a kind of placeholder for what these conceptual features really are so to speak but i i think that language is slightly misleading for a reason that people like chomsky and david popel have talked about and a lot of these things really just come down to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2061.798,
    "end": 2088.181,
    "text": " kind of classic marion levels you know david marge three levels of computation algorithm and implementation and all of these things are totally kosher and legitimate at the computational level and so therefore it's it doesn't really we don't really have to abandon them necessarily just because um we can't find uh you know what some what looks like an amount of feature in the brain that's you know a lot of this involves kind of category errors i think um so which is why i try and break it down into more atomic stages",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2089.482,
    "end": 2093.165,
    "text": " So syntax builds structure through recursive applications of merge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2093.185,
    "end": 2100.591,
    "text": "Like I said, you have this basic merge operation, which I haven't introduced yet, I realize, but it's basically just a binary set formation with some kind of categorization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2100.992,
    "end": 2105.295,
    "text": "So you form a set, you just put two things together, and then you categorize it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2106.176,
    "end": 2109.859,
    "text": "You give a category, you know, a noun phrase or a verb phrase or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2109.899,
    "end": 2115.403,
    "text": "And there's much more to be said there, but that's essentially the basic property of language, just building sets, set formation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2115.423,
    "end": 2116.404,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2118.88,
    "end": 2121.443,
    "text": " So this is the outline of the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2122.484,
    "end": 2130.333,
    "text": "At the R level, as I mentioned, you get single unit encoding of conceptual features and what I call formal syntactic features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2130.834,
    "end": 2134.258,
    "text": "And these are basically features that I won't bother going into, but there are certain features",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2135.479,
    "end": 2150.432,
    "text": " like q and phi and other things that are other features that are interpretable or uninterpretable things are features that only enter into syntactic relationships and don't have any other role they don't have any other role in providing instructions to phonology or anything else",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2151.632,
    "end": 2166.162,
    "text": " But so these features involve what's called a cellular barcode for distinct features that compose into syntactic objects coherently bound by these high gamma activity at O. So the O stage is the later stage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2167.082,
    "end": 2168.483,
    "text": "And it also involves vector codes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2168.663,
    "end": 2173.487,
    "text": "This is invoking a lot of work from John Hopkins University and people like Standa Hain again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2174.327,
    "end": 2177.189,
    "text": "The R level also involves vector codes for ensembles",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2177.969,
    "end": 2186.472,
    "text": " neural ensembles, cellular ensembles, hosting features common to objects represented at O, and which are ultimately coordinated by the S level, the low frequency level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2189.133,
    "end": 2191.314,
    "text": "At the O level, high gamma activity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2191.334,
    "end": 2200.337,
    "text": "So this high gamma activity is, like I said, it's a neural activity that is around 60 to 150, 200 hertz amplitude in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2201.118,
    "end": 2204.339,
    "text": "These high gamma sensory motor transformations",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2205.371,
    "end": 2220.59,
    "text": " So things like high gamma activity provides access to centromotor transformations, and they transform these centromotor representations like sight and sound and orthography and so on, things that you read, things that you are exposed to, they transform them into lexicalized objects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2221.477,
    "end": 2246.596,
    "text": " and if you're interested in the particular regional involvement there's a list there and then they are they they are therefore accessible as i mentioned earlier they're accessible to delta or theta phase locking so i mentioned that the theta gamma coupling where the phase of theta dictates the amplitude and the firing rate of the high frequency oscillations so you know you only get that once you have high gamma activity and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2247.576,
    "end": 2262.107,
    "text": " because that's the sufficiently correct resolution, the optimal resolution, it seems, which the brain likes to coordinate long-distance relationships and transfer information from one part of the brain to the other, essentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2263.328,
    "end": 2269.232,
    "text": "So this level can implement the semantic composition of language-specific concepts that coordinate the firing of R units.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2269.673,
    "end": 2273.716,
    "text": "So this high gamma level has also been implicated in basic semantic composition",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2274.352,
    "end": 2290.862,
    "text": " So in a paper of mine, I've looked at the composition of basic adjective noun structures using intercranial recordings, and high gamma activity seems to be sensitive to this basic aspect of semantic composition, not necessarily syntactic composition, but certainly semantic composition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2290.902,
    "end": 2294.864,
    "text": "It could also be involved in syntactic composition, but certainly semantic composition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2296.605,
    "end": 2300.707,
    "text": "Syntactic composition, again, would necessarily involve the S level, S for structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2302.785,
    "end": 2303.005,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2303.305,
    "end": 2320.44,
    "text": "And then, of course, the high gamma activity itself also activates these ensembles that I mentioned at the R level that are composed of distinct units hosting this barcode or vector code for the finite list of units that compose into the feature bundles that you get whenever you access an individual word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2321.38,
    "end": 2327.686,
    "text": "Every given word is literally just a linear list of these features that you kind of trigger whenever you access it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2329.13,
    "end": 2333.433,
    "text": " And again, all of this stuff is only talking about the syntax semantics side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2333.953,
    "end": 2340.076,
    "text": "The side of phonology and sound and gesture and orthography and all the rest of it, that's a separate issue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2340.576,
    "end": 2341.577,
    "text": "That's a totally separate issue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2342.837,
    "end": 2348.02,
    "text": "I'm only talking about interpretation, comprehension, planning, thinking, that kind of thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2348.04,
    "end": 2349.541,
    "text": "I'm just talking about internalization here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2350.802,
    "end": 2360.568,
    "text": " Okay, turning to the S-level, as I mentioned, this is a low-frequency neural program for generating structural inferences over the O-level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2361.048,
    "end": 2375.858,
    "text": "So delta-theta phase-amplified coupling, as I mentioned, gives you categorical inferences that allow you to modulate the representations of these feature bundles, so the delta can coordinate the theta-gamma complex, and it has some say in the sequencing and the triggering, and the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2376.318,
    "end": 2402.811,
    "text": " the kind of um like i said yeah basically the triggering of these features and how they are accessed and basically the readout but what's time to read out right and then finally e the encoding phase and this is what i mentioned earlier with the traveling waves where you get the local and global workspaces for bottom-up lexical memory and top-down hierarchical memory um traveling waves implement delta theta coupling for hierarchical memory",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2403.649,
    "end": 2408.372,
    "text": " Whereas the theta gamma coupling gives you a kind of bottom up lexical memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2408.392,
    "end": 2411.494,
    "text": "It's kind of linearized memory just for lexical features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2412.114,
    "end": 2417.517,
    "text": "Whereas the hierarchical memory, the memory about hierarchical relationships in a structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2417.877,
    "end": 2420.779,
    "text": "So, you know, abstract relations in a tree structure,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2421.628,
    "end": 2426.793,
    "text": " independent of any linear order or independent of any sensory motor transformations triggered by gamut.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2427.454,
    "end": 2438.264,
    "text": "There's a separability between the structural inferences made and the lower level sensory motor operations that you get and are accessed by gamut.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2439.918,
    "end": 2445.279,
    "text": " And then, as I mentioned earlier as well, alpha power can be involved in the shielding of this process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2445.979,
    "end": 2456.442,
    "text": "An increase in alpha power towards the end of sentences is often indicative of some kind of accrual of semantic attention or semantic working memory or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2457.322,
    "end": 2459.363,
    "text": "So I think that's potentially related to this issue too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2461.383,
    "end": 2464.684,
    "text": " And then finally, beta power also codes for syntactic predictions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2464.704,
    "end": 2478.508,
    "text": "There's been some interesting work looking at how beta power seems to be sensitive to successful or unsuccessful, but basically triggered or not triggered syntactic predictions, or at least anticipation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2479.048,
    "end": 2494.981,
    "text": " of building a syntactic phrase or you're about to you know you've been exposed to certain words and now you're about to generate a structural inference or you're predicting a specific syntactic item beta power seems to be involved in the indexing of that sensitivity and but notice something interesting here right that's beta power",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2495.999,
    "end": 2513.082,
    "text": " This whole notion of prediction and anticipation, that is a separate process from the core structure building inferential process that's been exhibited by Delta and Theta and has already been empirically documented in Delta and Theta.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2513.582,
    "end": 2521.544,
    "text": "So again, this is a kind of neurobiological support for the separation of predictive algorithms, predictive processing,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2522.279,
    "end": 2529.342,
    "text": " and more kind of old-fashioned traditional structural inferences that are made by the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2531.283,
    "end": 2541.928,
    "text": "So just to unpack that a little bit more, it would be a problem for me, it would be a problem for a lot of people if all of these processes, anticipation, prediction, coordination, attention,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2543.012,
    "end": 2549.034,
    "text": " and also syntactic structural inferences were all indexed and all coordinated in this delta and or theta rhythm.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2549.514,
    "end": 2552.475,
    "text": "That would be a problem because how the hell do you separate them out, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2552.535,
    "end": 2553.636,
    "text": "It's very difficult to think about that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2554.636,
    "end": 2562.779,
    "text": "You know, if that were to be true, then we would probably have to abandon the notion that we can construct a coherent oscillatory phase code for language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2563.399,
    "end": 2564.24,
    "text": "It might be impossible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2564.26,
    "end": 2566.06,
    "text": "You just have to just give up on it and look elsewhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2566.54,
    "end": 2570.182,
    "text": "But the fact that we can, in fact, find the separability, I think speaks to this potential.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2572.256,
    "end": 2597.713,
    "text": " is why i wrote this paper because i think you know i think there's some good um some good potential here okay and then this figure down here um if i can maybe just zoom in a little bit potentially um this just depicts um exactly what i mentioned uh in verbal form in visual form so the representation level again these individual features here that correspond to individual cells sensitive maybe not selective but sensitive",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2598.271,
    "end": 2599.051,
    "text": " to each of these features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2599.091,
    "end": 2602.352,
    "text": "The question of selectivity versus sensitivity, that's purely empirical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2604.232,
    "end": 2611.214,
    "text": "I enjoy philosophy and theorizing as much as anybody else, but these questions are, at this stage, purely empirical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2611.454,
    "end": 2617.215,
    "text": "It's possible that there are certain cells that are selective or sensitive to all these features, but at least that's the framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2617.435,
    "end": 2623.276,
    "text": "There's a particular cellular infrastructure that facilitates these representational accessing, essentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2624.368,
    "end": 2634.593,
    "text": " When it comes to operation, again, I need to be careful with the term operation because maybe this is the one that I haven't explained well enough, so I should maybe spend a minute just explaining this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2635.574,
    "end": 2643.818,
    "text": "The brain carries out phonological operations, it carries out semantic operations, it carries out syntactic operations, it carries out all sorts of operations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2644.298,
    "end": 2651.322,
    "text": "In the context of rows, I'm focusing on how it carries out the combination, the initial",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2651.969,
    "end": 2655.011,
    "text": " set formation process involved in merge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2655.071,
    "end": 2656.712,
    "text": "So the early stage of merge, essentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2657.272,
    "end": 2661.374,
    "text": "The O versus S kind of captures the distinction between merge and labeling, essentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2662.595,
    "end": 2671.359,
    "text": "The distinction between set formation, just building, you know, putting two units together and then transferring it into a category.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2671.759,
    "end": 2678.703,
    "text": "So I guess what I'm trying to say is the categorization process will not be found at the O level, at the high gamma level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2679.175,
    "end": 2681.837,
    "text": " You might see some category sensitivity in high gamma.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2682.278,
    "end": 2687.182,
    "text": "You might see different gamma profiles for verb phrases versus noun phrases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2687.522,
    "end": 2688.723,
    "text": "And in fact, we've already found that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2688.803,
    "end": 2690.745,
    "text": "People like Andrea Mara has published papers on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2691.025,
    "end": 2697.33,
    "text": "So we know that there's a syntactic or semantic sensitivity at the O level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2697.831,
    "end": 2702.475,
    "text": "Again, the difference between verb phrase and noun phrase is not just syntactic, it's also semantic, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2702.555,
    "end": 2703.095,
    "text": "That's the problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2703.596,
    "end": 2707.179,
    "text": "Big issue here of trying to separate syntax from semantics is that whenever you modulate syntax,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2707.932,
    "end": 2714.955,
    "text": " you also modulate semantics, and whenever you modulate lexico-semantic content, you also therefore modify everything else, syntax and semantics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2715.915,
    "end": 2716.515,
    "text": "So that's an issue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2717.096,
    "end": 2724.158,
    "text": "And there's, you know, we're trying to, well, we are in fact, you know, running some designs at the moment to try and experimentally tease those apart.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2724.599,
    "end": 2728.08,
    "text": "But for this purposes, for the current purposes,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2728.612,
    "end": 2738.121,
    "text": " the term operation is referred to unifying different lexical and semantic features together, essentially, into a coherent unit, into a set.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2738.601,
    "end": 2742.545,
    "text": "And then once you've got that set represented in Gamma, then you turn to the structural level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2742.965,
    "end": 2750.452,
    "text": "And the structural level is more higher order, more complex, more global, more interactive, and therefore more low frequency.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2751.333,
    "end": 2753.235,
    "text": "That's the kind of goal, that's the kind of framework here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2755.481,
    "end": 2762.866,
    "text": " And then finally, the encoding level, I mentioned very briefly, maybe a little bit too briefly, the two types of memories that you get in language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2763.147,
    "end": 2774.815,
    "text": "There's been some really good work by people like David Adger, Queen Mary, and a bunch of other people who've kind of explored the different types of syntactic workspaces or linguistic workspaces.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2775.075,
    "end": 2781.02,
    "text": "Like when you comprehend a sentence, you don't just have a single, well, you might in fact have a single workspace, it's possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2781.38,
    "end": 2788.902,
    "text": " but it's also possible that you read it out into different separable workspaces that are responsible or sensitive to different types of memory representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2789.443,
    "end": 2798.605,
    "text": "So it's often been implied by people like William Machen, I think very legitimately, that inferior frontal cortex is really involved in syntactic working memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2799.866,
    "end": 2809.469,
    "text": "Specifically, we don't know exactly what features of syntax, but certain types of syntactic information are held there and maintained there in short-term memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2810.744,
    "end": 2814.747,
    "text": " But so for lexical memory, I'm invoking theta-gamma coupling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2815.107,
    "end": 2820.891,
    "text": "And then, as I mentioned briefly, for the hierarchical memory, I'm invoking delta-theta coupling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2821.712,
    "end": 2830.139,
    "text": "And then unifying the both of them or connecting the two was this other form of processing that I mentioned earlier, the delta-gamma coupling, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2830.619,
    "end": 2837.144,
    "text": "So the delta-gamma coupling, as I mentioned, is just involved in basic domain general, very domain general,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2837.794,
    "end": 2841.515,
    "text": " combinatorics, just combining two different representations from different parts of the mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2842.835,
    "end": 2847.537,
    "text": "But nevertheless, you'll see the relationship between, you know, delta and gamma between both of them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2848.137,
    "end": 2861.22,
    "text": "Now, when it comes to the spatial temporal dynamics of this process, the actual kind of, you know, how this is implemented in the brain in terms of which networks, which white matter pathways, and so on, that's a purely empirical question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2861.961,
    "end": 2866.942,
    "text": "But we do know enough from the MEG, from the scalp literature, from the intracranial literature,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2867.352,
    "end": 2873.313,
    "text": " that these codes are legitimate codes to be implemented across some portions of cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2873.553,
    "end": 2884.255,
    "text": "I have a bunch of speculations empirically supported also in terms of which parts of the brain these particular encoding workspaces are going to be found and going to be documented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2885.295,
    "end": 2888.316,
    "text": "But at least this is the general abstract schema, if you like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2888.416,
    "end": 2890.956,
    "text": "This is the kind of very general schema.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2890.976,
    "end": 2893.697,
    "text": "And the reason why I've emphasized that is because, as I mentioned earlier,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2894.187,
    "end": 2900.375,
    "text": " every other paper in neurolinguistics focusing on syntax is almost entirely cartographic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2900.851,
    "end": 2905.855,
    "text": " it's almost entirely localizationist in terms of, let's figure out if it's, you know, is it IFG?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2906.196,
    "end": 2906.876,
    "text": "Is it PT?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2907.337,
    "end": 2909.018,
    "text": "You know, is it ventral temporal?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2909.138,
    "end": 2912.521,
    "text": "They're the kind of questions that are framed by most of these models in the literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2912.982,
    "end": 2915.704,
    "text": "And though essential, that's not my concern here, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2915.744,
    "end": 2925.933,
    "text": "My concern here is, yes, localization, but let's try and focus on which particular abstract neural code is going to be generalizable enough across different parts of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2926.354,
    "end": 2927.935,
    "text": "And also, by the way, small point here,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2928.583,
    "end": 2931.158,
    "text": " and also generalizable across cases of plasticity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2932.981,
    "end": 2936.844,
    "text": " you know, I'm involved in a neurosurgery case today, we know that the brain is highly plastic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2936.904,
    "end": 2945.909,
    "text": "When you resect certain portions of tissue, recruited or not in language, you get fairly rapid organisation over a period of weeks and months, sometimes years.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2946.69,
    "end": 2947.791,
    "text": "But that tells you immediately.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2948.271,
    "end": 2958.578,
    "text": "And in fact, there's some also really fascinating work in congenitally blind people and or deafblind, I think too, showing that portions of their brain",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2959.558,
    "end": 2988.72,
    "text": " uh yeah in the congenitally blind there's portions of occipital cortex that come online and are sensitive to syntax so because you know these people are not using their occipital cortex for vision they don't need it uh they end up uh recruiting it for other other purposes too sometimes linguistic purposes so that's why i think focus on a more abstract code is more important maybe not more important maybe that's maybe that's unfair but i think it's potentially just as important if not more important than trying to figure out the kind of cartographic landscape",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2990.085,
    "end": 2991.106,
    "text": " for how language is implemented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2992.327,
    "end": 3000.913,
    "text": "Also, by the way, another small point, which is maybe not so small these days, this is also very important if we care about things like brain-computer interface devices.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3001.373,
    "end": 3002.914,
    "text": "So, you know, neurotechnologies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3003.73,
    "end": 3015.154,
    "text": " And so there's a bunch of what's called BCI brain computer interface devices that you implant in patients brains to help them with either the epilepsy or to help them with speech processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3015.174,
    "end": 3017.835,
    "text": "You've got quadriplegic patients who lose their speech.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3018.455,
    "end": 3023.837,
    "text": "And there's some other efforts recently to try and help people with all sorts of language deficits by using neural implants.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3025.838,
    "end": 3036.361,
    "text": " There's a factory not too far away from me north in Austin, and there's places owned by Elon Musk, as you know, who owns Neuralink.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3036.421,
    "end": 3038.162,
    "text": "These guys are trying to do something similar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3038.622,
    "end": 3039.602,
    "text": "But that's a speech.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3039.922,
    "end": 3052.146,
    "text": "When it comes to designing a brain-computer interface for things like syntax or semantics, I think we're going to need to pay attention to these aspects, these questions to do with the neural code rather than just the region.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3052.486,
    "end": 3054.627,
    "text": "Because if you're going to have somebody who has a syntactic deficit,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3055.107,
    "end": 3058.969,
    "text": " or a semantic deficit, and you're going to try and help them get their language faculty back.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3059.449,
    "end": 3064.632,
    "text": "It's no good just knowing which part of the brain is going to be recruited for their language function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3065.252,
    "end": 3072.896,
    "text": "With a BCI device, you need to coordinate particular stimulation profiles and particular ways to coordinate and trigger and suppress brain activity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3073.296,
    "end": 3076.378,
    "text": "And so in order to do that, you've got to have the right parameter space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3076.998,
    "end": 3081.24,
    "text": "And to figure out the parameter space, you therefore need to have a question of neural code involved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3082.082,
    "end": 3085.784,
    "text": " almost definitely a phase code, some kind of high frequency or low frequency phase code.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3086.244,
    "end": 3094.429,
    "text": "So all of these questions that I'm asking right now, don't just have kind of theoretical, you know, basic science, academic implications.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3094.449,
    "end": 3095.489,
    "text": "Obviously, that's my interest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3095.529,
    "end": 3097.77,
    "text": "That's, that's my main concern here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3097.99,
    "end": 3104.874,
    "text": "But they will also definitely have kind of, you know, implications for patient treatment in the BCI space moving forward.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3108.176,
    "end": 3108.356,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3110.563,
    "end": 3112.184,
    "text": " Right then, let's move on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3112.464,
    "end": 3115.266,
    "text": "Let's skip past some of this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3116.266,
    "end": 3119.568,
    "text": "It's getting on to almost an hour now, so I'll skip through.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3120.248,
    "end": 3124.651,
    "text": "The next few sections are just outlining representation, operation, structure, and encoding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3124.971,
    "end": 3127.953,
    "text": "So I'll just pick out some of the most important moments from here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3128.573,
    "end": 3137.118,
    "text": "But again, this section number five just redefines, again, and maybe exhaustively, what I mean by representation, some example features,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3137.777,
    "end": 3146.42,
    "text": " And in fact, what these gamma oscillations and high frequency oscillations might be indexing more generally in terms of their collective scope and their computational kind of facility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3147.54,
    "end": 3153.222,
    "text": "This is just a little brief definition of the kind of scales that are relevant to the different levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3153.542,
    "end": 3156.003,
    "text": "So we have single unit activity, multi-unit activity,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3156.623,
    "end": 3159.044,
    "text": " the envelope of the spike, and the LFP.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3159.504,
    "end": 3166.886,
    "text": "These are different aspects of neural organization and recording resolution that will be relevant to the different components of ROSE.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3167.246,
    "end": 3172.028,
    "text": "And that kind of just outlines the scope of inquiry here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3173.288,
    "end": 3180.511,
    "text": "This was something that I put in to certify, make it clear that I'm talking about representation in this sense and not that sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3181.431,
    "end": 3184.732,
    "text": "Basic units, again, I'm just talking about what these basic units are.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3186.032,
    "end": 3210.556,
    "text": " um and then i'm turning here to concerns about um how to distinguish it from things like operations um okay and then oh yeah so this is an important paragraph i think um so this recent work by nelson fl discovered preferential activity for um content words over function words in the anterior temporal load this is single unit recordings again i should i should stress sorry um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3211.468,
    "end": 3217.952,
    "text": " So that already begins to tell you that at the single unit level, at the silo level, different parts of the brain, I mentioned ATL already.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3218.332,
    "end": 3223.194,
    "text": "In this case, ATL does seem to be sensitive to lexical type.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3223.314,
    "end": 3224.975,
    "text": "Again, that could be due to other reasons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3225.636,
    "end": 3228.337,
    "text": "In this case, they looked at it independent of word length and word position.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3229.618,
    "end": 3238.723,
    "text": "The big confound here is word frequency, but there's some of the kind of indication here that potentially something to do with lexicality is driving this difference, this sensitivity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3238.743,
    "end": 3239.683,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3242.963,
    "end": 3254.193,
    "text": " And then more generally, what are termed concept cells that preferentially activate for stimuli that occupy a certain position in some category or axis seem to support a declarative, seem to support declarative information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3254.633,
    "end": 3255.154,
    "text": "What does that mean?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3255.214,
    "end": 3259.878,
    "text": "It just means that there's some really nice work by Bauer et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3259.938,
    "end": 3265.403,
    "text": "showing that there's a kind of feature space in a primate and also a human",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3266.008,
    "end": 3270.495,
    "text": " and ventral temporal cortex that is sensitive to a kind of axis of animacy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3270.855,
    "end": 3278.507,
    "text": "So whether or not an object is animate or inanimate, like a chicken versus a laptop, there's some things that are kind of in between and vague.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3279.088,
    "end": 3281.331,
    "text": "And then whether or not a surface is spiky or stubby.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3281.96,
    "end": 3284.681,
    "text": " So kind of, you know, like this or spiky.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3284.721,
    "end": 3288.081,
    "text": "So kind of a kiki booba kind of situation for linguists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3288.522,
    "end": 3292.543,
    "text": "So that's kind of a nice conceptual geometry that you have going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3292.923,
    "end": 3300.144,
    "text": "And there's different cells, concept cells, that preferentially activate the stimuli that occupy a space within that axis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3300.945,
    "end": 3310.867,
    "text": "So that tells you very nicely that at the unit level, we have a potential neural code for this very generic, but also all-encompassing object space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3312.28,
    "end": 3314.762,
    "text": " This is Doris Sauer's lab, the Barrackel paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3315.983,
    "end": 3339.142,
    "text": "So, you know, the kind of promise, the promise that this gives us for linguistic features, I think is quite interesting because linguists have spent a long time, you know, reminding us that the feature space in linguistic semantics can also occupy something like animate, inanimate, and then some other, a bunch of other abstract concrete kind of feature spaces too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3340.062,
    "end": 3354.406,
    "text": " So I think it's very reasonable to expect and to predict at the unit level a similar kind of conceptual geometry taking place in a different part of the brain, potentially posterior temporal cortex, potentially inferior frontal cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3354.426,
    "end": 3354.726,
    "text": "Who knows?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3355.086,
    "end": 3356.666,
    "text": "We don't know until we explore.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3357.126,
    "end": 3367.509,
    "text": "But I think that kind of reinforces the definition of the R level that I'm defining here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3368.469,
    "end": 3368.669,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3371.797,
    "end": 3372.117,
    "text": " Right then.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3374.039,
    "end": 3380.444,
    "text": "Okay, so this next section here, mapping from R to O, this gets at the very tricky issue that I mentioned at the beginning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3380.985,
    "end": 3386.71,
    "text": "So at the beginning of the paper, I, you know, lampoon and criticize all these other people for not doing this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3387.07,
    "end": 3391.694,
    "text": "So hopefully I do it, you know, a decent job, otherwise I will embarrass myself a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3392.715,
    "end": 3397.94,
    "text": "But the kind of motivation here is that we don't just need a definition of what R and O looks like in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3398.36,
    "end": 3406.087,
    "text": " We need a way to relate R to O. We need a way to feed the information at the R level, the unit level, all the way up to the O level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3407.148,
    "end": 3411.291,
    "text": "So I mentioned, just a quick reminder, R is a single unit spike train activity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3412.793,
    "end": 3414.554,
    "text": "The O level is high gamma activity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3415.275,
    "end": 3421.5,
    "text": "So they're kind of slightly more easy to detect using standard intercranial measures, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3422.181,
    "end": 3424.723,
    "text": "Okay, so how can we relate these ideas, the O to the R?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3426.4,
    "end": 3434.808,
    "text": " So in this section, I kind of propose that the relations between multi-unit activity and population signals hold the answer.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3436.75,
    "end": 3438.972,
    "text": "So I might just have to focus on this for a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3439.012,
    "end": 3440.653,
    "text": "Oh, this is only a short section, very short section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3440.673,
    "end": 3441.494,
    "text": "That's good.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3441.574,
    "end": 3442.635,
    "text": "OK, this will be quick then.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3443.196,
    "end": 3450.222,
    "text": "So local field potentials reflect the common synaptic activity of a population of neighbouring neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3451.604,
    "end": 3457.187,
    "text": " And spikes are short-time high frequency content signals reflecting individual cellular activity, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3457.207,
    "end": 3457.967,
    "text": "So individual cells.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3458.667,
    "end": 3460.468,
    "text": "Neural synchronization can be evinced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3461.348,
    "end": 3462.289,
    "text": "One of my favorite words there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3462.689,
    "end": 3468.292,
    "text": "They can be evinced by temporally relating spiking activity to the background oscillations of LFPs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3469.192,
    "end": 3473.234,
    "text": "And this relationship has been documented across multiple brain regions and cognitive functions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3473.794,
    "end": 3476.976,
    "text": "So this spike phase coupling has functional consequences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3477.736,
    "end": 3479.797,
    "text": "And there's some examples there if you want to consult.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3480.7,
    "end": 3486.044,
    "text": " Okay, so that's the coupling between the LFP and the actual spike, the individual spike.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3486.705,
    "end": 3487.985,
    "text": "So that's kind of an analogous, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3488.026,
    "end": 3492.169,
    "text": "If you think about it, that's analogous to what I mentioned earlier in the low-frequency space, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3492.529,
    "end": 3496.652,
    "text": "I mentioned the delta-theta coupling and the delta-gamma coupling, etc.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3496.972,
    "end": 3501.175,
    "text": "This LFP phase coupling is essentially the same thing, just on a smaller scale, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3501.476,
    "end": 3502.937,
    "text": "So it's kind of nesting all the way down.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3504.558,
    "end": 3510.042,
    "text": "So LFPs are highly effective means of exposing what state a given cortical region is in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3510.563,
    "end": 3514.146,
    "text": " since they capture general dynamics not specific to any individual cell.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3514.426,
    "end": 3516.708,
    "text": "And this is a really cool point, actually, about LFPs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3516.748,
    "end": 3522.934,
    "text": "They actually host types of information that are not detected at the spike level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3523.695,
    "end": 3527.018,
    "text": "So that's kind of an important point there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3528.139,
    "end": 3530.461,
    "text": "And also, of course, there are cells that don't spike too, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3531.559,
    "end": 3542.192,
    "text": " So in the same way that there's likely much information available at the LFP level that's not represented at the unit level, like dynamics and amazing properties exist that can only be detected at the level of summed activity of a million neurons,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3542.825,
    "end": 3558.235,
    "text": " so too is it expected to be the case that there are aspects of cortical computation that are only represented at the interactional global scale, even at the state scale, like, you know, hidden Markov scale, kind of autoregressive hidden Markov models and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3558.255,
    "end": 3564.899,
    "text": "You can kind of generate these more abstract state spaces across networks of brains, networks of reasons, I'm sorry.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3565.779,
    "end": 3569.942,
    "text": "And I think that will also be relevant at some point too in the future, but maybe I'll get to that at some point later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3570.718,
    "end": 3574.36,
    "text": " And that information is not represented at the LFP or spike level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3574.801,
    "end": 3580.444,
    "text": "So that basic finding, empirical finding, is another core motivation for the ROSE model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3581.124,
    "end": 3597.354,
    "text": "The fact that you do find this dissociable level of information representation across these scales already tells you that there's very likely to be this scale of computational complexity at the linguistic and non-linguistic level too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3598.982,
    "end": 3599.182,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3599.603,
    "end": 3605.909,
    "text": "And like I said, it's a basic presupposition of rows, but it's also a presupposition of other major frameworks in cognitive neuroscience, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3606.089,
    "end": 3606.529,
    "text": "Not just me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3607.29,
    "end": 3609.973,
    "text": "I'm not the one to kind of, you know, propose this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3610.173,
    "end": 3619.182,
    "text": "So an example I counted here is working memory, which seems to involve discontinuous bouts of spiking activity as opposed to steady state neural dynamics, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3619.542,
    "end": 3623.426,
    "text": "So often it was initially believed that working memory, in order to maintain some of the working memory,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3624.11,
    "end": 3634.14,
    "text": " There's got to be some kind of direct, intuitively direct neural correlate, which looks like it's maintaining or staying at a stable level or amplitude, steady state or increase over time, etc.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3634.48,
    "end": 3635.321,
    "text": "Turns out not to be the case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3636.362,
    "end": 3640.325,
    "text": "OK, so relating R to O is far from trivial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3640.445,
    "end": 3641.927,
    "text": "Yes, that is absolutely correct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3643.393,
    "end": 3649.197,
    "text": " Consider how communication through coherence has typically been assumed to reflect phase synchronization between oscillators.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3649.718,
    "end": 3662.186,
    "text": "Recent work has offered an alternative mechanism through which coherence is the consequence of communication and emerges because spiking activity in ascending area causes postsynaptic potentials in the same, but also other areas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3662.306,
    "end": 3663.367,
    "text": "That makes things more complicated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3665.031,
    "end": 3675.06,
    "text": " So these authors identified afferent synaptic inputs rather than spiking entrainment as the principal determinant of coherence, opening up new directions for framing the relation between units and coherence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3675.78,
    "end": 3678.283,
    "text": "So LFP coherence appears to be determined by two factors.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3679.312,
    "end": 3688.379,
    "text": " Coherence due to the direct contribution of afferent synaptic inputs and coherence between the sender LFP and the sum population spiking connectivity in the receiver.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3688.74,
    "end": 3697.547,
    "text": "So therefore, coherence therefore depends on connectivity strength and oscillation power and does not need purely oscillatory coupling or spike phase locking in a receiver.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3698.228,
    "end": 3699.609,
    "text": "And then further complexities arise here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3699.629,
    "end": 3704.853,
    "text": "I mentioned some examples from a neighboring field too, but I'll kind of skip over that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3704.933,
    "end": 3705.714,
    "text": "It's an interesting topic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3708.018,
    "end": 3717.601,
    "text": " But still, you know, successfully relating the two fundamental signals in the section, spike and LFP, can provide us with a comprehensive explanation regarding the neurobiological cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3718.601,
    "end": 3727.403,
    "text": "And since many signals picked up by the LFP will also very likely be able to be found at the unit level, care must be taken to map out assembly level effects from single unit responses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3727.443,
    "end": 3728.703,
    "text": "And that's kind of an empirical portion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3729.384,
    "end": 3731.944,
    "text": "So this kind of section is very, I think it's very honest.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3731.984,
    "end": 3734.445,
    "text": "I think it's very upfront about the limitations and potential consequences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3735.225,
    "end": 3739.168,
    "text": " countervailing trends in the literature that provide some obstacles to this grounding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3739.548,
    "end": 3753.377,
    "text": "But nevertheless, I think even if these things are true, there's still the possibility for multiple types of face codes, multiple types of neural codes within the same space being involved in different types of cognitive operations or across different core knowledge systems.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3753.917,
    "end": 3771.7,
    "text": " And of course, given that we know that human syntax is in fact a potentially species-defining property, I think care must be taken to really separate it out from these constellation of domain general neural mechanisms, which might be relevant, but might also not be relevant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3771.861,
    "end": 3779.422,
    "text": "Again, you have to kind of weigh up the likelihood of a domain general versus non-domain general process being relevant for your concerns.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3779.932,
    "end": 3783.453,
    "text": " And again, you don't know until you know, you don't know until you do the empirical research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3784.213,
    "end": 3790.234,
    "text": "But I think, you know, the purpose of this subsection is to kind of open up the space of, you know, possible alternative mechanisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3791.274,
    "end": 3793.035,
    "text": "Okay, I'm going to skip over this section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3793.055,
    "end": 3795.215,
    "text": "This just discusses gain field mechanisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3795.315,
    "end": 3796.375,
    "text": "I've written a few papers about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3797.236,
    "end": 3804.377,
    "text": "It's a very interesting topic, just kind of grounding the kind of lower level accounts of why, you know, what it is we know already about",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3806.551,
    "end": 3810.912,
    "text": " what the computational properties of individual cells might in fact be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3811.253,
    "end": 3829.02,
    "text": "And that might sound a bit abstract, but there's some really good work by W. Tecumseh Fitch and Randy Gallistol and a bunch of other people that I cite here, just exploring the potential computational kind of, you know, kind of classical Turing-level architecture, you know, Chomsky hierarchy kind of computational",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3830.578,
    "end": 3835.981,
    "text": " you know, facility that these individual cells might have in terms of their operational power.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3837.502,
    "end": 3837.762,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3838.262,
    "end": 3845.626,
    "text": "And then this subsection here just introduces a kind of a more classical distinction between Sherringtonian and Hopfieldian views.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3845.947,
    "end": 3857.053,
    "text": "That's basically just a distinction that focuses on the transmission of signals by nodes in a point-backpoint architecture, viewing cognition as the result of patterns of node-to-node connections,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3857.931,
    "end": 3860.334,
    "text": " as opposed to viewing representational spaces",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3862.154,
    "end": 3889.888,
    "text": " which computation is considered to be the transformation between spaces um so it's kind of a more different ways of viewing um populations and units the relationship between units and their population dynamics and i kind of speculate that's you know um evolutionarily older brain areas might be explained better via sharingtonian accounts whereas more recently evolved structures in him language right uh might not be so that's a potential avenue that could also direct",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3890.956,
    "end": 3894.884,
    "text": " a way of exploring the kind of empirical space beyond this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3895.826,
    "end": 3898.972,
    "text": "And then when it comes to the operation space, I've already mentioned much of this stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3899.173,
    "end": 3900.515,
    "text": "I'm invoking high gamma activity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3903.405,
    "end": 3907.448,
    "text": " I am talking about the different dimensions of gamma.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3907.488,
    "end": 3912.372,
    "text": "Gamma is not just a unified construct, either neurochemically or genetically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3912.412,
    "end": 3915.895,
    "text": "In fact, it's a very complex structure indeed across species, across brain regions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3915.915,
    "end": 3918.877,
    "text": "You get physiological gamma responses in subcortical structures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3918.897,
    "end": 3922.1,
    "text": "You get kind of higher order cognitive responses in cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3922.5,
    "end": 3924.682,
    "text": "Gamma itself is just literally a range.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3925.402,
    "end": 3946.182,
    "text": " um but it's a very a complex manifold and so i kind of this section kind of takes care to to break down what i mean by gamma um you know a lot of papers in the neurobiology of language just kind of invoke you know gamma oscillations um or particular arbitrarily cut off you know range uh band range this section tries to take a little bit of care to just unpack",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3946.923,
    "end": 3955.573,
    "text": " the different types of gamma, different types of aspects of gamma in terms of their sensitivity to different aspects of representational complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3956.474,
    "end": 3959.738,
    "text": "So lower versus high gamma, you know, broadband, narrowband gamma, etc.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3960.719,
    "end": 3963.983,
    "text": "If you're interested in that, this is a good section for you to consult.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3966.586,
    "end": 3966.806,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3968.308,
    "end": 3984.342,
    "text": " So turning to structure, this again kind of reviews some of the things I mentioned earlier to do with the fact that, you know, every linguistic structure is sensitive to some aspect of lexical and semantic information that cohere into some kind of phrasal or sentence structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3985.604,
    "end": 3989.006,
    "text": " There's a phrase by Arkham Rance, there's no escape from syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3990.587,
    "end": 3991.367,
    "text": "That is absolutely true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3991.727,
    "end": 4005.274,
    "text": "Everywhere you look in language, every kind of phenomenon, semantic, pragmatic, even phonological, there's often a very direct impact of syntactic information in terms of the coordination and the instructions and the influence it has on these other levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4006.114,
    "end": 4013.678,
    "text": "Syntactic structure really is the most kind of fundamental level of language that influences a bunch of different domains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4015.041,
    "end": 4017.423,
    "text": " I've already introduced merge, so I'll just kind of skip over this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4017.443,
    "end": 4034.396,
    "text": "This is just a kind of more set theoretic classical definition of what we mean by a feature combination of the kind involved in language and of the kind involved in the kind of work that I mentioned earlier, and of the kind involved in the hydrogency gamma and theta dynamics that I mentioned earlier too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4035.757,
    "end": 4038.299,
    "text": "So merge is basically the most fundamental operation in language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4038.579,
    "end": 4041.101,
    "text": "It's the basic property of language, as Chomsky calls it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4041.121,
    "end": 4042.082,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4045.642,
    "end": 4062.81,
    "text": " Again, from a more philosophical perspective, I always found it interesting that even though this is a very rudimentary set formation operation, if you think about the cognitive consequences, as people like Peter Hagel have in a very nice paper, the computational system of language seems to be related to neural signals integrating perception and action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4063.77,
    "end": 4089.449,
    "text": " and providing humans with novel modes of planning and interpretation whereby lexical units and unification processes like merge provide an imaginary space that transcends the influence of direct perception action cycles that's a really key point there because of course we know that um one of the um real benefits of language and potentially why it was evolutionarily selected for uh is because it allows us to plan interpret think",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4090.509,
    "end": 4098.657,
    "text": " you know, consider personal responsibilities, you know, consider our own future, our past and so on, construct a notion of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4101.51,
    "end": 4125.719,
    "text": " know one's past and where you've been constructed narrative and so to speak right so we know that other other animals have memories and but maybe none of them have a past right maybe maybe only humans have a have a past it's a kind of a unique kind of concept and that involves some kind of a different epistemological transition and a linguistic transition too right so it's a fundamentally a linguistic notion uh same with the self right the concept of self",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4126.491,
    "end": 4129.737,
    "text": " you know, who I am and who you are, I, you, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4130.598,
    "end": 4132.261,
    "text": "The existence of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4133.15,
    "end": 4134.671,
    "text": " the pronoun system in language, for example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4135.031,
    "end": 4140.253,
    "text": "All of these things are extremely cognitively rich and semantically very important concepts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4140.293,
    "end": 4142.934,
    "text": "They're not just there to facilitate communication.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4143.334,
    "end": 4145.755,
    "text": "They're not just there to facilitate information transmission.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4145.775,
    "end": 4150.917,
    "text": "They really are part of the mental architecture that we have as human beings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4152.837,
    "end": 4154.518,
    "text": "So I think it's an important point that Hogarth makes there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4154.758,
    "end": 4158.179,
    "text": "The fact that this really is the center of the kind of cognitive neurosciences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4160.24,
    "end": 4160.42,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4162.819,
    "end": 4164.061,
    "text": " Oh, excuse me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4165.043,
    "end": 4170.27,
    "text": "This section just introduces syntactic features, what we mean by a particular syntactic feature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4170.591,
    "end": 4176.199,
    "text": "I mentioned lexical features quite a lot, but this section kind of just briefly touches on syntax specific features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4177.217,
    "end": 4183.361,
    "text": " And it also reviews some recent work looking at the role of endogenous oscillations in neural computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4183.381,
    "end": 4190.726,
    "text": "I mentioned some of the stuff earlier to do with low-frequency sensitivity and entrainment to particular moments of syntactic structure building.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4191.086,
    "end": 4197.089,
    "text": "This section here just kind of unpacks some of that more exhaustively and gives some more recent references there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4199.451,
    "end": 4201.272,
    "text": "So this section kind of just reviews that literature.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4204.714,
    "end": 4205.795,
    "text": "Skipping through this part here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4207.502,
    "end": 4218.308,
    "text": " And again, just kind of to recapitulate what I mentioned earlier, the role of low frequencies in indexing supralexical structural inferences is very well empirically supported.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4218.348,
    "end": 4233.316,
    "text": "So the previous two pages that I just scrolled past, they really kind of proposed and summarized a lot of literature suggesting that lower frequencies indexing supralexical, so stuff above the individual word level, it really is pretty undeniable at this stage, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4233.796,
    "end": 4233.956,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4236.024,
    "end": 4237.965,
    "text": " And then we turn to the more issues of timing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4238.025,
    "end": 4244.009,
    "text": "So, you know, what is the precise timing of syntactic information processing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4244.049,
    "end": 4256.437,
    "text": "This paragraph here just kind of breaks down some of the particular periods of sensitivity that have been already documented and how it is compatible and maps onto the predicted time course dictated by the higher frequency rhythms, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4256.897,
    "end": 4262.401,
    "text": "So it's no good me just saying, oh, delta is involved in syntax and, you know, gamma in, you know, semantics or whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4263.021,
    "end": 4264.322,
    "text": "You really need to have a motivated",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4264.804,
    "end": 4278.787,
    "text": " time course in real time, like a real time passing constraint on how these high frequency oscillations can embed themselves and be entrained and phase locked to these lower frequency rhythms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4279.528,
    "end": 4281.508,
    "text": "So I kind of break down the time course of activity here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4281.988,
    "end": 4282.908,
    "text": "And it's all kosher.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4282.968,
    "end": 4284.429,
    "text": "It's all empirically motivated.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4284.449,
    "end": 4290.35,
    "text": "It's all kind of aligned with what we know about both about delta and about the intermediary frequencies too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4292.871,
    "end": 4293.071,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4294.502,
    "end": 4297.368,
    "text": " And then this section turns to, again, the mapping process that I mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4299.781,
    "end": 4301.942,
    "text": " the mapping from the O to S structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4302.602,
    "end": 4305.743,
    "text": "So this kind of invokes, again, a separable mechanism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4306.623,
    "end": 4309.384,
    "text": "I'll just scroll up to the top here just to have a quick refresher.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4310.484,
    "end": 4314.305,
    "text": "So we had phase amplitude coupling, as I mentioned, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4314.465,
    "end": 4319.447,
    "text": "So this is spike phase coupling, mapping R to O. Mapping O to S is phase amplitude coupling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4319.487,
    "end": 4325.989,
    "text": "So that's the kind of classical process that I mentioned earlier to do with theta gamma and delta gamma coupling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4326.229,
    "end": 4329.931,
    "text": " because that gets you directly to the higher order structural inference.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4336.515,
    "end": 4351.464,
    "text": "This section is just a short review of the phase-amplitude coupling dynamics in this particular process, and it also talks a little bit about some other kind of extracranial recording measurements that have unveiled this in other kinds of domains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4353.525,
    "end": 4356.947,
    "text": " This section here, dissociating structure from meaning, this is very much for the linguists.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4357.407,
    "end": 4370.355,
    "text": "This is kind of trying to figure out how we can carefully account for signals that are specific to the semantics of a phrase versus signals that are maybe not specific, but certainly sensitive to the syntax of a phrase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4370.916,
    "end": 4371.736,
    "text": "That's a very tricky issue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4371.756,
    "end": 4379.641,
    "text": "You have to kind of basically design an experiment or stimuli that is getting participants to pay attention to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4380.247,
    "end": 4405.938,
    "text": " structural inferences and syntactic information and syntactic acceptability and not pay too much attention to other kinds of features, but also the stimuli itself have to be carefully weighted across words that preferentially engage syntactic information over and above conceptual information or conceptual semantic information versus words that very much do trigger heavy semantic content.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4406.438,
    "end": 4407.459,
    "text": "So that involves a lot of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4408.456,
    "end": 4410.477,
    "text": " you know, careful kind of empirical consideration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4411.258,
    "end": 4416.841,
    "text": "Our lab is currently carrying out, you know, some research into that space, as are some other labs too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4417.361,
    "end": 4433.931,
    "text": "But it's basically an appeal for focusing more laser-like on these, you know, ways to dissociate syntactic from semantic processing using empirical, you know, novel kind of experimental paradigms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4435.049,
    "end": 4443.396,
    "text": " Because a lot of the paradigms that are used at the moment have a big problem, which is they don't really carefully separate out moments of syntax from moments of semantics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4443.916,
    "end": 4457.286,
    "text": "So it's very difficult to kind of, you know, realistically, you know, kind of confidently make it clear that a given brain signal or a given response is really being driven by either syntax or semantics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4459.168,
    "end": 4459.368,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4461.174,
    "end": 4464.217,
    "text": " In terms of, skip over this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4464.277,
    "end": 4464.577,
    "text": "No, I didn't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4464.998,
    "end": 4465.238,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4466.799,
    "end": 4471.163,
    "text": "And then this outlines the mapping from the S to E levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4471.604,
    "end": 4474.086,
    "text": "And it talks a little bit more about some of Standerhane",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4475.526,
    "end": 4487.221,
    "text": " and other people's work into vector codes for population dynamics to do with what level of representation we might find individual syntactic features at.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4487.781,
    "end": 4491.706,
    "text": "And again, I transition slowly here to talking about traveling waves, how they kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4492.387,
    "end": 4520.812,
    "text": " more kind of static code that i've presented so far in terms of just you know a delta a theta a gamma how that static code might be transfigured into something more you know cognitively and neurochemically plausible in terms of the what we know about the transformation of um information across white matter tracks and across and how different and portions of cortex cortical cortical cortical cortical information is kind of transferred in real time across different portions of the cortical mantle it's not just like stationary",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4522.626,
    "end": 4532.348,
    "text": " Okay, so I guess what I'm kind of calling for here, and as I call for in the next section, is a more kind of spatiotemporally dynamic model or code for language, essentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4533.968,
    "end": 4534.468,
    "text": "Excuse me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4535.368,
    "end": 4550.771,
    "text": "So all of this section essentially needs, it kind of calls upon the notion that you need to map on an important, you know, important findings from the psycholinguistic domain in terms of the timing of language, the kind of, you know, when we know that language is coming involved,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4551.761,
    "end": 4555.963,
    "text": " which periods of activity are going to be important and the actual neural architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4556.183,
    "end": 4559.744,
    "text": "That's kind of a very tricky question, how you map on those.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4559.944,
    "end": 4573.17,
    "text": "So, for example, you know, if a psycholinguist says, OK, we know that when people using eye tracking or using scalp ARP responses, we know that the period of 300 to 400 milliseconds is when most people kind of detect semantic violation effects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4574.793,
    "end": 4599.265,
    "text": " really then have to say okay if that's the case does that time period at the behavioral level map onto moments of neural activity also at that level or maybe potentially the neural response comes on a little bit earlier before it's detected the scalp level or maybe at the single unit level it's even earlier or vice versa or maybe there's a kind of top-down effect whereby some kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4599.925,
    "end": 4606.369,
    "text": " intermediary mesoscale neural signal can be detected first before the spiking information is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4606.709,
    "end": 4616.115,
    "text": "There's different hypotheses that arise here in terms of the directionality and causal relation between the R to E levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4616.235,
    "end": 4622.579,
    "text": "In the ROSE paper, I make it very clear what my empirical predictions are, but other alternative ways to modify the ROSE model could be",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4623.139,
    "end": 4625.66,
    "text": " in terms of the directionality from different levels, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4625.68,
    "end": 4641.608,
    "text": "So for different linguistic structures, it could be the case that some of the more mesoscale levels, in fact, influence the coordination of spiking rather than spiking information being read out at kind of high-order levels, which then facilitate the inferences being made.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4642.809,
    "end": 4649.172,
    "text": "The directionality is very clear in the paper, but it's very much open for empirical resolution, essentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4649.892,
    "end": 4651.053,
    "text": "Okay, so in this figure...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4652.042,
    "end": 4656.684,
    "text": " Figure two, figure one is the basic kind of, you know, components of the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4657.344,
    "end": 4660.045,
    "text": "Figure two is the basic mechanisms of the model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4660.485,
    "end": 4678.672,
    "text": "So this just goes into some more technical details that I won't go into to do with the actual nature of spike-Galopy coupling, what the kind of mathematical foundations of it are, and how you can, you know, map that on to a kind of classical kind of low frequency response and how these different signals could be coordinated in real time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4679.913,
    "end": 4680.113,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4682.466,
    "end": 4691.893,
    "text": " And then turning to the encoding section, as I mentioned earlier, we know that the human mind needs different workspaces for different aspects of cognition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4693.054,
    "end": 4699.618,
    "text": "So the big question is, does language share a workspace with other kind of non-linguistic processes?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4700.019,
    "end": 4704.001,
    "text": "Is there a specialized, unique workspace for linguistic information?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4704.602,
    "end": 4705.122,
    "text": "It's possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4705.803,
    "end": 4708.204,
    "text": "I think it's likely, in fact, which is why I have it in my paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4709.491,
    "end": 4728.597,
    "text": " So, in fact, we know that there are some non-human primates that can execute very primitive combination processes, like potentially even more flashful composition, just combining two calls, you know, like primate vocal calls together into a basic primitive unit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4729.407,
    "end": 4730.988,
    "text": " Can they then do it again and again and again?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4731.588,
    "end": 4746.097,
    "text": "Do they have the workspace that allows the facilitation of storing this one unit and then creating a new structure and then assigning that whole complex an identity that is independent from its discrete parts, which is what Merge is all about in language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4746.757,
    "end": 4747.798,
    "text": "They don't seem to be able to do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4748.258,
    "end": 4757.724,
    "text": "So that tells you, I think quite reliably, that we do need some kind of notion of human specific syntactic workspace, which is what the whole encoding level is meant to be in ROSE.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4759.71,
    "end": 4778.42,
    "text": " Okay, so this section kind of just plays out a little toy example of how to derive a particular structure and what the whole process would look like going from R to O to E. So I think this is important for me to kind of outline since it's the part of the paper where I kind of really do give a concrete example.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4779.6,
    "end": 4782.582,
    "text": "So let's consider the sentence, old men walk slowly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4783.804,
    "end": 4792.907,
    "text": " During the comprehension of the first two words, the delta-gamma combinatorial code coordinates the feature bundling of the atomic data structures hosted by olden men.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4793.147,
    "end": 4794.748,
    "text": "So olden men have various features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4795.468,
    "end": 4806.772,
    "text": "At a minimum, this involves posterior superior temporal sulcus, low firmus activity coupled with neighboring posterior temporal cortex, but also cross-cortical sites responsible for the specific feature types in question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4807.932,
    "end": 4810.113,
    "text": " So I've already mentioned places like ATL and IFG.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4810.954,
    "end": 4813.736,
    "text": "And then I also mentioned theta-gamma coupling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4814.356,
    "end": 4816.077,
    "text": "This maintains in short-term memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4816.217,
    "end": 4818.179,
    "text": "I mentioned the lexical memory buffer before, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4818.679,
    "end": 4823.262,
    "text": "Theta-gamma coupling maintains in short-term memory the relevant units via HIFUX activity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4824.342,
    "end": 4826.904,
    "text": "Obviously, in a linear sequence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4827.444,
    "end": 4829.226,
    "text": "So this is worked by David Popel too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4829.606,
    "end": 4833.829,
    "text": "The theta-gamma coupling is a linear feature clocking mechanism that tells you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4834.069,
    "end": 4836.01,
    "text": "These are the set of features, features 1 to 5, 1 to 7.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4837.711,
    "end": 4840.712,
    "text": " And you're going to access them and trigger them and read them out in a given sequence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4841.172,
    "end": 4843.313,
    "text": "So that's the kind of linear lexical memory stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4843.593,
    "end": 4848.335,
    "text": "It doesn't give you the hierarchical syntactic relational component, but it's independent of order.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4848.655,
    "end": 4849.295,
    "text": "That comes later.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4850.536,
    "end": 4851.756,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4852.137,
    "end": 4860.78,
    "text": "At the transition between men and walk, so word two and word three, the superordinate delta theta code maintains the categorical identity of the object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4861.553,
    "end": 4865.395,
    "text": " So, you know, old men is obviously men that are old, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4865.435,
    "end": 4868.316,
    "text": "As I mentioned, it's not an old quality that happens to be men.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4868.857,
    "end": 4870.217,
    "text": "So that's a noun phrase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4870.818,
    "end": 4875.26,
    "text": "When you get to old men walk, you relabel the object and it's no longer a noun phrase, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4875.5,
    "end": 4877.041,
    "text": "You have to recategorize the syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4877.961,
    "end": 4878.701,
    "text": "It's not a verb phrase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4878.922,
    "end": 4880.242,
    "text": "It's old men doing something.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4880.282,
    "end": 4881.243,
    "text": "It's an event structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4882.27,
    "end": 4893.239,
    "text": " So things like event structures and quantification structures and all the rest of it, they involve very specific, unique semantics that are informed and provided by and configured by the syntactic category.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4894.059,
    "end": 4896.821,
    "text": "So that's why I mentioned that there's no escape from syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4896.882,
    "end": 4899.103,
    "text": "The syntactic category feeds the semantic information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4900.064,
    "end": 4906.969,
    "text": "OK, so when you get to the third-word walk, the superordinate delta theta code maintains the categorical identity of the object.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4907.51,
    "end": 4908.791,
    "text": "In this case, the negotiation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4909.284,
    "end": 4913.728,
    "text": " between a multi-unit noun phrase and a more complex verb phrase hosting old men.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4915.009,
    "end": 4920.254,
    "text": "So during the same period, the lexical memory code, again, if you remember, the lexical memory code is the theta gamma.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4920.895,
    "end": 4926.039,
    "text": "The lexical memory code increases its number of theta nested chunks due to the occurrence of walk, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4926.319,
    "end": 4935.288,
    "text": "So old men walk is, in terms of the theta gamma code, all the theta gamma code sees is another word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4936.172,
    "end": 4939.254,
    "text": " When you get to walk, all the Theta Gamma Code sees is a third word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4939.695,
    "end": 4939.955,
    "text": "That's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4940.015,
    "end": 4942.577,
    "text": "It just sees, okay, another word's coming, another word, another word.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4943.017,
    "end": 4948.381,
    "text": "And it just simply chunks those features together using the feature clocking mechanism that I mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4950.783,
    "end": 4952.724,
    "text": "But that's not what the Delta Complex sees, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4952.744,
    "end": 4953.485,
    "text": "That sees something else.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4954.345,
    "end": 4957.928,
    "text": "So the superordinate Delta Theta Code maintains the identity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4961.106,
    "end": 4966.468,
    "text": " And in this case, the negotiation between a multi-unit non-phrase and a more complex phrase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4966.908,
    "end": 4971.989,
    "text": "During the same period, the initial lexical memory code increases the number of peter-nested trunks due to thickness of walk.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4972.309,
    "end": 4978.291,
    "text": "The same transition occurs from walk and slowly, with the exception that while the lexical memory code still increases in complex strength,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 4979.271,
    "end": 5001.32,
    "text": " and that's the measurement of pack relations between the future and gamma right high pack relations the hierarchical memory code would decrease closer to but not identical its pre-read baseline due to the um adjunction relation not demanding a revision of the hierarchical memory representation so what the hell does that mean um so when you get to old man walk you change the uh syntactic",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5002.22,
    "end": 5019.442,
    "text": " um category it's a verb phrase so that that involves a activity at the delta theta level when you get old men walk slowly the word slowly does not change the syntax the words it's still a verb phrase so old men walk slowly is a verb phrase",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5020.33,
    "end": 5022.751,
    "text": " Old men walk is also a verb phrase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5023.392,
    "end": 5026.473,
    "text": "So slowly changes the lexical semantic information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5026.813,
    "end": 5029.615,
    "text": "So you keep getting that theta gamma pack increase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5030.475,
    "end": 5032.836,
    "text": "But you get either a steady state or a decrease.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5032.896,
    "end": 5037.358,
    "text": "Again, I predict the decrease of the delta theta pack relationship.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5037.839,
    "end": 5040.78,
    "text": "Because all you're doing is maintaining the same syntactic identity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5040.8,
    "end": 5041.86,
    "text": "You don't need to change syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5041.981,
    "end": 5042.881,
    "text": "Same syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5043.341,
    "end": 5046.183,
    "text": "Again, I talked about syntax feeding semantics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5046.943,
    "end": 5047.943,
    "text": "If you think about it for a second,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5050.046,
    "end": 5054.688,
    "text": " Old men walk slowly is still involves old men.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5055.848,
    "end": 5062.251,
    "text": "It could be old men walk quickly, old men walk, you know, lethargically, whatever.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5062.931,
    "end": 5063.771,
    "text": "It's still the same thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5064.012,
    "end": 5069.494,
    "text": "So the fact that old men walk slowly doesn't change the fact that it's still old men.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5070.194,
    "end": 5074.476,
    "text": "Whereas with old men walk, that does change the fact about old men.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5074.496,
    "end": 5077.257,
    "text": "So when we get to old men, we have certain facts we know about old men.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5077.912,
    "end": 5080.173,
    "text": " When we get to all men walk, that changes things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5080.693,
    "end": 5081.913,
    "text": "We know that it's all men walking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5082.353,
    "end": 5085.454,
    "text": "When we get to all men walk slowly, that's a modificational structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5085.514,
    "end": 5086.274,
    "text": "It's called an adjunct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5087.335,
    "end": 5093.497,
    "text": "The adjunct structure or adverb or prepositional phrase, anything like that, simply adjoins.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5095.322,
    "end": 5098.185,
    "text": " So that only involves basic set formation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5098.505,
    "end": 5102.749,
    "text": "It doesn't involve a relabeling of the category itself because the category is still the same.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5104.29,
    "end": 5108.714,
    "text": "So this gets into some theoretical syntax ideas that are not important here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5109.095,
    "end": 5115.601,
    "text": "But the basic idea is that you just get an enhancement of lexical semantic information, but the syntax is identical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5116.041,
    "end": 5119.184,
    "text": "So that's why you get this kind of wave of old men walk and then slowly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5119.625,
    "end": 5122.327,
    "text": " And this is, you know, I mentioned some of the delta peaks before.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5122.827,
    "end": 5140.618,
    "text": "This kind of stimuli, old men walk slowly, is what has allowed researchers to figure out that you get those low frequency peaks at the third word, old men walk slowly, because that's the period where you really change the syntax and it turns it into, you know, a kind of sentence, I guess, a kind of full sentential structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5142.236,
    "end": 5146.839,
    "text": " with a propositional identity, you know, truth evaluability.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5146.959,
    "end": 5148.22,
    "text": "It can be true, it can be false.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5149.02,
    "end": 5152.822,
    "text": "You can afford all sorts of different epistemic judgments to it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5153.903,
    "end": 5160.867,
    "text": "That's the whole kind of, you know, you kind of get a whole complex of instructions being sent to conceptual systems at that stage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5162.734,
    "end": 5172.9,
    "text": " Okay, so the transfer of relevant lexical information from categorization or labeling that I mentioned would take place via interactions between these two neural codes, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5172.94,
    "end": 5174.721,
    "text": "So separable codes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5175.221,
    "end": 5186.007,
    "text": "I speculate here potentially via theta-theta phase-phase coupling or phase locking of the theta-gamma workspace and the delta-theta workspace.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5187.047,
    "end": 5200.29,
    "text": " Theta-driven dynamics effectively constitute the handoff of information after lexicality has been established by lower-level R and O processes, transitioning from encoding lexical memory to multi-object memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5201.25,
    "end": 5211.912,
    "text": "Direct testing of these dynamics specifically with respect to syntactic workspace construction has currently not been undertaken, although much work has been carried out demonstrating increased theta-gamma coupling in human hippocampus",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5212.372,
    "end": 5223.682,
    "text": " during main formation, as well as enhanced frontal theta to posterior gamma coupling, alongside the recent discovery of a rapid neocortical theta network mechanism for flexible information encoding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5225.131,
    "end": 5231.252,
    "text": " And familiar operations from left corner minimalist grammars can be appropriately parcelated onto these R, O, and S levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5231.272,
    "end": 5235.273,
    "text": "That's a bunch of jargon, but the linguists will appreciate what I'm talking about there, I hope.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5236.193,
    "end": 5244.095,
    "text": "But future work should still, you know, treat this issue of precise parsing models with more care and tact than I have demonstrated here in this initial architectural proposal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5244.535,
    "end": 5250.156,
    "text": "So what I'm trying to say there is that, you know, I mentioned Mars computational, implementational, and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5251.791,
    "end": 5252.853,
    "text": " algorithmic level in the middle.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5253.413,
    "end": 5255.716,
    "text": "I've talked a lot about computation and implementation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5256.036,
    "end": 5267.449,
    "text": "I've only spoken a little about the algorithm, the thing connecting the wetware, the kind of biological stuff you can touch and see with the kind of more abstract algorithm in between the computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5268.39,
    "end": 5270.833,
    "text": " And that's the domain of what's called psycholinguistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5271.253,
    "end": 5276.499,
    "text": "So the field of psycholinguistics has a bunch of different parsing architectures for how humans parse sentences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5276.899,
    "end": 5277.86,
    "text": "There's rival models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5278.661,
    "end": 5285.228,
    "text": "Lots of them have different predictions for how human beings parse different types of weird sentences in real time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5286.329,
    "end": 5287.951,
    "text": "I have my own favorite candidate.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5288.191,
    "end": 5289.853,
    "text": "I've mentioned left corner minimalist parsers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5290.613,
    "end": 5291.194,
    "text": "That's kind of my own.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5292.214,
    "end": 5295.997,
    "text": " you know, favourite account for all sorts of empirical and theoretical reasons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5297.017,
    "end": 5297.818,
    "text": "But it's an open question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5297.858,
    "end": 5305.363,
    "text": "And in fact, later, I kind of discuss the possibility that different parts of the brain might implement slightly different parsing models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5306.323,
    "end": 5310.046,
    "text": "So, you know, the posterior temporal cortex might be a good place to find the minimalist grammar.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5310.683,
    "end": 5318.048,
    "text": " But the inferior parietal cortex or the inferior frontal gyrus might be an excellent place to find a different kind of passing model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5318.528,
    "end": 5322.111,
    "text": "And I cite a bunch of examples in the paper somewhere in here, I think.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5322.571,
    "end": 5324.092,
    "text": "But that's, again, a bit of a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5325.073,
    "end": 5330.136,
    "text": "But it's also kind of a more I think it's a more pluralistic way of kind of viewing language in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5330.156,
    "end": 5336.521,
    "text": "You know, it's not just like, you know, minimalist passing grammars explain everything and the entire brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5337.131,
    "end": 5361.433,
    "text": " is you know uh in in concordance with the predictions of minimalist grammars it might be a kind of more uh a different kind of constellation of of passes that we need um but still nevertheless with the basic primitive uh you know computational architecture being uh inflected by moments of merge and labeling and kind of more traditional basic assumptions from general grammar okay",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5364.772,
    "end": 5377.317,
    "text": " This period just turns a little bit more towards travelling waves and a little bit more to do with fMRI research, kind of building the paper more to what we already know from the extracranial world.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5379.621,
    "end": 5385.504,
    "text": " This section talks about syntactic memory as being phase synchronization over successive cycles.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5385.884,
    "end": 5407.072,
    "text": "So this invokes a bunch of interesting work and consults some models from the world of the neurobiology of oscillations more generally in terms of phase dynamics and cross-referencing coupling and all the rest of it, just to kind of situate what the model might look like in a more kind of mathematically rigorous feature space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5408.622,
    "end": 5422.33,
    "text": " The section on symbolic computation turns a little bit more to what we already know about... In fact, I think I should review this very quickly because this again comes back to the issue of domain in general.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5423.011,
    "end": 5428.594,
    "text": "So, vision directions and the neurobiology of navigation and memory are relevant to the conception of E.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5430.96,
    "end": 5436.684,
    "text": " So hippocampal cortical sequence replay and encoding is not constrained to simply repeat past experience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5437.405,
    "end": 5444.97,
    "text": "Rather, this process is informed by an internal model of the world, generating representations of inferred entities, not necessarily encountered physically.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5445.29,
    "end": 5457.999,
    "text": "Again, this is one of the reasons why I work with people like Carl Friston, because I think this whole notion of building a gendered model of one's environment, the interplay of action and perception cycles and so on, that's really a fundamental negotiating",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5459.685,
    "end": 5464.049,
    "text": " a building block of what language gives us, of what the role of language really is in the human mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5464.109,
    "end": 5468.934,
    "text": "It's really about interplaying these two different divides of the human brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5469.855,
    "end": 5476.361,
    "text": "So this active generative capacity motivates the authors to propose that replay in the brain instantiates a form of compositional computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5477.625,
    "end": 5489.569,
    "text": " So a given replay sequence constitutes a set of entities strung together into a compound, whereby each entity is bound to a representation of its compound role, determining its function as part of a whole.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5490.25,
    "end": 5497.693,
    "text": "This establishes a clear separation with respect to composability between entity and role, or what's called syntax and semantics, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5497.733,
    "end": 5498.493,
    "text": "The entity and the role.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5499.198,
    "end": 5514.503,
    "text": " So while roles encoded by hippocampal-cortical interactions can certainly be spatial, they can also be non-spatial, and even non-spatial and non-Euclidean, potentially involving arbitrary roles such as a verb, or what we would call a verb, some kind of event anchor.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5515.888,
    "end": 5521.691,
    "text": " So the entity role bindings currently explored empirically in humans are limited to things like which position and which sequence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5522.152,
    "end": 5532.378,
    "text": "But if other roles like if, then, else can be encoded in a similar way, then replay may form a viable candidate for a neurophysiological mechanism implementing symbolic computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5533.174,
    "end": 5548.144,
    "text": " So this compositional nature of replay is implemented via our friend data-gamma coupling, mirroring closely the present assumptions of lexical feature sequencing and basic semantic compositionality being implemented via the same dynamics and high gamma activity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5548.404,
    "end": 5553.508,
    "text": "And there's a nice paper recently by Nina Kazanina and David Popel that explore very similar notions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5553.768,
    "end": 5560.433,
    "text": "They kind of argue that a lot of the neural mechanisms already known to be found in hippocampus could be used",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5561.522,
    "end": 5564.024,
    "text": " for symbolic language of thought in language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5564.864,
    "end": 5567.206,
    "text": "Language of thought meaning the kind of classical Fedorian notion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5568.226,
    "end": 5586.298,
    "text": "So a lot of what's already known outside of language about the neurobiological infrastructure, things like navigation, could be utilized and exploited by the language system in order to achieve its goals of composable functions, compositionality, and basic structure building.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5586.818,
    "end": 5589.221,
    "text": " So that's, again, once again, it's an empirical question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5589.561,
    "end": 5590.742,
    "text": "These are all empirical questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5591.003,
    "end": 5599.872,
    "text": "But I think the purpose of this paper, which is a purely theoretical paper, is to kind of negotiate through this terrain and see which candidates are more feasible, more likely, etc.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5599.932,
    "end": 5606.558,
    "text": "And I think this candidate in particular, I'm not the only one who thinks this, is a very viable candidate for grounding some of the initial",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5607.751,
    "end": 5609.732,
    "text": " Again, the stress is, for me, it's initial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5610.173,
    "end": 5616.937,
    "text": "It's just that initial phase of the early phase of merge, the basic set formation process, the theta gamma stage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5617.717,
    "end": 5626.923,
    "text": "Potentially not the human-specific structure building stuff that I mentioned earlier to do with the structural inferences that involve other mechanisms that I mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5627.344,
    "end": 5637.07,
    "text": "But at least in some aspects of language, lexical search, lexical access, morphologically complex word binding and so on, it's likely that these things are potentially used as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5638.965,
    "end": 5640.306,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5640.746,
    "end": 5648.068,
    "text": "And then in terms of... So memory transfer, this is an important concept that's been raised recently by Brinkert et al.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5648.649,
    "end": 5649.349,
    "text": "and L. Miller.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5649.409,
    "end": 5664.815,
    "text": "This section just very briefly reviews how we might transfer memories across the cortex, which kind of might look a little bit like transferring syntactic structures into a workspace or transferring stored lexical items into a separate kind of consolidation or monitoring workspace.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5665.695,
    "end": 5690.926,
    "text": " um there's some kind of potential for for research in this domain and then turning to alpha beta dynamics this is an interesting topic and that i mentioned briefly earlier to do with how the you know the the the role of these oscillations that are outside the main code space that i've already mentioned right i've already mentioned i've delimited my code space what about the uh the world of alpha and beta i've mentioned it briefly but it's a it's kind of a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5691.693,
    "end": 5694.155,
    "text": " by an important role, given that they are quite dominant.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5694.175,
    "end": 5699.618,
    "text": "They're very prominently found in intracranial and extracranial research into language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5700.359,
    "end": 5709.485,
    "text": "So just focusing on syntactic memory, there's a recent paper, Geric et al., which supports a role for beta in syntactic identity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5710.205,
    "end": 5715.207,
    "text": " just being sensitive to the identity of a sentence, the type of category that you afford it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5716.007,
    "end": 5726.512,
    "text": "These authors investigated speech memory representations using intracranial recordings in the left parasympathetic cortex during delayed sentence reproduction in patients undergoing awake tumor surgery.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5727.372,
    "end": 5728.793,
    "text": "Based on the memory performance of patients,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5729.192,
    "end": 5734.015,
    "text": " they found that the phase of frontotemporal beta represents sentence identity in working memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5734.955,
    "end": 5743.2,
    "text": "The notion of sentential identity presupposes a labeled or categorized structure, like a verb phrase, seemingly represented partially by frontotemporal beta.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5744.403,
    "end": 5754.489,
    "text": " And converging with other literature, beta may represent aspects of the global cognitive set going beyond syntax specific information to include conceptual and statistical information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5754.869,
    "end": 5761.313,
    "text": "Again, I mentioned the role of beta in syntactic anticipation, syntactic prediction, the kind of statistics of language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5761.553,
    "end": 5763.574,
    "text": "And I think that has an important role to play here again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5766.385,
    "end": 5775.148,
    "text": " Intercranial recordings by yours truly of auditory language comprehension also implicate frontal alpha and beta power in phrase prediction and anticipation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5775.188,
    "end": 5779.249,
    "text": "They kind of mark the moment of potential anticipation of a licensed phrase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5780.25,
    "end": 5788.813,
    "text": "Another paper found that both theta and gamma are sensitive to syllable rate, but only beta power is modulated by comprehension rates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5789.513,
    "end": 5792.894,
    "text": "So comprehension obviously implies semantics and syntax rather than just syllables.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5795.226,
    "end": 5807.374,
    "text": " And over the past decade, in fact, a little bit longer than that, over the past 15 years or so, there's been a debate about whether beta power effects during sentence comprehension reflect syntactic computations or instead reflect maintenance or set updating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5808.36,
    "end": 5814.664,
    "text": " And to briefly summarize the most current results, it appears that the latter maintenance hypothesis is most well supported.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5815.704,
    "end": 5818.606,
    "text": "So I'm therefore going to put further discussion of this to one side.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5819.386,
    "end": 5834.175,
    "text": "But the basic role of it in maintenance in terms of just continuing, aiding with the assisting in some way of maintaining the set of generated and sustained cognitive representations, not necessarily being sensitive to the properties",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5834.995,
    "end": 5861.189,
    "text": " of this set not being sensitive to the particular syntactic identity or the category of the syntax or even the category of the semantics or the features of the semantics but at least being involved in coordinating neural resources available neural resources to help with the sustaining of that memory in work in in a current space again this is very domain general not specific to language which is why i think it's you know you don't you find fewer of the um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5862.029,
    "end": 5883.97,
    "text": " language specific syntax semantics sensitivities and even though it's involving comprehension as i mentioned comprehension means everything it's just like you know processing a sentence means loads of things it doesn't mean specifically syntax specifically language specific stuff it just means you know when you when you when you process a sentence you do all sorts of things and so i think it's most likely that it's involved in these kind of more domain general maintenance processes",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5885.512,
    "end": 5890.257,
    "text": " And then in parietal cortex, alpha enhancement seems to index syntactic working memory demands.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5891.298,
    "end": 5900.388,
    "text": "Much like the regulation of gamma by alpha in control and attention mechanisms that I mentioned earlier, parietal cortex may play an important role in memory and complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5900.948,
    "end": 5915.176,
    "text": " such that low frequency rhythms originating in lateral or medial parietal cortex regulate the activity of gamma-encoded operations in lateral temporal cortex, and single-unit or assembly-encoded are in medial temporal or inferior temporal cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5915.196,
    "end": 5916.876,
    "text": "That's a more kind of specific proposal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5918.557,
    "end": 5924.4,
    "text": "And another likely site of syntactic working memory is in Perifontosulcus, for reasons cited in this paragraph.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5924.921,
    "end": 5928.883,
    "text": "It's very heavily involved in all sorts of interesting semantic integration processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5929.856,
    "end": 5938.88,
    "text": " And then, yes, as I mentioned, the kind of bringing this model to a kind of conclusion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5939.3,
    "end": 5943.202,
    "text": "These assumptions take place all within the context of the of the traveling wave framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5943.682,
    "end": 5949.645,
    "text": "So lower frequencies migrating across the cortex, particularly being relevant to cases of maintenance and storage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5950.185,
    "end": 5955.007,
    "text": "So traditional standing waves lead to periods when all neurons in the network are turned off.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5956.004,
    "end": 5966.972,
    "text": " Whereas traveling waves can ensure that sub-portions of a network remain consistently active, directly compatible with the mosaic-like architecture of posterior temporal cortex in semantic integration.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5967.012,
    "end": 5981.243,
    "text": "I won't explain that further, but it's basically the idea that within these small regions of cortex, like posterior temporal cortex, there's a very interesting patchwork of activity of little satellites of sensitivity to different aspects of language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5981.563,
    "end": 5983.445,
    "text": "Even though they're all generally sensitive to language,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5984.165,
    "end": 6005.53,
    "text": " And within them, there's kind of more specialised regions, which is not unlike what you find in ventral temporal cortex for things like face and place and other kinds of shape perception, kind of ventral visual occipital cortex being having a kind of tapestry of, you know, cellular, cell specific sensitivity to different representational features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6008.652,
    "end": 6013.056,
    "text": " So where exactly the waves travel to during phrase composition is, again, my favorite phrase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6013.257,
    "end": 6017.541,
    "text": "This is purely an empirical question, but some candidate regions have been suggested above, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6017.601,
    "end": 6019.363,
    "text": "That's kind of where we stand at the moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6019.403,
    "end": 6022.366,
    "text": "That's where the field is at the very moment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6022.626,
    "end": 6025.189,
    "text": "So figure three here is the basic processes of the ROSE model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6027.014,
    "end": 6033.116,
    "text": " This kind of just gives a general outline of how ROSE is hypothesized to be implemented across the frontotemporal language network.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6034.056,
    "end": 6039.678,
    "text": "And at the bottom, there's a representation of the various frequency interactions proposed to implement phrase flexibility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6040.198,
    "end": 6044.48,
    "text": "So you have representations, category-specific information being encoded in spikes,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6045.725,
    "end": 6047.846,
    "text": " with operations, you have broadband gamma activity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6048.587,
    "end": 6054.21,
    "text": "Initially, I hypothesized in PSTS based on the intracranial work that we've done, but it could be anywhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6054.25,
    "end": 6061.954,
    "text": "It could be in PM2G, but also be in portions of IFG, depending on the category potentially of the phrase, the type of structure you're generating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6062.074,
    "end": 6063.555,
    "text": "That's an open question, very much open.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6065.576,
    "end": 6069.218,
    "text": "In terms of structure, we have the low frequency neural program driven by a temporal cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6069.738,
    "end": 6072.94,
    "text": "And then for encoding, we have these traveling waves that spatially migrate structure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6074.329,
    "end": 6096.245,
    "text": " So I also think that given what we know about the speed of travelling waves, I think it's possible that a lot of this stuff transfers up either via dorsal or ventral pathways across posterior to anterior temporal cortex and from posterior to anterior frontal cortex, given the timescales of sensitivity that we know exist there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6099.309,
    "end": 6117.296,
    "text": " Okay, this final section of the paper talks about causal evidence, which is increasingly becoming very important these days in neuroscience as we've exhaustively mapped correlational activity of loads of different linguistic processes, but we haven't really got a good sense of which parts of the brain are actually essential for language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6117.856,
    "end": 6132.046,
    "text": " So when you get regions X, Y, and Z being activated, region X might be causally involved, whereas regions Y and Z might just be activated or recruited or implicated, but not actually essential for the function.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6133.527,
    "end": 6146.991,
    "text": " So this section just kind of charts out some of the ways of exploring that empirically through cortical stimulation mapping in the OR or in the AMU using TMS, for example, or joint TMS MEG studies.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6147.211,
    "end": 6148.331,
    "text": "That's a possibility.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6148.691,
    "end": 6154.813,
    "text": "There's all sorts of ways you can think of kind of providing different portions of causal evidence for these models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6155.573,
    "end": 6167.872,
    "text": " And these paragraphs here just kind of just review mostly non linguistic, but also some language research into how people have used these methods to disrupt language in particular parts of the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6170.038,
    "end": 6196.717,
    "text": " some more interesting research disrupting particular phase codes and trying to particularly trying to modulate either a hypo or hyper excite and particular osteo dynamics or pack dynamics in different parts of the brain now that's a really good way to directly test the causal involvement of a phase code more generally because if you can hyper excite a theta rhythm or hyper excited gamma rhythm then that can really screw up your potential your facilitation of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6197.117,
    "end": 6211.544,
    "text": " the coordination of these electrical features and your attention and working memory and all the rest of it so that's a great way to kind of causally test um not just a brain region's involvement but also a particular brick like how a brain region is involved okay",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6213.871,
    "end": 6215.472,
    "text": " This section is much more philosophical.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6217.133,
    "end": 6221.375,
    "text": "If you guys play Elden Ring, you might get the reference in this section.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6222.796,
    "end": 6235.122,
    "text": "But the point of this section is to kind of evaluate the ROSE model, to kind of situate it in a large context to relate it to existing models in the intercranial space and extracranial space too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6238.486,
    "end": 6241.667,
    "text": " So some of the important periods in this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6242.748,
    "end": 6248.79,
    "text": "So I've already mentioned this paragraph, I think, to do with how different parts of the brain might be sensitive to different parses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6248.81,
    "end": 6250.73,
    "text": "So I'll skip that bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6251.051,
    "end": 6266.196,
    "text": "This paragraph here just outlines how the very basic philosophy in Rose is that mesoscale neural organization can be useful for brain function and that high frequency gamma oscillations report mechanisms and underlying communication channels of neural computation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6267.745,
    "end": 6276.713,
    "text": " So neural oscillations organize cortical activity to produce computation, and ROSE builds an architecture for syntax that presupposes this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6277.474,
    "end": 6285.781,
    "text": "Some exciting prospects for testing ROSE come in the form of multi-channel recordings with broad cortical access using binary microelectrode arrays, et cetera, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6286.581,
    "end": 6290.085,
    "text": "And I just cite some more technical examples there for people in the field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6294.269,
    "end": 6296.35,
    "text": " And then let's see, what else do we have here?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6298.792,
    "end": 6300.593,
    "text": "Yeah, I've already mentioned the inside out outside it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6300.693,
    "end": 6301.714,
    "text": "Well, actually, I haven't mentioned that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6301.834,
    "end": 6302.875,
    "text": "I've mentioned Mars framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6303.775,
    "end": 6313.522,
    "text": "But just very briefly, I think my model is incompatible with a bunch of recent ideas to do with encouraging people to explore the brain from inside out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6314.142,
    "end": 6320.507,
    "text": "So I'll just read this paragraph and then maybe try and digest it a little bit because it's probably the most important philosophical kind of grounding here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6322.85,
    "end": 6327.072,
    "text": " So brain models informed by computational concerns will continue to be needed in neurosciences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6327.172,
    "end": 6327.833,
    "text": "Yes, that is true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6328.313,
    "end": 6332.035,
    "text": "In particular, as we approach the advent of widespread availability of single unit recordings.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6332.435,
    "end": 6346.623,
    "text": "And again, one of the anxieties I have with this paper is that as linguists get their hands on sophisticated neural recording measures, we really need to be careful and quite conservative in knowing what we can say with each of these measures.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6347.243,
    "end": 6352.066,
    "text": "So if you give every linguist on the planet access to single unit recordings in the human brain,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6353.496,
    "end": 6372.815,
    "text": " You're going to get a lot of papers making claims about, as I satirize here, Neo-Davidsonian existential closure neurons or specific, very niche kind of cellular types responsible for all sorts of baroque and complicated and not very cognitively plausible linguistic constructs.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6373.456,
    "end": 6401.707,
    "text": " so i really wanted to in this paper boil it down you know decompose language into its primitive components decompose at the computational level and decompose at the representational level that kind of goes back to the 1980s kind of classical framework of the computational representation of theory of mind where you have a series of fixed representations units and fixed computations or things that you can do with those units this kind of actions and objects right that's a basic metaphysical human distinction between things and processes actions",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6402.568,
    "end": 6407.084,
    "text": " objects and all the rest of it, nouns and verbs, computations, representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6408.606,
    "end": 6431.818,
    "text": " So I really wanted to make it clear that next time you find yourself with access to a single unit dataset, you need to have sufficiently decomposed these levels to make it neurochemically and neurobiologically plausible, rather than talking about the more highfalutin stuff that I mentioned earlier.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6433.599,
    "end": 6456.398,
    "text": " so it's kind of more it's more of a cautionary tale i guess um because i you know other fields have gone through this before right um so for example um you know grid cells right it's it's over the last decade grid cells in um internal and paracamber cortex were initially implicated in um spatial navigation then it turns out they're involved in auditory navigation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6456.918,
    "end": 6482.952,
    "text": " and then they're involved in conceptual navigation it so in other words they end up just being involved in navigation full stop just all types of navigation and and i think a similar kind of transition might happen with when we get um an increasing number of publications about language in single units you'll get a lot of people initially saying oh well you know these these units these specific cell types are involved in x then it turns out they're also involved in y and z and will ultimately end up being",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6483.652,
    "end": 6494.743,
    "text": " forced to propose a more generic account for these things, which is why in my paper I try and focus it, I try and appeal to as much generosity as I can.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6495.363,
    "end": 6502.71,
    "text": "There's always going to be some domain specificity because obviously language has domain specific representations and apparently domain specific computations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6503.011,
    "end": 6506.074,
    "text": "So we will need some notion of domain specificity on some level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6506.414,
    "end": 6508.216,
    "text": "But the only question is like, where are you going to find that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6509.474,
    "end": 6511.736,
    "text": " Okay, I'm rambling a little bit, so I'll just, I'll continue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6512.657,
    "end": 6515.219,
    "text": "So this outside-in perspective has been critiqued recently.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6515.98,
    "end": 6528.25,
    "text": "Djordje Brzezaki advocates for an insider perspective on building neural models of cognition and considers the classical Maurean framework a purely outside-in perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6528.79,
    "end": 6534.595,
    "text": "Yet Maure himself stressed that the three levels should be investigated in parallel, not necessarily prioritizing any given level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6535.416,
    "end": 6536.658,
    "text": " So this is a balancing act though, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6537.419,
    "end": 6541.083,
    "text": "Too much outside in, and you're going to get these Neo-Davidsonian neurons.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6541.664,
    "end": 6547.19,
    "text": "Too much inside out, and you're going to be told that linguistics departments need to shut down, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6548.194,
    "end": 6556.183,
    "text": " So regardless of your own philosophical bent, I think single unit and other types of intercranial recordings are plainly the most direct and reliable means to further test and refine rows.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6556.724,
    "end": 6560.328,
    "text": "In particular, given recent independent assessments and critiques of bold activity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6560.648,
    "end": 6567.596,
    "text": "But the basic message here is that a purely insider perspective is when people will say, well,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6568.177,
    "end": 6578.648,
    "text": " what's called data-driven neuroscience, where you say, well, let's just do a bunch of sophisticated statistical analyses on our single unit data and see what kind of emerges.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6579.109,
    "end": 6586.396,
    "text": "Let's just hope that language will just arise somehow without any ideological presuppositions or any kind of biases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6586.997,
    "end": 6591.179,
    "text": " First of all, it's impossible, I think, for any human being to do that, even if they tell themselves they're doing it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6591.439,
    "end": 6593.74,
    "text": "You're always going to be delivering some biases.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6594.0,
    "end": 6598.561,
    "text": "You're always going to be bringing some philosophy of science or philosophy of mind to the table, whether or not you like it or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6599.562,
    "end": 6602.723,
    "text": "On the other hand, you have the completely outside-in perspective.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6603.851,
    "end": 6605.271,
    "text": " which I'm also very much against.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6605.692,
    "end": 6611.573,
    "text": "So the outside in perspective would say, let's, you know, everything that linguists say is Bible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6613.093,
    "end": 6619.135,
    "text": "All these theories of double rates movement and pipe piping and all the rest of it, they are literally what the brain cares about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6619.455,
    "end": 6621.216,
    "text": "And we have to find that in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6621.696,
    "end": 6629.238,
    "text": "We have to keep our fixed theories of higher order cognition and just look at the brain and expect the brain to care about everything we care about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6629.978,
    "end": 6634.1,
    "text": " We expect the brain to be sensitive to all the stuff that we as linguists care about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6635.34,
    "end": 6639.081,
    "text": "And the problem with science is that, you know, there's always a negotiation going on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6639.161,
    "end": 6642.103,
    "text": "There's always a kind of deal that needs to be made.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6642.963,
    "end": 6646.584,
    "text": "So, you know, one of our former presidents talked about the art of the deal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6647.104,
    "end": 6656.948,
    "text": "In this case, the art of the deal in this case is figuring out how much linguistics you need to hold on to and stay true to and how much you need to let go off.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6657.472,
    "end": 6659.498,
    "text": " and how much you need to say, the brain doesn't care about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6660.56,
    "end": 6662.265,
    "text": "It only cares about this, but not that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6663.508,
    "end": 6665.313,
    "text": "So my own feeling is that the brain, excuse me,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6666.349,
    "end": 6690.137,
    "text": " brain does genuinely care about some aspects of language domain specific or otherwise namely the representational feature types and also this business of marriage and labeling that i mentioned the basic computations i think the brain does genuinely care about that it probably doesn't care about all the other stuff that linguists talk about and but it can be characterized at some kind of more epiphenomenal level i guess as some kind of emerging phenomenon we can talk about the philosophical details you know in another kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6690.997,
    "end": 6691.758,
    "text": " frameworks, if you like.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6692.078,
    "end": 6694.481,
    "text": "But that's the kind of, I think, way to go about it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6694.501,
    "end": 6702.929,
    "text": "I think it's much too harsh and arrogant to just completely abandon all of the insights of contemporary linguistics just because we have sophisticated neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6703.529,
    "end": 6712.819,
    "text": "I think holding on to some insights from linguistics will be essential to direct and test and refine our data-driven science too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6713.719,
    "end": 6719.683,
    "text": " So I think what Brzezaki talks about in his book is, I think, misleading and kind of a, you know, unhelpful division.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6720.103,
    "end": 6722.844,
    "text": "I think it's not, I don't like to talk about inside out or outside in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6723.124,
    "end": 6726.466,
    "text": "I think it's kind of just, you have a balancing act between both, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6726.546,
    "end": 6732.85,
    "text": "You have to just negotiate when it's appropriate to use computational levels and when it's appropriate to use implementational level theories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6734.691,
    "end": 6734.931,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6735.951,
    "end": 6737.472,
    "text": "So that takes care of that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6738.693,
    "end": 6740.354,
    "text": "I'll skip over this bit here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6743.601,
    "end": 6745.741,
    "text": " Yes, so this gets into what I mentioned.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6746.041,
    "end": 6757.183,
    "text": "I mentioned this maybe a little bit briefly, but it's very common to object to these kinds of proposals of the kind I mentioned in Rose as a kind of crude form of direct mapping, right, or isomorphism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6757.723,
    "end": 6764.425,
    "text": "And I'm sure some people listening to me right now might think, well, you're kind of a hypocrite because you're doing exactly what you're critiquing Bersaki for doing, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6764.825,
    "end": 6772.626,
    "text": "I'm complaining that Bersaki is just, no, sorry, I'm complaining that these outside-in people are just imposing their linguistic theory on the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6773.226,
    "end": 6774.209,
    "text": " And I'm saying you shouldn't do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6774.77,
    "end": 6782.309,
    "text": "At the same time, though, the whole point of the ROSE model is to directly map on what different types of linguistic structure",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6783.368,
    "end": 6808.406,
    "text": " onto the brain so a complete nihilist or you know might say well the brain really doesn't care about any of these structures the brain really doesn't care about um atomic features lexical items feature bundles phrases uh you know sets of sets of sets and all the rest of it now that might indeed be true that's totally possible um i think it's unlikely given that the um you know um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6810.263,
    "end": 6820.028,
    "text": " the specific responses that we've seen at different levels of linguistic complexity, the kind of dissociable scales of sensitivity you can see at different neural complexity scales that I've mentioned here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6821.449,
    "end": 6831.935,
    "text": "But so, you know, the ROSE model is essentially invoking a direct mapping in some way, a kind of one-to-one correspondence between a scale of linguistic complexity X and a neural mechanism Y.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6833.035,
    "end": 6843.791,
    "text": " And you kind of, you know, you follow that all the way up until you get to the ultimate, the highest level of nesting that you get with the delta theta complex all the way down to the spike at the peak coupling that I mentioned earlier, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6845.211,
    "end": 6847.972,
    "text": " Okay, so some people might say that's a problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6849.033,
    "end": 6858.037,
    "text": "Rose continues this crude tradition by establishing an even more explicit isomorphism between system-level complexity and syntactic complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6858.477,
    "end": 6863.979,
    "text": "So, for example, cells and syntactic features versus global coherence and phrase structure on the other hand.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6864.079,
    "end": 6871.343,
    "text": "Alternative accounts that build syntactic operations into neural systems of diverging levels of structural complexity have not been forthcoming, by the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6871.983,
    "end": 6875.306,
    "text": " So if they do both come, then we can test them as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6875.586,
    "end": 6881.571,
    "text": "But we'd also naturally be required to establish any kind of adversarial collaborations and experimental testing of the models.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6881.651,
    "end": 6895.263,
    "text": "So through this, it would be possible to pick different candidate neural mechanisms for syntax against one another and compare effect sizes across studies to see which mechanism, either from ROSE or some other model, best explains real-time direct vertical effects of language processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6895.623,
    "end": 6898.065,
    "text": "So that's a nice way to directly test the ROSE model.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6898.365,
    "end": 6899.667,
    "text": "But I also want to emphasize here that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6900.703,
    "end": 6919.298,
    "text": " As far as I know, the ROSE model is the only non-neurobiological model of syntax that takes seriously this whole notion of the fact that the brain genuinely exhibits distinct levels of neural complexity organization and scales of complexity, and also takes seriously the fact that not all neural recording measures just measure the same thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6920.999,
    "end": 6926.022,
    "text": " single units up to UTARs, up to SEGs, up to ECOG, up to MEG, up to Scalp EEG.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6926.843,
    "end": 6930.005,
    "text": "These are very different beasts and they record very different things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6930.205,
    "end": 6943.294,
    "text": "It's easy and convenient and maybe comforting just to say, well, the kind of signal that we see in Scalp ERP responses and Delta waves are probably just some kind of summated phase reset of whatever's going on at the spike level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6944.074,
    "end": 6945.936,
    "text": "On some level of description, that's true.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6947.096,
    "end": 6951.037,
    "text": " However, it doesn't help with building a model of syntax in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6951.377,
    "end": 6952.377,
    "text": "That's just kind of dismissal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6952.817,
    "end": 6956.958,
    "text": "So my appeal here is to kind of ground it more concretely in different levels of analysis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6957.658,
    "end": 6965.999,
    "text": "And so far, you know, all the other models of syntax in the brain, as I've said, are localizationist as opposed to kind of algorithmic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6966.319,
    "end": 6972.381,
    "text": "That's why the subtitle of this paper is a neurocomputational architecture, because it's a neurocomputational architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6972.741,
    "end": 6974.101,
    "text": "And it is very much an architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6974.741,
    "end": 6980.7,
    "text": " There's within the Rose architecture, you can imagine three or four or five very different specific theories.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6982.127,
    "end": 6983.509,
    "text": " or models from the architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6984.089,
    "end": 6986.431,
    "text": "So, you know, it's very much an architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6986.491,
    "end": 6990.574,
    "text": "And within this paper, I propose my own specific theories at each level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6991.115,
    "end": 6999.722,
    "text": "But the scale of the architecture scaling from the spike of peak coupling up to pack up to traveling waves, that's the architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7000.422,
    "end": 7007.928,
    "text": "But so within the architecture, you could maybe reframe some of these things as long as the mechanistic relations between R to O to S to E are maintained.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7008.048,
    "end": 7009.57,
    "text": "That's the kind of general framework here.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7011.951,
    "end": 7022.395,
    "text": " And then going back to metaphysics for a moment, Rose is also sympathetic to recent moves in philosophy of biology to view a range of biological constructs as processes rather than objects.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7023.936,
    "end": 7032.4,
    "text": "Rose is built entirely from neurocomputational mechanisms that are already known to subserve clusters of generic perceptual and cognitive operations, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7032.44,
    "end": 7034.3,
    "text": "I'm not invoking any new neural mechanisms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7034.38,
    "end": 7035.801,
    "text": "I'm not proposing...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7036.759,
    "end": 7042.622,
    "text": " a new kind of microtubule quantum computational mechanism to explain all this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7042.942,
    "end": 7044.443,
    "text": "I'm being very, very conservative.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7044.563,
    "end": 7056.189,
    "text": "I'm just using literally stuff that's been published in the most high impact, serious scientific journals, which has been afforded textbook level treatments at every level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7056.509,
    "end": 7058.931,
    "text": "So all of these mechanisms have been given serious textbook treatment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7059.571,
    "end": 7069.617,
    "text": " The only difference here is that I'm migrating some of these concerns over to the linguistic domain with various different motivations across the levels.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7070.977,
    "end": 7071.218,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7072.218,
    "end": 7075.02,
    "text": "And then turning slightly further.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7077.955,
    "end": 7082.796,
    "text": " So, yeah, another nice point here made in the Nature Neuropaper by Nina Kazanina and Alessandro Tibano.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7083.516,
    "end": 7095.538,
    "text": "Current theories that model hierarchical structure building via low-frequency dynamics correlate some neural measure with attributes of a hierarchical syntactic structure and thus concern the outcome of syntactic structure construction.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7095.958,
    "end": 7104.7,
    "text": "So this is a critique of those MEG and EEG studies that show this low-frequency delta entrainment or peak response at moments of syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7105.987,
    "end": 7107.027,
    "text": " It's a very legitimate critique.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7107.767,
    "end": 7123.111,
    "text": "But by initiating certain syntactic structure building at the cellular R level and accounting for how these output low frequency responses at the S and E levels, the ROSE architecture goes beyond these other accounts that are more closely tied to the output of structure building.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7123.611,
    "end": 7132.253,
    "text": "So, and again, even in the ROSE architecture, this is correct that these low frequency delta peaks are indeed the output of the structure building.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7132.313,
    "end": 7132.993,
    "text": "I'm not denying that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7133.173,
    "end": 7134.033,
    "text": "I'm not saying that the input",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7134.893,
    "end": 7136.174,
    "text": " They're not some kind of intermediate response.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7136.695,
    "end": 7139.217,
    "text": "Kazanina and Tavana are completely correct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7139.357,
    "end": 7146.423,
    "text": "They do reflect some kind of readout, the final stage of the syntactic structure building process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7146.703,
    "end": 7149.585,
    "text": "Some kind of wrap-up or even monitoring stage.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7149.645,
    "end": 7153.048,
    "text": "For me, it's part of the structure to encoding phase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7153.769,
    "end": 7160.294,
    "text": "But at least the early stages of syntax at the R and O levels are definitely at this kind of spike level and high gamma activity level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7162.316,
    "end": 7162.536,
    "text": "Okay.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 7165.013,
    "end": 7190.368,
    "text": " um yes and then again open questions remain about how to ground this in more neurochemically explicit models i haven't talked much about neurochemistry uh some of my earlier papers in 2015 2016 tried to take a neurochemical framework much more seriously and i have more of a like mathematically rigorous framework into uh negotiating particular low frequency dynamics and but in this paper i'm just kind of leaning that to one side for now because the paper is already",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7190.968,
    "end": 7204.649,
    "text": " know way too long and i'm just focusing on the kind of architectural components that's something to be focused on at a later stage okay um yes yes yes okay so turning to the conclusion um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7206.635,
    "end": 7213.297,
    "text": " I've mentioned a few times that the ROSE architecture really does come in response to the absence of phase coding models in language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7213.557,
    "end": 7221.478,
    "text": "There's been a lot of phase coding responses or phase-weighted entrainment and low frequency responses empirically documented.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7221.899,
    "end": 7226.84,
    "text": "They've been empirically documented, but in terms of the actual theoretical summary, that's kind of been lacking.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7227.14,
    "end": 7228.14,
    "text": "So that's my main motivation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7228.92,
    "end": 7238.415,
    "text": " And many researchers who have kept the frameworks emerging purely from extranial MEG-derived event-related fields or scalp EEG-related potentials or fMRI responses, etc.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7238.936,
    "end": 7240.699,
    "text": "These guys have begun to lose hook.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7242.216,
    "end": 7245.758,
    "text": " they've begun to lose hope in the prospect of finding syntax in the brain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7246.278,
    "end": 7259.526,
    "text": "So, for example, Lena Pilkenen, who's probably the world's most respected neurobiologist of syntax, she's written that the neuroscience of language field has long assumed that our brains build syntactic structure during language processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7260.526,
    "end": 7262.807,
    "text": " Today, it's reasonable to question this assumption.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7263.487,
    "end": 7272.489,
    "text": "And she's totally right and motivated to say that because she's summarizing research from mostly extracranial stuff like MEG and fMRI.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7272.849,
    "end": 7276.97,
    "text": "And she's definitely right that if you just focus on that research, it seems pretty hopeless.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7277.951,
    "end": 7283.672,
    "text": "I think the lack of high spatial temporal resolution in these methods explains the absence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7284.372,
    "end": 7285.913,
    "text": "That's kind of one of the implications of this paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7286.873,
    "end": 7290.596,
    "text": " And this paper is essentially indirectly critiquing that field.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7291.096,
    "end": 7304.106,
    "text": "So Pilkenant reasonably speculates that based on the evidence reviewed in her article, something like merge might not be an obvious neural operation, or alternatively, it might not be found in presently explored neural signals.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7304.987,
    "end": 7315.075,
    "text": "In fact, she has this nice distinction between syntax as knowledge and semantics as process, where in neural recordings across all methodologies,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7316.223,
    "end": 7321.099,
    "text": " Finding signatures of semantics is very easy because semantics is very energetically costly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7322.984,
    "end": 7328.929,
    "text": " The number of words and possible concepts you can combine at any given moment is really kind of astonishing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7328.949,
    "end": 7331.311,
    "text": "The number of different feature spaces you can talk about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7331.331,
    "end": 7337.316,
    "text": "You can talk about green horses made from licorice that ride to Mars next Tuesday.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7337.657,
    "end": 7339.358,
    "text": "You can talk about all sorts of surreal stuff, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7339.678,
    "end": 7342.401,
    "text": "So semantics is very unpredictable.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7344.483,
    "end": 7348.346,
    "text": "It calls upon a wide range of cross-cortical representational features.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7349.567,
    "end": 7350.227,
    "text": "What about syntax?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7351.607,
    "end": 7355.91,
    "text": " Syntax is very different because syntax is just merge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7356.611,
    "end": 7358.152,
    "text": "That's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7358.172,
    "end": 7360.754,
    "text": "You put two things together and then you label it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7361.775,
    "end": 7362.195,
    "text": " So that's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7362.515,
    "end": 7365.257,
    "text": "There's no novelty there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7365.737,
    "end": 7369.159,
    "text": "Every time you build a phrase, you do it in the same way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7369.799,
    "end": 7378.084,
    "text": "You build a phrase architecture, you label it, you stack it into a workspace, you label that, you ship it off to an interpretation and procedure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7379.084,
    "end": 7379.404,
    "text": "That's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7380.045,
    "end": 7380.905,
    "text": "That's all of syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7381.486,
    "end": 7383.166,
    "text": "And you do it again and again and again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7384.047,
    "end": 7387.309,
    "text": "You don't have a different merge process on Tuesday as you did on Friday.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7388.188,
    "end": 7394.19,
    "text": " But semantics is, like I said, there's a big difference here between the space of semantics and the space of syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7394.23,
    "end": 7397.571,
    "text": "The space of syntax is just this merge, this one operation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7398.351,
    "end": 7408.095,
    "text": "So it's no surprise that it's been very difficult for scientists to find neural signatures of syntax, syntax specific responses.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7409.09,
    "end": 7420.464,
    "text": " Because it's like, we do it so reflexively and so trivially, and we've been doing it since infancy, maybe even before infancy, depending on which language acquisition theorist you believe in.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7420.805,
    "end": 7422.527,
    "text": "Whereas semantics, we're constantly changing it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7423.068,
    "end": 7427.813,
    "text": "It takes years and years and years for us to really build our full repertoire of developed semantics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7428.769,
    "end": 7432.252,
    "text": " with syntax, once you've built a phrase, you've built a phrase.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7432.892,
    "end": 7433.232,
    "text": "That's it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7433.272,
    "end": 7434.473,
    "text": "You've got all the syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7435.014,
    "end": 7442.739,
    "text": "The only thing that you can go beyond that is performance aspects, like how complex a sentence you can construct.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7443.0,
    "end": 7444.04,
    "text": "Can you read Shakespeare?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7444.1,
    "end": 7444.901,
    "text": "Can you read Joyce?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7445.742,
    "end": 7447.163,
    "text": "Can you read David Foster Wallace?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7447.563,
    "end": 7448.924,
    "text": "That's a very different question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7449.284,
    "end": 7450.906,
    "text": "But that's a question about performance.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7451.006,
    "end": 7455.069,
    "text": "It's a question about working memory, attention, all those sorts of things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7456.429,
    "end": 7458.73,
    "text": " The actual basic component of syntax is just merge.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7459.29,
    "end": 7463.671,
    "text": "So I think Pilkenin's right that, you know, maybe she's not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7463.691,
    "end": 7467.132,
    "text": "I don't think she's right that, you know, merge is knowledge and semantics is process.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7467.152,
    "end": 7469.633,
    "text": "I think they're both process and they're also both knowledge too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7470.653,
    "end": 7477.015,
    "text": "But in terms of why it's been difficult for people to find a signal reliably, it's because that's all there is to syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7477.455,
    "end": 7484.717,
    "text": "Whereas of semantics, you're going to get a very reliable, very serious neural energetic cost involved in processing sentences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7485.217,
    "end": 7508.689,
    "text": " so and in fact in our lab in our intracranial recordings of our epilepsy patients all the response or the most reliable responses you see are clearly with uh you know meaningful sentences as opposed to um you know semantically impoverished sentences that have a good syntax because it's just difficult to really disentangle those things um but that leads to into some some other questions that i won't get into because that's that'll take us to a different topic um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7509.429,
    "end": 7518.039,
    "text": " But so I guess what I've tried to do with this paper is that with ROSE, I think I've at least provided some candidate neural signals and they do exist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7518.059,
    "end": 7523.745,
    "text": "There's plenty of candidate neural signals, some very good ones, and you can be readily investigated in this manner.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7524.626,
    "end": 7529.248,
    "text": " So, yeah, I think that kind of settles that issue, at least for me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7530.368,
    "end": 7536.67,
    "text": "So under ROSE, there's basically no sense to be made out of claims that syntax lies in one specific brain region.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7537.03,
    "end": 7546.213,
    "text": "I talked about PSTS before being the real site of the initial phase of merge, but in order to get to structural inferences and then transferring that to a workspace, that's a global phenomenon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7546.773,
    "end": 7551.435,
    "text": " it involves most likely, you know, posterior temporal, inferior frontal coordination.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7551.796,
    "end": 7571.246,
    "text": "There's a nice paper in PNAS by Oscar Wolno, who's in our lab, a postdoc in our lab, who showed very convincingly that building a coherent sentence structure involves the coordination of overlapping, spatio-temporally overlapping, but distinct clusters in both posterior temporal and inferior frontal cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7571.846,
    "end": 7574.647,
    "text": " So it's not just, you know, IFG versus PT.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7575.167,
    "end": 7578.988,
    "text": "It's kind of like, okay, they're both involved, but to what extent?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7580.728,
    "end": 7589.49,
    "text": "Some issues are a bit tricky to discuss because you have to kind of relate this to the lesion literature, which kind of more reliably implicates posterior temporal cortex strongly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7589.83,
    "end": 7598.132,
    "text": "And for my money, if I were just to, you know, contradict myself just a little bit, I think the language region is essentially posterior superior temporal sulcus.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7598.172,
    "end": 7600.192,
    "text": "I think PSTS is basically the language region.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7600.666,
    "end": 7608.27,
    "text": " with other things coming online later due to either coupling or functional coupling and coordination with PSTS.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7608.71,
    "end": 7610.03,
    "text": "PSTS will always be involved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7610.09,
    "end": 7610.691,
    "text": "It's always the hub.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7611.171,
    "end": 7620.935,
    "text": "And there's other regions like IFG and ATL are involved and called upon for performance reasons or reasons to do with downstage readout and interpretation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7621.436,
    "end": 7624.277,
    "text": "But PSTS is the language region, for me at least.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7624.757,
    "end": 7653.992,
    "text": " um so that's kind of the seat of the rose localizationist approach at least but then the rest of the neural code spreads far beyond that as i mentioned um i only read one sentence of a paragraph before before waffling um but i think i pretty much already said that in many ways um okay and then yeah we can think about testability in all sorts of different ways too uh to do with separate out the category of the phrase versus the semantic of the phrase that's something to think about yeah and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7655.862,
    "end": 7656.202,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7656.722,
    "end": 7674.89,
    "text": "And then in terms of the general roles in shaping information processing, the currently identified frequency-specific mechanisms seem to align with an emerging consensus in the field that slow frequencies control input sampling, alpha and beta gate information flow, and high frequency activity is controlled by slower rhythms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7674.95,
    "end": 7680.492,
    "text": "That's a very general kind of neurocomputational framework that's been explored in the current neurosciences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7681.732,
    "end": 7691.517,
    "text": " And then moving beyond this, a newly emerging focus on brain criticality and how this concept might relate to brain rhythms provides exciting revenues for future work in theoretical neurolinguistics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7691.537,
    "end": 7692.518,
    "text": "So that's a cool concept too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7693.318,
    "end": 7696.26,
    "text": "And in fact, there's some really good work exploring how",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7697.443,
    "end": 7709.894,
    "text": " In some of my earlier papers, I talked about what's called globularity, which is this concept of the fact that the human brain is uniquely almost spherical relative to other primates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7709.914,
    "end": 7716.32,
    "text": "It's not completely spherical, obviously, but a lot of cognitive abnormalities come with a brain shape reorganization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7717.02,
    "end": 7718.882,
    "text": "And the fact that the human brain is kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7719.835,
    "end": 7741.588,
    "text": " more globular than our ancestors has been used to motivate a lot by a lot of serious um anthropologists and also neurobiologists uh this idea that the human brain is kind of uniquely uh efficiently wired in some way to facilitate a cross cortical and also subcortical cortical um information integration and so i think there's something to be said there to do with um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7742.569,
    "end": 7768.738,
    "text": " know an evolutionary change in brain shape globular brain shape would have naturally facilitated different paths for these traveling waves to move across right and different patches of cortex can communicate with each other and in fact we know from work by people like liz falkey that the basic computational kind of uh contribution of language is to provide a kind of universal currency for different um conceptual domains to talk to each other",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7770.003,
    "end": 7792.566,
    "text": " excuse me so language is basically giving you you know you have then your number sense your sense of morality your sense of intuitive physics intuitive geometry uh intuitive botany you know what is all sorts of different domains in the psychology literature concerning how human beings have intuitive modules for understanding reality and constructing a gender model of the world",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7794.509,
    "end": 7800.59,
    "text": " language seems to uniquely allow us to conduct transactions between these domains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7800.89,
    "end": 7807.892,
    "text": "Whereas in non-human primates, they may not be encapsulated exactly, but they are much more kind of atomized.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7807.952,
    "end": 7816.453,
    "text": "The modules, you know, non-human primates have most of these modules for sure, no doubt, maybe all of them, but they don't have a way of conducting transactions between them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7816.973,
    "end": 7819.994,
    "text": "Whereas with humans, we can talk about, you know,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7821.627,
    "end": 7846.649,
    "text": " a large number of you know funny green colorful heavy balloons or whatever right we can combine different conceptual categories together and number sense morality you know um uh different geometrical constructions uh emotional constructions we can use language to access all of these different cognitive constructions now even more interestingly there's some you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7848.37,
    "end": 7864.057,
    "text": " If you look at the kind of syntax of natural language, there's been some really interesting work by people at Queen Mary University and other universities showing that if you take the list of human semantic concepts and the list of human kind of, you know, electrical items and features,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7865.595,
    "end": 7874.824,
    "text": " a lot of overlap in terms of event structure and agent processes and features, but there's also some non-overlap.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7875.264,
    "end": 7887.775,
    "text": "So there's certain notions like worry or concern, for example, that are not morphologically marked in any language, whereas things like trustfulness or belief",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7888.536,
    "end": 7892.96,
    "text": " and things like that are marked by words and language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7893.42,
    "end": 7906.491,
    "text": "So there are certain conceptual features that are very readily found across the world's languages and have certain morphological inflections for or features for, but there are also certain epistemic notions or notions pertaining to knowledge and truth and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7907.918,
    "end": 7909.96,
    "text": " that are not readily morphologically marked.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7910.36,
    "end": 7924.972,
    "text": "So that suggests that there are certain parts of the brain, certain cortical modules that the language system does connect with and does functionally speak to and interact with, but there are other cognitive or perceptual modules that it does not speak to, that it's more isolated from.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7926.133,
    "end": 7936.021,
    "text": "So that's kind of a potential way to kind of think about ways to relate the kind of neurobiological infrastructure with the kind of behavioral linguistic kind of phenomenon.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7937.668,
    "end": 7938.929,
    "text": " Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7939.95,
    "end": 7957.101,
    "text": "So yeah, and then just to conclude, the more kind of philosophical foundations of ROSE are also in line with research documenting a rich array of innate capacities utilized during language acquisition in Neonics, which can distinguish distinct phonemes, detect word boundaries, layered words, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7957.261,
    "end": 7961.124,
    "text": "I'm kind of really invoking a very rich kind of array of innate capacities.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7961.844,
    "end": 7967.051,
    "text": " So currently, due to the lack of consensus regarding how to ground syntactic combinatorics and Excalc in the brain,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7968.321,
    "end": 7977.703,
    "text": " researchers enjoy many degrees of freedom when selecting from their preferred linguistic theory, processing theory, the algorithm, and your about-for framework, the implementational framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7978.704,
    "end": 7987.526,
    "text": "So I hope that rose basically allows us to, you know, fairly constrain the landscape to narrow the space of likely candidate neural mechanisms for syntactic structure building.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7987.866,
    "end": 7992.087,
    "text": "It's really all about figuring out what are the most likely mechanisms that we're going to find",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 7993.027,
    "end": 8020.804,
    "text": " um natural language syntax in the brain which parts of the brain are going to be sensitive to it and which really index that process on some level um so yeah i think i guess i should probably leave it there and conclude it but um yeah that's pretty much the whole model thank you for the massively informative overview and the research agenda do you want to stay",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8021.96,
    "end": 8023.241,
    "text": " Happy to stay for a bit longer for sure.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8023.261,
    "end": 8023.701,
    "text": "Yeah, yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8024.002,
    "end": 8024.562,
    "text": "I'm happy to chat.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8025.263,
    "end": 8025.623,
    "text": "All right.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8026.644,
    "end": 8029.846,
    "text": "Well, there's so many places to join.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8029.987,
    "end": 8032.849,
    "text": "For people who are watching live, maybe we'll have a few minutes to ask a question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8037.38,
    "end": 8061.199,
    "text": " yeah if you have any questions or comments or thoughts I mean I I can I can I can sit here all day and just talk forever about this stuff I probably shouldn't all right I have a handful let's do some short answers and just some general because on the evidence and on the specific brain regions and specific time scales you've made that abundantly clear so I'm gonna ask some alternate questions so okay",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8063.191,
    "end": 8084.139,
    "text": " how do we study these densely woven cognitive phenomena without how do we hold that tension without just resorting simply only always to holism or reductionism you kind of talked about that with the inside out and outside in views but how can we",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8085.976,
    "end": 8107.757,
    "text": " approach a different cognitive system maybe not the human brain and language where even the relationships amongst the different phenomena might be themselves not known um okay i see you mean so if there's some kind of you mean a human specific cognitive process that is not language",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8109.39,
    "end": 8109.711,
    "text": " Yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8110.071,
    "end": 8115.437,
    "text": "If you want to pull out a different thing or study a different system, what kind of account are we looking for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8115.457,
    "end": 8119.501,
    "text": "How are we going to know we're on the path that's not being just massively misleading and so on?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8120.142,
    "end": 8121.343,
    "text": "No, no, that's a good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8122.144,
    "end": 8129.652,
    "text": "So the ROSE architecture, I think, is partially applicable to lots of different cockpit domains.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8130.532,
    "end": 8138.538,
    "text": " I think for attention and working memory, face perception, olfaction, they all involve something at the R to O level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8139.118,
    "end": 8147.164,
    "text": "The coordination of spike timing and the realization of some kind of sensory motor transformations at the broadband gamma level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8147.845,
    "end": 8149.706,
    "text": "The thing where we take over",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8150.672,
    "end": 8173.743,
    "text": " is really at the S-level, where you get the particular type of low-frequency coordination that seems to be specific for language, but language is not the only thing that recruits low-frequency oscillatory phase codes to conduct the orchestra of representations that need to be externalized or interpreted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8174.343,
    "end": 8176.925,
    "text": "So I think the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8178.678,
    "end": 8180.48,
    "text": " It's transferable in many ways.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8180.981,
    "end": 8182.663,
    "text": "The real testable",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8184.489,
    "end": 8208.717,
    "text": " uh issue will be to do with whether or not these um you know whether or not I'm correct that these different levels of linguistic structure are found only at these levels or maybe they're found across all of them um so for example if effects of syntax specific responses can be found truly at the r the o the s and the e scales that I've mentioned that muddies the waters",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8209.588,
    "end": 8218.513,
    "text": " because it means that the brain at every scale across all areas cares about the most niche specific issues in syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8219.213,
    "end": 8230.619,
    "text": "We might have to turn ultimately to state space architectures, which I suspect will be used to supplement rows, at least at the SME levels, I think, in terms of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8231.559,
    "end": 8246.889,
    "text": " you'll have different abstract states being coordinated across network nodes, which is similar to what I mentioned with traveling waves, just a more kind of global interactional process, but for a very different mathematical grounding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8246.909,
    "end": 8250.811,
    "text": "It'll have a very different mathematical grounding.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8251.651,
    "end": 8259.256,
    "text": "I'm not sure if I'm answering your question well, but I think in terms of transferring it to other domains that could be explored,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8261.112,
    "end": 8269.779,
    "text": " It's really about trying to find a prediction of like, I need to use a particular methodology.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8269.799,
    "end": 8279.126,
    "text": "I need to use a particular experimental paradigm to find effects that should only be found at this particular neural resolution.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8279.746,
    "end": 8281.127,
    "text": "And in this respect, it's no different from",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8282.088,
    "end": 8283.309,
    "text": " the rest of the cognitive sciences.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8283.709,
    "end": 8288.591,
    "text": "Because in working memory and attention and navigation, that's exactly what these guys have done for decades.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8289.932,
    "end": 8293.294,
    "text": "Linguistics, as usual, is the last person to the party.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8293.314,
    "end": 8303.319,
    "text": "Linguists are usually the last field in cognitive neuroscience to pick up the developing tools in the field and apply them.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8304.099,
    "end": 8304.639,
    "text": "And that's fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8305.16,
    "end": 8305.9,
    "text": "There's nothing wrong with that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8306.32,
    "end": 8309.442,
    "text": "I think the reason is because human language is the most complex",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8310.242,
    "end": 8334.774,
    "text": " cognitive process that we have it requires a lot of the weeds to be sorted out before we have to figure out how working memory works our attention works our vision works before we can even worry about language and because all of them kind of presuppose and require that right at some level so I think it's natural for language to be saved until last right save the best to last for sure no doubt um but I think it's also it makes it um",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8335.814,
    "end": 8347.302,
    "text": " It's also the case that neuro linguists have not always taken the lessons that previous fields have learned as seriously, and we often end up making the same mistakes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8347.743,
    "end": 8357.33,
    "text": "So when we got scalp EEGs for the first time or fMRI, we made a lot of the same mistakes that the memory guys did or the navigation guys did.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8358.33,
    "end": 8363.934,
    "text": "And I think my own fear in writing this paper is that the reason why I wrote this is mainly because",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8365.195,
    "end": 8373.902,
    "text": " I see it in the last few months, I see it in the last year or so, cognitive neuroscientists getting their hands on very advanced recording techniques, but not really knowing what to make of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8374.423,
    "end": 8390.076,
    "text": "Again, this very aggressive, but also very contemporary and very progressive kind of so-called progressive viewpoint of data-driven science, where you just kind of let the data speak for itself and allow the statistics of your, or do some kind of machine learning.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8390.716,
    "end": 8416.609,
    "text": " um on your kind of on your neural data and expect that to kind of feed into an explanation for language a lot of those techniques and also discourage this kind of theoretical reflection um and if you look at people like Carl Friston you know he spends most of his time he's the world's most influential neuroscientist and he spends most of his time just doing theoretical neuroscience because it's that's that that's really where we're at these days in all of these fields it's about consolidation",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8417.469,
    "end": 8443.26,
    "text": " an interpretation a lot of the a lot of the um i mean i was surprised when i when i started writing this paper i was surprised that a lot of the clues and answers to this puzzle of how syntax is important in the brain are kind of already out there they just haven't been very you know uh the dots haven't been connected the uh the principled relations and logical relations between different findings and different um you know recording methodologies um and the kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8444.284,
    "end": 8448.308,
    "text": " more principled relations between them haven't been established yet or haven't been figured out.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8448.588,
    "end": 8459.118,
    "text": "And I think there's often a push and a desire to just do another experiment, get funding to do more and more experiments and collect more data and do more analysis.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8459.359,
    "end": 8460.34,
    "text": "That's obviously essential.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8460.38,
    "end": 8462.662,
    "text": "I do that as my day job.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8463.142,
    "end": 8467.487,
    "text": "But outside of my day job, I think it's also important to spend some time thinking about how to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8468.769,
    "end": 8472.912,
    "text": " thinking more carefully about this so that you don't need to do any more experiments for a while.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8474.233,
    "end": 8482.298,
    "text": "Or at least so you know that when you do your experiments, you know the landscape better and you don't end up making the same mistakes that other people do.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8483.339,
    "end": 8486.241,
    "text": "But really, it goes back to this issue of cost benefit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8486.761,
    "end": 8487.082,
    "text": "How do you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8487.97,
    "end": 8495.176,
    "text": " How do you kind of weigh up the pros of collecting more data with the foreseeable benefits?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8495.216,
    "end": 8505.245,
    "text": "But the whole notion of foreseeable benefits, empirical foreseeable benefits, really presupposes and needs this framework of what the benefits are likely to be.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8505.706,
    "end": 8509.149,
    "text": "If the benefits are just, I'm going to just let the data speak for itself and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8509.529,
    "end": 8534.521,
    "text": " get a bunch of different you know machine learning um or llm architectures to kind of figure out the story for me you're probably going to be disappointed um whereas if you take a step back and think about a more principled architectural approach like think about the brain the way an engineer would and figure out like which level is going to be best served for a different a particular cognitive process that's that's the basic mindset behind behind this model",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8534.942,
    "end": 8539.575,
    "text": " It's about figuring out which scale of neural operation is going to be most helpful for you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8542.793,
    "end": 8542.993,
    "text": " Great.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8543.033,
    "end": 8547.958,
    "text": "Well, on that kind of research program scale, the Compass Rose, it's a great model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8549.359,
    "end": 8565.575,
    "text": "I was curious about a few other settings for speech, like listening to a video or recording at a different speed than 1x, or watching subtitles, or just the idea of reading, and whether there was some kind of a...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8567.844,
    "end": 8591.329,
    "text": " clean handoff between one sentence is heard then one is read then one is heard is it beyond the sensory modality by what stage or what elements that are extra lexemic like prosody and timing and so on play into for example speech as opposed to writing where there's formatting and italics and so on",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8591.969,
    "end": 8593.47,
    "text": " Yeah, no, that's a good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8593.49,
    "end": 8602.836,
    "text": "So there's an unanswered question at the moment, which is to do with the bottleneck of reading or speech processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8602.896,
    "end": 8605.278,
    "text": "Well, speech processing, not so much, but definitely for reading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8605.978,
    "end": 8609.861,
    "text": "We don't really know that much about the bottleneck, like how fast you can read.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8611.042,
    "end": 8612.983,
    "text": "So the ROSE model talks about delta rhythms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8613.063,
    "end": 8614.064,
    "text": "It talks about theta rhythms.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8614.164,
    "end": 8615.225,
    "text": "These are very slow waves.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8615.985,
    "end": 8621.169,
    "text": "If you ever tried speed reading, it becomes very clear straight away that human beings can read very quickly.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8622.249,
    "end": 8647.616,
    "text": " and so if you if you you know code in matlab or python some kind of rsvp style and you know a textbook where you can just like have one word flashing on the screen at a time and set it to different rates if you have it you know 50 500 milliseconds away no problem it turns out you can go way faster up to like you know 15 20 words a second and you can still get interpretability and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8648.836,
    "end": 8652.297,
    "text": " you'll be surprised if you try it, you'll be very surprised by how fast you can actually read.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8653.938,
    "end": 8658.219,
    "text": "So you might think that poses a problem for the ROSA architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8658.239,
    "end": 8659.299,
    "text": "I don't think it does.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8659.339,
    "end": 8661.08,
    "text": "I can get to that after I've answered your question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8661.12,
    "end": 8662.6,
    "text": "It doesn't pose a problem at all.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8663.02,
    "end": 8664.821,
    "text": "But so that's a good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8664.901,
    "end": 8674.184,
    "text": "So we know that there are certain parts of the brain that do in the ventral temporal cortex, which is the lower side of the other side of the temporal lobe, they are responsible for",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8675.804,
    "end": 8678.726,
    "text": " transforming visual information into orthographic information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8679.066,
    "end": 8683.988,
    "text": "In fact, the work of Oscar Wolno in my lab, he's done the most impressive work on this by far.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8684.028,
    "end": 8690.45,
    "text": "Very exquisite, like intercranial recordings of how human beings... In fact, his whole research is on reading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8690.77,
    "end": 8692.991,
    "text": "So you should probably definitely read his work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8693.351,
    "end": 8696.653,
    "text": "It's basically about how the human brain takes visual information",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8697.313,
    "end": 8710.442,
    "text": " and then converts it into an orthographic space, a constrained orthographic space, a space in which your mind, I guess, will be sensitive to particular statistical configurations of shapes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8710.782,
    "end": 8713.004,
    "text": "But you know this one's a letter, this one's not a letter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8713.464,
    "end": 8715.706,
    "text": "So that takes place in the same part of the ventral temporal cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8717.427,
    "end": 8729.708,
    "text": " maybe somewhere around there that will due to endogenous um you know processing and limitations probably not to do a vision probably due to you know some kind of uh next next stage and process to do of interpretability",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8731.058,
    "end": 8740.923,
    "text": " And because as you know, we can read, we can see based on such the card rates and all the rest of the numbers, like objects and things we can see in a given second is very large indeed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8741.823,
    "end": 8757.411,
    "text": "The human brain mostly filters out most of its sensory information every second, just to kind of focus on the stuff that's key to its general model, the stuff that's key to kind of, you know, minimizing the free energy of its general model and keeping it kind of sustained and not changing the status quo, et cetera.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8757.964,
    "end": 8767.474,
    "text": " But on the reading level, we know that at that stage, that's when you get what I call the sensory motor transformations in high-gamma activity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8767.955,
    "end": 8775.223,
    "text": "So that's where you get that high-gamma activity being responsible and sensitive to the mapping from that visual information to the linguistic information.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8775.703,
    "end": 8779.444,
    "text": " Because often somehow you see words on a screen, you see squiggles and lines.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8779.844,
    "end": 8782.825,
    "text": "Somehow you've got to convert that into a more abstract space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8783.265,
    "end": 8785.445,
    "text": "So that all takes place in the ventral temporal cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8785.525,
    "end": 8796.288,
    "text": "And then you get some interesting connectivity and top down information from being sent from frontal cortex back to ventral temporal to constrain and kind of coordinate",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8797.401,
    "end": 8818.02,
    "text": " the that bottleneck at least that's one of the main theories that exists and i'm not an expert on reading per se i'm not a vision scientist but you know as far as i understand that's the kind of um the general framework is that there is a part of the brain that's sensitive to statistics but also the symbology of orthographic information um and we know that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8818.843,
    "end": 8821.806,
    "text": " it takes place in very short timescales.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8822.267,
    "end": 8831.997,
    "text": "You asked a very interesting question about the kind of dual modality, like when you're watching a film, you're listening to it, and you're also reading subtitles at the same time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8832.898,
    "end": 8833.278,
    "text": "That's a very...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8834.093,
    "end": 8845.036,
    "text": " tricky question because on the centromotor side, we know that you'll get oratory cortex involvement and orthographic kind of occipital temporal involvement engagement at the same time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8845.456,
    "end": 8849.617,
    "text": "But somehow they both have to converge on a single interpretation, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8849.817,
    "end": 8852.218,
    "text": "Because we know that you can't",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8852.677,
    "end": 8853.738,
    "text": " comprehending things in parallel.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8853.958,
    "end": 8857.099,
    "text": "You can't read two books at once, or at least most people can't.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8857.62,
    "end": 8867.305,
    "text": "So that means there's got to be a single kind of interpretation procedure and a single kind of semantic integration process that is being instructed in a form by different modalities",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8868.677,
    "end": 8874.621,
    "text": " But when you think about it, that might sound difficult, but it's actually no different from when I use hand gestures right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8875.302,
    "end": 8879.985,
    "text": "So when I use hand gestures, I'm providing some kind of extra modal information to you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8880.885,
    "end": 8889.251,
    "text": "It's obviously easier because this is more hand gestures are usually kind of pragmatically informative rather than explicit propositional, of course, unless you speak sign language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8890.372,
    "end": 8895.235,
    "text": "But it's still just a case of different sensory motor transformations taking place.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8895.516,
    "end": 8896.516,
    "text": "So that would still be at the O level.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8898.049,
    "end": 8908.955,
    "text": " that would still be at the O-level of R. It's still high-gamut transformations that are then fed into a more uniform, discrete and abstract syntactic inference being made.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8909.095,
    "end": 8914.118,
    "text": "There's only one syntactic inference being made about the meaning of the sentence, but it's being informed by multiple sites.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8914.478,
    "end": 8918.4,
    "text": "Now, you do raise an interesting question because that might be the case.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8918.54,
    "end": 8925.584,
    "text": "It might be the case, therefore, that this low-frequency delta complex therefore has to entrain and functionally connect with multiple cortical sites.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8926.184,
    "end": 8929.347,
    "text": " it might have to speak to auditory cortex, but also ventral temporal cortex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8929.628,
    "end": 8940.519,
    "text": "If you're gleaning distinct types of, if the lower level lexical representations you're getting are being sourced from auditory, that orthographic.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8940.719,
    "end": 8942.801,
    "text": "So for example, if I give you a sentence,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8943.891,
    "end": 8952.962,
    "text": " and I get you to hear the first word, and then read the second word, and then hear, read, hear, read, or listen, I should say.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8952.982,
    "end": 8953.823,
    "text": "Listen, read, listen, read.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8954.844,
    "end": 8961.352,
    "text": "If you go between listening and reading, but you're still integrating a single unified structure, we know you can do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8961.532,
    "end": 8962.413,
    "text": "Human beings can do that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8962.593,
    "end": 8963.574,
    "text": "So that tells you straight away that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8964.363,
    "end": 8965.244,
    "text": " you know, it can be done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8966.385,
    "end": 8967.485,
    "text": "But the question is how it's done.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8967.786,
    "end": 8980.775,
    "text": "Like I said, I suspect it's through this dual kind of trade-off between central motor instructions being sent from auditory cortex to the same unified low frequency program, and then the visual information too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8981.756,
    "end": 8991.224,
    "text": " So that's actually a kind of a nice way to separate out the distinction between, you know, sensory motor stuff from the more abstract, unified kind of syntactic information that's being built.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8991.464,
    "end": 8994.246,
    "text": "And in fact, you've just given me a good idea for an experiment, so thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 8995.587,
    "end": 8995.947,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 8996.608,
    "end": 9005.274,
    "text": "Yeah, because language is so linearized, it's like being pulled through a needle, and then in the CICADE, so-called speed reading,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9006.115,
    "end": 9010.12,
    "text": " But it's not simply moving the linearization faster.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9010.2,
    "end": 9017.95,
    "text": "Speed reading can leverage formatting and all these other strategies, like almost thinking through other minds.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9020.396,
    "end": 9040.549,
    "text": " ways of reading and also having an off-center effect in visual system and the way that that kind of convolves the orthography versus in listening you basically always want to be listening more clearly because the moment is the only time you're going to hear it",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9041.872,
    "end": 9051.562,
    "text": " The active listening components, like you can't let it fly by, but reading, you can take saccade strategies and cognitive strategies that you just can't take.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9052.523,
    "end": 9056.647,
    "text": "And that's kind of this like all at once versus one at a time element.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9058.289,
    "end": 9065.276,
    "text": "There's actually, there's a framework in psych linguistics called the now or never bottleneck.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9066.041,
    "end": 9069.102,
    "text": " So the now or never bottleneck refers to what you're saying, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9069.222,
    "end": 9071.243,
    "text": "In reading, there's no now or never.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9071.783,
    "end": 9072.784,
    "text": "You can just take your time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9073.144,
    "end": 9074.544,
    "text": "With listening, you're totally right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9074.764,
    "end": 9075.605,
    "text": "It's now or never.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9075.625,
    "end": 9082.047,
    "text": "You have to pay attention now and integrate or your working memory is going to dissipate or your attention is going to",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9082.492,
    "end": 9087.917,
    "text": " or your phonological loop is going to decay, and you're going to ask the person to repeat themselves again and again.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9089.478,
    "end": 9093.181,
    "text": "So it's a very different performance system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9093.581,
    "end": 9101.047,
    "text": "And it's also very different from Braille, when you're using touch and you're reading Braille, when you're gesturing and using sign language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9101.087,
    "end": 9103.549,
    "text": "Language, especially syntax, truly is amodal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9104.15,
    "end": 9106.592,
    "text": "It's completely independent of any modality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9107.753,
    "end": 9110.956,
    "text": "The neuroscience of speech is very different from the neuroscience of language.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9111.636,
    "end": 9114.737,
    "text": " neuroscience of gesture is very different from neuroscience.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9114.938,
    "end": 9126.023,
    "text": "Your language is a more kind of a modal abstract system that calls upon these very various sensory motor kind of processes, which is what most people",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9127.074,
    "end": 9155.672,
    "text": " intuitively trying ground language in a sensory motor kind of context because that's natural of course you know that's how we access it that's how we trigger it well obviously you know most of most of our daily language use is probably just thinking to ourselves you know um using language maybe on subconsciously using the using the computational capacity that language affords us in non-linguistic ways meaning to construct hierarchical structures of thought and planning",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9156.372,
    "end": 9169.387,
    "text": " and you know and all the rest of it in some kind of subconscious way rather than explicitly saying I am saying a sentence or even I am thinking a sentence in my head because even when we think a sentence in our head",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9170.967,
    "end": 9174.451,
    "text": " that's still just an internalized form of externalization, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9174.711,
    "end": 9178.295,
    "text": "So when you think about in your head, that's still externalization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9178.315,
    "end": 9180.158,
    "text": "It's just a different type of externalization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9180.518,
    "end": 9184.783,
    "text": "You're not externalizing it with your mouth, but you're still putting it out into your own phonological loop.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9185.364,
    "end": 9187.286,
    "text": "But that's still externalization.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9187.746,
    "end": 9202.891,
    "text": " internalization is truly the subconscious process of generating the syntactic inference which is done rapidly reflexively uh you know intuitively often without much thought often meaning attention often without much attention being directed to it and any kind of",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9203.411,
    "end": 9205.253,
    "text": " conceptual implications being made.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9206.213,
    "end": 9211.877,
    "text": "So most of language use is outside of the sensory motor space, I would argue.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9211.958,
    "end": 9216.401,
    "text": "Maybe I'm wrong about that, but this is a point that Noam Chomsky's made a lot, and I think he's right about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9217.181,
    "end": 9221.385,
    "text": "A lot of the daily use of the language infrastructure",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9222.305,
    "end": 9239.685,
    "text": " um is like i said i mentioned the universal currency metaphor it's like it's across these different conceptual spaces um and it's it's it's potentially represented very redundantly across sparse neural codes as i mentioned in the rose architecture such that it survives brain damage it survives all sorts of different things and",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9240.726,
    "end": 9242.748,
    "text": " But it's still crucial.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9243.088,
    "end": 9262.441,
    "text": "And you get a lot of people like Rosemary Barley and Federico, you know, showing work that, you know, damage to, well, you know, using imaging research showing that the language network is not activated during XYZ non-linguistic cognitive tasks or damage to the language network does not damage, you know, XYZ non-linguistic tasks.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9262.881,
    "end": 9263.561,
    "text": "And that's all fine.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9264.502,
    "end": 9270.266,
    "text": "But it's really, that's kind of a separate issue from whether or not the more abstract syntactic neural code,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9271.166,
    "end": 9279.551,
    "text": " that I've presented in the paper is recruited on some level by non-linguistic resources, which I suspect it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9279.872,
    "end": 9282.693,
    "text": "Again, another empirical question for you, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9283.014,
    "end": 9286.215,
    "text": "But I think that's a reasonable framework to kind of assume, at least.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9287.016,
    "end": 9287.196,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9288.617,
    "end": 9289.217,
    "text": "Cool.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9289.537,
    "end": 9292.679,
    "text": "One, I guess, reflection on that, and then one last question.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9295.523,
    "end": 9315.568,
    "text": " You described language, human language, as being a kind of psychotechnology with supporting architecture and enculturation, all these different features that are totally relevant, influence it, that allows us to articulate the sense-making in action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9315.988,
    "end": 9320.089,
    "text": "Like when we look at figure 4.3 in the Active Inference textbook, and we have",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9321.269,
    "end": 9349.103,
    "text": " a Bayesian graph that factorizes out through the sparsity of just how things are related, like how the measurement of the thermometer is related to the temperature in the room, how the temperature in the room changes, fundamental concepts of place and time, where preferences fit into that, what this is about, the semantics of this variable, whether it's kind of like a central tendency or whether it's a variance estimator like confidence, which is something that you brought up as like a strong linguistic utility.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9349.584,
    "end": 9350.084,
    "text": "So it's kind of like,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9351.678,
    "end": 9373.804,
    "text": " it has an element of just being the geometry and topology of thought and thinking and generative modeling that has ultra mundane everyday uses because this generalized apparatus really does",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9375.782,
    "end": 9379.543,
    "text": " have utility, pragmatic value in communication.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9380.663,
    "end": 9393.646,
    "text": "So it can be used for the most referential, just one bump above pointing at something and pointing at something and grunting and pointing at something and say, look, or look, it's like you can keep going.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9395.447,
    "end": 9402.108,
    "text": "But often what's only needed is the first little bit, especially given a context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9402.628,
    "end": 9405.189,
    "text": "And yet there's this open-ended...",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9406.542,
    "end": 9431.823,
    "text": " arbitrary state space navigation elements as well yet it's only i just i think it's incredible how it's laid out and how what you described with a heavy emphasis on the neurophysiological and the computational comes into play with active inference and the generalized state spaces and all these concepts so that's just super exciting i guess my sort of",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9432.95,
    "end": 9451.019,
    "text": " closing or or we can keep talking or whatever but how do you see this relating to language learning for first language and for not first language learning yeah i i i totally agree with what you said about the active inference framework but i think i think um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9452.216,
    "end": 9459.622,
    "text": " You know, linguistics, semantics and well, you know, syntactic structures are a unique kind of inference that the human brain has to make.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9459.642,
    "end": 9474.513,
    "text": "I see a lot of the properties of lexical semantics in human language as being a unique type, a unique contributor to the active inference framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9474.853,
    "end": 9482.497,
    "text": " And I think it's a surprise to me that more linguists haven't turned to active inference to think about certain properties, because it seems so obvious.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9482.557,
    "end": 9483.437,
    "text": "It seems so compatible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9484.038,
    "end": 9488.32,
    "text": "I've tried to do it in some work, and I think maybe some other people have too, potentially.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9489.577,
    "end": 9493.801,
    "text": " It's an obvious kind of, well, I mean, I cited the Peter Hagor paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9493.981,
    "end": 9495.803,
    "text": "He cites that work too a little bit.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9496.103,
    "end": 9498.706,
    "text": "But no, it's a very promising way to pursue it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9498.846,
    "end": 9503.75,
    "text": "In terms of language learning and acquisition, that's a very, very good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9504.351,
    "end": 9512.259,
    "text": "So I mentioned at the beginning some of the low-frequency delta responses to syntax, all of that research is in adults.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9513.237,
    "end": 9523.845,
    "text": " Well, all of it was until some researchers at Cambridge UK a few years ago started to think, okay, well, maybe is this how children process language too?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9524.145,
    "end": 9528.649,
    "text": "Or maybe is this how, is this where they process language in the same regions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9529.089,
    "end": 9529.59,
    "text": "It turns out",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9530.481,
    "end": 9538.004,
    "text": " If you look at teenagers and children and you do the same kind of low scalp BG, or maybe even Meg research, I'm not sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9538.024,
    "end": 9538.504,
    "text": "I can't remember.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9538.524,
    "end": 9539.925,
    "text": "I cited it in my book.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9540.525,
    "end": 9547.848,
    "text": "The low frequency responses change over development in terms of which ranges are sensitive to the periods of syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9548.368,
    "end": 9553.27,
    "text": "So it's not necessarily, you know, 1.3 Hertz precisely that entrains the syntax.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9553.39,
    "end": 9553.811,
    "text": "Of course not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9554.751,
    "end": 9556.952,
    "text": "This gets back to the point I made earlier about speed reading, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9557.212,
    "end": 9559.593,
    "text": "It's all about the flexible coordination and packaging",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9560.282,
    "end": 9562.983,
    "text": " of representations into a given complex.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9563.704,
    "end": 9571.328,
    "text": "Again, I mentioned the issue of trade-off between number of representations you can chunk and the fidelity of the representations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9571.428,
    "end": 9577.911,
    "text": "You can have a few and well represented in Ghana or a large number and only a small number of spikes per representation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9580.272,
    "end": 9581.313,
    "text": "That's a very general framework.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9581.693,
    "end": 9584.535,
    "text": " that's been supported in the attention literature too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9584.555,
    "end": 9586.356,
    "text": "It's not just my proposal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9586.896,
    "end": 9589.638,
    "text": "So that poses a question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9590.198,
    "end": 9597.143,
    "text": "If children and teenagers show a different kind of low frequency phrase response, how do we deal with that?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9597.823,
    "end": 9599.264,
    "text": "I don't have a clear answer to that question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9599.765,
    "end": 9607.83,
    "text": "I think the ROSE architecture can very readily be modified to that because it's not as if they will still have the same architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9608.45,
    "end": 9614.814,
    "text": " they'll still have the same R to O to S to E. The particular frequency band of interest might shift over development.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9614.834,
    "end": 9623.339,
    "text": "And in fact, we know from working memory and attention that theta dynamics and alpha dynamics, and beta dynamics too, do change cross-cortically over development.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9624.099,
    "end": 9626.12,
    "text": "And these are behaviorally relevant to things like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9627.95,
    "end": 9629.971,
    "text": " development of working memory and attentional resources.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9630.251,
    "end": 9633.772,
    "text": "That's been very clearly studied and very well studied too.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9634.613,
    "end": 9644.177,
    "text": "So it's more like there's a more abstract code that simply shifts its spatial temporal profile as the brain gets older and then changes more when we get even older.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9644.637,
    "end": 9649.839,
    "text": "So I have a paper that's going to come out fairly soon, I hope, to do with aging.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9651.019,
    "end": 9655.003,
    "text": " What happens when our brains decay and we get old?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9655.323,
    "end": 9666.453,
    "text": "There's some nascent kind of research looking at the language processing, not at the behaviour level, but in terms of the neuro level, the neurobiology of language processing in older people.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9667.479,
    "end": 9692.01,
    "text": " and how it might also relate to you know breakdown of semantic information access and things like that and what are the potential correlates of that so you can imagine very clearly if you take the rose architecture which components will be disrupted or modified based on if it's a syntactic or a conceptual or a lexical kind of deficit but you know the the the isomorphism is as i said very crude so you can you can predict that very clearly and in fact there's some",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9692.51,
    "end": 9697.431,
    "text": " research in that space that I think is concordant with this, which is what I discuss in this new paper.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9698.131,
    "end": 9702.812,
    "text": "Like I said, it's a relevant architecture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9703.252,
    "end": 9719.255,
    "text": "It's a very difficult question about how the whole brain matures over time, because there's certain aspects of knowledge that may not be represented in ways that we currently know how to detect or record.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9722.696,
    "end": 9727.841,
    "text": " We have the four or five measures, main measures that I mentioned in the paper, they're what we have right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9728.381,
    "end": 9735.046,
    "text": "Maybe there's a particular form of neural encoding that just goes way beyond what we can physically provide in the year 2023.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9736.697,
    "end": 9742.302,
    "text": " I don't think there's any reason to assume that we've reached the limit of decodability of neural signals and their complexity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9742.583,
    "end": 9743.824,
    "text": "Absolutely not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9744.264,
    "end": 9748.008,
    "text": "So the learning process is a very mysterious one.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9749.289,
    "end": 9754.694,
    "text": "So yeah, I think it's also a really good way to falsify a lot of this stuff, by the way.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9755.768,
    "end": 9763.701,
    "text": " It's a really good way just to completely falsify and test a lot of these proposals to do with the architecture itself and then developing code over time as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9763.921,
    "end": 9765.284,
    "text": "So, yeah, it's a very relevant concern.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9766.125,
    "end": 9769.911,
    "text": "The best way to do it is to get into training recordings and children.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9771.062,
    "end": 9782.429,
    "text": " That's very difficult because in Austin, Texas, there's a lab there that has these recordings and uses access to children with epilepsy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9782.969,
    "end": 9787.652,
    "text": "And they get these children to watch trailers of films and listen to stories and things like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9787.952,
    "end": 9789.293,
    "text": "And they do some interesting language research.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9789.993,
    "end": 9815.407,
    "text": " in these kids that's exceptionally rare data and very very very useful data for answering these questions i don't have access to that data and most of that research has not been forthcoming yet there's been a couple of intracranial papers in children and language but it's fairly sparse fairly low patient numbers and the types of analyses have been too kind of remote and departed from this framework to really test it but that would be the way to test it get you know",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9816.451,
    "end": 9820.475,
    "text": " electrodes directly inside the brains of children and potentially even younger.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9820.495,
    "end": 9822.977,
    "text": "I think the youngest I've seen is about four.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9823.678,
    "end": 9832.305,
    "text": "But even by four years old, it's maybe too late to chart the actual full development of acquisition of language, because by that stage, they've already acquired syntax, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9832.666,
    "end": 9842.775,
    "text": "If you could get even I don't want to sound like a mad scientist, but if it's possible, ethical to one day get access to intracranial recordings and very young children, then it would be possible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9843.155,
    "end": 9872.29,
    "text": " to chart this developmental process especially if the children are in the hospital for protracted periods and in fact get some kind of i mentioned bci implants if they have some kind of implanted device over time that would be the most direct way to test this stuff well not just test my theory but just you know just just completely chart out the full developmental profile and the evolution and the development of the neurophysiological basis of speech processing and language processing um but right now that's kind of as far as i understand that's kind of like",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9873.467,
    "end": 9876.018,
    "text": " the current landscape of where the field is right now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9879.855,
    "end": 9907.727,
    "text": " wow well um you can have the last word with any last thoughts but thank you for this amazing presentation and i hope that if people are interested that they can of course read the paper and learn and reach out and maybe we can have 64.2 when the time is right but anything you'd like to kind of leave it with yeah no thanks so much for having me on man um it's been very it's been great you've been great i've been enjoyed it's been enjoyable just kind of outlining my own",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 9908.436,
    "end": 9917.524,
    "text": " You know, you read your own paper over and over again and you realize all the things that you kind of misinterpreted or misread on your face, read through in terms of like phrasing and all the rest of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9917.544,
    "end": 9919.986,
    "text": "So it's always good to refresh these things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9920.406,
    "end": 9921.147,
    "text": "But no, absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9921.167,
    "end": 9923.689,
    "text": "If people are interested in this stuff, I'm always open.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9924.29,
    "end": 9927.833,
    "text": "You know, you can contact me via email, on Twitter.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9928.053,
    "end": 9928.874,
    "text": "Very happy to talk more.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9929.474,
    "end": 9929.834,
    "text": "Absolutely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9930.235,
    "end": 9931.115,
    "text": "So yeah, thank you for listening.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9931.135,
    "end": 9932.176,
    "text": "Thank you for having me.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9932.196,
    "end": 9932.497,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9933.537,
    "end": 9933.798,
    "text": "Peace.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 9934.538,
    "end": 9934.879,
    "text": "Peace, mate.",
    "speaker": "SPEAKER_02"
  }
]