[
  {
    "start": 6.448,
    "end": 33.813,
    "text": " hello and welcome it's december 7th 2023 we're here in active inference guest stream 67.1 andres carada is here with us and we'll be presenting and discussing on ntqr logic for noisy ai algorithms complete postulates and logically consistent error correlations so thank you for joining andres and also jacob and looking forward to this discussion",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 35.916,
    "end": 36.576,
    "text": " Thank you, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 36.636,
    "end": 37.717,
    "text": "Thank you for introducing me.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 37.737,
    "end": 42.6,
    "text": "Hello, Jacob and Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 43.28,
    "end": 45.981,
    "text": "Jacob, would you like to talk about why you're here?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 48.763,
    "end": 49.343,
    "text": "Yes, sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 49.964,
    "end": 51.505,
    "text": "So, hi, I'm Jacob.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 51.845,
    "end": 54.566,
    "text": "I am a researcher currently based in California.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 56.52,
    "end": 84.406,
    "text": " i am interested in using physics-based principles to model intelligent and self-organizing systems and how different frameworks uh most specifically active inference can be applied to both topics in ai and systems engineering and broadly how we can use these formalisms to understand systems at a deeper um more",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 85.499,
    "end": 88.962,
    "text": " inclusive level with other disciplines as well.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 89.522,
    "end": 109.538,
    "text": "And I'm very interested to hear your talk and your thoughts on these topics and engage in hopefully a productive discussion.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 111.039,
    "end": 112.16,
    "text": "Looking forward to that, yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 114.19,
    "end": 134.005,
    "text": " okay so i'm going to talk about the problem of self-regulation for any intelligent machine and it has been a long journey for me in dealing with this topic it goes back to a patent that i that that i took out in 2010",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 136.209,
    "end": 144.371,
    "text": " But recently I've come to understand it because I've been collaborating with a philosopher and an economist, the aspects of it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 144.531,
    "end": 156.634,
    "text": "And that's why I have this very abstract title for it called NTQR, because it refers to a situation where you have an ensemble of N experts to which you have given T tests.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 157.394,
    "end": 161.555,
    "text": "And each test has Q questions and each question has R responses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 161.575,
    "end": 162.675,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 163.624,
    "end": 170.469,
    "text": " So it's about evaluating noisy AI algorithms when you give them these types of testing protocols.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 171.69,
    "end": 177.674,
    "text": "And superficially, at the beginning, we can take that testing protocol to be the surface application itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 177.834,
    "end": 181.717,
    "text": "You are literally taking, let's say, a multiple choice exam.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 182.277,
    "end": 191.404,
    "text": "But I'm going to eventually dislodge you from that to understand that this is a digitizing format for testing logical consistency of anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 192.18,
    "end": 193.641,
    "text": " because you can digitize anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 194.381,
    "end": 200.363,
    "text": "So even if it's continuous, you can create four response ranges and stuff like that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 201.763,
    "end": 212.787,
    "text": "And the big breakthrough for me has been the recognition that for a long time I talked about these things as universal thermometers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 213.627,
    "end": 219.589,
    "text": "And the universality meant that they could be used everywhere, just like thermometers can be used everywhere aside from",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 220.385,
    "end": 249.021,
    "text": " you melting them right or freezing them beyond their range and the thermometer also had the notion of being stupid no intelligence no theory about the world or the phenomena that it's measuring the temperature off and i've did that for a long time and i took out a patent because i thought that i had found a method to do these thermometers and and you can patent methods",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 249.645,
    "end": 253.987,
    "text": " But it turns out that I did not discover a method or have a patent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 254.648,
    "end": 257.93,
    "text": "I discovered logical postulates for evaluation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 259.11,
    "end": 267.495,
    "text": "And so what I'm going to talk about today is the logic of evaluating noisy functions, period, in general, universally.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 268.035,
    "end": 275.179,
    "text": "And so I'm going to talk about them as postulates because they apply whenever you are doing these NTQR tests.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 275.834,
    "end": 280.037,
    "text": " And so a major conceptual goal for me is to convince you of that, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 280.077,
    "end": 288.302,
    "text": "That I have something that you could call postulates because especially in the machine learning world, people would say, this is crazy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 288.342,
    "end": 290.103,
    "text": "This cannot possibly be, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 290.163,
    "end": 297.708,
    "text": "How could you have postulates for anything in the real world so general?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 297.748,
    "end": 302.991,
    "text": "And you'll see that I do that by basically shedding all representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 306.408,
    "end": 308.368,
    "text": " So I want to mention these collaborators.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 308.949,
    "end": 310.449,
    "text": "One of them happens to be my cousin.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 310.489,
    "end": 312.549,
    "text": "This is a conflict of interest disclosure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 313.43,
    "end": 320.211,
    "text": "He's a professor of philosophy at Virginia Westland University, and he has been the severe critic of things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 320.911,
    "end": 333.054,
    "text": "And I've done most of the work in terms of the mathematics and the machine learning, but he's the person that's responsible for actually introducing the concept of logically consistent",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 333.712,
    "end": 358.154,
    "text": " versus logically sound and the utility of of having any sort of logical right proof for for anything that you do and then the other collaborator with this paper is elia parker who works with the navy and has a master's in economics because you're going to see that this is a fundamental problem in economics that goes under the name of principal agent monitoring",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 362.262,
    "end": 370.726,
    "text": " So I'm going to talk about, you know, the two main goals that I have in the talk, and I'm going to introduce the main problem that we're going to be addressing, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 371.166,
    "end": 373.467,
    "text": "This principal agent monitor problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 374.147,
    "end": 377.188,
    "text": "And then I'm going to make some observations about you guys.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 377.248,
    "end": 384.291,
    "text": "I find that the format of these live streams is incredibly interesting to me intellectually.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 384.731,
    "end": 391.274,
    "text": "And I just want to, you know, sort of give an outsider viewpoint about what I'm seeing that you guys are doing that I find so laudable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 391.803,
    "end": 399.728,
    "text": " And as I was saying to Daniel, I have a little bit of an imposter syndrome because I feel like you guys made a mistake inviting a stranger like me so suddenly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 399.808,
    "end": 404.39,
    "text": "But I hope to repay that kindness by engaging in a good discussion with everybody.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 405.931,
    "end": 413.816,
    "text": "And so then I'm going to introduce this idea of algebraic evaluation, talking about binary classifiers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 413.876,
    "end": 417.818,
    "text": "And I'm going to make the math be really simple, just linear algebra.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 418.502,
    "end": 420.222,
    "text": " so that you can understand it, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 420.322,
    "end": 429.005,
    "text": "I don't want to lose you because this eventually involves algebraic geometry and something called Grubner basis and all these complicated stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 429.065,
    "end": 433.666,
    "text": "But I don't want to use this math to hide from the basic ideas that are behind it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 434.606,
    "end": 445.229,
    "text": "And then I'm going to talk about what I said before, that you shouldn't think of the multiple choice exams as actually being the surface realization of how something is being evaluated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 445.979,
    "end": 466.444,
    "text": " you could you could have given people a philosophy exam and giving them written essays and then you have chat gpt grade the written essays and give a score right from you know zero to four right so then you're making an ntqr equals five test right and so i'm going to go over that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 467.245,
    "end": 494.027,
    "text": " And then the main technical result of today, the main thing that is the breakthrough, is that there are complete postulates for pairs of correlated binary classifiers that allow you to separate correlation from individual performance in a way that actually allows you to then immediately trivially sort of compute the only logically consistent error correlation if you believe that they behaved in a particular way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 494.047,
    "end": 495.949,
    "text": "And I'll go through that caveat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 497.071,
    "end": 507.68,
    "text": " Then I'm going to show an exact solution for the tree of error independent classifiers, and then show some experiments and work through the math of doing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 509.701,
    "end": 512.143,
    "text": "Any questions or people want to comment on anything?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 516.406,
    "end": 519.629,
    "text": "Go a little further, and I believe we'll have a few pieces to add in.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 519.649,
    "end": 520.75,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 526.687,
    "end": 538.171,
    "text": " The main goal that I have is that I want to describe to you what I did technically, which is try to figure out how I'm going to evaluate ensembles of noisy binary classifiers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 538.911,
    "end": 542.232,
    "text": "And so it has a particular way that I go about it, blah, blah, blah, blah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 542.872,
    "end": 544.773,
    "text": "And that's sort of like the surface realization.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 544.813,
    "end": 553.516,
    "text": "But once you realize how I've done it and what I've been able to achieve, what I really want you to think about is this last question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 554.645,
    "end": 582.044,
    "text": " if it's not this thing that i'm going to talk about wow isn't it something like this because it seems like this is so easy to implement and it's so useful if it existed and so that's where i want to take you okay and so i want to have the discussion for that and you know we can go into the math and i can pull up the papers i can pull up github repos right and i can show you stuff if you want me to show it but i don't think it's going to help",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 582.665,
    "end": 583.265,
    "text": " the discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 583.746,
    "end": 590.069,
    "text": "And so I want to talk about, you know, sparsity, picking best variants and safety from internal mistakes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 591.89,
    "end": 596.472,
    "text": "That those are the topics I think Jacob wrote, you know, talked about some of them, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 597.152,
    "end": 606.537,
    "text": "I think the November 14 talk that I saw with Alexander, he was harping very much on sparsity being a very biological thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 606.557,
    "end": 608.278,
    "text": "And you're going to see how I use it, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 608.318,
    "end": 610.679,
    "text": "Because I basically have a data streaming algorithm",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 613.507,
    "end": 637.422,
    "text": " okay so this is my outside review i mean this is a community of people that you guys have been working in so such hard problems and you're still working on such hard problems which i have to say you know and i'm being you know honest here you've made very little progress on right but it's because they're really hard fundamental problems but you guys don't give up",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 638.436,
    "end": 640.278,
    "text": " You guys are still having this live stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 640.318,
    "end": 641.539,
    "text": "You're still inviting people.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 641.579,
    "end": 642.74,
    "text": "You're still discussing it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 642.84,
    "end": 643.06,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 643.221,
    "end": 643.861,
    "text": "I love that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 643.881,
    "end": 644.882,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 645.042,
    "end": 648.646,
    "text": "Not giving up on particularly hard problems.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 649.226,
    "end": 649.406,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 649.446,
    "end": 652.169,
    "text": "So I'm very attracted to that particular mind temperament.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 653.368,
    "end": 678.87,
    "text": " and your community as i can observe of people who have come to neuroscience and biological things but from different places sometimes from physics sometimes from biology sometimes from mathematics and have arrived there but you're still bringing in people from those places right and there's a lot of active listening that i saw daniel writing stuff down right as people were speaking i mean incredible stuff that you rarely see so kudos to you guys",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 679.724,
    "end": 684.669,
    "text": " for setting up this sort of environment and, you know, inviting a stranger like me to talk to you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 685.329,
    "end": 688.132,
    "text": "It's very courageous intellectually and I applaud it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 691.975,
    "end": 698.702,
    "text": "And I hope to repay the kindness by engaging in a discussion for the purposes of clarification, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 698.942,
    "end": 699.823,
    "text": "That's what we're here for.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 702.927,
    "end": 727.345,
    "text": " okay so you know i i i think in linkedin now i have myself a scientist and inventor and i'm starting i think i'm going to flip it i'm going to say inventor and scientist because i'm the older i get the more i think that invention is better than science first of all it's been around before us right and some people claim that the fire made us right and we didn't invent fire it wasn't invented by homo sapiens",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 728.271,
    "end": 733.553,
    "text": " And so invention has been before humans and probably will be after humans are around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 734.573,
    "end": 734.773,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 735.093,
    "end": 738.214,
    "text": "And and so I've done I worked in many different things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 738.954,
    "end": 743.036,
    "text": "And so I've done I have a patent for an underwater periscope.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 744.316,
    "end": 750.198,
    "text": "When you are at the bottom of a pool, when you look up, you see that you see that circle that's called snail's window.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 750.718,
    "end": 756.1,
    "text": "The whole world, the whole above surface world has been compressed into that circle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 756.641,
    "end": 761.885,
    "text": " and distort it, but you can see with the shading, right, that you can pick up pieces of the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 761.985,
    "end": 767.069,
    "text": "And so if you have a polarized camera, you could reconstruct this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 769.491,
    "end": 773.795,
    "text": "So it's this idea of reconstructing, right, what's beyond that I find it interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 774.535,
    "end": 784.163,
    "text": "And I've worked in, I trained as a physicist, but I trained, you know, I've been always interested in the marriage of mathematics and exact stuff.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 784.898,
    "end": 786.539,
    "text": " with a very physical problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 786.599,
    "end": 797.282,
    "text": "So for my PhD, I worked on superfluid film vortices on a torus, and I found a theorem of Riemann that had no application of quantum mechanics until this problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 799.362,
    "end": 802.043,
    "text": "Okay, so let's get to the meat of the problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 802.923,
    "end": 804.844,
    "text": "So the principal agent monitoring problem.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 804.864,
    "end": 806.845,
    "text": "So this is a problem as old as a hill.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 806.945,
    "end": 814.467,
    "text": "So it appears in Plato's Republic, and some people call it the allegory of the ship of fools, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 815.18,
    "end": 840.292,
    "text": " so there is a ship owner who has a crew of sailors and you know they're kind of rowdy sailors plato says that they may be drunk and among them there's a philosopher king who's plato himself right and uh and but the owner you know doesn't know how to pick the sailors right the owner just owns the ship doesn't have any ability that's why the owner has hired sailors",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 841.448,
    "end": 865.258,
    "text": " so if you are an a a principal and you hire somebody to do the job for you either you're lazy or stupid and you don't want to do it yourself so you have this monitoring problem how do you monitor that you know how do you do how do you monitor work that you don't want to do or don't or don't know how to do does everybody get that the paradox there",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 868.962,
    "end": 874.729,
    "text": " And so Plato's answer is democracy is no way to do this, because there can be factions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 876.372,
    "end": 883.081,
    "text": "Part of the crew can have a faction, and you're not going to pick the best captain if you have people vote for who the best captain is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 883.161,
    "end": 886.305,
    "text": "So Plato used this to attack democracy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 888.996,
    "end": 916.384,
    "text": " but this kind of goes this is counterintuitive right we know that that that group right that groups are better for us right that ensembles help us survive better right so there's this tension in western civilization between the sphere of the mob right and this thing about the unitary right philosopher king that's going to be the dictator so who's going to rule us is it going to be the philosopher king dictator or is it going to be the mob",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 917.842,
    "end": 919.203,
    "text": " So there's this constant tension.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 921.345,
    "end": 930.031,
    "text": "So I came up with this problem because I'm one of the hundreds of scientists that have made speech recognition possible on your phone right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 930.912,
    "end": 932.873,
    "text": "I used to work for Dragon NaturallySpeaking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 933.994,
    "end": 944.922,
    "text": "And Dragon NaturallySpeaking, if you go into Wired Magazine and look at the highlights of machine translation, the founding of Dragon Systems in Newton, Massachusetts,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 945.834,
    "end": 974.933,
    "text": " in the 80s is considered to be a pivotal moment because you know the dragon systems went on to create uh the first uh continuous speech recognition product on the desktop and and the way that speech recognition was developed was as people may know from machine learning was by having data sets and one of them was people reading the wall street journal and then that being transcribed with all the mistakes that people made and the hooms and the haas",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 975.586,
    "end": 1002.309,
    "text": " and so forth right but after you know five or or six years you know the wall street journal uh corpus became very important as a benchmark and so people started realizing well you know i'm being graded incorrectly in this transcription but i actually it's the official transcription that's wrong and so why don't we just redo it right and so they went through the whole corpus and they redo they spent the money to do it better",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1003.667,
    "end": 1032.072,
    "text": " and so they so every test from then on writing the software had the old benchmark with the mistakes so that you could still benchmark all papers and then the new benchmark and i said who's checking the new benchmark right it's the principal agent monitoring problem right who checks the experts how do we know that this last transcription doesn't have any mistakes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1035.669,
    "end": 1038.09,
    "text": " Then a second moment in my professional life.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1038.13,
    "end": 1040.712,
    "text": "I'm a lecturer at UMass Amherst in physics, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1041.192,
    "end": 1042.112,
    "text": "Physics 101.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1042.833,
    "end": 1044.614,
    "text": "I have to lecture 500 students.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1045.294,
    "end": 1050.377,
    "text": "The only way to do this is to give them multiple choice exams, bubble sheet answers, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1050.437,
    "end": 1056.76,
    "text": "That I then collect with the proctors at the end of the exam and take to the back of the room and feed into an optical scanner.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1057.862,
    "end": 1065.684,
    "text": " I won't describe to you everything that I did and I was told to do to randomize the test in the room.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1066.944,
    "end": 1075.186,
    "text": "OK, but it led me to sometimes when I was feeding those exams to say, why do I need to feed the first sheet, the answer key?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1076.507,
    "end": 1081.208,
    "text": "Why can't I use the wisdom of the crowd to grade the exam?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1085.862,
    "end": 1104.915,
    "text": " And then finally, the thing that actually got me into the mathematics of actually doing this was in 2008, I started working in UMass Amherst in the computer science department with Howard Schultz doing digital elevation models from multiple maps that were done from aerial photographs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1105.195,
    "end": 1106.857,
    "text": "So how do you combine these things?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1107.057,
    "end": 1108.918,
    "text": "There's so much data now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1109.498,
    "end": 1111.76,
    "text": "This is the problem that we have, so much data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1112.816,
    "end": 1116.519,
    "text": " How do you combine it and not prevent the noise from corrupting it?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1117.801,
    "end": 1125.387,
    "text": "And then finally, the 2010 patent by Data Engines on error independent model solution, which, as I'm going to tell you, has disappeared.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1125.407,
    "end": 1127.429,
    "text": "The patent is null and void.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1127.99,
    "end": 1129.591,
    "text": "There can be no patents on postulates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1129.611,
    "end": 1131.553,
    "text": "You cannot patent natural loss.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1134.716,
    "end": 1137.999,
    "text": "So I'm telling you the history of my business failure, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1141.77,
    "end": 1169.879,
    "text": " okay so so this is the paper that was on uh you know the the geometric uh let me get the laser pointer the geometric precision error right for computer vision tasks and basically the the idea there is that you you have a bunch of maps okay and you're and i'm plotting here the error covariance matrix between the different maps",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1170.794,
    "end": 1185.879,
    "text": " And the way that my boss, Howard Schultz, did the maps, he did it so that he took advantage of the fact that when you have a photograph A and photograph B, when you match features in A to B, you can go this way, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1186.119,
    "end": 1188.38,
    "text": "One way, an arrow, but you can also go the other way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1189.48,
    "end": 1191.321,
    "text": "And that matching is not symmetric.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1193.381,
    "end": 1197.783,
    "text": "So he wanted to take advantage of that non-symmetry to discover blunders.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1198.817,
    "end": 1201.739,
    "text": " And he did so, and he was able to show that he got rid of blunders.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1202.319,
    "end": 1204.72,
    "text": "But he went on to continue using the maps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1205.301,
    "end": 1208.523,
    "text": "And everybody told him, Howard, why are you doing that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1208.603,
    "end": 1210.744,
    "text": "Those maps are really correlated, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1210.784,
    "end": 1212.745,
    "text": "That's A to B and B to A matching.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1212.765,
    "end": 1214.806,
    "text": "And he said, yeah, but why not?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1214.866,
    "end": 1215.927,
    "text": "They have some information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1216.94,
    "end": 1241.948,
    "text": " and so eventually i was able to prove that he was right and this is what i'm showing here is is where i have a model where i just assume that everybody's zero and all and i've induced a signal if you're a physicist you know what i'm talking about right because i have these two pair to these two maps that i know have been correlated or highly correlated and i'm introducing them there with other maps that are not so correlated",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1243.22,
    "end": 1246.881,
    "text": " So it's like I'm putting an injection, right, a modulating signal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1247.501,
    "end": 1250.582,
    "text": "And this recovery here was with compressed sensing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1251.683,
    "end": 1258.365,
    "text": "And you see how without being told that along the diagonal there's a strong structure, it's able to pick it up.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1260.665,
    "end": 1260.865,
    "text": "Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1261.006,
    "end": 1261.846,
    "text": "So sparsity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1262.086,
    "end": 1268.708,
    "text": "If the errors are sparse enough, you can discover the error, the precision error between regressors.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1270.146,
    "end": 1274.748,
    "text": " So even though today I will talk mostly about classification, everything applies to regression too.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1276.908,
    "end": 1279.369,
    "text": "And here's the crux of the issue, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1279.549,
    "end": 1284.871,
    "text": "That the way to do this is to basically get rid of reality.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1286.351,
    "end": 1288.572,
    "text": "This is the way that you get rid of representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1289.87,
    "end": 1290.05,
    "text": " Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1290.891,
    "end": 1295.073,
    "text": "If I have a model, why don't I subtract a true value from the model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1295.113,
    "end": 1297.634,
    "text": "Whatever remains is the error.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1298.194,
    "end": 1301.075,
    "text": "And so I'm just going to talk about that today in terms of classification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1302.896,
    "end": 1308.039,
    "text": "OK, we can stop here if people want to ask questions, because the next theme is going to be data streaming.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1310.64,
    "end": 1312.421,
    "text": "Yeah, I have a few comments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1312.561,
    "end": 1316.883,
    "text": "Jakob, you want to go first, though?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1317.043,
    "end": 1317.503,
    "text": "Yeah, sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1320.834,
    "end": 1343.13,
    "text": " was wondering if there if you have been thinking about i guess a measure to quantify how uh how much information is lost or can be lost when using a particular benchmark uh because the way it sounded like when you were talking about it is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1344.033,
    "end": 1350.555,
    "text": " I guess, similar to the notion of, well, all models are a coarse graining of the particular thing we're modeling.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1350.615,
    "end": 1365.98,
    "text": "Therefore, every benchmark is going to have this problem of who is watching the benchmark or who's checking that the benchmark itself is correct, which is a, I suppose, inescapable problem.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1366.22,
    "end": 1368.24,
    "text": "We cannot escape it as a civilization, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1368.32,
    "end": 1370.081,
    "text": "Nobody knows what the answer key is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1371.73,
    "end": 1396.021,
    "text": " right there is no dictator that we can go to as a civilization as a society it's inescapable right we're always benchmarking to something else there is nothing but benchmarking to something else right am i am i crazy here or can i get an almond right nothing but difference",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1397.014,
    "end": 1423.02,
    "text": " yes nothing but gradient unity is yes at minimum two yes right that is the only thing that we have to observe and that's a statement of relative relativity in physics too right that we cannot observe a absolute velocity we can only observe relative velocity between particles it's the same thing for measurement it's no different yeah",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1423.843,
    "end": 1425.243,
    "text": " a few other comments.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1425.263,
    "end": 1435.766,
    "text": "So the back and forth, keeping the back and forth directions being fit and how that contains information on blunders like you described.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1436.066,
    "end": 1451.631,
    "text": "And then another subtle pattern is in the matrix, one slide previously, in the cells that were too off diagonal, yep, there's a slight positive correlation that's transmitted",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1453.675,
    "end": 1457.76,
    "text": " spuriously, potentially amplified through compressed sensing and distorted and so on,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1459.226,
    "end": 1470.734,
    "text": " there's also ripples of underlying even trivially analytical square correlation matrices empirically plus noise plus compressed sensing have these attributes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1471.615,
    "end": 1486.506,
    "text": "And that is what puts so much of the experimental design and attention interpretation onus onto the cognitive entity as hardly this or any data speak for itself.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1487.867,
    "end": 1488.047,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1489.178,
    "end": 1489.418,
    "text": " Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1491.601,
    "end": 1494.365,
    "text": "Yes, I have to agree with you, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1494.625,
    "end": 1498.971,
    "text": "We have to distinguish here there is no magic and there is no metaphysics here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1499.932,
    "end": 1503.216,
    "text": "There is only a measurement, which is a statistic of a sample.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1504.198,
    "end": 1507.522,
    "text": "And therefore, it's impossible for you to generalize it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1511.458,
    "end": 1513.138,
    "text": " It's not an intrinsic property here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1513.218,
    "end": 1524.943,
    "text": "If I'm telling you that this is the error correlation in those maps, I'm telling you that that's the error correlation for that particular collection and for those particular maps, not for the algorithm in the future or in the past.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1525.003,
    "end": 1530.145,
    "text": "I'm telling you something about the test that you just took, period, end of story.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1530.685,
    "end": 1531.305,
    "text": "Nothing else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1531.385,
    "end": 1535.227,
    "text": "If you want to ascribe meaning to that, go ahead.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1535.767,
    "end": 1537.348,
    "text": "But then you're incurring that",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1538.283,
    "end": 1542.865,
    "text": " right, that cognitive, you're the one who's now becoming the dictator, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1543.345,
    "end": 1549.968,
    "text": "The bucket is stopping with you because you've decided to assume that that measurement meant X about the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1552.93,
    "end": 1553.27,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1553.93,
    "end": 1560.573,
    "text": "When you undertake the epistemic quest, then you're the principal epistemic agent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1561.233,
    "end": 1563.174,
    "text": "And that's an N equals one situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1563.734,
    "end": 1565.975,
    "text": "Another, I think, interesting touch point is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1567.461,
    "end": 1592.004,
    "text": " hierarchical predictive processing models which we talk about a lot in inactive inference they have a highest level prior and if that is going to be also learnt over updated there's going to be a hyper prior on that so that's one aspect where there's just the buck stopping at a point from a hierarchy perspective and then also um even with just the gaussian",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1592.765,
    "end": 1620.233,
    "text": " the bell curve with the mean and the variance but there's not a variance on the variance that is what gets collapsed that's the metacognitive and that degree of freedom is what constrains and makes models go stale and makes them over generalize without being aware yes and i want to i'm going to address that one here because i'm going to talk about measuring error correlation independent model being able to measure empirical error correlation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1620.905,
    "end": 1628.038,
    "text": " Now, whether you want to generalize that because you have some view of how to base and generalize it or not, that's a separate issue, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1628.438,
    "end": 1633.828,
    "text": "But being able to at least benchmark the actual correlation on the test",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1634.485,
    "end": 1639.207,
    "text": " so that then you can have those cognitive models and those epistemic models that can have that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1639.867,
    "end": 1640.787,
    "text": "Let's make the analogy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1641.207,
    "end": 1644.129,
    "text": "Your car has a computer in its engine, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1644.489,
    "end": 1645.949,
    "text": "And it also has a thermometer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1646.469,
    "end": 1655.933,
    "text": "What I'm going to talk about today is about how to build a thermometer that helps the car's computer run the engine better, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1656.473,
    "end": 1661.515,
    "text": "And all I'm saying really comes down to that, that wouldn't it be great",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1662.122,
    "end": 1668.085,
    "text": " If intelligent minds had a thermometer for intelligence, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1668.125,
    "end": 1671.567,
    "text": "Because then the thermometer just tells you that the car is overheating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1672.308,
    "end": 1673.408,
    "text": "It doesn't tell you why.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1674.749,
    "end": 1676.61,
    "text": "You need a cognitive process, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1677.29,
    "end": 1678.191,
    "text": "To figure that out.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1678.991,
    "end": 1680.892,
    "text": "Oh, it's because a piston is blowing, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1681.012,
    "end": 1682.573,
    "text": "Or the oil went down, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1682.753,
    "end": 1684.094,
    "text": "That's a separate issue, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1684.554,
    "end": 1691.518,
    "text": "But knowing that something is wrong by overheating with a thermometer is golden, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1692.358,
    "end": 1700.36,
    "text": " And I want to get to that rock of having a thermometer that I don't have to worry about representation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1701.5,
    "end": 1703.341,
    "text": "It just gives me a measurement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1704.301,
    "end": 1707.262,
    "text": "I'll deal with the fact of what it means, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1707.422,
    "end": 1713.603,
    "text": "But I just don't want to worry about what that measurement is, or I want to reduce it as much as possible.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1714.303,
    "end": 1721.965,
    "text": "So it may sound weird, but you would want a tool that strips epistemology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1722.705,
    "end": 1726.427,
    "text": " from checking the logical consistency of your evaluation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1729.589,
    "end": 1731.891,
    "text": "So that you can aid the epistemic agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1733.051,
    "end": 1734.112,
    "text": "And so I'm right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1734.132,
    "end": 1742.497,
    "text": "This is the thing that I find weird and fascinating here that I'm going to propose to you that what we need to do is strip epistemology.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1743.238,
    "end": 1745.999,
    "text": "And I'm going to do that, you know, continuing on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1747.44,
    "end": 1749.922,
    "text": "And so let me now start talking about that, OK?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1752.62,
    "end": 1753.44,
    "text": " So data streaming.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1753.48,
    "end": 1755.441,
    "text": "So you guys talked about sparsity, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1756.601,
    "end": 1763.763,
    "text": "So the way that I encountered data streaming was with a good Turing smoothing algorithm in speech recognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1764.583,
    "end": 1774.725,
    "text": "At Dragon Systems, they gave us a book written by, gosh, how can I forget his name?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1775.346,
    "end": 1776.646,
    "text": "Our research director.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1777.446,
    "end": 1780.887,
    "text": "And he had good Turing smoothing, frequency smoothing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1781.661,
    "end": 1786.785,
    "text": " Can I get a count of how many people know about what this is or know what data streaming is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1787.506,
    "end": 1790.628,
    "text": "Is this something that you guys know very well as a community?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1793.731,
    "end": 1796.773,
    "text": "Give a description that sets it up for how you want to talk about it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1797.694,
    "end": 1797.954,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1798.635,
    "end": 1809.163,
    "text": "So the way that the typical data streaming algorithm and the way that it gets presented is that it's a method for minimizing memory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1809.975,
    "end": 1834.632,
    "text": " when you want to compute statistics of a of a stream and so the prototypical simplest cases you have a stream of numbers that are coming down the the pike right and you want to keep uh and at any moment i want you to tell me what the average of those numbers are so the memory intensive way to do it is to store all the numbers right and whenever you a query gets made",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1835.552,
    "end": 1863.207,
    "text": " take the average of those numbers right the whole list but of course as the as the stream increases right that list is going to balloon and become humongous so the the philosophy of data streaming is is don't do that just keep two numbers have a sum so every time you get a number increment the sum and then have a counter of how many numbers you've seen and then the average is just the sum divided by the number",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1864.528,
    "end": 1864.688,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1864.728,
    "end": 1869.93,
    "text": "So just having two numbers, two integer counters or two real numbers, whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1870.01,
    "end": 1870.21,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1870.41,
    "end": 1875.652,
    "text": "You can store and at any time compute a stream that may be a billion long.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1878.653,
    "end": 1880.273,
    "text": "So that's the purpose of data streaming.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1880.333,
    "end": 1880.533,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1880.974,
    "end": 1885.195,
    "text": "To compress you, you take a data sketch, as it's called.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1885.842,
    "end": 1891.687,
    "text": " which is a compressed version of all the events that you've observed in the data stream, in all the richness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1891.827,
    "end": 1892.708,
    "text": "But you're not doing that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1893.188,
    "end": 1896.591,
    "text": "You're just taking the events and you're doing some sort of compression on it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1897.692,
    "end": 1899.033,
    "text": "And you're keeping that statistic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1899.093,
    "end": 1904.618,
    "text": "And then at the end, when people ask you, you say, oh, this is the average that I've observed so far.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1906.161,
    "end": 1934.14,
    "text": " so for a good touring smoothing got invented by alan turing during world war ii because i don't know if you know that he was responsible for the enigma machine breaking right in world war ii and you know they had they started to you know alan turing was a very good mechanical dude he actually built a tide predicting machine way before computers or he did any of the stuff that he was doing you know uh as he's known very abstractly right",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1934.853,
    "end": 1945.262,
    "text": " He was very much hands-on, and he helped build the bomb, which were early computers that were processing the German traffic that day and trying to decode it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1947.184,
    "end": 1948.245,
    "text": "They had to work all day.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1948.305,
    "end": 1951.407,
    "text": "These bombs were continually churning, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1953.109,
    "end": 1956.492,
    "text": "This is the Enigma machine, by the way, recently found in a flea market.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1956.512,
    "end": 1959.314,
    "text": "$15,000 if you find this machine.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1960.335,
    "end": 1962.317,
    "text": "So it had these very complicated rotors, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1963.326,
    "end": 1987.206,
    "text": " and so these these are the bombs and they had a lot of uh women assistants right back when when computers were woman right before uh you had the grace allen and so forth right and so uh this you had to send people home at the end of the day when did you stop you don't know how many a secret rotor settings were done that day",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1988.504,
    "end": 2012.721,
    "text": " when do you stop when do you decide that you've done enough processing and there's no big chunk of German traffic that you've missed so he came up with good touring smoothing which was how many rotors settings have we not seen which is a crazy statistic if you think about it right what do you mean how many things have you not seen",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2015.647,
    "end": 2018.408,
    "text": " And so he was able to do it by shifting, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2018.448,
    "end": 2023.991,
    "text": "By saying, well, there's many orders for which we've seen only one message, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2024.831,
    "end": 2029.653,
    "text": "And there's fewer orders settings for which we've seen two messages, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2030.253,
    "end": 2040.978,
    "text": "And so if you look at how many messages were per rotor setting, which now biologists use to figure out how many species they miss in a survey.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2042.04,
    "end": 2047.343,
    "text": " You can then know how to shift the mass to the zero frequency observation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2048.524,
    "end": 2051.325,
    "text": "You take a little bit of probability from everything and shift it down.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2052.346,
    "end": 2059.37,
    "text": "And can you believe that this is still one of the provable best ways of doing this, estimating unknown frequencies?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2060.651,
    "end": 2066.154,
    "text": "Alan Orlarski from UC San Diego has been doing some of the modern work on understanding good Turing smoothing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2067.294,
    "end": 2070.176,
    "text": "Notably, it doesn't get used nowadays in neural networks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2070.572,
    "end": 2074.176,
    "text": " Because neural networks never have any missing data.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2074.336,
    "end": 2076.699,
    "text": "They will always give you an answer, even if it's wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2078.281,
    "end": 2083.367,
    "text": "Or Linsky in this paper, which was published in NeurIPS, argues that that's wrong and you should go back to doing what it does.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2083.567,
    "end": 2084.548,
    "text": "But we're not going to go into that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2086.23,
    "end": 2087.412,
    "text": "Can I make a comment there?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2088.113,
    "end": 2088.253,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2089.953,
    "end": 2113.571,
    "text": " um this reminds me of the distinction with parametric and non-parametric statistics and when people talk about how many parameters this model has neural network transformer what have you it's a parametric model that's why they're talking about how many parameters there are and non-parametric methods although that's kind of like saying the non-elephant animals kind of classic joke",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2114.412,
    "end": 2130.835,
    "text": " It's also like a very open and procedural space where there can be a lot of methods such as shuffling and leaving one out, all these different statistical methods that may have less power or less of some statistical positive capacity",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2131.616,
    "end": 2145.302,
    "text": " in the case where the generated data, for example, are known to be from a Gaussian error distribution, but under relaxed assumptions about variant structure, then non-parametric statistics can do well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2146.523,
    "end": 2155.947,
    "text": "Yes, and heuristics must be something that biological systems use a lot, right, instead of exact computation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2157.771,
    "end": 2168.655,
    "text": " I would mitose that statement into two, which the first statement I'm most comfortable with is we can model biological agents as using heuristics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2169.496,
    "end": 2172.237,
    "text": "We can model anything as using heuristics in our...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2173.337,
    "end": 2192.727,
    "text": " finiteness as cognitive modelers so if we say we're restricting ourselves to an eight parameter model or to this kind of genre of model for this phenomena it's a map territory distinction now as to whether the territory uses heuristics whether you can really say does a bacterium or does a squirrel use heuristics",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2193.267,
    "end": 2194.287,
    "text": " That is a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2194.467,
    "end": 2195.488,
    "text": "What are those heuristics?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2195.888,
    "end": 2205.131,
    "text": "But the first question, which I feel most strongly about, is that we can say that we'll choose to use heuristics in modeling complex behavior.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2205.611,
    "end": 2206.011,
    "text": "Why not?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2206.391,
    "end": 2209.172,
    "text": "How can that be not the case?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2210.552,
    "end": 2210.852,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2212.693,
    "end": 2213.253,
    "text": "I'll grant you that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2215.403,
    "end": 2217.684,
    "text": " Because I don't have actual experimental, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2217.804,
    "end": 2224.746,
    "text": "I mean, to be precise, right, scientifically, you're asking for a particular demonstration of our heuristic and our biological system, and I don't have that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2225.387,
    "end": 2228.928,
    "text": "I only have an aspirational statement that maybe it does happen, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2230.668,
    "end": 2238.771,
    "text": "Okay, so the thing that I want to do here and the problem that I'm trying to solve, again, is not necessarily procedurally what's happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2238.811,
    "end": 2244.513,
    "text": "We know that us in the world are not completely isolated from the world, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2245.56,
    "end": 2255.408,
    "text": " But what I want to think about is the Gedanken extreme where you're isolated and paranoid, which does occur in certain technological realms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2255.448,
    "end": 2258.05,
    "text": "It doesn't have to be a mental paranoia, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2258.55,
    "end": 2265.155,
    "text": "So, for example, a self-driving car that wants to check its pedestrian detectors immediately, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2266.096,
    "end": 2269.539,
    "text": "That immediacy, right, means isolation, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2269.579,
    "end": 2273.222,
    "text": "It can't wait to get the feedback by actually touching something, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2273.968,
    "end": 2277.049,
    "text": " or get further information moving forward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2277.789,
    "end": 2280.61,
    "text": "And, you know, it's close, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2280.63,
    "end": 2287.071,
    "text": "It can only rely on its own things because unlike a Roomba, right, it can't be bumping into pedestrians.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2287.551,
    "end": 2297.534,
    "text": "It cannot get feedback any other way other than this mechanism that it's decided to do whatever it is for pedestrian detection, which could be sonar or could be visual.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2298.846,
    "end": 2305.347,
    "text": " So I think of it as an extreme that I want to solve to understand what are the limits of what can be done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2306.668,
    "end": 2310.828,
    "text": "OK, not because we are actually need to be in that realm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2312.589,
    "end": 2319.35,
    "text": "And so I want to I wanted to build certain features into it, right, because I was using this in speech recognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2320.19,
    "end": 2323.851,
    "text": "And one of the things that I wanted to do was to make it simple.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2323.971,
    "end": 2327.732,
    "text": "And so I wanted to treat all the members of the example as black boxes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2328.76,
    "end": 2330.82,
    "text": " So I don't want to go inside your brain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2331.04,
    "end": 2339.662,
    "text": "I don't want to go and get readings of internal parameters in models, which is not wrong, mind you, again, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2340.222,
    "end": 2345.043,
    "text": "To come back to the analogy of the thermometer and the computer in a car engine, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2345.063,
    "end": 2346.544,
    "text": "You can have intelligent things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2347.584,
    "end": 2349.784,
    "text": "And a lot of people do neural networks, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2349.824,
    "end": 2355.625,
    "text": "And they inspect internals to try to figure out, right, how to detect when it's actually hallucinating.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2356.466,
    "end": 2358.366,
    "text": "There's nothing wrong with that, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2359.119,
    "end": 2363.002,
    "text": " But I'm saying that it itself is then going to bring assumptions that I can't check.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2363.562,
    "end": 2363.682,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2363.722,
    "end": 2364.623,
    "text": "So I don't want to do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2365.283,
    "end": 2367.344,
    "text": "I want to treat everything as a black box.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2367.805,
    "end": 2375.01,
    "text": "I just want to see what the decisions are from the Oracle or whether that Oracle will be a person or function or whatever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2375.19,
    "end": 2375.39,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2376.07,
    "end": 2376.911,
    "text": "And I don't want to go.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2376.931,
    "end": 2378.412,
    "text": "I don't want a theory of mind.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2381.747,
    "end": 2389.11,
    "text": " The other thing that I want to do, and here's the crucial thing, right, is I want finite chains of safety validation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2390.071,
    "end": 2392.392,
    "text": "I don't want to use Bayesian models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2392.472,
    "end": 2393.972,
    "text": "I don't want to use probability.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2394.813,
    "end": 2401.336,
    "text": "Because like you just mentioned, Daniel, those are hyperparameters, which are encoding information about the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2402.776,
    "end": 2408.679,
    "text": "And the whole point about being paranoid is that I cannot, right, I cannot rely on that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2409.213,
    "end": 2411.594,
    "text": " I cannot rely on any representational knowledge.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2412.254,
    "end": 2412.934,
    "text": "I don't want to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2414.774,
    "end": 2415.895,
    "text": "To avoid that pitfall.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2418.135,
    "end": 2422.436,
    "text": "And so by going to sample statistics, that's how I'm going to avoid that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2425.257,
    "end": 2427.217,
    "text": "Because I'm not going to talk about distributions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2427.257,
    "end": 2430.118,
    "text": "I'm not going to infer anything about the future or the past.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2430.718,
    "end": 2435.079,
    "text": "I'm just going to tell you a number about something that already happened.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2436.92,
    "end": 2444.967,
    "text": " And since it's a sample statistics, right, I'll be able to then do the magic that I do, which is to create a complete set of postulates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2445.527,
    "end": 2450.631,
    "text": "So then I can prove that you could be in states that are probably wrong or inconsistent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2452.713,
    "end": 2462.321,
    "text": "And and so that's the punch line, right, that I can do both of these things of being isolated and Gedanken, right, and paranoid by just",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2464.085,
    "end": 2488.519,
    "text": " having functions that only use statistics of the decisions by the ensemble members nothing else let's stop here because this is an important point right this is a design choice right that i'm making could you um unpack that a little further i'm not sure i fully understand",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2489.551,
    "end": 2515.062,
    "text": " how samples using sample statistics differs from conceptually from using say bayesian probability on your data so would would you agree that there's the concept of sample statistics and then you know distribution statistics right and things like that right that you can always define a sample statistics and actually compute it if you knew what the sample was",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2516.73,
    "end": 2518.031,
    "text": " So that's what I'm talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2518.831,
    "end": 2520.392,
    "text": "That's what I mean by sample statistics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2520.432,
    "end": 2524.895,
    "text": "And then I mean by, so what would it be?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2525.015,
    "end": 2530.938,
    "text": "It would be something like if you have data being produced by a Gaussian distribution, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2531.058,
    "end": 2534.78,
    "text": "A sample statistic would be the mean of what was produced, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2536.101,
    "end": 2538.062,
    "text": "That has meaning, that exists, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2538.102,
    "end": 2540.423,
    "text": "Independent of what meaning you want to ascribe to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2541.003,
    "end": 2545.326,
    "text": "Whether you want to think that it's the mean of the actual Gaussian distribution, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2546.505,
    "end": 2548.447,
    "text": " That's a separate thing, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2549.127,
    "end": 2558.015,
    "text": "Using that data and using that mean to then estimate what is the mean of the Gaussian distribution that produced it is a completely different task.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2560.838,
    "end": 2561.078,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2561.919,
    "end": 2562.159,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2562.719,
    "end": 2565.682,
    "text": "So for one, the data may not have been produced by a Gaussian.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2568.15,
    "end": 2574.172,
    "text": " This issue, just to connect it to like what we talk about with variational or just Bayesian inference and active inference.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2575.132,
    "end": 2579.154,
    "text": "Let's just say in the room, the temperature is continuously variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2579.874,
    "end": 2583.435,
    "text": "But then the thermometer is going to be integers.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2584.395,
    "end": 2588.837,
    "text": "And then the agent is only capable of coarse graining into buckets of 10.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2590.39,
    "end": 2613.568,
    "text": " we can still talk about only cares because of you know a precision uh engineering spec right why am i being uh uselessly precise right yeah yeah variable precision to promote system properties is definitely a corollary of this kind of a framework more broadly like getting stability",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2614.952,
    "end": 2618.197,
    "text": " getting rid of the representation question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2618.818,
    "end": 2622.102,
    "text": "This is like hierarchical predictive processing of visual.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2622.803,
    "end": 2630.314,
    "text": "And so at the earlier lower levels, and this phenomenon is recapitulated in silico, as well as in aspects of biological systems.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2631.215,
    "end": 2637.659,
    "text": " that the earlier layers pick out less abstract components like edges and on and off.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2638.1,
    "end": 2655.912,
    "text": "And then not that it's clean, but that at each synaptic interval, which can be modeled as actually means and variances and differentials in the hierarchical predictive processing architecture, that can be modeled as like a kind of like representation explained away.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2656.592,
    "end": 2660.415,
    "text": "You know, where's the rom-com in this pattern of neural activity?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2661.415,
    "end": 2664.938,
    "text": " And then it's just very interesting that you brought up, of course, the engineering setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2665.338,
    "end": 2675.385,
    "text": "Predictive coding, which is to say difference in coding, was discovered slash invented in the video compression setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2676.306,
    "end": 2689.055,
    "text": "And yet in the Rao and Ballard 1999 work and so on, it came to be understood as a more general property of how information transmission and so on",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2690.33,
    "end": 2699.093,
    "text": " in certain settings led to certain parsimonies that has certain relationships with things like the Kalman filter and predictive coding.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2700.673,
    "end": 2705.814,
    "text": "So you and Jacob have mentioned this thing about a transmission of information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2706.975,
    "end": 2709.095,
    "text": "So I'm not going to go into it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2709.135,
    "end": 2710.356,
    "text": "There's so much to talk about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2710.436,
    "end": 2711.916,
    "text": "I've been working on this for a decade.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2713.157,
    "end": 2717.478,
    "text": "The difference between the observed responses gives you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2718.955,
    "end": 2725.817,
    "text": " something about the test, but also something about the quality of the person who answered the test.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2726.597,
    "end": 2732.659,
    "text": "The uninformative person who answered the test doesn't transmit anything about how they performed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2733.319,
    "end": 2737.241,
    "text": "The random guesser only transmits information about the test.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2740.221,
    "end": 2745.543,
    "text": "If I randomly guess what A and B are, right, I'm going to have",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2745.922,
    "end": 2749.423,
    "text": " the right proportion of A and B as the test itself.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2749.443,
    "end": 2751.143,
    "text": "It's going to be in the wrong places.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2753.384,
    "end": 2755.144,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2755.464,
    "end": 2758.445,
    "text": "But you're transmitting the difference between the A's and the B's.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2759.045,
    "end": 2761.746,
    "text": "And so there is no magic here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2762.206,
    "end": 2771.508,
    "text": "If the ensemble is made of stupid agents, they are not able to transmit via their aligned responses any information that allows you to grade them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2772.408,
    "end": 2774.769,
    "text": "So my method has blind spots.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2776.896,
    "end": 2777.937,
    "text": " There is no magic here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2778.117,
    "end": 2783.902,
    "text": "If your ensemble is made up of stupid members that don't have any information, you're not going to get anywhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2785.364,
    "end": 2797.154,
    "text": "What do you think about an ant colony where none of the nest mates know about how many seeds that they have and how many nest mates need what and how much rain there is outside and the rate of information and blah, blah, blah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2797.594,
    "end": 2798.595,
    "text": "But they don't know any of that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2798.735,
    "end": 2800.597,
    "text": "They're just using their local interactions.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2800.917,
    "end": 2804.06,
    "text": "I actually have a couple of books on ants and ant colonies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2804.759,
    "end": 2807.801,
    "text": " And I saw that you wrote a paper on ant colony behavior.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2807.841,
    "end": 2811.884,
    "text": "I'm very interested in thinking about that, but we're not going to be able to talk about that, OK?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2812.224,
    "end": 2812.624,
    "text": "Fair enough.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2814.205,
    "end": 2814.465,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2815.146,
    "end": 2821.33,
    "text": "So I'm interested in the comment you made about RAU, too, general information.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2823.431,
    "end": 2826.073,
    "text": "So data streams as NTQR tests, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2826.113,
    "end": 2828.955,
    "text": "So we're going to look at binary classification, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2829.055,
    "end": 2831.516,
    "text": "So down here below, we have the true label, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2831.536,
    "end": 2832.477,
    "text": "So this is a stream.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2833.26,
    "end": 2835.962,
    "text": " So think of this flowing to the right, that gray box.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2836.042,
    "end": 2837.503,
    "text": "Everybody sees that alpha and beta?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2838.244,
    "end": 2841.766,
    "text": "And then I have three different classifiers that are making different decisions, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2842.307,
    "end": 2850.613,
    "text": "So aligned on the first item, the first two classifiers are saying that it's beta, and the third one disagrees and says that it's alpha.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2851.894,
    "end": 2853.015,
    "text": "Everybody with me on this?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2853.235,
    "end": 2860.841,
    "text": "And so what I'm going to do is just collect how many times each of these different patterns occurs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2862.412,
    "end": 2864.073,
    "text": " That's the compression, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2864.473,
    "end": 2867.015,
    "text": "So we could be looking at a test that has a million items.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2867.155,
    "end": 2867.716,
    "text": "I don't care.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2868.376,
    "end": 2870.558,
    "text": "It says I'm doing binary classification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2870.578,
    "end": 2873.38,
    "text": "I only need two to the three eight integers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2874.26,
    "end": 2878.163,
    "text": "So right there we see the compression that's very attractive, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2878.383,
    "end": 2880.064,
    "text": "For in terms of a biological system.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2881.245,
    "end": 2888.17,
    "text": "And because you're not you're not storing the whole stream, you're storing these eight integers that are picking up these patterns.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2889.751,
    "end": 2889.851,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2891.394,
    "end": 2906.959,
    "text": " like i said and like daniel has said right you can digitize to whatever you want in terms of engineering spec you don't want to measure the degree of the temperature of a car to a millionth of a degree it's useless right economically there's no point",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2907.961,
    "end": 2933.532,
    "text": " likewise you may not care too much to worry about you know knowing right you don't care about too much beyond boiling or something like that right you just want to be told hey the car is overheating right you could digitize that that's a safety you're coding in there by choosing the the degradation of digitation you're deciding what is your engineering spec and what is your safety concern okay",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2934.395,
    "end": 2935.536,
    "text": " So I cannot tell you that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2935.836,
    "end": 2940.299,
    "text": "This is an instrument that you have to design and you have to decide what your R is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2941.88,
    "end": 2942.661,
    "text": "Any questions on that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2944.534,
    "end": 2945.634,
    "text": " Yeah, just a few notes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2945.674,
    "end": 2947.135,
    "text": "This is really interesting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2948.115,
    "end": 2957.098,
    "text": "There's the principle of the hash encoding or the kind of lookup table for all the combinations, and then you can do hierarchical nestings.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2958.178,
    "end": 2970.362,
    "text": "And then also, this situation is kind of like the cells in the retina, just speaking coarsely, that there's some false positive and false negative for some activation thresholds.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2971.702,
    "end": 2973.303,
    "text": "And so it's kind of like a retinal...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2974.741,
    "end": 2991.473,
    "text": " display that is getting noisy photons and and also there's there's variability through all of these finite systems variability and finiteness are ever prevalent but the observation is just what it is",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2992.614,
    "end": 3019.432,
    "text": " exactly exactly and and therefore right uh all the problems with philosophy and logic occur because of infinity right if we just accepted that the world is finite but maybe very large right we would solve all sorts of problems right zermelo's axiom of choice is only needed for infinite sets right finite sets everything is is explainable and understandable okay so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3021.445,
    "end": 3042.621,
    "text": " so here i'm going to show you you know eventually you're going to see this this this this is the the set of equations for three classifiers and these are the eight frequencies okay and so these are the complete postulates for error independent classifiers so i'm going to come back to this and make it much simpler than it is right but i just want to show you how",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3043.374,
    "end": 3067.044,
    "text": " you know these frequencies here right there eight of them and i can sort of synthesize right uh assuming that that that that the classifiers have some sort of uh performance right if i just i i randomly pick numbers between one and a hundred and then divided by a hundred to to have these values and then i just plug them back in here and then i get what what the frequencies would have been of how they voted",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3068.573,
    "end": 3072.574,
    "text": " So I'm just trying to show you how these numbers are integers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3073.334,
    "end": 3074.434,
    "text": "There's no probability here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3076.455,
    "end": 3082.736,
    "text": "And then the other thing I want to go back to is something that I think you guys would find interesting from the physicists.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3082.816,
    "end": 3095.059,
    "text": "Renaud was a 19th century French physicist, very famous for building the most precise thermometers of his time, at the time when people were just inventing the concept of temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3095.879,
    "end": 3099.361,
    "text": " And people told him, how do you know that you're measuring anything?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3100.481,
    "end": 3102.502,
    "text": "Temperature is an imaginary concept, dude.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3102.542,
    "end": 3104.723,
    "text": "We don't even believe that there's such a thing as temperature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3105.283,
    "end": 3113.827,
    "text": "And even if you did, you would need to have some sort of theory about how you make errors in your thermometer so that I would believe what your thermometer is saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3114.968,
    "end": 3117.769,
    "text": "And Renault was, screw that, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3118.402,
    "end": 3125.59,
    "text": " He says, are you saying that there is no science without theory, that there can be no purely empirical measurement?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3126.371,
    "end": 3130.475,
    "text": "And he said, no, I'm going to make purely empirical science.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3131.516,
    "end": 3133.258,
    "text": "And so he was a radical empiricist.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3133.538,
    "end": 3136.942,
    "text": "Eventually in the 20th century, we found out that empiricism doesn't work.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3138.158,
    "end": 3167.615,
    "text": " but he basically is going to do what i'm i'm going to show you today and and this is what i did with the maps he took thermometers and just compared them against each other that's all he did and then he looked at the differences right and he's the first one to start talking about the concept of precision as saying yes i can build the most precise thermometers because i can get them to agree to certain amount of figures right",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3168.462,
    "end": 3169.923,
    "text": " And then they start disagreeing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3171.964,
    "end": 3182.328,
    "text": "So even in science, right, there's a concept that you really do not have science until you have disagreement in measurement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3184.209,
    "end": 3186.69,
    "text": "You have to have error in measurement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3187.431,
    "end": 3195.874,
    "text": "If you do not have error in measurement, you either tell me about math and postulates or you don't know what you're doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3196.034,
    "end": 3197.135,
    "text": "Your instruments are stuck.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3198.044,
    "end": 3200.206,
    "text": " You think they have a position that they actually don't have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3200.226,
    "end": 3203.448,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3203.688,
    "end": 3204.369,
    "text": "This is awesome.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3206.969,
    "end": 3231.088,
    "text": " when we have multiple observations going wide that's sometimes called sensor fusion and then when we have the clash of the prediction and the observation and the differential that's found there that's the predictive processing architecture so those are both there's so many motifs but you totally need a minimum of two other otherwise you have like a statistical monad",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3231.829,
    "end": 3235.132,
    "text": " which is really just a pure conceptual object.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3235.592,
    "end": 3245.32,
    "text": "And then one interesting tie in is like, in active inference, as we specify the generative model, the preferences are directly over observations.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3246.966,
    "end": 3253.309,
    "text": " In the extreme case, meaning that the likeliest thing and the preferred thing are one and the same.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3253.909,
    "end": 3258.311,
    "text": "And it's just that it just, you prefer to get that number on the roulette table.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3258.731,
    "end": 3261.853,
    "text": "And every single time your action is confirming that's the case.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3263.466,
    "end": 3269.61,
    "text": " That is one special case that can be set up as well as epistemic, more general epistemic activities.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3270.171,
    "end": 3292.166,
    "text": "But by having the pragmatic value load directly onto observations, like the thermometer reading, not I have a preference for the room to be at 72, but I have a preference for something about the measurements and that direct target rather than the hidden state being the direct target, which leads to a fantastical analysis.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3293.846,
    "end": 3309.751,
    "text": " okay so you guys seem to be uh yeah yes ahead of about thinking about this and how to implement it okay so let me finish with this with the temperature saying that that the reason i came up with upon renault",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3311.801,
    "end": 3339.489,
    "text": " was because that this thing happens in invention all the time right you're not too clever you invent something and you think you're clever but you're not right it's somebody's thought about it before you just don't know it right you're just ignorant and so i said you know somebody must have thought about this somebody must have done something like this and so i went looking for it and so i found this book inventing temperature which has a whole discussion about renault and how he's wrong because he thought that he was doing a metaphysics",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3340.567,
    "end": 3343.53,
    "text": " He thought that he was getting behind the curtain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3344.892,
    "end": 3347.054,
    "text": "That was his philosophical mistake, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3348.055,
    "end": 3353.9,
    "text": "And so I want to pull back from his philosophical mistake and say, no, this is the comment I made earlier to Daniel, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3354.601,
    "end": 3358.385,
    "text": "I am not saying anything about what the reality is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3358.845,
    "end": 3361.828,
    "text": "I'm only telling you an estimate of a sample statistic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3361.868,
    "end": 3362.249,
    "text": "That's it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3362.789,
    "end": 3364.371,
    "text": "How you want to interpret that is up to you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3367.068,
    "end": 3369.289,
    "text": " And I recommend this book because it's great reading, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3369.329,
    "end": 3371.93,
    "text": "Because it's about how you invent physical concepts, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3372.87,
    "end": 3374.23,
    "text": "And the struggle that people went.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3377.891,
    "end": 3391.756,
    "text": "Okay, so now we're getting into the part where I think you guys are going to be interested because I'm going to go back to the digitizing the format for logical consistency because there's two different viewpoints of the same test.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3393.291,
    "end": 3406.719,
    "text": " And one of them, which is the one that I'm choosing to use the NTQR methodology just to have a new word for you to go somewhere else in your mind, is different from the ML binary classification case, which has semantics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3407.38,
    "end": 3413.283,
    "text": "And here's where I want to show to you that the mathematics of the NTQR test is separate from the semantics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3413.403,
    "end": 3417.006,
    "text": "It can be attached to semantics, but they're not the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3417.506,
    "end": 3420.568,
    "text": "So I want to spend some time to make sure that we capture this one, OK?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3423.513,
    "end": 3452.727,
    "text": " so and then the the payoff here is the the realization that you can start to understand it in terms of semantics this is something that a machine could use to binary classify things in the environment okay which is how i thought of at first and how people in machine learning think of it right i have a binary classifier because i'm looking to classify things in the external world i'm looking to be told how many a's and b's there are in the external world",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3454.065,
    "end": 3464.153,
    "text": " But once I pull the rug from under you, I'm going to tell you that exactly the same mathematics can be used to figure out the statistics of correctness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3464.834,
    "end": 3468.417,
    "text": "And that has nothing to do with what A and B means in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3471.6,
    "end": 3478.886,
    "text": "Because it just means that there is some percentage of the questions have A as the right answer and B as the right answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3479.426,
    "end": 3482.769,
    "text": "But who knows where you came from digitizing that format, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3483.374,
    "end": 3512.397,
    "text": " so there doesn't need to be any semantics attached to a and b and i can still calculate what your performance in the total test is so something that can be attached semantically then has the same mathematics in a way that it can be used to check tests about chemistry about philosophy about geology about any subject right you're not doing binary classification you're just correcting grades",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3513.428,
    "end": 3517.991,
    "text": " a test that have two responses per question or three or four.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3518.831,
    "end": 3520.252,
    "text": "That's a general thing, yes?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3521.633,
    "end": 3525.795,
    "text": "Very separate from the specific task of binary classifying things in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3528.723,
    "end": 3537.371,
    "text": " So I'm going to stop and encourage discussion because I want you to get I'm going to show you the differences, too, in how it comes into the mathematics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3537.411,
    "end": 3547.861,
    "text": "But I want to first get if you if just with words, you understand that there is binary classification where the percentage of A's and B's in the test actually means something in the world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3548.781,
    "end": 3551.404,
    "text": "And then there is grading of multiple choice exams.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3552.034,
    "end": 3555.536,
    "text": " where the percentage of A and B has no meaning outside of the test.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3555.636,
    "end": 3565.863,
    "text": "It just means that 10 questions in the exam had A as a correct and 10 had B. But the questions could have been about geology, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3565.883,
    "end": 3567.764,
    "text": "A and B doesn't mean anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3569.721,
    "end": 3579.525,
    "text": " Yeah, just to kind of say it how I'm seeing it, if we look at the output of a statistical test, we might get a vector percentage rain and percentage not rain.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3579.685,
    "end": 3584.047,
    "text": "Bayesian causal model, probabilistic statistical model, percent dog, percent cat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3585.308,
    "end": 3598.113,
    "text": "In contrast, we have a different procedural non-parametric approach that can be designed incrementally to discard various aspects of information",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3599.648,
    "end": 3603.45,
    "text": " Especially in a discrete finite space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3604.811,
    "end": 3614.857,
    "text": "Taking kind of the finitest perspective on modeling and then using that to say, well, I am core screening into this many cells, so I am going to have this many hash codes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3615.437,
    "end": 3617.919,
    "text": "So we will be able to do this in this runtime.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3619.119,
    "end": 3620.96,
    "text": "Okay, that's a little bit too complicated, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3620.98,
    "end": 3622.541,
    "text": "Let me restate the following.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3622.561,
    "end": 3624.322,
    "text": "We have a philosophy question, okay?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3624.522,
    "end": 3625.343,
    "text": "A philosophy exam.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3626.67,
    "end": 3645.784,
    "text": " and and the and the and the philosophy exam consists of uh you know that a and b questions right where you giving a passage and you're giving two philosophers and you have to identify which philosopher wrote that passage okay you get the philosophy exam",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3647.182,
    "end": 3654.724,
    "text": " Yeah, it's testing for familiarity with philosophers, not the ability to generate philosophy or recognize new kinds, but I hear you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3654.864,
    "end": 3666.226,
    "text": "So we could have Schopenhauer and Wittgenstein as choices A and B in question one, but question two could have Plato and Aristotle.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3667.787,
    "end": 3673.688,
    "text": "So A and B are not referring to the same thing in the two different questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3674.827,
    "end": 3678.549,
    "text": " That's what I mean by having no semantic connection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3680.17,
    "end": 3680.37,
    "text": "Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3680.45,
    "end": 3687.573,
    "text": "But your grade is the percentage of times that you correctly answered A when it was an A-type question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3689.254,
    "end": 3689.454,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3690.275,
    "end": 3694.437,
    "text": "So does that make it easier to understand that I'm making a simpler point, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3694.997,
    "end": 3702.121,
    "text": "That I can detach grading you from having attaching a semantic meaning to your response.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3704.324,
    "end": 3719.893,
    "text": " It's like you, this is a common question in neuroscience where certain cells while learning a task can learn an abstraction of the task.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3719.933,
    "end": 3732.681,
    "text": "For instance, if it is A or B, you will have cells that respond to this concept of A or B, but then you have specific components of the network which",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3733.616,
    "end": 3758.084,
    "text": " specialized to the particular instance of a or b like aristotle versus plato um or any other uh set of um set of philosophers i guess the question is whether um i'm not sure i fully understand the the what whether both both can happen at the same time",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3759.282,
    "end": 3760.843,
    "text": " So both can happen at the same time, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3760.863,
    "end": 3764.346,
    "text": "You recognize that you can have the general structure, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3765.067,
    "end": 3774.093,
    "text": "Basically, what I'm trying to argue is that if there's an algorithm that can grade r equal to questions, right, then I'm done, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3774.194,
    "end": 3781.439,
    "text": "It can do it for any r equal to question of philosophy or economics, and it can also do it for binary classification.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3782.74,
    "end": 3787.364,
    "text": "What do you think about binary classification of language, like language generation questions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3788.445,
    "end": 3790.106,
    "text": " Yeah, anything, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3790.126,
    "end": 3792.107,
    "text": "But you would have to decide if that's correct.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3793.447,
    "end": 3799.029,
    "text": "Let me go on maybe, and then when I show you things, you can start.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3800.83,
    "end": 3808.994,
    "text": "Let me see if I can, let me escape and see if I can go now to Mathematica so I get to show you some pictures.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3813.776,
    "end": 3814.076,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3814.236,
    "end": 3815.937,
    "text": "Yeah, like the example, yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3817.253,
    "end": 3821.316,
    "text": " I think of the pheromone perception in the environment and the alarm or no alarm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3821.677,
    "end": 3822.597,
    "text": "Is it at the threshold?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3822.637,
    "end": 3831.985,
    "text": "You got finite number of antenna, finite number of receptors, noisy signaling, go, no go, buck stopping with an estimate brain somehow, some way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3834.507,
    "end": 3841.453,
    "text": "Okay, so let me go on and you'll see what I think you'll start to see how there's different ways of looking at things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3842.994,
    "end": 3844.195,
    "text": "We certainly see PowerPoint.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3845.276,
    "end": 3845.656,
    "text": "Oh, sorry.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3848.985,
    "end": 3849.265,
    "text": " I see.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3849.285,
    "end": 3851.626,
    "text": "Yeah, I'm going to do share again.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3853.267,
    "end": 3856.889,
    "text": "And I'm doing share now of Mathematica.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3859.77,
    "end": 3861.071,
    "text": "OK, you see the Mathematica?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3861.091,
    "end": 3863.152,
    "text": "Oops.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3863.212,
    "end": 3863.632,
    "text": "Not yet.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3865.133,
    "end": 3866.073,
    "text": "I just took it away.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3866.093,
    "end": 3867.094,
    "text": "I don't know why I did that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3870.095,
    "end": 3870.676,
    "text": "You see it now?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3870.836,
    "end": 3871.056,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3874.758,
    "end": 3875.058,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3876.498,
    "end": 3877.059,
    "text": "And then, oh.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3879.644,
    "end": 3882.765,
    "text": " I'm going to stop the show because I need to do that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3883.345,
    "end": 3883.705,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3885.026,
    "end": 3885.926,
    "text": "That way I avoid.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.046,
    "end": 3886.186,
    "text": "Okay.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.266,
    "end": 3886.766,
    "text": "Perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3886.986,
    "end": 3887.367,
    "text": "Perfect.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3888.327,
    "end": 3888.647,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3889.107,
    "end": 3891.888,
    "text": "And then now I can go to here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3892.388,
    "end": 3892.828,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3893.889,
    "end": 3901.391,
    "text": "So this is the paper that I sent Daniel and it's the one that I've submitted to a special issue on AI safety and philosophical studies.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3903.212,
    "end": 3903.652,
    "text": "And so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3904.756,
    "end": 3912.381,
    "text": " I want to, you know, so because I'm doing safety, right, I want to I want to speak about this specific case of doing a binary classifier to be concrete.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3912.541,
    "end": 3912.741,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3913.782,
    "end": 3920.966,
    "text": "And so I'm now shifting into getting you into the mode of accepting that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3921.026,
    "end": 3921.967,
    "text": "In fact, they are.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3922.207,
    "end": 3928.09,
    "text": "There is a logic to evaluation that there are postulates and there's a logic and that it's universal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3928.991,
    "end": 3929.511,
    "text": "It's a big one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3929.731,
    "end": 3930.812,
    "text": "It's a big burger.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3932.68,
    "end": 3944.968,
    "text": " And so the way that I'm going to do it is by just talking to you about what are the possible grades on an exam that has two responses before I see anything.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3945.488,
    "end": 3959.537,
    "text": "And so I know that if I have QA questions of A type, then the number of correct responses, so R is for response,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3960.575,
    "end": 3974.601,
    "text": " on the a questions that the i'th classifier right does everybody see that notation r a sub i right this has to be these relationships have to hold i claim these are postulates",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3976.731,
    "end": 3980.392,
    "text": " You know, I've been thinking, how the hell did Euclid do this to begin with?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3980.732,
    "end": 3982.073,
    "text": "How do you introduce postulates?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3982.093,
    "end": 3982.873,
    "text": "What do you argue?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3983.213,
    "end": 3984.614,
    "text": "What do you say, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3984.694,
    "end": 3986.875,
    "text": "When you have postulates, you can't prove them, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3986.895,
    "end": 3993.077,
    "text": "You have to sort of say, I can sort of prove them here, but you have to sort of see them and say, yeah, of course, that makes sense, Andres.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3993.917,
    "end": 3994.077,
    "text": "Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3994.117,
    "end": 3999.979,
    "text": "You can't have more correct responses of A than there are A questions or B. Agreed?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4002.151,
    "end": 4031.611,
    "text": " within a circumscribed axiomatic verified information environment so play on where i have q questions right where i've told you what the number of q questions are right there's no way there's no there's no other way right and so therefore i can i can immediately go and write you know this this table i mean this is how simple it is right i'm going to tell you here let me let me make that bigger",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4039.077,
    "end": 4044.339,
    "text": " So you see this, I'm having a Q equal 20 exam, 20 question exam.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4045.619,
    "end": 4050.881,
    "text": "And I'm just going to make a table of all the possible correct A responses you could have.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4051.661,
    "end": 4052.401,
    "text": "AA, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4052.942,
    "end": 4060.484,
    "text": "The number of A's that you correctly said that it was A. And the number of B's that you correctly said were B's.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4061.144,
    "end": 4063.625,
    "text": "And then I'm just going to keep track of the number of A's, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4065.143,
    "end": 4089.171,
    "text": " questions well the number of a questions can only go from zero to the total questions right and then once i decide that there's any of them then like i said right my correct responses can only go from zero up to that one and then if i have any questions that b questions has to be this remnant and so if you just do that this is this is the cube you get this is what you get for the grades",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4094.654,
    "end": 4119.786,
    "text": " until three weeks ago i've never seen this cube and it's amazing that this cube is it's actually you know kind of a nice figure right it has got this double-edged kind of thing right but that's it if you answer a 20 question exam with 20 responses your correct grade is somewhere is a point somewhere here is it a true tetrahedra",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4121.691,
    "end": 4122.831,
    "text": " I don't know what to call it, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4122.851,
    "end": 4124.752,
    "text": "It's got that 90-degree twist, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4124.852,
    "end": 4126.712,
    "text": "At the bottom is 90 degrees to the top.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4128.432,
    "end": 4128.753,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4129.713,
    "end": 4130.933,
    "text": "Well, wow.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4131.133,
    "end": 4131.933,
    "text": "What do you see in it?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4132.293,
    "end": 4133.073,
    "text": "What does it mean to you?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4134.194,
    "end": 4140.375,
    "text": "Well, the thing about it that I found really interesting is let me show you the other way of looking at it, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4140.475,
    "end": 4149.937,
    "text": "Which is now the way that I looked at it for years until this year, which is the reality in which I looked at it, which was the machine learning.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4150.549,
    "end": 4156.591,
    "text": " Where now I'm telling you what is the percentage of things that A's that you got correct.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4157.251,
    "end": 4161.912,
    "text": "I'm telling you the percentage of B's and then I'm telling you the percentage of A's.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4163.752,
    "end": 4168.594,
    "text": "And in that cube, that same Q equal 20 test, this is how it looks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4172.855,
    "end": 4173.895,
    "text": "See how different that is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4175.915,
    "end": 4178.136,
    "text": "See how it has that kind of quadratic structure?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4181.38,
    "end": 4184.982,
    "text": " What's different between the two postulates?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4185.523,
    "end": 4191.847,
    "text": "Okay, so I'm going to show you what's different is that I decided to do the math in the machine learning world.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4193.988,
    "end": 4197.15,
    "text": "So this is what I'm sort of showing you now, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4197.59,
    "end": 4198.691,
    "text": "These are postulates, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4198.711,
    "end": 4201.293,
    "text": "The number of A responses that you give me",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4202.142,
    "end": 4208.607,
    "text": " are equal to the number of A responses that you got correct plus the Bs that you incorrectly label as As.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4208.747,
    "end": 4212.029,
    "text": "Yeah, true positives and false positives.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4212.129,
    "end": 4214.11,
    "text": "Exactly, exactly, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4214.211,
    "end": 4215.431,
    "text": "These are postulates, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4216.072,
    "end": 4217.653,
    "text": "These are prior postulates, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4217.713,
    "end": 4223.217,
    "text": "They exist before you see any observation about the test, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4223.417,
    "end": 4226.239,
    "text": "Everybody's on board with the fact that this is postulates, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4226.599,
    "end": 4229.061,
    "text": "And that the number of responses you give",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4229.904,
    "end": 4232.427,
    "text": " in a sort of election integrity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4232.708,
    "end": 4235.331,
    "text": "There can be no more votes than their voters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4236.332,
    "end": 4237.453,
    "text": "It obeys this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4237.974,
    "end": 4244.342,
    "text": "And I can rewrite this in terms of being binary classification with these equations down here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4245.222,
    "end": 4248.544,
    "text": " Yeah, just to kind of connect that to the case of an election.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4249.044,
    "end": 4257.088,
    "text": "So it's like one approach would be to take in the samples as evidence and try to estimate a continuous hidden state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4257.709,
    "end": 4265.873,
    "text": "And you're always going to get into this statistical approach versus treating the fundamental finiteness.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4266.353,
    "end": 4273.617,
    "text": "We had, I'm not going to use the NTQR, but those are the parameters that describe the finite state.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4274.838,
    "end": 4276.779,
    "text": " printing and dissemination project.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4277.679,
    "end": 4282.721,
    "text": "Of that project and that printing, there was a thousand ballots with five options.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4283.601,
    "end": 4285.042,
    "text": "That is the state space.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4285.782,
    "end": 4287.303,
    "text": "You could go into cognitive modeling.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4287.323,
    "end": 4288.543,
    "text": "You could do narrative information.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4288.563,
    "end": 4289.583,
    "text": "You could do interpretation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4289.603,
    "end": 4290.744,
    "text": "You can have this, all those things.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4291.144,
    "end": 4293.745,
    "text": "But the finiteness and the discreteness",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4294.867,
    "end": 4301.693,
    "text": " Then to get around this challenge of like, well, temperature, like in, it could be like any number, or it could be a number greater than zero.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4302.013,
    "end": 4302.934,
    "text": "So how do you deal with that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4303.394,
    "end": 4313.262,
    "text": "And you take a kind of engineering approach here, which is you define the safety zone, which can be hierarchical, abstract safety zone, generalized anomalies, and so on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4313.623,
    "end": 4314.864,
    "text": "But you define the safety zone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4315.284,
    "end": 4319.267,
    "text": "Within the safety zone, you have the direction of free energy minimization.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4320.288,
    "end": 4345.045,
    "text": " statistically control or you just stay in this in the fully finite world and maybe the issue can be resolved by explaining away the semantics of the decision through mere propagation and procedure exactly logical consistency okay so so so it turns out that that so so these two postulates right",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4347.925,
    "end": 4351.448,
    "text": " These two positives here are written as a binary classifier here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4351.708,
    "end": 4354.269,
    "text": "And you see that these equations are linear here, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4354.93,
    "end": 4357.872,
    "text": "So that's the cube that you saw with the planes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4358.652,
    "end": 4362.435,
    "text": "And you saw that when I went to the ML, I showed you parabolas.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4362.595,
    "end": 4363.536,
    "text": "That's a quadratic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4365.377,
    "end": 4367.759,
    "text": "Are people seeing that in the equations, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4368.239,
    "end": 4372.362,
    "text": "That when I change to the ML point of view where I'm dividing, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4372.782,
    "end": 4375.964,
    "text": "Then I end up having these quadratic structures, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4376.559,
    "end": 4381.762,
    "text": " In the cube, do you see the parabola?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4384.724,
    "end": 4385.945,
    "text": "What does that represent to you?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4387.008,
    "end": 4388.249,
    "text": " That's the ML space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4388.869,
    "end": 4392.412,
    "text": "That's where I'm telling you the accuracy as percentages.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4392.693,
    "end": 4393.013,
    "text": "You see?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4393.033,
    "end": 4395.475,
    "text": "The percentage of you got half.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4395.855,
    "end": 4396.455,
    "text": "Yeah.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4396.496,
    "end": 4399.218,
    "text": "This test has the highest resolution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4399.838,
    "end": 4403.741,
    "text": "When the coin is even 50-50, statistics does the best job.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4404.142,
    "end": 4413.389,
    "text": "When the coin is 99-1, then three measurements give you very poor statistical power because you can't resolve 99-1 from like 98-2 very well.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4415.649,
    "end": 4417.45,
    "text": " It's not quite like that, but it's close to that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4417.47,
    "end": 4418.971,
    "text": "So let's move on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4420.812,
    "end": 4428.096,
    "text": "Okay, so I'm not going to show you the math, but these two equations, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4428.156,
    "end": 4430.138,
    "text": "This is where the algebraic geometry comes from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4430.678,
    "end": 4432.219,
    "text": "This is what we can observe, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4433.019,
    "end": 4444.126,
    "text": "We observe how many times you said that it was A. We can observe how many times it was B, that you said that it was B. And I know it's related to your individual performance by these equations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4444.841,
    "end": 4471.836,
    "text": " it turns out that you can disentangle them and there's actually you know because these two frequencies have to add up to one there's only one postulate and that possible is being represented here in the two different ways it's either this one or this one either in the ml world or the the ntqr world and here's where we come back to that thing about transmitting information the difference between your responses is telling me something about the difference in your correctness",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4474.622,
    "end": 4477.183,
    "text": " Just to clarify, you use a single equation number 16.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4477.303,
    "end": 4490.909,
    "text": "It's exactly the same test, but I'm showing P of A sub A is RAA divided by QA.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4491.59,
    "end": 4496.112,
    "text": "So are you co-asserting these axiomatically, or are you declaring them equivalent?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4496.972,
    "end": 4497.652,
    "text": "They're equivalent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4498.853,
    "end": 4500.874,
    "text": "And so they're co-asserted by equivalence.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4501.809,
    "end": 4503.07,
    "text": " Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4503.09,
    "end": 4504.691,
    "text": "Why do the shapes look different then?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4505.892,
    "end": 4507.133,
    "text": "Because they're in different spaces.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4508.233,
    "end": 4511.576,
    "text": "One is in the p space and one is in the integer space, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4512.056,
    "end": 4516.219,
    "text": "One is in the integer ratios and the other one is in the whole integer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4518.6,
    "end": 4535.613,
    "text": " Okay, so it's kind of like a discrete mesh, and it's a continuous space, and there's integrity between the discrete and the continuous, and you have very strong procedural guarantees on the discrete, and then you have arbitrary or standard statistical guarantees on the continuous.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4536.814,
    "end": 4545.181,
    "text": "But my problem is that I have difficulty seeing how a biological system could do the division one, but I can see how it could do the integer one very well.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4547.185,
    "end": 4547.425,
    "text": " Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4548.205,
    "end": 4549.866,
    "text": "That's why I'm bringing up the NTQR.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4549.906,
    "end": 4551.846,
    "text": "That's why I think you guys would be interested in it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4552.527,
    "end": 4556.668,
    "text": "Because the ML space is not, I don't see how a biological system could be dividing one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4557.888,
    "end": 4562.33,
    "text": "But I can see how a biological system could build a cube that's 20 sided.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4563.33,
    "end": 4568.151,
    "text": "Yeah, that's kind of like a synapse and the synaptic release, it's in vesicles.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4568.752,
    "end": 4571.072,
    "text": "It's not like dopamine is a continuous variable.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4571.572,
    "end": 4575.834,
    "text": "At the synaptic level, the dopamine release is in one bucket.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4576.614,
    "end": 4576.774,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4578.616,
    "end": 4607.541,
    "text": " so then so so then we get to the so so this is the the the interesting part right so so what is the problem with ensembles gosh if we could just do my so here's where we go back to heuristics right and my love of heuristics majority voting is such a great algorithm it's so simple right it's so simple and it works if if if things were good enough majority voting would just be good enough right it would just make us safe as it is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4608.709,
    "end": 4611.33,
    "text": " The problem with majority voting is that it can go wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4611.35,
    "end": 4613.91,
    "text": "The mob can be wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4614.01,
    "end": 4617.191,
    "text": "Things could be flipped in terms of their accuracy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4618.331,
    "end": 4620.792,
    "text": "So we need to consider now ensembles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4621.772,
    "end": 4625.413,
    "text": "And the problem with ensembles is that they can be error correlated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4626.013,
    "end": 4628.794,
    "text": "They're not going to be making their errors independently.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4628.834,
    "end": 4630.175,
    "text": "So we need to handle that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4631.395,
    "end": 4635.236,
    "text": "And so here's where we come to the first set of what I would call non-trivial postulates.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4636.661,
    "end": 4659.982,
    "text": " because this is what makes them complete right that if i observe two classifiers this right they can only vote four different ways and there's no other way that's it that's the completeness this is guaranteed so if i give you equations that describe these four different frequencies and those are going to be the four postulates i'm done",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4662.333,
    "end": 4667.217,
    "text": " And so, by the way, these are the surfaces for some of those planes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4668.618,
    "end": 4671.24,
    "text": "I'm going to show you later.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4672.061,
    "end": 4674.483,
    "text": "Let me move on to there because it's going to be 4.30.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4679.166,
    "end": 4680.387,
    "text": "So here's the correlation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4682.549,
    "end": 4687.533,
    "text": "So this is what I was saying before, Daniel, that the P's are these things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4688.774,
    "end": 4691.396,
    "text": "The response is divided by the total number of questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4695.785,
    "end": 4696.005,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4696.826,
    "end": 4699.528,
    "text": "So either I can talk about ours or I can talk about peace.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4700.649,
    "end": 4708.315,
    "text": "And then correlation is defined as something that looks exactly like you would define it for distribution, but it's here defined for a sample.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4709.295,
    "end": 4709.476,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4711.057,
    "end": 4717.542,
    "text": "So basically what I'm saying is I want to continue to write things as being individual products of performance.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4718.576,
    "end": 4727.378,
    "text": " And so what I really want to have inside this parentheses is the number of times that they both said that it was A and it was A. Well, that's this number here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4730.198,
    "end": 4731.399,
    "text": "But I'm not going to put that number.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4731.639,
    "end": 4743.341,
    "text": "What I'm going to do is I'm going to stubbornly stick with individual performance, and then I'm going to put the difference between that number that I need and this thing that I'm stuck with putting in, which is the product.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4745.669,
    "end": 4749.411,
    "text": " And so these are the four postulates for pair correlated binary classifiers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4749.451,
    "end": 4750.672,
    "text": "You only need two of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4751.112,
    "end": 4754.294,
    "text": "You need one for the A label and you need one for the B label.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4754.834,
    "end": 4758.576,
    "text": "And it acts exactly like you would expect correlation to do, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4760.137,
    "end": 4766.481,
    "text": "When correlation is positive, it's going to increase the number of responses where they agree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4767.141,
    "end": 4771.484,
    "text": "And when it's negative, right, it's going to increase when they disagree.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4773.2,
    "end": 4774.601,
    "text": " It has the right sign, basically.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4774.661,
    "end": 4774.842,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4775.242,
    "end": 4778.745,
    "text": "Correlation here is plus contributing plus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4779.786,
    "end": 4783.43,
    "text": "And in these two equations where they disagree is continuing with minus.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4784.891,
    "end": 4785.191,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4785.992,
    "end": 4788.614,
    "text": "Something like a finite procedural.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4789.676,
    "end": 4815.604,
    "text": " recasting and reimagining of the true positive true negative false positive false negative those are four actual values and so again within the finiteness of digitized sensing especially you can take purely non-parametric purely algorithmic purely arithmetical numerical approaches",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4817.461,
    "end": 4821.562,
    "text": " rather than always passing everything through the kind of statistical meat grinder.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 4821.582,
    "end": 4823.823,
    "text": "I'm done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4824.023,
    "end": 4824.803,
    "text": "I'm done, Daniel.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4824.963,
    "end": 4825.423,
    "text": "I'm done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4826.124,
    "end": 4826.564,
    "text": "I'm done.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4827.284,
    "end": 4828.805,
    "text": "You said exactly, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4828.845,
    "end": 4830.965,
    "text": "This is the thing, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4831.065,
    "end": 4837.207,
    "text": "And so I'm not going to go back into... Tom Mitchell and Platonius, one of the students, came up with an independent solution, which is wrong.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4838.207,
    "end": 4844.449,
    "text": "And I've been slammed by reviewers because they say they did it right and I'm doing it wrong, and it turns out to be the other way around.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4844.489,
    "end": 4845.41,
    "text": "But I'm not going to go into that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4845.45,
    "end": 4846.43,
    "text": "That's my personal beef.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4847.461,
    "end": 4851.144,
    "text": " But let me then show you what happens when you take these equations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4851.664,
    "end": 4852.625,
    "text": "So what is the problem?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4853.266,
    "end": 4863.193,
    "text": "The problem that everybody has encountered with pair binary classifiers is that correlation is entangled with individual performance in every one of these equations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4863.834,
    "end": 4864.454,
    "text": "Do you see that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4864.474,
    "end": 4865.735,
    "text": "26A, 26B, 26C, and 26D",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4869.821,
    "end": 4896.6,
    "text": " have correlation every single one of them we cannot separate correlation from individual performance but if you use algebraic geometry you can and that's what i'm not going into you can separate these equations you get back the individual equations 33 a and 33 b are exactly the same equations that i showed you before but then you get these new ones where you've decoupled correlation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4901.924,
    "end": 4907.949,
    "text": " So 33D, 33E, and 33Fs are the only ones that have correlation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4908.029,
    "end": 4910.071,
    "text": "And it turns out that they're the same postulate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4910.551,
    "end": 4914.954,
    "text": "You get no information from them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4915.835,
    "end": 4920.659,
    "text": "And in fact, then everything in binary classification is controlled by this number.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4921.5,
    "end": 4927.905,
    "text": "The number of times that you agreed in the B label minus the product of times that you said there was B.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4930.407,
    "end": 4956.924,
    "text": " it turns out that you can prove that for binary classification this is exactly the same as this other quantity and the way that i'm going to use error correlation is this one this equation right here and the only thing i want you to note about this equation is that it's linear in the correlation so if you tell me what you think the grade is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4957.808,
    "end": 4965.51,
    "text": " and I observe how you voted and how you differed in your voting, I can tell you what your error correlation is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4969.21,
    "end": 4973.571,
    "text": "I'm racing ahead, and I just want to show you some evaluations, OK?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4973.891,
    "end": 4974.111,
    "text": "So",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 4991.005,
    "end": 5005.055,
    "text": " Let me see what the... So this equation is the solution for the prevalence of As when the classifiers are making error independent mistakes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5010.839,
    "end": 5019.225,
    "text": "It comes from this quadratic polynomial that you get from solving",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5020.131,
    "end": 5049.231,
    "text": " that very complicated system that i show at the end so now i need eight of them i need three of them right so i need uh eight equations so now i have i j and k and you see sort of a descending a symmetric pattern right this ladder goes down one way and it goes up the other way these are the b's and these are the a's and when you solve that equation you get a quadratic",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5050.376,
    "end": 5052.638,
    "text": " And it's that quadratic that I'm excited to show you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5055.32,
    "end": 5063.326,
    "text": "You get a quadratic equation which has these complicated factors that depend only on the statistics that you have observed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5063.346,
    "end": 5064.687,
    "text": "There's no free parameters.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5065.667,
    "end": 5068.269,
    "text": "So this is not Bayesian estimation in any way, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5068.91,
    "end": 5070.691,
    "text": "You have no freedom whatsoever.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5071.957,
    "end": 5098.572,
    "text": " so then when i do synthetic data where i i've made it to have 1920s of of one of the variables it predicted uh exactly but let me show you some experimental results and the one that i want to show you is where it fails that independent solution is going to fail if they if they if the classifiers are too correlated it's going to give you an imaginary solution",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5100.855,
    "end": 5103.117,
    "text": " Can I make a comment on that?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5104.718,
    "end": 5105.078,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5105.098,
    "end": 5105.639,
    "text": "Sorry, go ahead.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5106.859,
    "end": 5110.202,
    "text": "An imaginary solution means that the parabola doesn't touch the axis.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5112.743,
    "end": 5116.646,
    "text": "And gosh, I look at this picture and I go, I can draw this circuit.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5117.727,
    "end": 5121.269,
    "text": "I can make this circuit, physical circuit, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5122.29,
    "end": 5123.791,
    "text": "So that I could, because, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5123.871,
    "end": 5126.933,
    "text": "I could make a geometric construction that draws this...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5128.598,
    "end": 5157.675,
    "text": " parabola and then i can check to see whether electrically it touches that axis and this is a warning light if you don't touch that axis your classifiers are correlated too much right the error independent solution has failed so this is something that no probabilistic method can do right no probabilistic method that assumes error independence",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5158.331,
    "end": 5161.632,
    "text": " can show that the error-independence assumption is violated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5162.713,
    "end": 5166.634,
    "text": "That's the main problem with distributions and statistics, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5167.455,
    "end": 5171.236,
    "text": "If you make assumptions, you cannot prove, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5171.256,
    "end": 5175.057,
    "text": "Because you're tuning your parameters to satisfy your assumptions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5175.858,
    "end": 5180.64,
    "text": "But when you're doing things algebraically, like I'm doing here, there is no freedom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5182.46,
    "end": 5186.622,
    "text": "You can be in a state where they... And actually, I can show...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5187.734,
    "end": 5211.02,
    "text": " because I can have a complete representation where I include all the correlations, I can prove that when I do these computations, if the classifiers ever have a square root that's unresolved, this is the independent algebraic evaluator, I can prove that that means that that set of classifiers is actually correlated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5211.44,
    "end": 5213.02,
    "text": "It has non-zero correlation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5213.52,
    "end": 5215.801,
    "text": "And below, you're seeing that that's in fact the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5217.382,
    "end": 5221.344,
    "text": " You're seeing that one of the correlations is almost 6%.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5223.466,
    "end": 5232.071,
    "text": "And I've been able to detect with the independent solution that, in fact, there is non-zero correlation because I have an unresolved square root.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5232.931,
    "end": 5234.973,
    "text": "That doesn't make any sense, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5235.193,
    "end": 5236.333,
    "text": "These are integer numbers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5238.194,
    "end": 5242.277,
    "text": "What does it mean to say that you got a percentage that is some square root?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5246.404,
    "end": 5252.446,
    "text": " And this cannot be done by any infinite statistical... This is the distinction I want to make.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5252.907,
    "end": 5259.409,
    "text": "There's finite statistics, which is about samples, and there's infinite statistics, which is an infinite number of samples.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5260.389,
    "end": 5268.172,
    "text": "And there is finite statistics where you accept that what's gold is the sample.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5269.073,
    "end": 5270.593,
    "text": "The sample is true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5271.794,
    "end": 5275.255,
    "text": "Everything that you derive from it is not possibly true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5275.939,
    "end": 5298.551,
    "text": " versus the infinite statistical world where the world the sample is always wrong right in statistics a given sample is always wrong right the equality only occurs and the average of the samples that's a completely different way of thinking yes",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5300.299,
    "end": 5320.184,
    "text": " and I say that the finite one is the one that I want to choose in terms of safety and it's 4 30 exactly so I'm going to stop because you know I think I feel like I've been talking too much and maybe people can chime in and push back and have interesting questions yeah anyone in the live chat and then Jakob go for it",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5329.904,
    "end": 5356.225,
    "text": " yeah it's um i want to show you how i just want to say how crazy this is i'm giving you error correlations which are the only logically consistent error correlations once i decided to do majority voting or not and here i'm showing you that majority voting is kind of like a little bit too hysterical it thinks that they're 25 correlated and in fact they're only at most one percent and and so my method",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5356.835,
    "end": 5379.182,
    "text": " right of using the postulates gives a better self-consistent solution i haven't gone into that right but i go what basically what i do is i take this number which is not at all an integer ratio right and i find the integer ratio that's closest to it right and then i ask for that integer ratio what is the only",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5380.291,
    "end": 5396.123,
    "text": " logically consist of error correlation and i get this these numbers yeah that reminds me of the finite pi like 22 over 7 is a classic small approximator of pi and you can go into finite approximators",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5397.381,
    "end": 5397.821,
    "text": " Exactly.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5398.002,
    "end": 5403.305,
    "text": "And therefore get closer and closer incessantly, keeping the strong guarantees.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5403.906,
    "end": 5405.267,
    "text": "Right, but at some point it's useless.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5405.287,
    "end": 5410.19,
    "text": "You're doing the width of a hydrogen atom, as people like to point out, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5411.151,
    "end": 5413.833,
    "text": "Your error in the circumference is going to be the width of a hydrogen atom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5413.873,
    "end": 5414.734,
    "text": "Who cares, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5416.377,
    "end": 5440.046,
    "text": " and so a finite heuristic is going to do it very well sorry jacob i i had to i had to interrupt you there to just to point out right that that the fact that i can even measure error correlation and say that it's logically consistent is incredible i just have to say that yeah and no worries i i'm still trying to wrap my head around um the concept of",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5441.326,
    "end": 5470.434,
    "text": " disentangling the semantics from the particular tools that you're using right um because i feel like it also kind of depends on your expectations as the person using these tools like going back to the going back to the example of like a or b like if you if you take away um if you take away the particular content of those of those questions and you only look at the statistics of the of the answers",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5471.275,
    "end": 5476.692,
    "text": " of correctness i would say statistics of correctness statistics of correctness then",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5477.825,
    "end": 5484.029,
    "text": " Perhaps you perhaps you are taking away the correlation from the particular content of those questions.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5484.429,
    "end": 5484.65,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5485.13,
    "end": 5485.33,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5485.43,
    "end": 5489.853,
    "text": "Are you taking away the correlation of, for instance, the person who said those questions?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 5490.353,
    "end": 5490.794,
    "text": "Oh, my God.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5490.894,
    "end": 5491.494,
    "text": "It's so good.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5491.554,
    "end": 5492.555,
    "text": "It's so good that you were saying.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5492.595,
    "end": 5492.775,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5493.035,
    "end": 5497.058,
    "text": "So so so here's what I had to do at UMass when I was giving the exams.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5497.118,
    "end": 5497.298,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5497.698,
    "end": 5499.84,
    "text": "So so UMass Amherst is a state school.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5499.9,
    "end": 5500.12,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5500.62,
    "end": 5502.101,
    "text": "So you get bubble sheet answers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5502.722,
    "end": 5502.902,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5503.642,
    "end": 5505.423,
    "text": "Exams at UMass Amherst.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5505.484,
    "end": 5505.624,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5505.664,
    "end": 5507.525,
    "text": "But I taught at Williams and at Swarthmore.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5508.445,
    "end": 5513.246,
    "text": " I never gave bubble sheet exams at Swarthmore Williams.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5513.326,
    "end": 5517.848,
    "text": "It's only when you have large classes that you have these things.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5517.868,
    "end": 5519.908,
    "text": "At UMass, the students would cheat.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5522.329,
    "end": 5525.57,
    "text": "They told me, you have to make five exams, Andres.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5527.17,
    "end": 5533.972,
    "text": "The student is one color exam, and then you see people in a diamond pattern around that student.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5536.061,
    "end": 5539.163,
    "text": " So that everyone around the student has a different color exam.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5540.444,
    "end": 5543.626,
    "text": "And then you scramble the responses.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5544.286,
    "end": 5549.89,
    "text": "So nobody can look over anybody's shoulder and copy the bubble.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5551.631,
    "end": 5551.831,
    "text": "Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5552.652,
    "end": 5554.173,
    "text": "So what am I trying to do there?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5554.293,
    "end": 5555.574,
    "text": "Why am I trying to do that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5555.634,
    "end": 5561.358,
    "text": "Because I want to prevent the error correlation that occurs because you cheated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5563.166,
    "end": 5573.933,
    "text": " And I'm trying to find out the error correlation between all the students that is due to a commonly shared cognitive misunderstanding of Newtonian physics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5574.814,
    "end": 5576.315,
    "text": "Maybe they're still thinking, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5576.375,
    "end": 5581.158,
    "text": "Maybe I put a question that is testing their belief in Aristotelian physics, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5582.139,
    "end": 5583.9,
    "text": "And I want to detect that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5584.04,
    "end": 5591.185,
    "text": "And so when I get a wrong answer in a question, the purpose of the exam for me as a professor",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5592.063,
    "end": 5619.923,
    "text": " is to find out what i should be talking about the next class right to address the mistakes that people are making cognitively i want to design a test that blocks any error correlation except the cognitive one and so that goes to what you're saying jacob right you get to design what error correlation right somebody's error correlation right may be a gold for you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5620.749,
    "end": 5627.952,
    "text": " I, as a teacher, want to see cognitive error correlations because I want to help you and teach better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5629.773,
    "end": 5641.798,
    "text": "And when I talked about digitizing, you brought up another thing, Jacob, which is that maybe in the original signal, the responses were not correlated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5642.819,
    "end": 5645.06,
    "text": "But then when I digitized it, I correlated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5647.341,
    "end": 5649.962,
    "text": "And I think Daniel also talked about that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5650.615,
    "end": 5677.522,
    "text": " right that when you change formats right you're introducing spurious signals and all of them are in there and yes there is no guarantee right but but by the way uh there is the advantage here that i can measure the error correlation right so that you can see whether i did introduce right by digitizing the the logical consistency of your grading",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5679.019,
    "end": 5682.0,
    "text": " If I introduce correlations or not that existed in the original format.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5682.72,
    "end": 5686.62,
    "text": "Does that make sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5686.921,
    "end": 5687.901,
    "text": "There's no free lunch.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5687.941,
    "end": 5689.501,
    "text": "You won't get anything for free here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5690.361,
    "end": 5691.741,
    "text": "If you really think about it, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5691.761,
    "end": 5693.342,
    "text": "It sounds magical, but it isn't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5695.802,
    "end": 5700.543,
    "text": "It's okay on the free lunch theme, kind of thinking about this in a fun way.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5701.403,
    "end": 5704.244,
    "text": "There's a lunch where you just show up and it's there for you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5706.457,
    "end": 5725.833,
    "text": " So that's kind of the dream scenario, if you're one of those who eat lunch at that time, because it's kind of like you've chosen the axis to create a finite projection to, it's the right test, the seating arrangement, there's just an ideal situation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5726.753,
    "end": 5730.997,
    "text": "And then some of those may be actually perhaps even relaxed in practice",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5732.389,
    "end": 5737.874,
    "text": " Like, I don't know all the details, but when you described that you're taking an integer approximator",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5739.335,
    "end": 5745.94,
    "text": " So there's ways of integerizing and finitizing that strip semantics.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5746.36,
    "end": 5749.623,
    "text": "But then I thought about what if the ship of fools, what if none of them can be the captain?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5750.143,
    "end": 5751.664,
    "text": "Well, then the ship's going to go extinct.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5752.044,
    "end": 5756.388,
    "text": "And then it doesn't matter what, that's the imaginary parabola that doesn't make contact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5756.468,
    "end": 5758.489,
    "text": "It's like, no, there's no decision rule.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5758.99,
    "end": 5763.713,
    "text": "There's also no quadratic regression, but this is just an imaginary solution.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5764.013,
    "end": 5767.476,
    "text": "These people are talking about survival strategies that are imaginary.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5768.246,
    "end": 5796.344,
    "text": " yes yes so so you get the other part about it which is what why it was good to put it in a philosophical uh journal which is what if there is no answer key what if we are all deluded and we're just testing with the test our alignment on a delusional belief i explained this to uh uh an ex-wife of mine who's a psychoanalyst and she because i was explaining the concept of logical consistency versus logical soundness by the way",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5796.917,
    "end": 5799.218,
    "text": " With logical soundness, you need to know the truth table.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5799.879,
    "end": 5801.219,
    "text": "Logical consistency, you don't.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5801.439,
    "end": 5808.723,
    "text": "You're just checking to see, without semantics, that you're cranking the logic machinery correctly.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5809.223,
    "end": 5812.165,
    "text": "If your premises are correct, your conclusions are correct.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5812.645,
    "end": 5815.586,
    "text": "So that's what I mean here by logical consistency of grading.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5816.267,
    "end": 5824.911,
    "text": "I cannot tell you exactly what the grade is, but I can tell you whether you're being logically consistent with how you believe your experts are behaving.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5827.389,
    "end": 5827.529,
    "text": " Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5827.789,
    "end": 5829.17,
    "text": "So that that is.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5830.01,
    "end": 5830.211,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5831.992,
    "end": 5833.492,
    "text": "That's the only thing that can be checked here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5834.313,
    "end": 5834.493,
    "text": "Right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5835.193,
    "end": 5841.717,
    "text": "But it can be probably shown, right, that that you are in a highly correlated state and therefore you should raise an alarm.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5842.557,
    "end": 5849.461,
    "text": "And so when you look at what this could be, it could be also you could think of it as a way of selecting if you have different models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5850.163,
    "end": 5856.568,
    "text": " and you find the one that's most aligned with what your beliefs are about what the truth is, then you have instant compression, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5856.748,
    "end": 5859.01,
    "text": "Just select that model, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5859.05,
    "end": 5862.552,
    "text": "Because you found the one that's most aligned with everybody, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5862.592,
    "end": 5864.053,
    "text": "And so you don't need to keep all of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5864.934,
    "end": 5871.139,
    "text": "But there's nothing to say that you're not hallucinating and that you're going to be eaten, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5871.179,
    "end": 5876.943,
    "text": "Because you think that there is no tiger there, but there is a tiger, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5876.963,
    "end": 5878.364,
    "text": "You could have false beliefs, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5879.773,
    "end": 5902.568,
    "text": " and be delusional right confident and alive not confident and soon to decease exactly right and so there is nothing here that prevents that from happening but it would allow you if you were initially in a good operating state to start detecting something that is malfunctioning right so that you could prevent that from happening",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5904.042,
    "end": 5905.963,
    "text": " Yeah, I'll ask a question from the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5906.763,
    "end": 5909.184,
    "text": "Upcycle Club writes, I have a question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5909.765,
    "end": 5913.046,
    "text": "How do you define the data sketch of the decisions?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 5914.987,
    "end": 5920.429,
    "text": "So that was in the statement about completeness, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5920.609,
    "end": 5931.954,
    "text": "So whenever you look at an ensemble, by the way, if you know data streaming, right, there's data streaming algorithm for every statistic, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5931.994,
    "end": 5933.595,
    "text": "Sample statistics, there's many of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5934.48,
    "end": 5963.39,
    "text": " of course with a finite sample there's only a finite number but there's many of them right combinatorially explosive so here it is right if i talking about three right i have to talk about two to the three or eight different frequencies if i'm looking at only their alignment right but that's not the only statistics i may want to right suppose that you're looking at classification of of uh dna pairs so you're worrying so there's also sequence information",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5964.477,
    "end": 5974.699,
    "text": " So you may want to know how accurate you are on the point, you know, on the given base pair, but you may want to know what percentage of times you were correct on both pairs.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5976.72,
    "end": 5981.341,
    "text": "So now you're keeping tab of another set of statistics, which is not the one here in equation 38, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5982.081,
    "end": 5987.542,
    "text": "Because now you're comparing two different points on the DNA sequence, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5987.562,
    "end": 5993.904,
    "text": "And so you could be keeping statistics about the observation 10 steps back or 10 steps forward, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5995.279,
    "end": 5997.961,
    "text": " So there's an infinite number of statistics that you could be doing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 5998.182,
    "end": 6000.223,
    "text": "So I've only shown one small set of them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6000.824,
    "end": 6006.569,
    "text": "And for every one of them, you're going to be able to write this summation, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6007.23,
    "end": 6013.375,
    "text": "It's a part of, if you will, of the basis of probability theory that you have event space, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6013.495,
    "end": 6017.098,
    "text": "And that you can delineate event space completely, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6017.138,
    "end": 6018.379,
    "text": "So you have completeness, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6018.419,
    "end": 6020.281,
    "text": "There is no event that you do not know about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6021.209,
    "end": 6044.62,
    "text": " if you and by the way there is no theory about all the theories of the world this is why you cannot do this with theoretical work right because we do have no theory that can enunciate all the postulates of all the possible theories about the world this can only be done with sample statistics right that's how i get away with this",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6045.287,
    "end": 6060.01,
    "text": " yeah to kind of reflect that back i i first off i again i appreciate this presentation and work i i encourage people to to look into this because it's very interesting and to connect to the prior",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6060.851,
    "end": 6089.72,
    "text": " century of statistics and understand where exactly this is positioned and and how deeply this statistical paradigm is baked into the safety discussion and to this last point that you're creating many possible finite spaces um the error patterns and covariances can be harder to fake than the mean you could just take one number and say oh my god danny oh my god",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6090.632,
    "end": 6119.427,
    "text": " okay oh my god i mean i mean come on it just yes exactly right right you can fake the signal but you cannot fake the correlation it's so much harder right it's so much harder to do that yeah yes they're faking the mean and the variance and all the higher coordinates of motion then it's indistinguishable exactly exactly right yes so this applies to the concept of enemy inside the gates",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6120.419,
    "end": 6146.711,
    "text": " how would you detect that something inside of you is hallucinating right now and you shouldn't be paying attention to it right this is would be a crucial thing for any right let's go back to the original question right forget about what i said if it's not how i said it is it has to be something like this how can an entity have intelligence have integrity of thought",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6147.552,
    "end": 6176.017,
    "text": " if it doesn't have a way of detecting enemy inside the gates yes you have to defend against yourself cognitive security yes right this is this is what i think is so interesting about this right forget about right the number one enemy you have to worry about is you",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6177.071,
    "end": 6180.594,
    "text": " your hallucination that is preventing you from seeing the tiger.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6184.778,
    "end": 6186.48,
    "text": "I would think that that would be the primary thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6187.681,
    "end": 6195.809,
    "text": "And going back to the semantics, I can see how this can be used for binary classification of safe, unsafe, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6195.909,
    "end": 6196.95,
    "text": "Tiger, not tiger.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6198.091,
    "end": 6201.114,
    "text": "But then, because the mathematics is exactly the same,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6202.091,
    "end": 6223.173,
    "text": " how the biological system could co-opt exactly the same computational structure to just check correctness of very complicated opinions not just binary classification how about Jakob um a last thought and then we'll just each have a closing word here",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6230.276,
    "end": 6259.797,
    "text": " yeah i'm trying to connect these thoughts to um i guess the the active inference formalism where like where how many how many layers of uh of metacognition do you need to um to re to realize or uh elicit this type of self self-reflective behavior on the different systems that you're modeling",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 6261.266,
    "end": 6262.106,
    "text": " To all of them, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6262.746,
    "end": 6263.887,
    "text": "This would be used everywhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6265.627,
    "end": 6266.727,
    "text": "Like crazy, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6266.787,
    "end": 6269.568,
    "text": "You could use this over and over and over and over and over, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6269.868,
    "end": 6271.308,
    "text": "To check every single component.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6274.629,
    "end": 6274.769,
    "text": "Right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6274.789,
    "end": 6277.71,
    "text": "It has no intelligence, so therefore it can be used right anywhere.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6278.73,
    "end": 6285.212,
    "text": "That's what I'm saying, that this is the thing that I find fascinating about it, because it has no intelligence and it's stripped the semantics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6285.292,
    "end": 6290.073,
    "text": "You can insert the instrument anywhere to check statistics of correctness.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6291.446,
    "end": 6293.343,
    "text": " of your noisy oracles.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6294.927,
    "end": 6298.73,
    "text": " What that makes me think about is Chris Fields' recent course.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6299.21,
    "end": 6312.039,
    "text": "Andreas, not saying you watch this or anything like that, but what he spoke to was that there's a classical screen that can be digitized, a physical screen, and then there's two agents that have these semantic reference frames.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6312.819,
    "end": 6316.022,
    "text": "That was done in a Bayesian statistical setting.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6317.102,
    "end": 6321.686,
    "text": "And you have kind of added discrete beads...",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6323.038,
    "end": 6343.391,
    "text": " some first approximation inside some of these otherwise distributional considerations like if the two thermometers can be from zero to ten that's how many pairwise observations there are you can have all kinds of distributions and flows and that type of modeling and continuous state spaces or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6344.372,
    "end": 6358.068,
    "text": " there may be a whole variety of activities available in the discrete cube, including these things like, well, 1 over and 7 up, and then that correlation, again, to make the point clear, it can be",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6359.295,
    "end": 6383.865,
    "text": " basically detected and and triangulated where discrete differential is occurring in active inference we have the kind of continuous optimization machine learning but this is more like pinpoint like this bolt is failing rather than like there's a 0.8 that one of the bolts is loose no it's this this is failing",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6385.683,
    "end": 6388.805,
    "text": " Yes, it's definitely trying to identify this is failing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6388.845,
    "end": 6389.906,
    "text": "Don't pay attention to it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6390.026,
    "end": 6391.387,
    "text": "Maybe take it out of the ensemble.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6395.269,
    "end": 6396.67,
    "text": "What are the next steps for your work?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6398.852,
    "end": 6409.418,
    "text": "So kind of going through the binary case has made me realize it was very hard to figure out the binary case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6409.899,
    "end": 6410.839,
    "text": "I've been working on it since 2010.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6412.534,
    "end": 6424.318,
    "text": " But now that I've finally gone through the other end and I figured out how to make it simple, I'm starting to be able to write down what the solutions have to be for the three-label case, so the R equals three test.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6425.158,
    "end": 6432.861,
    "text": "And so what I've not gone into is that it goes back to that issue of these two numbers being the same, 34 and 35.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6433.821,
    "end": 6435.862,
    "text": "There's no more information in the binary case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6436.522,
    "end": 6441.444,
    "text": "But in the three-label case, you would find that these three things are not the same, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6442.296,
    "end": 6449.16,
    "text": " So strangely enough, when you have more responses, there's more information because there's more chance of disagreement.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6449.641,
    "end": 6453.703,
    "text": "And disagreement is the most informative thing that you can have for an ensemble.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6455.344,
    "end": 6456.485,
    "text": "Agreement is useless.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6457.626,
    "end": 6460.448,
    "text": "Agreement is a tiny portion of these equations, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6460.488,
    "end": 6461.488,
    "text": "Look at these equations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6462.329,
    "end": 6464.25,
    "text": "These equations, there are four of them, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6464.45,
    "end": 6467.092,
    "text": "Well, not this one, but in the eighth one, you can see it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6470.004,
    "end": 6489.242,
    "text": " the maximally informative coin flip is 50 50. that's the statistical way to say this right but here right there are eight equations and only two of them are when they completely agree and this is what people like to talk about platonius and tom mitchell talk about the agreement equations",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6489.969,
    "end": 6492.991,
    "text": " where they just wanted to talk about 41 plus 48 added.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6493.431,
    "end": 6494.332,
    "text": "And I'm like, why?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6494.872,
    "end": 6499.115,
    "text": "Why not look at the full set of information that's available when you consider 41, 42, 43, 40?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6499.755,
    "end": 6502.177,
    "text": "You know what I'm saying?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6502.317,
    "end": 6504.358,
    "text": "Each one of these is true.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6505.359,
    "end": 6507.26,
    "text": "It's much more complicated when you have correlation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6507.3,
    "end": 6510.843,
    "text": "Then you have pairwise correlation, and then you have three-way correlation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6511.383,
    "end": 6515.286,
    "text": "But my point is that these things are quite complicated.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6516.386,
    "end": 6518.768,
    "text": "But they have a very predictable structure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6520.148,
    "end": 6523.249,
    "text": " This makes me think about it being a meta-observation.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6524.43,
    "end": 6524.67,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6525.13,
    "end": 6526.11,
    "text": "It's a second level.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6526.23,
    "end": 6529.712,
    "text": "It's an actual calculated... It's a monitor algorithm.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6530.312,
    "end": 6531.392,
    "text": "It's an actual fact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6532.613,
    "end": 6538.815,
    "text": "As much as the thermometer's reading is a fact, the thermometer that measures the difference between them is also a fact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6540.896,
    "end": 6541.276,
    "text": "That's right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6542.116,
    "end": 6551.659,
    "text": " And then you have to decide, well, I know that I'm in this domain and, you know, this is temperature and temperature is not going to change very quickly because it's a car engine, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6551.739,
    "end": 6553.24,
    "text": "So it can't actually fluctuate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6553.92,
    "end": 6554.54,
    "text": "You know what I'm saying?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6554.58,
    "end": 6555.18,
    "text": "That kind of thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6555.22,
    "end": 6559.082,
    "text": "So if you see something that's fluctuating too much, you know that it's wrong, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6559.102,
    "end": 6560.382,
    "text": "That's domain knowledge, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6560.422,
    "end": 6564.203,
    "text": "Being applied to then take a measurement, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6564.463,
    "end": 6569.465,
    "text": "And then interpreting that measurement as being a safety issue or not, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6571.936,
    "end": 6574.017,
    "text": " Again, the computer is needed, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6574.037,
    "end": 6578.96,
    "text": "The thermometer is providing the reading, but the computer is needed to understand why.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6579.601,
    "end": 6582.122,
    "text": "The other analogy I like to make is like a murder mystery.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6582.603,
    "end": 6583.763,
    "text": "A crime has been committed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6584.464,
    "end": 6590.787,
    "text": "With this method, you can interview all the suspects and find via logical consistency the suspect, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6591.328,
    "end": 6594.029,
    "text": "Because they have a story that doesn't compare to anybody else.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6595.53,
    "end": 6598.352,
    "text": "But you cannot find why and how.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6599.119,
    "end": 6603.521,
    "text": " Because there's no semantics of why people commit murders or how they commit them.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6606.163,
    "end": 6607.944,
    "text": "So this helps you solve the crime.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6608.584,
    "end": 6610.345,
    "text": "Who committed the crime?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6612.486,
    "end": 6621.391,
    "text": "This algorithm is malfunctioning, but it cannot help you figure out why or how.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6621.811,
    "end": 6623.192,
    "text": "That you need a higher cognition.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6628.018,
    "end": 6629.399,
    "text": " Thank you again for joining.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6630.34,
    "end": 6632.501,
    "text": "Thank you for inviting me in this wonderful discussion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 6634.343,
    "end": 6640.988,
    "text": "Indeed, perhaps a 67.2 in a future time.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6641.968,
    "end": 6642.189,
    "text": "Yes.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6643.63,
    "end": 6643.99,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6644.01,
    "end": 6645.611,
    "text": "Thank you, guys.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 6646.332,
    "end": 6646.592,
    "text": "Thank you.",
    "speaker": "SPEAKER_04"
  }
]