[
  {
    "start": 2.332,
    "end": 19.285,
    "text": " hi it's february 8th 2023 we're in meeting 15 of the act inf textbook group we're in our second discussion in cohort two on chapter six so",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 20.993,
    "end": 24.794,
    "text": " Last week, we looked at a few questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 25.895,
    "end": 35.938,
    "text": "And in this modeling chapter, there's many questions and topics we can come to.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 36.038,
    "end": 41.94,
    "text": "So does anybody want to just raise a question or a thought on six?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 43.1,
    "end": 48.762,
    "text": "Otherwise, we will look through questions and see what we can do.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 56.104,
    "end": 63.368,
    "text": " Yeah, well, I've put a few questions there that came to my mind.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 66.169,
    "end": 66.409,
    "text": "Great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 66.489,
    "end": 67.75,
    "text": "Which one would you like to start with?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 69.671,
    "end": 73.633,
    "text": "So we already talked about this last time, this figure 6.1 on page 110, I believe it is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 73.653,
    "end": 75.294,
    "text": "And where is it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 86.035,
    "end": 87.175,
    "text": " page 108.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 90.476,
    "end": 97.077,
    "text": "And my question was this vertical connection there between active states and sensory states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 97.997,
    "end": 104.378,
    "text": "And I was not able to really understand why we would need to model this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 104.498,
    "end": 112.36,
    "text": "And I've put this into the question there under chapter 6 when I read out that question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 114.798,
    "end": 118.841,
    "text": " So how is the mutual interaction between active states and sensory states meant?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 119.982,
    "end": 127.127,
    "text": "Can they mutually change their states without impacting neither internal nor external states?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 127.767,
    "end": 129.689,
    "text": "So that means they cycle around.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 129.789,
    "end": 132.351,
    "text": "If yes, what is it supposed to model, for instance,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 134.724,
    "end": 145.851,
    "text": " put their cycle around 1,000 times, mutually modifying their states, and then eventually arrive at a state where they change the external or internal states somehow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 147.252,
    "end": 150.454,
    "text": "So means my question is, if they mutually",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 151.799,
    "end": 170.27,
    "text": " are able to change inside these Markov blankets the states without any trace in the external or internal states, then they can catapult or manipulate themselves to come into a situation where suddenly they produce a trace.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 173.031,
    "end": 178.815,
    "text": "And if this is allowed, then I'm wondering, what are we supposed to model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 180.177,
    "end": 182.698,
    "text": " with such processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 184.418,
    "end": 188.66,
    "text": "So because, I mean, you can then explain any arbitrary behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 188.68,
    "end": 196.582,
    "text": "And is it Turing complete, this kind of machine that we are then trying to implement there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 196.602,
    "end": 209.806,
    "text": "And basically, doesn't it undermine explainability of behavior?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 211.283,
    "end": 218.765,
    "text": " So I guess you got my question, but maybe I'm understanding something wrong there.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 221.805,
    "end": 222.845,
    "text": "Anyone else want to give?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 222.945,
    "end": 224.886,
    "text": "Yes, please, Ali, and then go on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 227.906,
    "end": 239.769,
    "text": "I believe those bidirectional paths between active states and sensory states are simply there for the model to be more comprehensive and",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 240.996,
    "end": 255.422,
    "text": " They basically refer to something like reflex arcs, which don't necessarily need to pass through cortical paths.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 256.582,
    "end": 261.224,
    "text": "So that's something much more directly manipulated.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 262.524,
    "end": 269.627,
    "text": "But of course, those direct paths between active states and sensory states could be",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 270.197,
    "end": 280.745,
    "text": " removed from the diagram and we can talk about bypassing internal states or external states when the reflex arcs happen.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 281.186,
    "end": 295.157,
    "text": "But I believe those direct paths are there to account for those kinds of intrinsic or somehow those",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 297.746,
    "end": 300.808,
    "text": " the behaviors akin to reflex arcs.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 302.53,
    "end": 304.371,
    "text": "Thanks, Salih.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 304.772,
    "end": 311.678,
    "text": "But isn't this then the question of what you define to be internal states?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 312.298,
    "end": 320.445,
    "text": "If you say the internal states only start up from a certain point above the spine and below, it's no more internal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 321.346,
    "end": 323.388,
    "text": " then it's an arbitrary decision, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 323.808,
    "end": 335.599,
    "text": "So you could just also say that everything that happens in the hypothalamus is not part of internal states and only what is in the prefrontal cortex is.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 335.779,
    "end": 337.141,
    "text": "And I mean, how?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 337.161,
    "end": 342.766,
    "text": "I mean, this is arbitrary, no?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 343.006,
    "end": 347.09,
    "text": "And what is the reason to have such kind of arbitrary decisions there?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 349.605,
    "end": 359.153,
    "text": " you could then put everything into this direct interaction, depending on where you... Yeah, yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 359.373,
    "end": 375.866,
    "text": "Actually, it is, to some degree, an arbitrary boundary, because as we also read in Chapter 6, defining the Markov blanket boundary depends on the situation we're trying to model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 376.427,
    "end": 379.089,
    "text": "So it's not necessarily something",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 379.551,
    "end": 380.272,
    "text": " predefined.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 380.874,
    "end": 383.96,
    "text": "And it depends what behavior we're trying to model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.08,
    "end": 388.83,
    "text": "So yeah, in some sense, it depends on the context.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 390.021,
    "end": 391.883,
    "text": " And yeah.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 392.203,
    "end": 401.132,
    "text": "But see, my point is, if we are trying to model reflexes, we would put this into the internal states.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 401.993,
    "end": 411.944,
    "text": "But if you allow this direct interaction between active states and sensory states, you're basically",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 413.655,
    "end": 420.782,
    "text": " Isn't this just like saying there is behavior that we cannot explain, but we want to have it in our model?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 423.524,
    "end": 425.306,
    "text": "I will give a thought, but first, Jakob.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 429.028,
    "end": 446.626,
    "text": " yeah i was um i just wanted to add that you could i i think i agree with ali's point that it's probably there for um more i guess explainability or just to kind of um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 448.083,
    "end": 469.07,
    "text": " point to the fact that the active states and sensory states form like a single blanket but I think you could also think of it as enabling another loop with the internal states perhaps where if the external states are very high dimensional and you're in a partially observable",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 469.85,
    "end": 488.555,
    "text": " state where you have like a window of observation then the active states can directly change the sensory states without necessarily changing the external states it's like um psychotic eye movement it's not changing the external states but it is changing your window of observation through action",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 489.315,
    "end": 506.513,
    "text": " And I think that Carl mentioned in one of his talks that these arrows might also represent different levels of sophistication, but I'm not totally clear on how that can be explained.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.889,
    "end": 512.169,
    "text": " Thanks.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 512.649,
    "end": 512.83,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 512.85,
    "end": 515.991,
    "text": "A few angles on this.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 516.792,
    "end": 523.636,
    "text": "So I think the general modeler perspective is what some call an arbitrary decision.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 523.876,
    "end": 525.998,
    "text": "Others might call a modeler degree of freedom.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 526.758,
    "end": 531.501,
    "text": "So the idea that just because something is subjective or arbitrary devalues it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 532.161,
    "end": 535.183,
    "text": "Rather, that is the space in which decisions are made.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 536.064,
    "end": 537.685,
    "text": "And so it's rarely a bad thing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 538.755,
    "end": 542.38,
    "text": " to have a broader family to choose from.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 543.561,
    "end": 552.974,
    "text": "And then let's imagine that there is, okay, second point is the particular partition, which is this one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 553.374,
    "end": 556.679,
    "text": "So here's the particle, the blanket and the internal states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 558.018,
    "end": 579.167,
    "text": " then the autonomous states which are the ones that we're most interested in developing imperatives for are internal states and active states so those are called the autonomous states they're the ones like if you had total control of your mind and action and you had the optimal policy like you'd be thinking and acting optimally",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 580.183,
    "end": 608.895,
    "text": " then that leaves the sensory states as being what we're trying to reduce the divergence with in terms of what we actually observe and what we expect slash prefer okay so the particular partitioning comes into being or a defined set of variables in a base graph it's not like one variable is simply internal states so depending on what model you construct",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 610.515,
    "end": 637.372,
    "text": " there might be a variable might be internal with respect to one but then blanket with respect to another so if we were doing um an eye circadian model like you you might be able to make a base graph where different things corresponded to differences um and then also this allows us to have a model where the entire cognitive behavior is",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 640.089,
    "end": 669.324,
    "text": " accomplished by the blanket so you could have a model where these edges with internal states do nothing and that is corresponding to the the strange types that we talked about previously like it corresponds to an inert particle that's not doing anything that we might call truly cognitive which is to say that its perception and action are mediated entirely by its blanket",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 670.285,
    "end": 679.927,
    "text": " And so there are systems where the entire performance can be understood on the holograph, on the blanket.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 681.187,
    "end": 684.448,
    "text": "Other systems, we might want to extend that.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 685.428,
    "end": 693.21,
    "text": "And there might be a system where this edge is parameterized from empirical data to be zero, or where you set this to be zero.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 694.25,
    "end": 699.171,
    "text": "But another way to view this graph",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 700.37,
    "end": 706.515,
    "text": " is as a four by four matrix where the edges reflect relationships.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 707.476,
    "end": 712.76,
    "text": "So if it was just four independent variables, it would look like the identity matrix.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 713.86,
    "end": 722.747,
    "text": "And then the off-diagonal elements of that four by four matrix reflect the causal influence of different variables on each other.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 724.448,
    "end": 728.712,
    "text": "And so you can have the around the clock, you could have the bi-directional around the clock,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 730.026,
    "end": 750.388,
    "text": " could have the telepathic model where there's a direct edge between internal and external so you could fit the full four by four but that would be equivalent to fitting a linear regression with four variables testing for all by all interactions",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 751.277,
    "end": 755.418,
    "text": " which you might want to do, also that has the least statistical power.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 756.158,
    "end": 767.741,
    "text": "And so in terms of which edges it makes sense to fix to zero, removing the telepathy slash telekinesis edge is a really important one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 769.242,
    "end": 777.144,
    "text": "And then there's a few other edges that are removed, like internal backward causing sense and external backwards causing action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 778.237,
    "end": 781.92,
    "text": " But that's not to say this is the only topology of the action-perception loop.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 782.44,
    "end": 782.7,
    "text": "Michael?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 785.682,
    "end": 795.79,
    "text": "Yeah, so I'm just wondering how... Well, as I said, I'm trying to apply this to our translation process data.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 795.87,
    "end": 798.952,
    "text": "So we have gaze data and keystrokes and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 799.512,
    "end": 803.375,
    "text": "And there is one observation in translation that",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 805.116,
    "end": 818.259,
    "text": " It's a mixture of priming processes, so of partially automatized processes, and monitoring processes where higher cognitive decisions or reflective thought maybe comes into play.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 818.299,
    "end": 827.401,
    "text": "So it means that translation is a mixture of automatized production routines and monitoring intervention.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 828.081,
    "end": 831.242,
    "text": "And I'm wondering whether this model then would",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 833.823,
    "end": 840.247,
    "text": " could be used to say that these priming processes are these direct links between sensation and action.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 841.988,
    "end": 857.878,
    "text": "And these higher order reflective processes, and so somebody maybe thinks of in which context does the translation make sense and all this, whether this would then be better modeled with the other route.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 861.04,
    "end": 865.582,
    "text": " So in this case, of course, these priming processes happen in the head somewhere.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 865.702,
    "end": 867.443,
    "text": "It's not in the spine, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 867.463,
    "end": 874.766,
    "text": "So translator produces and nevertheless uses the head, but there's priming processes and other kinds of processes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 874.966,
    "end": 877.667,
    "text": "Do you think that makes sense to view it that way?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 877.687,
    "end": 890.153,
    "text": "I think we can actually very quickly run the recipe and understand Ali first, and then we'll come to the recipe.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 894.081,
    "end": 906.582,
    "text": " I think one point that might help to understand this diagram slightly better is that in most of the literature related to active inference and FEP,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 907.786,
    "end": 914.711,
    "text": " The word particle is used to refer to the joint set of internal states and blanket states.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 915.192,
    "end": 920.996,
    "text": "But in some other papers, instead of particles, they use system or agent.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 921.616,
    "end": 926.54,
    "text": "So actually, in some sense, those markup blankets",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 928.181,
    "end": 931.703,
    "text": " belong to the agent we're trying to model.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 932.904,
    "end": 946.113,
    "text": "But the reason behind distinguishing between the markup blanket and internal state is purely for modeling purposes.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 947.814,
    "end": 950.536,
    "text": "I'm not sure if it makes sense or not.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 950.576,
    "end": 955.539,
    "text": "But yeah, so in any case, those markup blankets",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 956.877,
    "end": 965.04,
    "text": " would actually constitute parts of this ancient agent we're trying to model here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 969.542,
    "end": 970.622,
    "text": "OK, thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 970.742,
    "end": 974.144,
    "text": "Let's just imagine just rapid fire.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 974.244,
    "end": 982.047,
    "text": "You have the most translation experience, but others can imagine potentially what",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 983.496,
    "end": 1004.109,
    "text": " translation setting would be so we'll just give one thought we don't need to um expound on all of them but we're gonna focus on the particular partition and then we'll use that to understand like what family of action perception loops are we actually fitting so what question are we looking to answer",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1011.249,
    "end": 1013.432,
    "text": " Or what phenomena are we looking to model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1017.177,
    "end": 1017.878,
    "text": "Are you asking me?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1018.479,
    "end": 1018.679,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1019.12,
    "end": 1023.506,
    "text": "What's an interesting question for you or for anyone about translation, human translation?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1028.154,
    "end": 1041.82,
    "text": " Yeah, so we would like, I guess, try to understand translator-environment interaction and how translators produce translations.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1042.82,
    "end": 1044.121,
    "text": "What are the difficulties?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1044.201,
    "end": 1047.242,
    "text": "What are the processes that go on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1049.963,
    "end": 1050.743,
    "text": "Difficulties.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1052.464,
    "end": 1052.724,
    "text": "OK.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1054.645,
    "end": 1057.206,
    "text": "Which data do we have?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1061.767,
    "end": 1064.248,
    "text": " We have the observations on the Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1064.288,
    "end": 1072.112,
    "text": "So we have gaze data, reading patterns on the source and the target text, and we have typing behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1072.853,
    "end": 1079.116,
    "text": "So the insertions and deletions that happen in the texts.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1080.696,
    "end": 1080.977,
    "text": "OK.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1083.958,
    "end": 1084.198,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1086.451,
    "end": 1112.599,
    "text": " now we're going to go to the form of the generative model as we mentioned last week like it doesn't have to necessarily be in this order each time but now we're going to so here no markov blankets need to be mentioned this is just empirically which data exists or what are we trying to model now let's think about um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1114.859,
    "end": 1141.765,
    "text": " using the ontology what are the particular partitions going to be so okay the action states these ones do correspond to actions that you you have collected on so we have isocades",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1143.157,
    "end": 1171.012,
    "text": " which there's actually there are active models of sentence comprehension and typing so here the eye saccades could be understood as being selected from directions that the eye can move and the typing could be understood as like at the letter or the word scale okay what sense data or sense states are going to be incoming",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1173.045,
    "end": 1178.968,
    "text": " Well, I would put these eye saccades into the sense thing or the reading pattern.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1179.368,
    "end": 1184.931,
    "text": "So with an eye tracker, we can see where the eyes are on the text.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1184.991,
    "end": 1190.734,
    "text": "So we can see the items, the tokens that are read.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1191.915,
    "end": 1192.175,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1192.775,
    "end": 1199.158,
    "text": "So the sense could be the incoming visual perception, which token is being viewed.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1200.479,
    "end": 1202.22,
    "text": "But the eye saccade is an action.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1203.248,
    "end": 1229.26,
    "text": " yeah but okay this is a policy up down left right that the eye can move to obtain a different sense state okay so they're describing random variables in a base graph they're not necessarily describing um spatially separated parts of an organism okay now this is where",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1230.399,
    "end": 1243.125,
    "text": " there's a lot of degrees of freedom in what is being modeled as the internal the external state so does anyone have a thought on what the internal or the external states might be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1246.44,
    "end": 1252.706,
    "text": " So the way we are trying to see this is that the internal states can be fluent.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1253.366,
    "end": 1255.648,
    "text": "So the person can be in a steady state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1255.729,
    "end": 1260.313,
    "text": "So they can be just looking a little bit ahead, fluently translating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1260.393,
    "end": 1264.797,
    "text": "So it's a kind of fluent production state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1266.414,
    "end": 1268.356,
    "text": " exactly non-equilibrium steady state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1269.076,
    "end": 1274.301,
    "text": "Or they can be in a state where they are confused or hesitating.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1274.761,
    "end": 1283.628,
    "text": "We can see this by the eye gaze data going back and forth in the text, revision, trying out some options, and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1283.668,
    "end": 1285.35,
    "text": "So there's kind of a hesitation.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1285.87,
    "end": 1294.117,
    "text": "That would be an internal state, in my understanding, searching and, well, a kind of surprise.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1296.723,
    "end": 1321.654,
    "text": " Or they could be in a state where they try to, so what I think is called epistemic state, where they go ahead intentionally and try to activate the correct or the appropriate mental resources to be able to then use this in a translation in a steady state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1326.004,
    "end": 1326.784,
    "text": " Does that make sense?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1328.025,
    "end": 1329.806,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1329.826,
    "end": 1338.591,
    "text": "I might put forth that fluency, confusion, hesitation, or just thinking, these are like categorizations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1339.693,
    "end": 1345.878,
    "text": " that you're going to be able to delineate from the phase space of a variable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1346.458,
    "end": 1348.46,
    "text": "And so the question is, what is the variable?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1349.321,
    "end": 1360.149,
    "text": "So one option, but anyone feel free to give a different option would be the external state are the true hidden semantics of the text.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1361.35,
    "end": 1364.973,
    "text": "And the internal state would be the received semantics of the text.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1366.724,
    "end": 1394.24,
    "text": " like just thinking about numbers like we're doing a cooking recipe but we're less fluent or we're translating a cooking recipe so it's three cups of sugar and two cups of flour we're going to be engaging in isocades to reduce our uncertainty about the semantics of a text",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1395.182,
    "end": 1399.626,
    "text": " But of course, we can't directly see the semantics of a text.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1400.207,
    "end": 1400.787,
    "text": "What do we get?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1401.748,
    "end": 1403.129,
    "text": "Incoming visual tokens.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1404.37,
    "end": 1405.571,
    "text": "What do visual tokens do?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1406.692,
    "end": 1409.695,
    "text": "Visual tokens reduce our uncertainty about the semantics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1410.496,
    "end": 1413.198,
    "text": "What do we do now that we've resolved semantics?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1413.959,
    "end": 1415.801,
    "text": "Well, we can take actions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1417.526,
    "end": 1444.731,
    "text": " which constraining or if we didn't have to type this is a complex because there's like two kind of very different kinds of actions but let's just say we were just reading to understand so we're doing silent translation we're just reading and understanding something in a in a language so then if you had sufficiently resolved your uncertainty about us about the the word you'd imagine that you had taken isocade",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1446.209,
    "end": 1452.373,
    "text": " to where you expect the next piece of semantics to be resolved, next word.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1453.174,
    "end": 1464.182,
    "text": "Whereas if the incoming sensory states are not adequately resolving your uncertainty, you might pause or you might even go back.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1467.084,
    "end": 1474.629,
    "text": "And then from patterns of flow across the agent states,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1477.31,
    "end": 1502.946,
    "text": " then you could categorize those into categories like fluent reading hesitant reading distracted that's one option or one can imbue the model with like a little bit more like a more opinionated model where you could say an internal state is going to be",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1504.266,
    "end": 1508.668,
    "text": " whether they're in this or that mode.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1510.609,
    "end": 1532.018,
    "text": "So just to kind of summarize that, you can have internal states reflect semantics and then have a secondary categorization of different zones in that phase space, or you can have a more opinionated model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1533.942,
    "end": 1542.329,
    "text": " that is explicitly modeling transitions between, for example, fluent production and confusion.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1548.774,
    "end": 1550.115,
    "text": "I need to think about this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1551.275,
    "end": 1551.896,
    "text": "Good ideas.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1551.956,
    "end": 1552.416,
    "text": "Thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1552.516,
    "end": 1552.737,
    "text": "Yes.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1553.437,
    "end": 1553.617,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1553.918,
    "end": 1558.141,
    "text": "And then just to kind of let's just continue just briefly to this last piece.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1560.062,
    "end": 1562.004,
    "text": "How would we set up the generative model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1563.612,
    "end": 1567.435,
    "text": " Well, let's look at how they talk about setting up the generative model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1573.681,
    "end": 1575.262,
    "text": "What are the variables and priors?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1576.023,
    "end": 1578.244,
    "text": "Okay, so here was just natural language.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1580.006,
    "end": 1581.747,
    "text": "So the semantics of the text.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1582.388,
    "end": 1584.83,
    "text": "So what should that variable be?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1585.551,
    "end": 1588.934,
    "text": "Are we reading a text that's just ones and zeros?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1590.14,
    "end": 1596.123,
    "text": " Or is there going to be, are we doing genre detection and there's five genre?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1597.284,
    "end": 1603.468,
    "text": "Or what is the actual state space of different variables?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1606.83,
    "end": 1610.512,
    "text": "For typing, are we going to have the state space be letters?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1611.676,
    "end": 1635.101,
    "text": " and then basically have like a transition matrix of letters which is like some of the earliest information theory or will we have a transition matrix of words or a transition matrix of motifs so those are all what some might call subjective but they're model or degrees of freedom there isn't a right answer there's just what model is made we",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1636.104,
    "end": 1640.908,
    "text": " We have actually something we call activity units.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1640.948,
    "end": 1655.801,
    "text": "So we can chop up the text or the translation process into smaller pieces where we can see whether a person types or reads a text or has concurrent typing and reading.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1656.642,
    "end": 1663.75,
    "text": " And so we can chop up the timeline into smaller units, which we call activity units.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1664.531,
    "end": 1670.817,
    "text": "And this, I think, would be the units on which we would like to.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1673.28,
    "end": 1673.54,
    "text": " work.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1674.881,
    "end": 1679.102,
    "text": "So the idea here is not to simulate a translation system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1679.142,
    "end": 1689.986,
    "text": "We're not so much interested what is actually the text, the translation being produced, but say the textual elements",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1691.28,
    "end": 1692.861,
    "text": " but rather the process elements.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1693.462,
    "end": 1695.284,
    "text": "So it means how long does it take?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1695.444,
    "end": 1699.227,
    "text": "What is the interval between successive keystrokes?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1699.888,
    "end": 1708.435,
    "text": "And what is the offset between gaze and typing and so on?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1708.475,
    "end": 1709.997,
    "text": "What are the gazing patterns?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1710.257,
    "end": 1713.26,
    "text": "So how long ahead do people read in the text?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1714.441,
    "end": 1714.861,
    "text": " and so on.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1714.881,
    "end": 1723.388,
    "text": "So it's more the temporal structure that we want to model, not the semantic structure, actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1724.148,
    "end": 1724.989,
    "text": "Yes, great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1725.99,
    "end": 1728.992,
    "text": "So we are not trying to simulate a machine translation system.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1729.773,
    "end": 1729.973,
    "text": "Yep.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1730.373,
    "end": 1739.801,
    "text": "So this could be simply like the most coarse-grained typing model would be there's two affordances, typing or not typing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1740.802,
    "end": 1741.002,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1741.542,
    "end": 1742.663,
    "text": "Yeah, and again...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1743.69,
    "end": 1764.311,
    "text": " one person could say these are subjective differences between models but these are the kinds of models if one were to really do a research project on that you could compare these three models or you could say we chose to pursue a model with this state space for this reason or like which parts are fixed and which must be learned well",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1765.475,
    "end": 1773.539,
    "text": " We know that there's things that can be learned by real humans, but the question is what is going to be fixed or learned in this model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1777.581,
    "end": 1791.068,
    "text": "And fixed models are simpler computationally and they have a simpler interpretation, but sometimes the function of learning then gets displaced and results in",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1792.768,
    "end": 1816.673,
    "text": " distorted behavior from other parameters so this is why modeling is an iterative process and why it involves constructing sometimes vast families of cousin models to understand the stability of different parameters because maybe once you you enable learning on something",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1818.086,
    "end": 1836.775,
    "text": " then that might change another parameter because all of a sudden it doesn't need to be taking on some kind of role and then which aspects are perception-like?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1838.636,
    "end": 1840.797,
    "text": "which aspects are learning-like?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1842.277,
    "end": 1845.359,
    "text": "and then the last question is how to set up the generative process",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1847.355,
    "end": 1848.936,
    "text": " Interesting little hidden character.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1856.0,
    "end": 1858.721,
    "text": "Not sure if that's just my reader, but that's very interesting.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1860.142,
    "end": 1863.724,
    "text": "What are the elements of a generative process and how do they differ from a generative model?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1864.424,
    "end": 1874.109,
    "text": "So the generative process, the niche, it could be another Act-Inf agent, or it could just be a static text.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1878.206,
    "end": 1905.671,
    "text": " that passes tokens in order or it could be a conversant but the exact structure of the state space and then which families of statistical distributions one chooses for priors those are modular degrees of freedom",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1909.099,
    "end": 1937.305,
    "text": " won't just be one for any natural system in in our last third what would be another good chapter six direction to go there's a lot",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1957.691,
    "end": 1965.681,
    "text": " Okay, the decision, the choice between discrete and continuous models is more simply articulated using discrete time models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1967.063,
    "end": 1968.865,
    "text": "Okay, who has a thought on why that is?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1968.905,
    "end": 1970.107,
    "text": "That's a very good question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1998.663,
    "end": 2000.344,
    "text": " Here's one possible answer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2002.144,
    "end": 2003.164,
    "text": "What was the question again?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2004.305,
    "end": 2014.288,
    "text": "Why is it the decision to model alternative futures contingent on policy selection is largely tied up with a choice between discrete and continuous models?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2016.748,
    "end": 2021.95,
    "text": "Why are alternative futures more simply articulated with discrete time models?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2050.413,
    "end": 2075.471,
    "text": " in the discrete state space model figure 4.3 as usual hidden states past now future and that could have temporal depth even further but we're making an explicit prediction about like the hidden state at time seven",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2076.846,
    "end": 2079.127,
    "text": " if we're interested in time depth of seven.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2079.887,
    "end": 2094.03,
    "text": "And then if we have two affordances, we're evaluating all of those combinatorics, every policy, which is a sequence of actions of length seven.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2094.57,
    "end": 2099.651,
    "text": "For each of those policies, we're going to evaluate what the hidden states will be.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2100.771,
    "end": 2102.412,
    "text": "So you could ask under policy 22,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2104.77,
    "end": 2109.132,
    "text": " up, up, up, down, up, up, up, what would the hidden state be?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2109.873,
    "end": 2112.434,
    "text": "And then what observations might I expect?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2113.535,
    "end": 2125.641,
    "text": "So the discrete state space formalization is amenable to talking about specific moments in specific policy that are under consideration.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2126.701,
    "end": 2133.565,
    "text": "And then of course, like those policies are going to be evaluated according to their expected free energy.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2136.397,
    "end": 2145.259,
    "text": " The continuous time case is structurally similar, which is the big visual message of figure 4.3.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2146.38,
    "end": 2155.962,
    "text": "But note that while B in the discrete time case is a transition matrix, how does the time point move into the next time point?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2156.002,
    "end": 2159.203,
    "text": "So you multiply forward with B, and then that's how the hidden states move forward.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2159.983,
    "end": 2163.704,
    "text": "And that's where policy intervenes, how hidden states change through time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2165.345,
    "end": 2180.093,
    "text": " In the continuous time case, it's a lot more like a Taylor series expansion because node three here is the derivative of x conditioned upon x and v causes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2181.514,
    "end": 2190.739,
    "text": "So in this case, it's not that we're explicitly predicting at five time steps from the future if I do this or that,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2191.769,
    "end": 2217.38,
    "text": " but rather under a given policy that's being considered there's a function that's being approximated with higher and higher derivatives so it doesn't have as straightforward of an interpretation you still could ask under this Taylor series approximation",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2218.695,
    "end": 2243.506,
    "text": " at five time steps out what's my prediction so you can ask that and you could even compare under um derivative uh under v1 or v2 two different ways of taking derivatives we can evaluate so it's not that you can't evaluate the um",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2245.618,
    "end": 2248.5,
    "text": " alternate futures contingent on policy selection.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2250.781,
    "end": 2254.943,
    "text": "And that is exactly what happens with expected free energy in continuous state space models.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2255.643,
    "end": 2269.771,
    "text": "So it is possible to compare alternate futures and still use expected free energy, but only in the discrete case do we actually have sequences of actions defined along the way.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2276.811,
    "end": 2290.876,
    "text": " So does this mean if, in the nondiscrete case, we need to look into the seventh derivation to see what happens, say, seven points in time ahead?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2293.017,
    "end": 2293.277,
    "text": "No.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2293.818,
    "end": 2295.558,
    "text": "That's a great question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2297.459,
    "end": 2302.341,
    "text": "You could do a Taylor series a depth of 1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2304.144,
    "end": 2309.225,
    "text": " So a Taylor series depth with approximation of one, let's see if there's a graph.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2309.345,
    "end": 2309.505,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2314.267,
    "end": 2314.527,
    "text": "Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2315.507,
    "end": 2317.668,
    "text": "So let's just say we do a Taylor series with one term.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2319.008,
    "end": 2320.729,
    "text": "So it just is literally a flat line.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2321.969,
    "end": 2323.789,
    "text": "We can look ahead any depth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2326.09,
    "end": 2329.351,
    "text": "We could look ahead a thousand time points with a Taylor series of depth of one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2330.765,
    "end": 2334.008,
    "text": " and we don't need to explicitly predict those thousand time steps.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2334.268,
    "end": 2342.435,
    "text": "Whereas if we wanted a thousand time steps deep with discrete, we would need to explicitly model every single step.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2343.255,
    "end": 2345.157,
    "text": "What is the B matrix from 997 to 998?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2347.919,
    "end": 2349.981,
    "text": "So that's the strength and the weakness of the Taylor series.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2350.581,
    "end": 2356.306,
    "text": "The Taylor series, you can have a really simple approximation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2356.326,
    "end": 2357.547,
    "text": "Oh, well, how about two terms?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2357.587,
    "end": 2358.608,
    "text": "Let's do the green one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2359.764,
    "end": 2363.605,
    "text": " And you could use that two-term approximation any depth.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2365.666,
    "end": 2377.59,
    "text": "And as you get more and more terms, they, just like principal component dimensions, they always make a better and better approximation.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2378.911,
    "end": 2381.432,
    "text": "Sometimes a lot, sometimes a little, but you always do get better.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2382.052,
    "end": 2387.434,
    "text": "So kind of like the contact zone between the true function, blue, cosine in this situation,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2390.08,
    "end": 2395.966,
    "text": " The contact zone, as you do higher approximations, always extends out more.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2397.548,
    "end": 2400.111,
    "text": "Like brown peels off here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2400.872,
    "end": 2402.253,
    "text": "Purple peels off here.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2404.175,
    "end": 2409.962,
    "text": "And that's part of the issue is also with Taylor series and just modeling in general, you don't really know how well you're doing",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2411.397,
    "end": 2414.9,
    "text": " because the green line is not going to complain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2414.92,
    "end": 2417.762,
    "text": "Oh, what's the cosine approximation of 11?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2417.802,
    "end": 2420.003,
    "text": "That's negative 200.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2421.524,
    "end": 2424.707,
    "text": "No, but the model's not going to complain.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2425.167,
    "end": 2425.387,
    "text": "Ali?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2434.454,
    "end": 2435.495,
    "text": "Possible unmute, Ali.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2436.656,
    "end": 2436.876,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2438.934,
    "end": 2441.276,
    "text": " First of all, sorry, I have some connection problems.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2441.296,
    "end": 2464.618,
    "text": "I'm not sure if my voice is intelligible, but one interesting point is actually some neuroscientists such as Rizzolatti and Sinigaglia, two prominent Italian neuroscientists, explain this choice of actions in terms of mosaic of zones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2465.865,
    "end": 2466.225,
    "text": " zones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2466.786,
    "end": 2480.756,
    "text": "So each zone in this mosaic would contain information about the parameters that must be used to select the most appropriate variant of action to act on an object or",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2487.532,
    "end": 2513.989,
    "text": " okay okay we we did just lose um only but we got that part mosaic of zones um okay let's see if we can get but um so suffice to say discrete state space downside you have to explicitly model you know the upside you get to explicitly model downside you have to explicitly model",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2516.121,
    "end": 2524.604,
    "text": " So if you want to do temporal depth of 30, you need to run that out across the combinatorics of policy for a depth of 30.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2525.865,
    "end": 2533.507,
    "text": "So the computational complexity can be extremely high, which we explored in the branching time active inference discussions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2534.908,
    "end": 2537.849,
    "text": "So here is like, it makes a massive tree search.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2538.729,
    "end": 2543.671,
    "text": "So it's kind of like a chess algorithm, at least some chess algorithms.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2544.744,
    "end": 2572.838,
    "text": " continuous state space has a very very defined uh computational complexity however it doesn't have the exact um ability to say like other than just generating this smooth function you can't really say too much more like how would it have been different if I went up up up up up down versus up again",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2577.566,
    "end": 2581.49,
    "text": " Okay.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2583.131,
    "end": 2588.596,
    "text": "Ali, we heard you with a mosaic of zones, so you could maybe add the links into the page.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2592.36,
    "end": 2595.783,
    "text": "Any one or two more questions that people would like to come to?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2595.803,
    "end": 2600.207,
    "text": "How about this one?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2603.078,
    "end": 2604.379,
    "text": " What is meant by a variable?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2605.079,
    "end": 2606.44,
    "text": "States or observations.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2606.681,
    "end": 2608.102,
    "text": "How can states be continuous?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2627.335,
    "end": 2628.596,
    "text": "So states can be continuous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2630.256,
    "end": 2638.12,
    "text": " A continuous variable is like one where there's a smooth knob that is controlling the value.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2638.62,
    "end": 2641.041,
    "text": "So this is like a smooth knob.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2641.061,
    "end": 2645.323,
    "text": "It could be any number between 0 and 1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2645.443,
    "end": 2645.783,
    "text": "It could be 0.77772.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2645.924,
    "end": 2649.925,
    "text": "Or discrete could be like 0 or 1.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2649.965,
    "end": 2652.207,
    "text": "Or it could be 1, 2, 3, 4, 5.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2659.249,
    "end": 2661.15,
    "text": " So that's how states can be continuous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2664.012,
    "end": 2667.654,
    "text": "What is meant by variable states or observations?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2668.874,
    "end": 2673.076,
    "text": "So variables and states basically mean the same thing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2674.117,
    "end": 2683.102,
    "text": "Like a variable is just a, it's a parameter in an equation or in a program and variables take on states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2684.983,
    "end": 2695.735,
    "text": " So the variable could be continuous between 0 and 1, and then the state that it's in is 0.6, and then observations are one kind of variable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2697.197,
    "end": 2697.417,
    "text": "Michael?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2700.595,
    "end": 2706.64,
    "text": " Yeah, so how would you then model the difference between the observations and the states?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2707.381,
    "end": 2708.582,
    "text": "Is there a problem?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2708.762,
    "end": 2709.883,
    "text": "Is that straightforward?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2711.745,
    "end": 2722.334,
    "text": "So if I have a knob and I can turn it on and off, so I have two observations for that knob, or I can turn it like a dimmer or something,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2723.655,
    "end": 2731.379,
    "text": " with infinite number of observations, but the knob itself is just one thing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2731.819,
    "end": 2733.14,
    "text": "So I'm not sure.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2733.16,
    "end": 2734.42,
    "text": "Yeah, great.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2734.44,
    "end": 2735.281,
    "text": "I should understand that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2736.962,
    "end": 2739.603,
    "text": "OK, so we're doing a volume knob.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2740.524,
    "end": 2741.785,
    "text": "The knob is the territory.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2742.385,
    "end": 2744.606,
    "text": "It has physical, it's made of metal.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2745.266,
    "end": 2749.129,
    "text": "OK, now there's multiple maps that you could make of that knob.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2750.014,
    "end": 2752.416,
    "text": " You could ask whether it's playing or not.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2753.257,
    "end": 2755.578,
    "text": "That would be a binary discrete space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2756.719,
    "end": 2761.163,
    "text": "You could say we're going to do 10 volume levels.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2762.984,
    "end": 2768.568,
    "text": "This would be discrete with 10 possible states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2770.57,
    "end": 2771.03,
    "text": "Or you could do 100.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2774.233,
    "end": 2775.574,
    "text": "Or you could do a continuous variable.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2777.873,
    "end": 2805.174,
    "text": " any number from zero to one so it's like a it's a total classic map territory question state spaces are about variables variables are in the map if i make a variable corresponding to weight like of a person it could be over under 100 pounds",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2806.806,
    "end": 2808.367,
    "text": " It could be integers.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2809.548,
    "end": 2812.01,
    "text": "It could be tenths of a pound.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2812.51,
    "end": 2814.171,
    "text": "That's still a discrete state space.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2815.653,
    "end": 2818.014,
    "text": "It could be a continuous number.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2824.679,
    "end": 2829.043,
    "text": "Jonathan wrote, you could then imagine that observations could be discrete even when states may be continuous.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2829.183,
    "end": 2832.225,
    "text": "It may be that we can't tell the difference between the very finely graded states.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2832.945,
    "end": 2833.146,
    "text": "Yes.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2834.161,
    "end": 2856.532,
    "text": " great point like just noticeable difference um and when you do discretized models it becomes like a trade-off where the more coarse graining you do the simpler the model is but you're making bigger and bigger buckets that are clumping together more and more disparate things",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2858.018,
    "end": 2873.968,
    "text": " Whereas if you do this really fine scale discretized model, like hundredth of a pound, and we're going to be weighing people, then you can get all these like bizarre phenomena where it's like, well, if they're 137.1 pound, then this is the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2874.008,
    "end": 2876.47,
    "text": "But if they're 137.2, then this is the case.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2877.23,
    "end": 2886.757,
    "text": "So finding that optimal discretization is a big topic in optimization in general and in modeling.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2888.241,
    "end": 2895.726,
    "text": " And then another piece to remember, the state space of the external state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2895.846,
    "end": 2901.89,
    "text": "So we're still not even talking about the territory itself, but the state space of the external variables.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2902.97,
    "end": 2910.375,
    "text": "So our model of temperature, it doesn't have to be the same as the cognitive model of the agent.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2911.816,
    "end": 2916.879,
    "text": "So we could say in the simulation, temperature is an integer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2918.584,
    "end": 2944.555,
    "text": " and then they're going to have three states cold just right and hot or here in the external world it could be continuous variable and then in the brain it could be three state or it could be a continuous variable or it could be anything else what matters is the observation coming in and then how that gets fit into the generative model ali",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2948.305,
    "end": 2950.006,
    "text": " Yeah, apologies, I got disconnected.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2951.726,
    "end": 2959.95,
    "text": "As I was saying, some neuroscientists explain the choice of appropriate action in terms of the mosaic of zones.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2961.07,
    "end": 2969.133,
    "text": "And by that, they mean that each zone is the mosaic that would contain the information",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2971.195,
    "end": 2978.339,
    "text": " to act upon the affordances or the goal-directed sequences to act upon the affordances.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2978.399,
    "end": 2984.402,
    "text": "So, as an example, take for instance the task of picking up a cup of coffee.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2985.583,
    "end": 2994.268,
    "text": "This seemingly simple task can be done in various ways depending on whether we are drinking from it,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 2995.164,
    "end": 2999.288,
    "text": " In that case, we would probably grasp it by the handle.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3000.649,
    "end": 3008.495,
    "text": "Or if we're washing it, so in that case, we would probably grasp it by the rim or moving it out of the way.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3009.767,
    "end": 3019.154,
    "text": " which in that case the grasping it by the body would probably be the more appropriate sequence of action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3019.555,
    "end": 3035.326,
    "text": "So which of these actions is deemed appropriate for a task is worked out within that mosaic of zones which they also correlate with some cortical areas which",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3037.207,
    "end": 3050.111,
    "text": " maps those mosaic zones quite literally in order to afford the agent this ability to pick the appropriate action in each situation.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3052.211,
    "end": 3052.591,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3052.851,
    "end": 3053.151,
    "text": "Cool.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3054.152,
    "end": 3054.472,
    "text": "All right.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3055.712,
    "end": 3059.593,
    "text": "That is our second discussion on Chapter 6.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3059.733,
    "end": 3062.594,
    "text": "So 6, in summary,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3063.911,
    "end": 3069.618,
    "text": " outlines some of the most important design choices that have been made in setting up an active inference model.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3070.879,
    "end": 3076.205,
    "text": "We have explored a lot of auxiliary routes and questions.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3077.549,
    "end": 3099.527,
    "text": " and hopefully this conveys some of the richness and excitement and openness around making a model because even for simple phenomena there's many ways to do it and even for simple phenomena it's not just about making one model and parameterizing it once it's like an iterated modeling process where you're generating these families of models",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3100.68,
    "end": 3104.043,
    "text": " They provided a recipe, some guidelines and thoughts.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3104.903,
    "end": 3108.726,
    "text": "They point out that it doesn't have to be followed in that particular order.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3110.988,
    "end": 3120.656,
    "text": "This sets up the remainder of the book, which puts the ideas into practice through a series of illustrative examples designed to showcase the theoretical principles presented in the first half of the book.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3122.017,
    "end": 3127.041,
    "text": "In everything that follows, the only differences amongst the example rest on the design choices we have highlighted.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3128.78,
    "end": 3138.043,
    "text": " Part two illustrates systems with different boundaries, discrete or continuous dynamics at different time scales, and that will all be implementing ACT-INF.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3139.043,
    "end": 3143.445,
    "text": "So we're going to head into chapter seven next time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3145.405,
    "end": 3148.326,
    "text": "Chapter seven is active inference in discrete time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3149.147,
    "end": 3152.348,
    "text": "We're going to look at generative models that have a discrete time characteristic.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3153.428,
    "end": 3155.449,
    "text": "Chapter eight is continuous time.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3156.26,
    "end": 3160.001,
    "text": " So that distinction was kind of raised earlier in figure 4.3.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3160.761,
    "end": 3166.503,
    "text": "Chapter 7 and 8 are like a pair that are going to highlight those two different possibilities.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3167.283,
    "end": 3171.964,
    "text": "Chapter 9 is about data-driven analysis and chapter 10 is a conclusion chapter.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3172.524,
    "end": 3177.066,
    "text": "So that concludes this session.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3178.206,
    "end": 3184.628,
    "text": "Thanks everybody for the great times and we'll come back next week for chapter 7.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3185.368,
    "end": 3185.628,
    "text": "Thank you.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3186.769,
    "end": 3187.094,
    "text": " Thank you.",
    "speaker": "SPEAKER_02"
  }
]