[
  {
    "start": 7.898,
    "end": 27.29,
    "text": " hello and welcome everybody this is physics as information processing it's october 28th 2023 and we're in discussion six so we'll see where and how and when we go but to begin with",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 28.322,
    "end": 54.293,
    "text": " thank you for watching if you're watching live please feel free to write any questions or comments in the live chat as this is our last discussion we're going to be probably ranging broadly so looking forward to people's comments there otherwise perhaps we can all go around first and say hello or just give any thoughts or reflections",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 55.595,
    "end": 56.576,
    "text": " to get things going.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 57.476,
    "end": 67.802,
    "text": "And then we'll jump into some of the questions and answers and look at some of these great thoughts that have been sent and responded to.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 68.142,
    "end": 78.147,
    "text": "So perhaps Dean and then Harrison, David, any just overall thoughts or comments to get us going?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 80.288,
    "end": 80.829,
    "text": "Thanks, Daniel.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 81.169,
    "end": 84.811,
    "text": "I guess my overall impression was that I think that the way that the",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 85.709,
    "end": 111.836,
    "text": " entire series was organized and and um structured allowed for these kinds of conversations that we're having today which i think are really really valuable as you can see on the slide here i think a lot of a lot of question and answer tends to be focused around what is um whereas the the conversations that we've had",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 112.931,
    "end": 120.197,
    "text": " we can sort of tease that apart a little bit and ask questions around what if, and get into the counterfactual piece of it and interact around that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 120.237,
    "end": 121.878,
    "text": "And I've really, really appreciated that.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 121.938,
    "end": 127.542,
    "text": "So that's my overall sense that we haven't left it sort of on the page.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 129.344,
    "end": 133.607,
    "text": "We've actually been able to sort of breathe some life into it through these conversations.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 138.411,
    "end": 138.731,
    "text": "Cool.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 139.332,
    "end": 139.632,
    "text": "Harris?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 141.687,
    "end": 145.589,
    "text": " Yeah, I just wanted to say that it was a great series.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 146.55,
    "end": 165.36,
    "text": "We all learned a lot and we got the opportunity to even ask questions to Chris and get back some very insightful answers that they are very helpful in order to, let's say, push the envelope forward.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 166.766,
    "end": 170.008,
    "text": " Overall, this has been a great series.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 170.528,
    "end": 171.549,
    "text": "I've enjoyed it a lot.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 172.489,
    "end": 177.511,
    "text": "And while conversing with some of my colleagues, they also enjoyed it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 177.591,
    "end": 180.333,
    "text": "So the feedback is great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 181.253,
    "end": 186.916,
    "text": "And thanks to Active Inference Institute for facilitating this and to you guys.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 188.797,
    "end": 189.098,
    "text": " Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 189.619,
    "end": 190.019,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 190.741,
    "end": 197.735,
    "text": "And welcome, David, if you want to just begin with any thoughts or what brought you into the game in the bottom of the ninth.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 200.642,
    "end": 228.077,
    "text": " um well in in school i was actually trying to use um free energy to develop some sort of a network of agents that were deciding what information to send and what states to be in based on each other's approximation of each other's states and um so i registered at the beginning but then i guess life happened i didn't really participate",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 230.202,
    "end": 238.046,
    "text": " But, um, yeah, so now I'm just kind of opening up to things and participating more in the world that I exist in.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 238.586,
    "end": 243.668,
    "text": "And this is a natural, um, this is really tied to, to the work that I was doing in school.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 245.469,
    "end": 250.311,
    "text": "I don't know if this is a place to ask a question, so I'm not gonna ask any questions, but that's like the first one.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 250.391,
    "end": 251.191,
    "text": "Let's begin with that.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 252.572,
    "end": 252.792,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 253.052,
    "end": 253.292,
    "text": "Oh yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 253.312,
    "end": 259.055,
    "text": "So I was thinking about, I was, I was, I'm still confused about like Markoff blankets and non-localism.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 263.717,
    "end": 287.097,
    "text": " how would those two things work together oh well like non-localism seems to me that an entity could be distributed arbitrarily in uh like in whatever it is i don't know if the universe is like space time is what is or if that's just a construction that we create through the information processing and like putting relation like enunciating or like uh",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 288.186,
    "end": 316.048,
    "text": " rendering the information in a way where it's like all the related components can be mutually distinguished um but the markov blanket seems to be highly local i i don't know maybe i this is what like i'm confused about this it seems to be highly local and like uh it seems like everything is connected with everything um so i i'm kind of confused about how an entity could be defined with a markoff blanket while at the same time",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 318.081,
    "end": 340.647,
    "text": " what is seems to be completely intertwined non-local mutually like defined yes dean please so can i just david just clarification did are you thinking that local and non-local is um somehow similar to maybe arbitrary um",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 346.471,
    "end": 359.897,
    "text": " I'm thinking local is like within a volume and non-local is like distributed, like a local, like a sphere, like a small sphere where all the information is like within a sphere and everything within that sphere is causally relevant.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 359.937,
    "end": 361.598,
    "text": "Everything without is causally irrelevant.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 362.198,
    "end": 371.383,
    "text": "But then like I'm thinking of a Markov blanket as a sphere and everything on the inside is like independent statistically from everything on the outside.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 372.456,
    "end": 376.717,
    "text": " I guess I'm asking around where do you see that being placed?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 377.117,
    "end": 379.838,
    "text": "Do you see that being placed arbitrarily?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 384.239,
    "end": 398.222,
    "text": "Like when you set that up, whenever you decide where that boundary exists, are you asking because it's local or it's non-local because it's wherever inside and outside exists?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 399.119,
    "end": 408.124,
    "text": " is present is it is that is the is the what's the word I'm looking for?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 408.144,
    "end": 420.972,
    "text": "Are you are you are you wondering about how the how that doesn't seem to be consistent that one minute it can be here and then the next minute it can change and arbitrarily end up being in a different place?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 428.232,
    "end": 454.129,
    "text": " um not not that i'm not that it doesn't seem to me that that's the confusion it's more like um like you know david boehm's implicate and explicate order and the idea that the explicate order is like one hologram there's like the hollow movement where each layer affects each layer and it's all the explicate is all at once explicated in mutual relatedness i don't know",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 456.063,
    "end": 484.982,
    "text": " um i don't know if these words are incoherent completely like uh and uh um and then but then the uh markov blanket like i'm i'm taking the example of my skin as like i don't know if that's even um a good example but my skin is like a markov blanket but then if everything is mutually related and explicated like this whole body is submerged in the same field that everything else is submerged in",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 486.554,
    "end": 508.741,
    "text": " in that sense everything is linked to everything there's no i don't know like um let me try adding a few pieces here so welcome welcome andrew and chris will hopefully join too here we go okay opening act",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 511.676,
    "end": 535.75,
    "text": " just to catch up chris and enter david asked about the markov blanket and about if slash how everything is connected to everything and how we associate markov blanket or the holographic screen with localism and non-locality do you want to give any quick thoughts on this or",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 536.809,
    "end": 562.601,
    "text": " are you asking me if you want to either of you could um i don't know uh let's wait a minute for chris to show up uh yeah i'm i'm here now yeah i'm glad you found it the way finally so uh question did you guys go through the slides of uh last time the lecture on biology",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 563.14,
    "end": 563.4,
    "text": " No, no.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 563.881,
    "end": 566.965,
    "text": "We just began and started with the Markov blanket question.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 568.226,
    "end": 569.247,
    "text": "Yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 569.548,
    "end": 582.122,
    "text": "I mean, I think you wouldn't hurt to talk about that because a big part of that last lecture was the copy and diversify notion as a universal feature in nature.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 584.551,
    "end": 590.416,
    "text": " I mean, naively, I think that the creation of new boundaries is implicit in there.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 590.516,
    "end": 592.157,
    "text": "So maybe Chris can comment.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 592.537,
    "end": 600.263,
    "text": "But I also thought it was very worthy of mentioning today the cycle of error correction, memory, and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 600.283,
    "end": 605.187,
    "text": "So those would be my only two comments in the agenda for today.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 606.588,
    "end": 607.969,
    "text": "Maybe Chris can say a few words.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 608.009,
    "end": 609.29,
    "text": "But I didn't mean to interrupt.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 610.451,
    "end": 614.094,
    "text": "So Mark of Blankets, we can pivot it to biology, I'm sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 615.48,
    "end": 617.142,
    "text": " Okay, I think I'm seeing this question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 617.282,
    "end": 620.084,
    "text": "Is this a question about the definition of Markov blankets?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 621.685,
    "end": 629.992,
    "text": "There's something about... I can't actually see the entire... No, it's not a question on my screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 631.072,
    "end": 632.574,
    "text": "Oh, it's not a question on your screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 632.674,
    "end": 632.954,
    "text": "Okay.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 633.154,
    "end": 635.256,
    "text": "It's a question on your screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 637.578,
    "end": 637.798,
    "text": "Right.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 639.099,
    "end": 641.02,
    "text": "But could you tell me what the question is again?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 641.06,
    "end": 643.142,
    "text": "Yeah, David, just restate it, how you see it.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 645.589,
    "end": 659.416,
    "text": " The question was if everything is mutually connected and mutually defined and interconnected, and there's non-localism in the sense that everything is mutually connected and mutually defined.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 659.436,
    "end": 669.982,
    "text": "I'm kind of implicitly working with a assumption that the implicate-explicate order makes sense, and the explicate is like one hologram.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 670.002,
    "end": 671.042,
    "text": "It's all together now.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 671.082,
    "end": 671.242,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 675.68,
    "end": 692.664,
    "text": " i still hear him oh the audio chris chris yeah i lost at least half of that audio just dropped out altogether oh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 693.649,
    "end": 696.21,
    "text": " Yeah, so I'll try to, sorry about that.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 696.91,
    "end": 710.996,
    "text": "Just like, so if everything is kind of explicated, like if it's information and the brain is kind of rendering it all at once together, I'm just confused as, and the whole body is submerged in the same, like in the same, like the whole body is submerged in it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 711.796,
    "end": 714.177,
    "text": "Like if I look in the mirror, the whole body is submerged in it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 715.439,
    "end": 740.215,
    "text": " it's all uh non-local i mean by that i mean it's all like connected together and mutually defined and mutually uh necessary to even make sense of any piece of it uh if there isn't even such a thing as a piece and i'm wondering i mean not so that's one that's one way of looking at it and then the other way is like the local to me it seems like the there's like the skin mark off blanket and it's kind of local and i'm kind of",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 742.552,
    "end": 758.158,
    "text": " like confused as to how those things kind of worked, like how those things like it seems like all the information in a sphere, the sphere could be a Markov blanket and then the on the inside and the outside, they're statistically independent.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 758.218,
    "end": 764.221,
    "text": "Is that the like the whole movement on the inside and the outside because of the Markov blanket separates those.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 764.781,
    "end": 770.303,
    "text": "But then if everything is this whole body submerged in this thing that's mutually related, I'm just confused as to how",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 772.523,
    "end": 775.244,
    "text": " Like, I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 775.304,
    "end": 777.485,
    "text": "I just, I'm confused as to how those things work together.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 777.505,
    "end": 789.471,
    "text": "I suspect the, I'm not sure I understand your question, but I suspect the answer has to do with whose point of view we're talking about.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 791.051,
    "end": 798.935,
    "text": "So if you are the system that's in, so let's fix a Markov blanket someplace.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 801.852,
    "end": 809.039,
    "text": " If you're the system on the inside, then all you can see is what's encoded on the blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 810.601,
    "end": 815.886,
    "text": "And you have no independent access to what the dynamics is on the outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 815.967,
    "end": 819.45,
    "text": "So you don't actually know what the dynamics is on the outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 822.173,
    "end": 824.115,
    "text": "And similarly, if you're on the outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 825.345,
    "end": 833.028,
    "text": " Now, if you're somehow able to view the whole system, you can see the whole system as having some joint dynamics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 834.409,
    "end": 842.592,
    "text": "But if the whole system is isolated, then there isn't anybody on the outside, kind of by definition.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 843.693,
    "end": 851.856,
    "text": "So the idea of a whole dynamics is just a theoretical postulate that we make to make the mathematics make sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 853.755,
    "end": 879.561,
    "text": " Now, if you move from the classical formulation to the quantum formulation, then it's possible to prove a very nice theorem, which is that if you're inside a holographic screen, you can't measure the entanglement entropy across the screen.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 882.113,
    "end": 890.256,
    "text": " What that means is that you can't know that your state is conditionally independent of what's going on outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 891.016,
    "end": 899.959,
    "text": "So if you're inside a holographic screen, you can't know that you're not entangled with whatever's outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 901.699,
    "end": 906.481,
    "text": "So you can't even know whether you have a well-defined state, in a sense.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 908.696,
    "end": 929.18,
    "text": " And I think the same thing would probably hold true from the point of view inside a Markov blanket, that you wouldn't be able to know whether your Markov blanket had holes in it or something like that.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 929.2,
    "end": 936.381,
    "text": "I mean, the problem is in the classical formulation, you assume there's no analog of entanglement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 937.757,
    "end": 939.878,
    "text": " So there's no analog of entanglement entropy.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 941.159,
    "end": 951.066,
    "text": "So I think the strongest thing you can say is you don't actually know your statistical relationship to what's going on outside, but you still can only see what's encoded on the blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 954.047,
    "end": 954.928,
    "text": "Thank you, Chris.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 955.648,
    "end": 957.39,
    "text": "If I could add a few more pieces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 958.17,
    "end": 960.872,
    "text": "So, David, you described everything connected to everything.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 961.352,
    "end": 963.794,
    "text": "For a system with that kind of a base graph,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 964.622,
    "end": 972.45,
    "text": " there aren't Markov blankets because a Markov blanket is the set of nodes that make two other sets of nodes conditionally independent.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 973.031,
    "end": 983.222,
    "text": "So in a fully connected setting, again, leading to the question, what is outside of that, but in a fully connected setting, you don't have a blanket as such.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 984.903,
    "end": 987.106,
    "text": "In fact, the Bayesian graph",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 988.792,
    "end": 1005.841,
    "text": " describes the factorization or the articulation and the sparsity of the system so it is a connectedness that is usually much much much sparser than everything connected to everything but that's not to say that differences can't make a difference at a distance",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1006.901,
    "end": 1031.898,
    "text": " just that they propagate through a local causal structure and then space-time is constructed by certain kinds of cognitive agents that was one of the key aspects of this course and so we can take as primary the topology of the active inference agent environment relation",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1033.624,
    "end": 1044.248,
    "text": " And then Markov blanket is just the sensorium on the inbound and the action capacity on the outbound.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1046.389,
    "end": 1057.874,
    "text": "One question though I do have to that is what about the non-zero gravitational effect, for example, of something that's distant in space and time?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1060.359,
    "end": 1063.321,
    "text": " Of course, Markov blankets don't have to be spatial temporal.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1063.621,
    "end": 1065.562,
    "text": "They can be in arbitrary state spaces.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1066.863,
    "end": 1074.108,
    "text": "But how do we deal with those kinds of long range influences?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 1079.142,
    "end": 1079.863,
    "text": " That's my question.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 1080.683,
    "end": 1080.963,
    "text": "Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1081.183,
    "end": 1090.249,
    "text": "Well, here I think it's useful to contrast Newtonian gravity with Einsteinian gravity.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1092.65,
    "end": 1106.538,
    "text": "Newtonian gravity is infinite range and instantaneously acting, whereas Einsteinian gravity is infinite range, but it's locally encoded.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1108.064,
    "end": 1122.336,
    "text": " So the Einsteinian gravity that you feel is your local measurement of the curvature of your local bit of spacetime.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1123.757,
    "end": 1127.901,
    "text": "So that is very much happening on your Markov blanket, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1127.961,
    "end": 1131.624,
    "text": "It's a local measurement, local in spacetime.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1131.664,
    "end": 1133.866,
    "text": "So let's assume there's a spacetime",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1134.875,
    "end": 1148.304,
    "text": " that's objective and characterizes everything, then you're locally measuring it on your blanket, and that's what you feel as gravitational attraction or your mass.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1150.786,
    "end": 1161.094,
    "text": "Whereas in Newtonian or Laplacian gravity, you don't have that sense of locality, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1161.154,
    "end": 1164.316,
    "text": "As soon as something changes anywhere in the universe, it affects you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1165.894,
    "end": 1180.277,
    "text": " So Einstein was struggling, of course, to make gravity consistent with electromagnetism, where it was clear that forces are transmitted at finite speed, the speed of light.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1181.437,
    "end": 1184.718,
    "text": "And he didn't have the idea of a graviton moving at the speed of light.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1186.158,
    "end": 1188.899,
    "text": "But he did have this idea of local measurement.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1190.376,
    "end": 1198.662,
    "text": " So nonlocality was anathema to Einstein, and that's basically why he spent so much trouble removing it from physics.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1199.902,
    "end": 1208.468,
    "text": "And that's why he hated the idea of entanglement so much, because it seemed to him that from a spacetime point of view, it had to be nonlocal.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1211.73,
    "end": 1213.992,
    "text": "Daniel, can I bring up a point at this point?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1214.672,
    "end": 1217.674,
    "text": "So I think this is somewhat relevant",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1218.854,
    "end": 1224.782,
    "text": " to a question I really wanted to ask Chris, which is in lecture six, I remember minute 23.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1225.503,
    "end": 1227.987,
    "text": "I wish I had written it down, but I can roughly remember.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1229.589,
    "end": 1235.056,
    "text": "There was that phylogenetic graph and you see a live growing,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1236.391,
    "end": 1245.978,
    "text": " in a self-similar way, you know, just like the genealogical tree of species, same thing happens at the individual level with growth and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1246.499,
    "end": 1255.065,
    "text": "Anyways, I found that fascinating in the sense that the degrees of freedom of life as a whole grow, right?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1255.285,
    "end": 1260.97,
    "text": "And around that minute, 23, you made a comment, well, then the environment must be shrinking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1261.63,
    "end": 1264.612,
    "text": "And you tie this with space-time and something about...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1265.723,
    "end": 1285.556,
    "text": " space-time you know we from the physics side we also have that uh you know we have cosmological inflation and whatnot are any of those things related that that remark uh I feel like was made in passing and I I think there's a lot there to to be said uh it also maybe shed some light on",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1287.691,
    "end": 1309.267,
    "text": " the emergent spacetime issue, if it does emerge from a more basic ontological object like the tensor network and the degrees of freedom in the tensor network, is it fair to say that life as it grows gets more of those degrees of freedom, but then somehow anything that happens to spacetime is an illusion in that sense?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1309.967,
    "end": 1314.811,
    "text": "I don't even know if I'm formulating that question right, but I think Chris knows what I'm talking about.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1316.789,
    "end": 1328.956,
    "text": " Yeah, the comment makes the most sense in the context of the state space itself leaving aside space-time.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1329.076,
    "end": 1343.984,
    "text": "So if you think of a Hilbert space and draw a boundary someplace that separates what we're going to call life from what we're going to call non-life,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1345.579,
    "end": 1359.55,
    "text": " And essentially what life has done over the past three billion years is incorporate bits of the non-life part of the state space into life.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1361.731,
    "end": 1364.694,
    "text": "So total biomass is increasing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1366.595,
    "end": 1371.96,
    "text": "So more and more of the available mass is getting incorporated into living things.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1373.035,
    "end": 1395.819,
    "text": " And so if we can kind of heuristically fold space-time in and say, you know, in the locality, in the locale of Earth and over this fairly short time period, the expansion of space-time is more or less negligible.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1397.559,
    "end": 1401.36,
    "text": "So life is actually taking up more space now.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1403.97,
    "end": 1431.563,
    "text": " it did certainly at the time of Luca when all of us weren't around but there was just one probably population of cells that we're descendants of but the point about the Hilbert space is just the point that if you have once if you divided it in two and you",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1432.273,
    "end": 1455.885,
    "text": " moved the boundary then one system gets bigger at the expense of the other system which now has less of the hilbert space so that's all that remark really is right as the system uh in a sense takes over degrees of freedom of the of the",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1456.832,
    "end": 1482.078,
    "text": " environment so that's in that case so it becomes a different system at every time step from the point of view of it has now a different hilbert space and different internal dynamics so physically it's a different thing yeah but when when we look at it we say oh this thing is continuous through time it is expanding it's growing it's developing evolving whatever",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1483.55,
    "end": 1490.254,
    "text": " Right and so so then I guess the comment just that question that just occurred as you as you were talking.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1491.015,
    "end": 1499.1,
    "text": "That begs the question, you know, does that biomass come to dominate all the degrees of freedom in the universe?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1499.581,
    "end": 1502.443,
    "text": "Is that there's all presumably there's a tension with.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1503.203,
    "end": 1507.788,
    "text": " the rate at which those degrees of freedom are growing and the rate at which spacetime is growing.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1508.268,
    "end": 1516.997,
    "text": "Thus, the growth of spacetime in terms of those degrees of freedom that may be more fundamental amount to loss in error correction capacity.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1518.359,
    "end": 1519.88,
    "text": "How do we not",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1520.714,
    "end": 1526.92,
    "text": " I mean, and maybe more speculatively, how you reconcile this with loss of thermodynamics.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1526.98,
    "end": 1535.468,
    "text": "Like, do we know, are you implying that life is going to come to dominate everything and fill up the entirety of the known universe?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 1538.811,
    "end": 1541.394,
    "text": "Yeah, I think that's a stretch.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1543.776,
    "end": 1544.016,
    "text": "But...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1550.566,
    "end": 1578.563,
    "text": " I would say at this point that until we have a mature theory of quantum gravity that makes enough empirical predictions to be testable, it's not clear, at least to me, how the whole emergent space-time picture fits together with the inflationary picture or the expanding space-time picture.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1580.243,
    "end": 1595.472,
    "text": " I mean, in some sense, taking a strict Hilbert space view, if the universe is an isolated system, then its Hilbert space is fixed.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1597.853,
    "end": 1607.759,
    "text": "And so your question in a sense becomes, what's the relationship between space-time and this Hilbert space?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1608.019,
    "end": 1608.099,
    "text": "Are",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1610.202,
    "end": 1614.463,
    "text": " what we think of as space-time degrees of freedom, real degrees of freedom or not.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1616.364,
    "end": 1621.346,
    "text": "And it seems to me that question really isn't resolved.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1622.246,
    "end": 1624.487,
    "text": "And I'm not sure at this point how to resolve it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1633.55,
    "end": 1634.57,
    "text": "Harris, do you want to?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1635.7,
    "end": 1639.724,
    "text": " Yeah, I just have something small to add.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1642.287,
    "end": 1648.133,
    "text": "Overall, this is very interesting and these questions are very deep.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1649.895,
    "end": 1657.542,
    "text": "What I wanted to add is that I was thinking the initial question regarding Markov blankets.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1658.356,
    "end": 1665.922,
    "text": " And I also have some equation that it's related with it, but I will ask Chris later.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1667.023,
    "end": 1679.532,
    "text": "What I wanted to add now is that basically Markov blankets are a way of describing the boundaries of a system in terms of statistical mechanics or statistics, let's say.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1680.553,
    "end": 1685.717,
    "text": "And essentially, from what I understand, they are",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1688.216,
    "end": 1694.398,
    "text": " paramount in order to define observers and also the systems under observation.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1695.298,
    "end": 1704.08,
    "text": "So any physical system can be seen as an observer with a Markov blanket, let's say.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1704.78,
    "end": 1709.901,
    "text": "So now trying to tie it all up with active inference.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1711.079,
    "end": 1730.773,
    "text": " Well, active inference, as I understand it, implies that the system is actively referring to its external states from its internal states in an effort to both learn, let's say, and adapt to the environment.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1733.809,
    "end": 1738.332,
    "text": " This goes back and ties with this metaphorical link, let's say, with the skin.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1738.973,
    "end": 1741.354,
    "text": "This is how I understand it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1742.195,
    "end": 1756.906,
    "text": "And it actually means that a system with a Markov blanket can actually be seen as performing physics as information processing, which is the bulk of this series that Chris is offering to us.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1758.01,
    "end": 1761.073,
    "text": " And a final comment in terms of non-locality.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1761.913,
    "end": 1765.336,
    "text": "Non-locality can actually be seen as a form of information processing.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1765.556,
    "end": 1768.018,
    "text": "So this is what I wanted to add.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1776.345,
    "end": 1781.109,
    "text": "Did you say how non-locality is a form of information processing?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1782.13,
    "end": 1784.712,
    "text": "Yes, this is how I understand it.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1790.171,
    "end": 1792.692,
    "text": " What do you think about that, Chris?",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1800.534,
    "end": 1815.878,
    "text": "If we put it in terms of entanglement, entanglement is a useful resource for information processing.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1817.955,
    "end": 1832.838,
    "text": " But it's only a usable resource if it's combined with classical communication, either across time or across space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1834.918,
    "end": 1845.7,
    "text": "So entanglement is only useful as a resource if different observers can act",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1848.721,
    "end": 1851.864,
    "text": " locally, i.e.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1851.944,
    "end": 1858.488,
    "text": "without interfering with each other on the quantum resource.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1860.63,
    "end": 1874.721,
    "text": "So if you think of entanglement as non-locality, if you embed it in space-time in that way, then it is useful as",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1877.213,
    "end": 1895.761,
    "text": " computational resource, but the observers also have to transmit classical communications in a way that fully complies with locality.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1896.061,
    "end": 1901.184,
    "text": "So in a Bell EPR type experiment, for example, if you have",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1902.296,
    "end": 1924.886,
    "text": " Alice in one lab and Bob in the other lab making measurements of some entangled state, then at some point, to know that the state is entangled, they have to send their classical records to each other as classical communication and then deal with those records locally.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1927.547,
    "end": 1928.508,
    "text": "So in a sense,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1930.911,
    "end": 1946.716,
    "text": " non-locality in that sense is useful for computation but it's only useful if you also have locality great great thank you actually i'm working on on uh",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1948.277,
    "end": 1960.951,
    "text": " on a novel notion, let's say, that is something that takes the notion of entanglement and transform it in the following sense.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1961.652,
    "end": 1963.053,
    "text": "I'm actually thinking of",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1963.994,
    "end": 1990.798,
    "text": " maximum unentanglement as a resource for classical computation so that's something i am actually exploring it's i find it to be on a nice concept did you say maximum unentanglement yes maximum separability yeah okay that that makes sense i mean we need maximum separability",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 1992.085,
    "end": 1992.745,
    "text": " Yeah.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1993.226,
    "end": 1997.768,
    "text": "Or we need to be able to factor a state space to talk about two different observers.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 1999.268,
    "end": 2001.429,
    "text": "So to talk about conditional independence.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2003.37,
    "end": 2004.311,
    "text": "Yeah.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2004.631,
    "end": 2017.196,
    "text": "In my head, this maximum entanglement as a resource can actually be expanded to perform a classical computation or even to increase the coherence of a quantum system.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2018.277,
    "end": 2020.778,
    "text": "So I'm playing with that notion a bit.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2025.117,
    "end": 2025.417,
    "text": " Thank you.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 2030.639,
    "end": 2033.179,
    "text": "Can I ask something really quick about?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2035.02,
    "end": 2035.7,
    "text": "Yeah, there is.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2036.22,
    "end": 2037.441,
    "text": "Okay.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2038.881,
    "end": 2051.765,
    "text": "So apparently, like, from what I don't understand very much, but from Bohr, apparently the whole experimental setup was one, like, entity.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2053.1,
    "end": 2060.402,
    "text": " They couldn't be broken down into like constituent pieces that are interacting, but had to be taken as one and see from what I understand.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2061.562,
    "end": 2072.965,
    "text": "And apparently Einstein's view is, um, well, I really don't know what his view was, but apparently like it's not one entity can broken, be broken down into localized pieces that are interacting.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2072.985,
    "end": 2077.886,
    "text": "And I'm kind of, apparently they couldn't get along like Warren Einstein.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2079.119,
    "end": 2102.472,
    "text": " apparently there was like a party or something and then they all congregate to separate parts of the room and didn't really interact and apparently it was because they had these like opposing views on the same thing of like breaking down the interconnectedness into separate constituent subsystems and even like taking the partial trace i mean there was one universal function taking the partial trace which possibly defined the subsystems whenever",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2103.37,
    "end": 2124.881,
    "text": " perfectly so i'm like it's all tied together but i can't really explain i'm trying to say like well how do you um i'm asking everyone like these seem like two very opposed views they seem like very alternative views like on on one side you have like kind of like",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2126.027,
    "end": 2152.755,
    "text": " an indivisible whole and the other side you have like locality where it's almost like there's like a sequence of measurements leading up to an ego an eye that then measures is like a real entity as in another one is like the observer and the observed are one thing they cannot be meaningfully separated maybe functionally they can be separated but like as actually until like as actually existing sub-components they cannot be defined strictly",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2153.709,
    "end": 2178.204,
    "text": " it's too different from what i understand one of them is saying yes you can define these subsystems and they really do exist as separate entities you know the other one is saying that's just kind of like a like a useful notion like a useful way to organize information as to operate on that information to posit a subject and an object and to have the subject operate on the object is a useful way for thinking to separate itself",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2179.383,
    "end": 2182.445,
    "text": " And it seems like this is closer to Bohr than the other one is closer.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2182.485,
    "end": 2190.23,
    "text": "Well, apparently that's a distinction of Bohr and Einstein from what I understand, which is, please correct me if it's wrong.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2190.75,
    "end": 2194.052,
    "text": "And so, yeah, that's why I put that out there.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2194.232,
    "end": 2199.035,
    "text": "And I don't know what that's going to spawn in terms of responses, but yes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2199.816,
    "end": 2204.539,
    "text": "Well, I think that's a fair characterization of the Bohr-Einstein debate, actually.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2209.98,
    "end": 2215.223,
    "text": " to add a response there, whether it actually exists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2215.843,
    "end": 2220.805,
    "text": "It seems like in one of those framings, you had an observer looking at something.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2221.085,
    "end": 2230.35,
    "text": "And if we define actually existing in a relational observed setting, then to the observer, the measurement actually exists.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2230.57,
    "end": 2232.091,
    "text": "Prepare, measure, prepare, measure.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2232.791,
    "end": 2236.913,
    "text": "And then from another perspective, viewing that setup,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2238.277,
    "end": 2240.558,
    "text": " then it's the observer of a setup.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2243.04,
    "end": 2258.409,
    "text": "And so it's just, again, to Chris's first point about what perspective, and this is one of the most essential pieces that the blanket screen relationality brings into play is there isn't a view from nowhere, but there is a perspective",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2259.972,
    "end": 2268.159,
    "text": " that may have a definite answer, and yet there are multiple perspectives that have complementary answers in our scenario.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2270.094,
    "end": 2271.415,
    "text": " Daniel, can I speak for a minute?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2271.515,
    "end": 2271.735,
    "text": "Oh, yeah.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2272.235,
    "end": 2273.236,
    "text": "I was muted earlier.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2273.256,
    "end": 2273.816,
    "text": "I didn't realize.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2273.916,
    "end": 2275.257,
    "text": "I meant to ask David.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2275.838,
    "end": 2280.44,
    "text": "I don't have an answer to your question, but I was wondering if you could reformulate.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2280.56,
    "end": 2286.664,
    "text": "Would it be fair to reformulate your question as saying, are blankets objective or not?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2287.085,
    "end": 2289.706,
    "text": "Is the Boris Einstein debate equivalent to that?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2290.226,
    "end": 2295.43,
    "text": "And then second, and I guess this may be for Chris, I was skimming through the answers, and one of them",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2296.912,
    "end": 2304.902,
    "text": " was talking about how one of the big tensions between general relativity and quantum theory is the idea of object persistence.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2305.262,
    "end": 2313.432,
    "text": "And I don't know how to articulate it either, but I feel like it was more or less what you were getting at, David.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2313.692,
    "end": 2314.774,
    "text": "Is that correct?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2317.128,
    "end": 2319.169,
    "text": " Yeah, I think that's another way to put it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2319.45,
    "end": 2331.238,
    "text": "And also the thing you said about the third person looking at those systems, if there's multi-agent communication, that's kind of the thing that I'm kind of stuck on in terms of trying to understand this.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2331.618,
    "end": 2338.763,
    "text": "Because if there's a third agent looking, those two are subsumed in the information on the holographic screen.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2340.584,
    "end": 2342.606,
    "text": "And then, I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2342.626,
    "end": 2345.488,
    "text": "Anyways, so that's what I'm kind of trying to.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2347.222,
    "end": 2356.167,
    "text": " I think a delightful thing to read here is Gene Wigner's paper where he introduces the Wigner's friend thought experiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2357.548,
    "end": 2365.733,
    "text": "And I think it's from, there's a book called The Scientist Speculates.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2366.013,
    "end": 2367.994,
    "text": "The editor is someone named Good, G-O-O-D.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2371.511,
    "end": 2392.777,
    "text": " And Wigner has a paper in this book, I think it's 1961, and it's also the paper where Wigner talks about consciousness being an essential concept in quantum theory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2393.777,
    "end": 2395.498,
    "text": "But the thought experiment is,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2397.628,
    "end": 2418.24,
    "text": " that Wigner's friend is doing an experiment in his laboratory and making observations, and Wigner is outside the laboratory, and Wigner has to regard his friend as in some sort of superposition with his instrument.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2418.34,
    "end": 2421.962,
    "text": "He has to regard his friend as entangled with his friend's instruments.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2424.315,
    "end": 2430.757,
    "text": " until Wigner can actually interact locally with the friend and make a measurement of the friend's state.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2432.777,
    "end": 2444.72,
    "text": "And so it makes Wigner's friend and his apparatus look like an entangled pair.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2445.84,
    "end": 2451.962,
    "text": "And Wigner now looks like an experimenter who's operating on just one part of an entangled pair.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2454.742,
    "end": 2458.644,
    "text": " But Wigner himself tells the story very nicely.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2462.666,
    "end": 2475.391,
    "text": "That sort of historical text, I think, is always useful to have a look at and see how the people themselves were responding to this idea.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2477.252,
    "end": 2479.893,
    "text": "And Wigner is quite perplexed by this thought experiment.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2484.389,
    "end": 2507.776,
    "text": " And I think all of those people were quite honestly mystified with what observation actually is and what consciousness is and all of these other questions that people are a little bit scared to talk about in the ensuing several decades.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2513.897,
    "end": 2529.565,
    "text": " self-reference yeah you can go ahead self-reference seems to be like there's this ancient symbol of the uroboros uh the output is the input it feeds on itself",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2530.717,
    "end": 2558.776,
    "text": " even like consciousness I have to contextualize my I have to contextualize to contextualize like it's self-referential I have to everything refers to itself and then at the end self-reference is where all the paradoxes are like this sentence is false or all I know is that I know nothing these are all paradoxical statements so there's some sort of mystery cell division of self-reference like that ancient view is that it's like embryogenesis cosmogenesis same thing",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2563.12,
    "end": 2563.58,
    "text": " I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2563.8,
    "end": 2567.023,
    "text": "It seems to me that there's some sort of mystery.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2567.604,
    "end": 2568.945,
    "text": "It's like the mind just deludes.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2569.205,
    "end": 2569.806,
    "text": "I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2570.186,
    "end": 2573.088,
    "text": "Thinking tries to make these thought systems, but it just slips out.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2573.209,
    "end": 2575.831,
    "text": "It can't grasp it.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2575.911,
    "end": 2578.173,
    "text": "I don't know.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2578.233,
    "end": 2581.556,
    "text": "But that's already a conclusion, which I don't necessarily want to even make.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2581.576,
    "end": 2585.099,
    "text": "Because if it's self-referenced, I'm just thinking, okay, then maybe it goes all the way to the bottom.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2585.139,
    "end": 2585.259,
    "text": "Yeah.",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 2588.743,
    "end": 2591.565,
    "text": " Daniel, can I ask a question before we run out of time?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2592.005,
    "end": 2592.926,
    "text": "Actually, I have two.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2592.986,
    "end": 2594.047,
    "text": "Maybe one is a bit longer.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2594.347,
    "end": 2594.927,
    "text": "The second one.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2595.788,
    "end": 2595.948,
    "text": "Sure.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2596.208,
    "end": 2601.932,
    "text": "So the first one, Chris, is I was very intrigued.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2602.712,
    "end": 2611.058,
    "text": "Looking forward to hear you talk a little bit about that cycle of error correction and memory and persistence and so on.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2611.658,
    "end": 2612.579,
    "text": "And in particular,",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2614.021,
    "end": 2623.927,
    "text": " I was wondering if it relates at all to the main other thing you talked about in that lecture six, the copy and diversify business.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2623.987,
    "end": 2636.255,
    "text": "Because intuitively, if that cycle is something that an organism has to implement, I'm talking about that slide with the error correction and whatnot, then it pays a thermodynamic price for it.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2636.275,
    "end": 2636.935,
    "text": "So I...",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2639.477,
    "end": 2646.919,
    "text": " Presumably, there is an anabolic process of trying to grow so you can feed degrees of freedom into this error correcting scheme.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2648.7,
    "end": 2651.521,
    "text": "Thinking like a physicist, something like that might be happening.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2652.561,
    "end": 2658.763,
    "text": "So is the copy and diversify feature a necessity of having to run this cycle?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2659.443,
    "end": 2661.544,
    "text": "That's my first question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2677.793,
    "end": 2678.653,
    "text": " That's a good question.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2678.713,
    "end": 2680.194,
    "text": "I don't know whether it's necessary.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2687.919,
    "end": 2706.051,
    "text": "I think one could think of a fairly small scale heat engine or metabolic system that can pull just enough free energy out of its environment to store a one-bit memory.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2711.289,
    "end": 2713.951,
    "text": " And you can think of something like a flip-flop, right?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2713.991,
    "end": 2720.696,
    "text": "These things aren't alive, so it's not quite as complex as an organism.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2722.158,
    "end": 2732.226,
    "text": "But it is using energy to maintain a memory, and its memory does influence its behavior.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2734.318,
    "end": 2740.722,
    "text": " So I think we have these limiting cases like this that don't have to grow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2744.005,
    "end": 2756.253,
    "text": "But when you think about organisms, organisms have...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2760.273,
    "end": 2764.637,
    "text": " the problem of being made out of very delicate parts that need to be replaced.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2766.699,
    "end": 2778.208,
    "text": "And it's that degradation that I think is driving this need for constant copying.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2785.494,
    "end": 2785.835,
    "text": "And from a",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2791.735,
    "end": 2810.786,
    "text": " From a physics point of view, I think what that boils down to is that the organism's living right at the edge of an interaction with its environment that's too strong to maintain.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2812.267,
    "end": 2815.048,
    "text": "So the environmental interaction is",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2819.48,
    "end": 2835.835,
    "text": " constantly at risk of spinning out of control and having too large an energy transfer, which basically tears the Markov blanket apart and exposes too many of the internal degrees of freedom to the outside.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2839.679,
    "end": 2840.559,
    "text": "So this...",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2842.859,
    "end": 2868.992,
    "text": " maybe one way of of saying what characterizes life that it's it's interacting with its environment right on the edge of an interaction that's too strong and it's it's it's great to have a strong interaction because then you have you have big eigenvalues and so you have large bandwidth but the risk is that the environment tears you apart",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2876.732,
    "end": 2898.748,
    "text": " close to the fire but don't get burnt become become the fire and then control the redox balance and gain that autopoetic regulative capacity which works when it works yeah until something comes along with bigger teeth",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 2903.437,
    "end": 2922.265,
    "text": " um another comment if i may is um as as the course comes to an end one two of the two themes i realized associated to classicality that we've talked a lot about in this class are object persistence and boundaries right so classicality being a feature",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2924.378,
    "end": 2953.406,
    "text": " intrinsically boundary related and having a lot to do with object persistence and so so so are these just things completely dual from from an fep point of view because you want to maintain the integrity of the boundary you want you know you want to preserve that classical information presumably i'm not sure i guess my question to to everyone is our object persistence and and uh and uh",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2955.225,
    "end": 2965.09,
    "text": " Well, in the topic of classicality, object persistence and boundaries, are these basically completely dual pictures?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2965.53,
    "end": 2966.29,
    "text": "That's my question.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 2969.172,
    "end": 2970.533,
    "text": "Yeah, I wouldn't be surprised.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2973.254,
    "end": 2976.355,
    "text": "And we also need object persistence to define space.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2978.957,
    "end": 2979.157,
    "text": "So",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2983.021,
    "end": 2992.604,
    "text": " This idea of object persistence is a very key idea that has to be dealt with.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 2994.104,
    "end": 3000.866,
    "text": "And physics has largely ignored this idea, which is kind of objects are taken for granted.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3006.147,
    "end": 3008.128,
    "text": "But I think what Carl says in that 2019",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3011.069,
    "end": 3015.733,
    "text": " free energy principle for a particular physics paper is fairly clear on this.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3015.753,
    "end": 3023.019,
    "text": "I mean, he basically says the free energy principle tells systems to persist.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3024.36,
    "end": 3031.686,
    "text": "That's basically what a system has to do by maintaining the integrity of its Markov blanket.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3033.007,
    "end": 3034.629,
    "text": "I think that's very insightful.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3038.132,
    "end": 3039.593,
    "text": "If it doesn't, it's not.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3041.089,
    "end": 3066.91,
    "text": " yeah, it's not a system anymore well, as we somewhat glide towards a local closure of course, anyone is welcome to bring up any reflections and also, I'd love to hear about",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3068.086,
    "end": 3090.524,
    "text": " where we go from this now measured outcome how do we prepare individually at the institute scale ecosystem scale and what are we going to do coming out of this are we talking about that right now",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3097.782,
    "end": 3098.342,
    "text": " Or any thoughts?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3099.383,
    "end": 3099.583,
    "text": "Yeah?",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3100.424,
    "end": 3101.424,
    "text": "Just keep learning, bro.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3101.584,
    "end": 3105.947,
    "text": "What do you mean by the ecosystem scale?",
    "speaker": "SPEAKER_04"
  },
  {
    "start": 3106.688,
    "end": 3113.792,
    "text": "Like the active inference ecosystem and our own ecosystems going beyond our own scale.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3115.013,
    "end": 3125.96,
    "text": "I guess the only thing I can comment on this is I echo the view that, or not view, or rather remark that Chris made in the lecture about quantum biology as a field.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3127.222,
    "end": 3141.627,
    "text": " it's in a nascent stage right now, but I mean, I think, you know, there will be a non-trivial interaction between the active inference community and quantum biology that I'm making that surmise right now.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3152.65,
    "end": 3155.071,
    "text": "So let's talk about quantum biology for a second.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3158.055,
    "end": 3159.696,
    "text": " I'll open up the Pandora's box here.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3159.936,
    "end": 3165.479,
    "text": "Let's think of it as a parable as opposed or maybe even fan fiction because Chris has shared so much with us.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3165.919,
    "end": 3167.2,
    "text": "I want to kind of build off of it.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3168.561,
    "end": 3171.542,
    "text": "If you'll indulge me for a second, I'll read you a little story.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3171.582,
    "end": 3172.703,
    "text": "Just hear the story out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3174.184,
    "end": 3179.206,
    "text": "Quantum biology sounds like more than up or down without saying that it is more.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3181.148,
    "end": 3187.331,
    "text": "Up or down is what information can be counterfactually is looking at carrying capacity as in quotes can be.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3189.059,
    "end": 3193.042,
    "text": " And from that carrying capacity comes orientation, things like direction and scale.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3193.963,
    "end": 3206.153,
    "text": "Things like the ability to plan appear to fit better in the orientation category relative to the carrying capacity category, which is non-communativity in action.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3207.915,
    "end": 3218.003,
    "text": "So if, and this is a big if, if we agree that orientation is to follow, should our recognizing of planning affordances follow as well?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3219.284,
    "end": 3229.213,
    "text": " So from the session slide, there was a quote, living systems are genetic quantum systems that the FEP has driven to a high level of computational complexity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3229.734,
    "end": 3234.898,
    "text": "And here, the in quotes, computation is baked in as something plannable.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3236.38,
    "end": 3240.123,
    "text": "With this as a reference frame to make plans, we need carrying capacity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3241.024,
    "end": 3241.324,
    "text": "Check.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3242.225,
    "end": 3242.565,
    "text": "Agreed.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3243.446,
    "end": 3244.547,
    "text": "But in order to learn,",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3246.254,
    "end": 3253.119,
    "text": " Where does the carrying capacity plus orientation relationship insist that we start with a received plan?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3254.34,
    "end": 3262.266,
    "text": "This perspective is compared to say actively inferring our way to the plan falls out of carrying capacity.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3263.727,
    "end": 3270.952,
    "text": "Just making this explicit, we can then ask, should we first apply a received plan or apply active inference?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3275.455,
    "end": 3286.161,
    "text": " That helps clarify when the strategy is one more based on exploitation versus a strategy more based and biased to exploration.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3286.281,
    "end": 3301.23,
    "text": "In summary, when did information delivery, things like product or packaging begin to trump information carrying capacity, which is essentially information processing, rather than",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3302.096,
    "end": 3314.765,
    "text": " We need this paired relationship, the carrying capacity plus the orientation as a minimum of two so that we can compare, identify change and no change, model patterns, et cetera.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3316.026,
    "end": 3328.535,
    "text": "This is another way of asking when did subject matter expertise come to be seen as more valuable than prediction matter expertise when it seems like we need both capacities if we want independency?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3329.455,
    "end": 3330.216,
    "text": "And here's the kicker.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3331.513,
    "end": 3355.105,
    "text": " If not given time to reflect on what's being asked here, and I know Chris oftentimes has a nice long pause to reflect, but if not given the time to reflect, people will take their subject matter expertise strategy, which clearly is a next move perspective over one that holds up next move plus all moves, meaning that they bring prediction matter expertise in to follow.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3355.99,
    "end": 3363.896,
    "text": " to parameterize, to unlock, to unring, to unbound what's in and what's out.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3364.777,
    "end": 3369.361,
    "text": "Of course, without prediction matter expertise, what is quantum biology?",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3374.265,
    "end": 3374.545,
    "text": "Wow.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3374.625,
    "end": 3377.767,
    "text": "Can you just post that someplace so we can think about it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3377.888,
    "end": 3379.369,
    "text": "I'll just email it to you, Chris.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3380.029,
    "end": 3380.29,
    "text": "Cool.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3383.512,
    "end": 3384.173,
    "text": "That was great.",
    "speaker": "SPEAKER_05"
  },
  {
    "start": 3390.495,
    "end": 3400.743,
    "text": " Yeah, I think you're asking about the fundamental question of what does Carl call it?",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3401.644,
    "end": 3408.589,
    "text": "Epistemic value and the role of curiosity and that whole cluster of issues.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3411.852,
    "end": 3415.355,
    "text": "Well, I think I need to give you the credit that you deserve on this.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3415.415,
    "end": 3419.598,
    "text": "I think it's the fact that you have allowed us to interact with you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3420.523,
    "end": 3426.164,
    "text": " that's given us that kind of courage and confidence to be able to put things out there.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3426.224,
    "end": 3436.547,
    "text": "I don't know how much of it sticks or how much of it, I'm not sure that it requires disciples, but I do think it provides what you've done is provided that medium.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3437.647,
    "end": 3440.167,
    "text": "So again, I guess that's my way of saying thank you.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3441.048,
    "end": 3441.748,
    "text": "Well, thank you.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3441.788,
    "end": 3442.368,
    "text": "That's, that's,",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3447.751,
    "end": 3449.152,
    "text": " Yeah, thank you, Chris.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3449.712,
    "end": 3454.394,
    "text": "I have learned so much this year, more than ever before.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3460.216,
    "end": 3461.097,
    "text": "Okay, well, great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3461.617,
    "end": 3463.778,
    "text": "This has been a great class.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3464.198,
    "end": 3473.382,
    "text": "And hopefully various things will come out of it.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3474.741,
    "end": 3481.747,
    "text": " Certainly just from looking at the questions that have been in the question forum, lots of people are thinking about these issues.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3485.249,
    "end": 3491.754,
    "text": "That's what I think AI needs going forward is people thinking and talking about stuff.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3495.287,
    "end": 3522.057,
    "text": " thank you chris yeah a few outcomes that we know will transcribe the lectures the discussions add in screenshots add in the q a and publish those proceedings as a book we will pick back up in 2024 with potentially having the recorded and written contents as part of a curriculum",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3523.519,
    "end": 3540.926,
    "text": " So not just replicating, but now continuing on with another quantum flow across this now classical artifact, because it's quantum in the moment, and then once it's communicated, it becomes a classic.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3540.946,
    "end": 3543.807,
    "text": "And we have most to prepare that state.",
    "speaker": "SPEAKER_03"
  },
  {
    "start": 3543.827,
    "end": 3547.408,
    "text": "All right, great.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3548.449,
    "end": 3551.81,
    "text": "I'm going to have to sign off, but thank you very much.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3552.759,
    "end": 3553.42,
    "text": " Thank you, Chris.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3554.44,
    "end": 3554.84,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3555.421,
    "end": 3556.121,
    "text": "Thank you, Chris.",
    "speaker": "SPEAKER_02"
  },
  {
    "start": 3557.902,
    "end": 3561.385,
    "text": "Ciao.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3564.447,
    "end": 3568.55,
    "text": "Does anyone else want to make any reflection or comments?",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3571.131,
    "end": 3578.176,
    "text": "I just thank everybody that's helped organize, participated in all of the discussions, even the people who showed up.",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3578.943,
    "end": 3599.877,
    "text": " the very end of the discussions because i really appreciate that again i can't emphasize enough when we get a chance to interact with this stuff when we get to manipulate it when we're able to get ask questions even though we feel vulnerable i think that that's when a lot of the really good stuff um tends to get consolidated so thank you to all of you",
    "speaker": "SPEAKER_00"
  },
  {
    "start": 3602.124,
    "end": 3605.767,
    "text": " I'll read some fun comments from the live chat.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3606.708,
    "end": 3612.712,
    "text": "Just the last several, just to recognize some of our great colleagues.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3613.953,
    "end": 3616.995,
    "text": "Lucrative Leadership wrote,",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3618.271,
    "end": 3646.81,
    "text": " yes on yes more on affordances ian wrote would love for this series to continue joanne wrote thank you this was a wonderful learning experience mills 8102 wrote the probable and the possible there are some emojis pablo sent a heart powwow dao i don't speak this language but i can definitely hear understand and feel it so thank you everybody who's watching along these were all great and um",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3649.537,
    "end": 3652.598,
    "text": " We prepare and measure every day at the Institute.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3652.758,
    "end": 3670.884,
    "text": "So I really do hope that people from all backgrounds, all vectors, all preference and prior sets come engage and not presuppose too much about us or themselves or what can happen when we really do interact.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3671.565,
    "end": 3678.407,
    "text": "And when we take it into the kinds of spaces and timelines that we know we want to be on.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3682.185,
    "end": 3682.445,
    "text": " All right.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3683.587,
    "end": 3683.888,
    "text": "Thank you.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3684.509,
    "end": 3684.73,
    "text": "Bye.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3685.732,
    "end": 3686.373,
    "text": "Thank you everyone.",
    "speaker": "SPEAKER_01"
  },
  {
    "start": 3687.114,
    "end": 3687.335,
    "text": "Bye.",
    "speaker": "SPEAKER_04"
  }
]